#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_P001

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_Player_P001.ABP_Player_P001_C.GetJumpAddMotionBlendWeight
// 0x0004 (0x0004 - 0x0000)
struct ABP_Player_P001_C_GetJumpAddMotionBlendWeight final
{
public:
	float                                         bpp__BlendWeight__pf;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABP_Player_P001_C_GetJumpAddMotionBlendWeight) == 0x000004, "Wrong alignment on ABP_Player_P001_C_GetJumpAddMotionBlendWeight");
static_assert(sizeof(ABP_Player_P001_C_GetJumpAddMotionBlendWeight) == 0x000004, "Wrong size on ABP_Player_P001_C_GetJumpAddMotionBlendWeight");
static_assert(offsetof(ABP_Player_P001_C_GetJumpAddMotionBlendWeight, bpp__BlendWeight__pf) == 0x000000, "Member 'ABP_Player_P001_C_GetJumpAddMotionBlendWeight::bpp__BlendWeight__pf' has a wrong offset!");

// Function ABP_Player_P001.ABP_Player_P001_C.GetJumpLowerBodyAnimationWeight
// 0x0004 (0x0004 - 0x0000)
struct ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight final
{
public:
	float                                         bpp__Weight__pf;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight) == 0x000004, "Wrong alignment on ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight");
static_assert(sizeof(ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight) == 0x000004, "Wrong size on ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight");
static_assert(offsetof(ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight, bpp__Weight__pf) == 0x000000, "Member 'ABP_Player_P001_C_GetJumpLowerBodyAnimationWeight::bpp__Weight__pf' has a wrong offset!");

// Function ABP_Player_P001.ABP_Player_P001_C.GetJumpUpperBodyAnimationWeight
// 0x0004 (0x0004 - 0x0000)
struct ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight final
{
public:
	float                                         bpp__Weight__pf;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight) == 0x000004, "Wrong alignment on ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight");
static_assert(sizeof(ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight) == 0x000004, "Wrong size on ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight");
static_assert(offsetof(ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight, bpp__Weight__pf) == 0x000000, "Member 'ABP_Player_P001_C_GetJumpUpperBodyAnimationWeight::bpp__Weight__pf' has a wrong offset!");

}

