#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_A036

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_A036.ABP_A036_C.ExecuteUbergraph_ABP_A036
// 0x0008 (0x0008 - 0x0000)
struct ABP_A036_C_ExecuteUbergraph_ABP_A036 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_A036_C_ExecuteUbergraph_ABP_A036) == 0x000004, "Wrong alignment on ABP_A036_C_ExecuteUbergraph_ABP_A036");
static_assert(sizeof(ABP_A036_C_ExecuteUbergraph_ABP_A036) == 0x000008, "Wrong size on ABP_A036_C_ExecuteUbergraph_ABP_A036");
static_assert(offsetof(ABP_A036_C_ExecuteUbergraph_ABP_A036, EntryPoint) == 0x000000, "Member 'ABP_A036_C_ExecuteUbergraph_ABP_A036::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_A036_C_ExecuteUbergraph_ABP_A036, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'ABP_A036_C_ExecuteUbergraph_ABP_A036::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_A036_C_ExecuteUbergraph_ABP_A036, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'ABP_A036_C_ExecuteUbergraph_ABP_A036::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_A036_C_ExecuteUbergraph_ABP_A036, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'ABP_A036_C_ExecuteUbergraph_ABP_A036::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

