#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_A036

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_A036.ABP_A036_C
// 0x09D0 (0x15C0 - 0x0BF0)
class UABP_A036_C final : public UJackTokiNoKesinAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_DE5B0BEB4356AB2ACB2944A3CD5F91D1; // 0x0BF8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97F2117F4FA38D2069ACD99718C8A3CF; // 0x0C40(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AA18C9F645BD4DBA58BA2F86F261BA7C; // 0x0CC0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81A5DA144C4B5C24A444FD83EAC59C60; // 0x0D40(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14A2DAC5441AB29BC76C6DB0AAC6A90C; // 0x0DC0(0x0130)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_FAE3449243E68D05ED1EF5AD02FDFD6D; // 0x0EF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F9E06A274F8F3138ABDE1DB577D38A38; // 0x0F38(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7675247643B1B5ABB801C1A625CBF620; // 0x0FA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_475686434138837C9F5F80A10C2AD9A3; // 0x0FF0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B15E4AE54B671FC1B1BDAAB79366CF62; // 0x1060(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_88D996F046EB6CD4BB3049B0633A38E6; // 0x10A8(0x00D8)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2D33852C436A199F9CE9CFAE5C87E5F8; // 0x1180(0x01A0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_F803825544AAE19B327739AA05956F64; // 0x1320(0x01A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_03AF26A94BD4C3306E5C25B972A2E104; // 0x14C0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_963C5BA34BF85BC6724CC6A3016A6669; // 0x1508(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7E759C024DE5B718CF392D80923D1BB3; // 0x1550(0x0068)()

public:
	void ExecuteUbergraph_ABP_A036(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_BlendSpacePlayer_14A2DAC5441AB29BC76C6DB0AAC6A90C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_LookAt_2D33852C436A199F9CE9CFAE5C87E5F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_LookAt_F803825544AAE19B327739AA05956F64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_SequencePlayer_475686434138837C9F5F80A10C2AD9A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_SequencePlayer_F9E06A274F8F3138ABDE1DB577D38A38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_TransitionResult_81A5DA144C4B5C24A444FD83EAC59C60();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_TransitionResult_97F2117F4FA38D2069ACD99718C8A3CF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_A036_AnimGraphNode_TransitionResult_AA18C9F645BD4DBA58BA2F86F261BA7C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_A036_C">();
	}
	static class UABP_A036_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_A036_C>();
	}
};
static_assert(alignof(UABP_A036_C) == 0x000010, "Wrong alignment on UABP_A036_C");
static_assert(sizeof(UABP_A036_C) == 0x0015C0, "Wrong size on UABP_A036_C");
static_assert(offsetof(UABP_A036_C, UberGraphFrame) == 0x000BF0, "Member 'UABP_A036_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_Root_DE5B0BEB4356AB2ACB2944A3CD5F91D1) == 0x000BF8, "Member 'UABP_A036_C::AnimGraphNode_Root_DE5B0BEB4356AB2ACB2944A3CD5F91D1' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_TransitionResult_97F2117F4FA38D2069ACD99718C8A3CF) == 0x000C40, "Member 'UABP_A036_C::AnimGraphNode_TransitionResult_97F2117F4FA38D2069ACD99718C8A3CF' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_TransitionResult_AA18C9F645BD4DBA58BA2F86F261BA7C) == 0x000CC0, "Member 'UABP_A036_C::AnimGraphNode_TransitionResult_AA18C9F645BD4DBA58BA2F86F261BA7C' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_TransitionResult_81A5DA144C4B5C24A444FD83EAC59C60) == 0x000D40, "Member 'UABP_A036_C::AnimGraphNode_TransitionResult_81A5DA144C4B5C24A444FD83EAC59C60' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_BlendSpacePlayer_14A2DAC5441AB29BC76C6DB0AAC6A90C) == 0x000DC0, "Member 'UABP_A036_C::AnimGraphNode_BlendSpacePlayer_14A2DAC5441AB29BC76C6DB0AAC6A90C' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_StateResult_FAE3449243E68D05ED1EF5AD02FDFD6D) == 0x000EF0, "Member 'UABP_A036_C::AnimGraphNode_StateResult_FAE3449243E68D05ED1EF5AD02FDFD6D' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_SequencePlayer_F9E06A274F8F3138ABDE1DB577D38A38) == 0x000F38, "Member 'UABP_A036_C::AnimGraphNode_SequencePlayer_F9E06A274F8F3138ABDE1DB577D38A38' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_StateResult_7675247643B1B5ABB801C1A625CBF620) == 0x000FA8, "Member 'UABP_A036_C::AnimGraphNode_StateResult_7675247643B1B5ABB801C1A625CBF620' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_SequencePlayer_475686434138837C9F5F80A10C2AD9A3) == 0x000FF0, "Member 'UABP_A036_C::AnimGraphNode_SequencePlayer_475686434138837C9F5F80A10C2AD9A3' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_StateResult_B15E4AE54B671FC1B1BDAAB79366CF62) == 0x001060, "Member 'UABP_A036_C::AnimGraphNode_StateResult_B15E4AE54B671FC1B1BDAAB79366CF62' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_StateMachine_88D996F046EB6CD4BB3049B0633A38E6) == 0x0010A8, "Member 'UABP_A036_C::AnimGraphNode_StateMachine_88D996F046EB6CD4BB3049B0633A38E6' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_LookAt_2D33852C436A199F9CE9CFAE5C87E5F8) == 0x001180, "Member 'UABP_A036_C::AnimGraphNode_LookAt_2D33852C436A199F9CE9CFAE5C87E5F8' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_LookAt_F803825544AAE19B327739AA05956F64) == 0x001320, "Member 'UABP_A036_C::AnimGraphNode_LookAt_F803825544AAE19B327739AA05956F64' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_ComponentToLocalSpace_03AF26A94BD4C3306E5C25B972A2E104) == 0x0014C0, "Member 'UABP_A036_C::AnimGraphNode_ComponentToLocalSpace_03AF26A94BD4C3306E5C25B972A2E104' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_LocalToComponentSpace_963C5BA34BF85BC6724CC6A3016A6669) == 0x001508, "Member 'UABP_A036_C::AnimGraphNode_LocalToComponentSpace_963C5BA34BF85BC6724CC6A3016A6669' has a wrong offset!");
static_assert(offsetof(UABP_A036_C, AnimGraphNode_Slot_7E759C024DE5B718CF392D80923D1BB3) == 0x001550, "Member 'UABP_A036_C::AnimGraphNode_Slot_7E759C024DE5B718CF392D80923D1BB3' has a wrong offset!");

}

