#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_FootIKAdvancedControl

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_FootIKAdvancedControl.AnimNotify_FootIKAdvancedControl_C
// 0x0008 (0x0050 - 0x0048)
class UAnimNotify_FootIKAdvancedControl_C final : public UAnimNotify
{
public:
	bool                                          FootIKEnable;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AdjustMeshHeightEnable;                            // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AdjustMeshHeightZero;                              // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_FootIKAdvancedControl_C">();
	}
	static class UAnimNotify_FootIKAdvancedControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_FootIKAdvancedControl_C>();
	}
};
static_assert(alignof(UAnimNotify_FootIKAdvancedControl_C) == 0x000008, "Wrong alignment on UAnimNotify_FootIKAdvancedControl_C");
static_assert(sizeof(UAnimNotify_FootIKAdvancedControl_C) == 0x000050, "Wrong size on UAnimNotify_FootIKAdvancedControl_C");
static_assert(offsetof(UAnimNotify_FootIKAdvancedControl_C, FootIKEnable) == 0x000048, "Member 'UAnimNotify_FootIKAdvancedControl_C::FootIKEnable' has a wrong offset!");
static_assert(offsetof(UAnimNotify_FootIKAdvancedControl_C, AdjustMeshHeightEnable) == 0x000049, "Member 'UAnimNotify_FootIKAdvancedControl_C::AdjustMeshHeightEnable' has a wrong offset!");
static_assert(offsetof(UAnimNotify_FootIKAdvancedControl_C, AdjustMeshHeightZero) == 0x00004A, "Member 'UAnimNotify_FootIKAdvancedControl_C::AdjustMeshHeightZero' has a wrong offset!");

}

