#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimGraphRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// Enum AnimGraphRuntime.ESphericalLimitType
// NumValues: 0x0003
enum class ESphericalLimitType : uint8
{
	Inner                                    = 0,
	Outer                                    = 1,
	ESphericalLimitType_MAX                  = 2,
};

// Enum AnimGraphRuntime.AnimPhysSimSpaceType
// NumValues: 0x0006
enum class EAnimPhysSimSpaceType : uint8
{
	Component                                = 0,
	Actor                                    = 1,
	World                                    = 2,
	RootRelative                             = 3,
	BoneRelative                             = 4,
	AnimPhysSimSpaceType_MAX                 = 5,
};

// Enum AnimGraphRuntime.AnimPhysLinearConstraintType
// NumValues: 0x0003
enum class EAnimPhysLinearConstraintType : uint8
{
	Free                                     = 0,
	Limited                                  = 1,
	AnimPhysLinearConstraintType_MAX         = 2,
};

// Enum AnimGraphRuntime.AnimPhysAngularConstraintType
// NumValues: 0x0003
enum class EAnimPhysAngularConstraintType : uint8
{
	Angular                                  = 0,
	Cone                                     = 1,
	AnimPhysAngularConstraintType_MAX        = 2,
};

// Enum AnimGraphRuntime.EDrivenDestinationMode
// NumValues: 0x0004
enum class EDrivenDestinationMode : uint8
{
	Bone                                     = 0,
	MorphTarget                              = 1,
	MaterialParameter                        = 2,
	EDrivenDestinationMode_MAX               = 3,
};

// Enum AnimGraphRuntime.EDrivenBoneModificationMode
// NumValues: 0x0004
enum class EDrivenBoneModificationMode : uint8
{
	AddToInput                               = 0,
	ReplaceComponent                         = 1,
	AddToRefPose                             = 2,
	EDrivenBoneModificationMode_MAX          = 3,
};

// Enum AnimGraphRuntime.EComponentType
// NumValues: 0x000C
enum class EComponentType : uint8
{
	None                                     = 0,
	TranslationX                             = 1,
	TranslationY                             = 2,
	TranslationZ                             = 3,
	RotationX                                = 4,
	RotationY                                = 5,
	RotationZ                                = 6,
	Scale                                    = 7,
	ScaleX                                   = 8,
	ScaleY                                   = 9,
	ScaleZ                                   = 10,
	EComponentType_MAX                       = 11,
};

// Enum AnimGraphRuntime.EConstraintOffsetOption
// NumValues: 0x0003
enum class EConstraintOffsetOption : uint8
{
	None                                     = 0,
	Offset_RefPose                           = 1,
	EConstraintOffsetOption_MAX              = 2,
};

// Enum AnimGraphRuntime.CopyBoneDeltaMode
// NumValues: 0x0003
enum class ECopyBoneDeltaMode : uint8
{
	Accumulate                               = 0,
	Copy                                     = 1,
	CopyBoneDeltaMode_MAX                    = 2,
};

// Enum AnimGraphRuntime.EInterpolationBlend
// NumValues: 0x0008
enum class EInterpolationBlend : uint8
{
	Linear                                   = 0,
	Cubic                                    = 1,
	Sinusoidal                               = 2,
	EaseInOutExponent2                       = 3,
	EaseInOutExponent3                       = 4,
	EaseInOutExponent4                       = 5,
	EaseInOutExponent5                       = 6,
	MAX                                      = 7,
};

// Enum AnimGraphRuntime.EBoneModificationMode
// NumValues: 0x0004
enum class EBoneModificationMode : uint8
{
	BMM_Ignore                               = 0,
	BMM_Replace                              = 1,
	BMM_Additive                             = 2,
	BMM_MAX                                  = 3,
};

// Enum AnimGraphRuntime.EModifyCurveApplyMode
// NumValues: 0x0004
enum class EModifyCurveApplyMode : uint8
{
	Add                                      = 0,
	Scale                                    = 1,
	Blend                                    = 2,
	EModifyCurveApplyMode_MAX                = 3,
};

// Enum AnimGraphRuntime.EPoseDriverOutput
// NumValues: 0x0003
enum class EPoseDriverOutput : uint8
{
	DrivePoses                               = 0,
	DriveCurves                              = 1,
	EPoseDriverOutput_MAX                    = 2,
};

// Enum AnimGraphRuntime.EPoseDriverSource
// NumValues: 0x0003
enum class EPoseDriverSource : uint8
{
	Rotation                                 = 0,
	Translation                              = 1,
	EPoseDriverSource_MAX                    = 2,
};

// Enum AnimGraphRuntime.EPoseDriverType
// NumValues: 0x0004
enum class EPoseDriverType : uint8
{
	SwingAndTwist                            = 0,
	SwingOnly                                = 1,
	Translation                              = 2,
	EPoseDriverType_MAX                      = 3,
};

// Enum AnimGraphRuntime.ESnapshotSourceMode
// NumValues: 0x0003
enum class ESnapshotSourceMode : uint8
{
	NamedSnapshot                            = 0,
	SnapshotPin                              = 1,
	ESnapshotSourceMode_MAX                  = 2,
};

// Enum AnimGraphRuntime.ERefPoseType
// NumValues: 0x0003
enum class ERefPoseType : uint8
{
	EIT_LocalSpace                           = 0,
	EIT_Additive                             = 1,
	EIT_MAX                                  = 2,
};

// Enum AnimGraphRuntime.EScaleChainInitialLength
// NumValues: 0x0004
enum class EScaleChainInitialLength : uint8
{
	FixedDefaultLengthValue                  = 0,
	Distance                                 = 1,
	ChainLength                              = 2,
	EScaleChainInitialLength_MAX             = 3,
};

// Enum AnimGraphRuntime.ESequenceEvalReinit
// NumValues: 0x0004
enum class ESequenceEvalReinit : uint8
{
	NoReset                                  = 0,
	StartPosition                            = 1,
	ExplicitTime                             = 2,
	ESequenceEvalReinit_MAX                  = 3,
};

// Enum AnimGraphRuntime.ETimeAccumulatorFunc
// NumValues: 0x0003
enum class ETimeAccumulatorFunc : uint8
{
	None                                     = 0,
	ResetAll                                 = 1,
	ETimeAccumulatorFunc_MAX                 = 2,
};

// Enum AnimGraphRuntime.ESplineBoneAxis
// NumValues: 0x0004
enum class ESplineBoneAxis : uint8
{
	X                                        = 1,
	Y                                        = 2,
	Z                                        = 3,
	ESplineBoneAxis_MAX                      = 4,
};

// Enum AnimGraphRuntime.ERBFDistanceMethod
// NumValues: 0x0004
enum class ERBFDistanceMethod : uint8
{
	Euclidean                                = 0,
	Quaternion                               = 1,
	SwingAngle                               = 2,
	ERBFDistanceMethod_MAX                   = 3,
};

// Enum AnimGraphRuntime.ERBFFunctionType
// NumValues: 0x0006
enum class ERBFFunctionType : uint8
{
	Gaussian                                 = 0,
	Exponential                              = 1,
	Linear                                   = 2,
	Cubic                                    = 3,
	Quintic                                  = 4,
	ERBFFunctionType_MAX                     = 5,
};

// ScriptStruct AnimGraphRuntime.AnimLegIKDefinition
// 0x0040 (0x0040 - 0x0000)
struct FAnimLegIKDefinition final
{
public:
	struct FBoneReference                         IKFootBone;                                        // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         FKFootBone;                                        // 0x0018(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NumBonesInLimb;                                    // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxis                                         FootBoneForwardAxis;                               // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRotationLimit;                              // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinRotationAngle;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableKneeTwistCorrection;                        // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimLegIKDefinition) == 0x000008, "Wrong alignment on FAnimLegIKDefinition");
static_assert(sizeof(FAnimLegIKDefinition) == 0x000040, "Wrong size on FAnimLegIKDefinition");
static_assert(offsetof(FAnimLegIKDefinition, IKFootBone) == 0x000000, "Member 'FAnimLegIKDefinition::IKFootBone' has a wrong offset!");
static_assert(offsetof(FAnimLegIKDefinition, FKFootBone) == 0x000018, "Member 'FAnimLegIKDefinition::FKFootBone' has a wrong offset!");
static_assert(offsetof(FAnimLegIKDefinition, NumBonesInLimb) == 0x000030, "Member 'FAnimLegIKDefinition::NumBonesInLimb' has a wrong offset!");
static_assert(offsetof(FAnimLegIKDefinition, FootBoneForwardAxis) == 0x000034, "Member 'FAnimLegIKDefinition::FootBoneForwardAxis' has a wrong offset!");
static_assert(offsetof(FAnimLegIKDefinition, bEnableRotationLimit) == 0x000035, "Member 'FAnimLegIKDefinition::bEnableRotationLimit' has a wrong offset!");
static_assert(offsetof(FAnimLegIKDefinition, MinRotationAngle) == 0x000038, "Member 'FAnimLegIKDefinition::MinRotationAngle' has a wrong offset!");
static_assert(offsetof(FAnimLegIKDefinition, bEnableKneeTwistCorrection) == 0x00003C, "Member 'FAnimLegIKDefinition::bEnableKneeTwistCorrection' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_ApplyAdditive
// 0x0048 (0x0078 - 0x0030)
struct FAnimNode_ApplyAdditive final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Base;                                              // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              Additive;                                          // 0x0048(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputScaleBias                        AlphaScaleBias;                                    // 0x0064(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActualAlpha;                                       // 0x0070(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_ApplyAdditive) == 0x000008, "Wrong alignment on FAnimNode_ApplyAdditive");
static_assert(sizeof(FAnimNode_ApplyAdditive) == 0x000078, "Wrong size on FAnimNode_ApplyAdditive");
static_assert(offsetof(FAnimNode_ApplyAdditive, Base) == 0x000030, "Member 'FAnimNode_ApplyAdditive::Base' has a wrong offset!");
static_assert(offsetof(FAnimNode_ApplyAdditive, Additive) == 0x000048, "Member 'FAnimNode_ApplyAdditive::Additive' has a wrong offset!");
static_assert(offsetof(FAnimNode_ApplyAdditive, Alpha) == 0x000060, "Member 'FAnimNode_ApplyAdditive::Alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_ApplyAdditive, AlphaScaleBias) == 0x000064, "Member 'FAnimNode_ApplyAdditive::AlphaScaleBias' has a wrong offset!");
static_assert(offsetof(FAnimNode_ApplyAdditive, LODThreshold) == 0x00006C, "Member 'FAnimNode_ApplyAdditive::LODThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_ApplyAdditive, ActualAlpha) == 0x000070, "Member 'FAnimNode_ApplyAdditive::ActualAlpha' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_SkeletalControlBase
// 0x0040 (0x0070 - 0x0030)
struct FAnimNode_SkeletalControlBase : public FAnimNode_Base
{
public:
	struct FComponentSpacePoseLink                ComponentPose;                                     // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputScaleBias                        AlphaScaleBias;                                    // 0x004C(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActualAlpha;                                       // 0x0058(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x14];                                      // 0x005C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_SkeletalControlBase) == 0x000008, "Wrong alignment on FAnimNode_SkeletalControlBase");
static_assert(sizeof(FAnimNode_SkeletalControlBase) == 0x000070, "Wrong size on FAnimNode_SkeletalControlBase");
static_assert(offsetof(FAnimNode_SkeletalControlBase, ComponentPose) == 0x000030, "Member 'FAnimNode_SkeletalControlBase::ComponentPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkeletalControlBase, Alpha) == 0x000048, "Member 'FAnimNode_SkeletalControlBase::Alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkeletalControlBase, AlphaScaleBias) == 0x00004C, "Member 'FAnimNode_SkeletalControlBase::AlphaScaleBias' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkeletalControlBase, LODThreshold) == 0x000054, "Member 'FAnimNode_SkeletalControlBase::LODThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_SkeletalControlBase, ActualAlpha) == 0x000058, "Member 'FAnimNode_SkeletalControlBase::ActualAlpha' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_CopyBoneDelta
// 0x0040 (0x00B0 - 0x0070)
struct FAnimNode_CopyBoneDelta final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         SourceBone;                                        // 0x0070(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetBone;                                        // 0x0088(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCopyTranslation;                                  // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyRotation;                                     // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyScale;                                        // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECopyBoneDeltaMode                            CopyMode;                                          // 0x00A3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslationMultiplier;                             // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationMultiplier;                                // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleMultiplier;                                   // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimNode_CopyBoneDelta) == 0x000008, "Wrong alignment on FAnimNode_CopyBoneDelta");
static_assert(sizeof(FAnimNode_CopyBoneDelta) == 0x0000B0, "Wrong size on FAnimNode_CopyBoneDelta");
static_assert(offsetof(FAnimNode_CopyBoneDelta, SourceBone) == 0x000070, "Member 'FAnimNode_CopyBoneDelta::SourceBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, TargetBone) == 0x000088, "Member 'FAnimNode_CopyBoneDelta::TargetBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, bCopyTranslation) == 0x0000A0, "Member 'FAnimNode_CopyBoneDelta::bCopyTranslation' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, bCopyRotation) == 0x0000A1, "Member 'FAnimNode_CopyBoneDelta::bCopyRotation' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, bCopyScale) == 0x0000A2, "Member 'FAnimNode_CopyBoneDelta::bCopyScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, CopyMode) == 0x0000A3, "Member 'FAnimNode_CopyBoneDelta::CopyMode' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, TranslationMultiplier) == 0x0000A4, "Member 'FAnimNode_CopyBoneDelta::TranslationMultiplier' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, RotationMultiplier) == 0x0000A8, "Member 'FAnimNode_CopyBoneDelta::RotationMultiplier' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyBoneDelta, ScaleMultiplier) == 0x0000AC, "Member 'FAnimNode_CopyBoneDelta::ScaleMultiplier' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimPhysConstraintSetup
// 0x005C (0x005C - 0x0000)
struct FAnimPhysConstraintSetup final
{
public:
	EAnimPhysLinearConstraintType                 LinearXLimitType;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysLinearConstraintType                 LinearYLimitType;                                  // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysLinearConstraintType                 LinearZLimitType;                                  // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LinearAxesMin;                                     // 0x0004(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearAxesMax;                                     // 0x0010(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysAngularConstraintType                AngularConstraintType;                             // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysTwistAxis                            TwistAxis;                                         // 0x001D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConeAngle;                                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularXAngle;                                     // 0x0024(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularYAngle;                                     // 0x0028(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularZAngle;                                     // 0x002C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularLimitsMin;                                  // 0x0030(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularLimitsMax;                                  // 0x003C(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysTwistAxis                            AngularTargetAxis;                                 // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AngularTarget;                                     // 0x004C(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLinearFullyLocked;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimPhysConstraintSetup) == 0x000004, "Wrong alignment on FAnimPhysConstraintSetup");
static_assert(sizeof(FAnimPhysConstraintSetup) == 0x00005C, "Wrong size on FAnimPhysConstraintSetup");
static_assert(offsetof(FAnimPhysConstraintSetup, LinearXLimitType) == 0x000000, "Member 'FAnimPhysConstraintSetup::LinearXLimitType' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, LinearYLimitType) == 0x000001, "Member 'FAnimPhysConstraintSetup::LinearYLimitType' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, LinearZLimitType) == 0x000002, "Member 'FAnimPhysConstraintSetup::LinearZLimitType' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, LinearAxesMin) == 0x000004, "Member 'FAnimPhysConstraintSetup::LinearAxesMin' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, LinearAxesMax) == 0x000010, "Member 'FAnimPhysConstraintSetup::LinearAxesMax' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularConstraintType) == 0x00001C, "Member 'FAnimPhysConstraintSetup::AngularConstraintType' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, TwistAxis) == 0x00001D, "Member 'FAnimPhysConstraintSetup::TwistAxis' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, ConeAngle) == 0x000020, "Member 'FAnimPhysConstraintSetup::ConeAngle' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularXAngle) == 0x000024, "Member 'FAnimPhysConstraintSetup::AngularXAngle' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularYAngle) == 0x000028, "Member 'FAnimPhysConstraintSetup::AngularYAngle' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularZAngle) == 0x00002C, "Member 'FAnimPhysConstraintSetup::AngularZAngle' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularLimitsMin) == 0x000030, "Member 'FAnimPhysConstraintSetup::AngularLimitsMin' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularLimitsMax) == 0x00003C, "Member 'FAnimPhysConstraintSetup::AngularLimitsMax' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularTargetAxis) == 0x000048, "Member 'FAnimPhysConstraintSetup::AngularTargetAxis' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, AngularTarget) == 0x00004C, "Member 'FAnimPhysConstraintSetup::AngularTarget' has a wrong offset!");
static_assert(offsetof(FAnimPhysConstraintSetup, bLinearFullyLocked) == 0x000058, "Member 'FAnimPhysConstraintSetup::bLinearFullyLocked' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_BlendSpacePlayer
// 0x00D8 (0x0130 - 0x0058)
struct FAnimNode_BlendSpacePlayer : public FAnimNode_AssetPlayerBase
{
public:
	float                                         X;                                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TranslationMultiplier;                             // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartPosition;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpaceBase*                        BlendSpace;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetPlayTimeWhenBlendSpaceChanges;               // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendFilter                           BlendFilter;                                       // 0x0088(0x0090)(Protected, NativeAccessSpecifierProtected)
	TArray<struct FBlendSampleData>               BlendSampleDataCache;                              // 0x0118(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UBlendSpaceBase*                        PreviousBlendSpace;                                // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FAnimNode_BlendSpacePlayer) == 0x000008, "Wrong alignment on FAnimNode_BlendSpacePlayer");
static_assert(sizeof(FAnimNode_BlendSpacePlayer) == 0x000130, "Wrong size on FAnimNode_BlendSpacePlayer");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, X) == 0x000058, "Member 'FAnimNode_BlendSpacePlayer::X' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, Y) == 0x00005C, "Member 'FAnimNode_BlendSpacePlayer::Y' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, Z) == 0x000060, "Member 'FAnimNode_BlendSpacePlayer::Z' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, PlayRate) == 0x000064, "Member 'FAnimNode_BlendSpacePlayer::PlayRate' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, bLoop) == 0x000068, "Member 'FAnimNode_BlendSpacePlayer::bLoop' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, TranslationMultiplier) == 0x00006C, "Member 'FAnimNode_BlendSpacePlayer::TranslationMultiplier' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, StartPosition) == 0x000070, "Member 'FAnimNode_BlendSpacePlayer::StartPosition' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, BlendSpace) == 0x000078, "Member 'FAnimNode_BlendSpacePlayer::BlendSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, bResetPlayTimeWhenBlendSpaceChanges) == 0x000080, "Member 'FAnimNode_BlendSpacePlayer::bResetPlayTimeWhenBlendSpaceChanges' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, BlendFilter) == 0x000088, "Member 'FAnimNode_BlendSpacePlayer::BlendFilter' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, BlendSampleDataCache) == 0x000118, "Member 'FAnimNode_BlendSpacePlayer::BlendSampleDataCache' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendSpacePlayer, PreviousBlendSpace) == 0x000128, "Member 'FAnimNode_BlendSpacePlayer::PreviousBlendSpace' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_CopyPoseFromMesh
// 0x0068 (0x0098 - 0x0030)
struct FAnimNode_CopyPoseFromMesh final : public FAnimNode_Base
{
public:
	TWeakObjectPtr<class USkeletalMeshComponent>  SourceMeshComponent;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAttachedParent;                                // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x5F];                                      // 0x0039(0x005F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_CopyPoseFromMesh) == 0x000008, "Wrong alignment on FAnimNode_CopyPoseFromMesh");
static_assert(sizeof(FAnimNode_CopyPoseFromMesh) == 0x000098, "Wrong size on FAnimNode_CopyPoseFromMesh");
static_assert(offsetof(FAnimNode_CopyPoseFromMesh, SourceMeshComponent) == 0x000030, "Member 'FAnimNode_CopyPoseFromMesh::SourceMeshComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_CopyPoseFromMesh, bUseAttachedParent) == 0x000038, "Member 'FAnimNode_CopyPoseFromMesh::bUseAttachedParent' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_AimOffsetLookAt
// 0x00F0 (0x0220 - 0x0130)
struct FAnimNode_AimOffsetLookAt final : public FAnimNode_BlendSpacePlayer
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0130(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLODEnabled;                                     // 0x014C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAtLocation;                                    // 0x0150(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SourceSocketName;                                  // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PivotSocketName;                                   // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SocketAxis;                                        // 0x0170(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         SocketBoneReference;                               // 0x0180(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SocketLocalTransform;                              // 0x01A0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         PivotSocketBoneReference;                          // 0x01D0(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PivotSocketLocalTransform;                         // 0x01F0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimNode_AimOffsetLookAt) == 0x000010, "Wrong alignment on FAnimNode_AimOffsetLookAt");
static_assert(sizeof(FAnimNode_AimOffsetLookAt) == 0x000220, "Wrong size on FAnimNode_AimOffsetLookAt");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, BasePose) == 0x000130, "Member 'FAnimNode_AimOffsetLookAt::BasePose' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, LODThreshold) == 0x000148, "Member 'FAnimNode_AimOffsetLookAt::LODThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, bIsLODEnabled) == 0x00014C, "Member 'FAnimNode_AimOffsetLookAt::bIsLODEnabled' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, LookAtLocation) == 0x000150, "Member 'FAnimNode_AimOffsetLookAt::LookAtLocation' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, SourceSocketName) == 0x000160, "Member 'FAnimNode_AimOffsetLookAt::SourceSocketName' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, PivotSocketName) == 0x000168, "Member 'FAnimNode_AimOffsetLookAt::PivotSocketName' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, SocketAxis) == 0x000170, "Member 'FAnimNode_AimOffsetLookAt::SocketAxis' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, Alpha) == 0x00017C, "Member 'FAnimNode_AimOffsetLookAt::Alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, SocketBoneReference) == 0x000180, "Member 'FAnimNode_AimOffsetLookAt::SocketBoneReference' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, SocketLocalTransform) == 0x0001A0, "Member 'FAnimNode_AimOffsetLookAt::SocketLocalTransform' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, PivotSocketBoneReference) == 0x0001D0, "Member 'FAnimNode_AimOffsetLookAt::PivotSocketBoneReference' has a wrong offset!");
static_assert(offsetof(FAnimNode_AimOffsetLookAt, PivotSocketLocalTransform) == 0x0001F0, "Member 'FAnimNode_AimOffsetLookAt::PivotSocketLocalTransform' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.SplineIKCachedBoneData
// 0x0020 (0x0020 - 0x0000)
struct FSplineIKCachedBoneData final
{
public:
	struct FBoneReference                         Bone;                                              // 0x0000(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         RefSkeletonIndex;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSplineIKCachedBoneData) == 0x000008, "Wrong alignment on FSplineIKCachedBoneData");
static_assert(sizeof(FSplineIKCachedBoneData) == 0x000020, "Wrong size on FSplineIKCachedBoneData");
static_assert(offsetof(FSplineIKCachedBoneData, Bone) == 0x000000, "Member 'FSplineIKCachedBoneData::Bone' has a wrong offset!");
static_assert(offsetof(FSplineIKCachedBoneData, RefSkeletonIndex) == 0x000018, "Member 'FSplineIKCachedBoneData::RefSkeletonIndex' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.BlendBoneByChannelEntry
// 0x0038 (0x0038 - 0x0000)
struct FBlendBoneByChannelEntry final
{
public:
	struct FBoneReference                         SourceBone;                                        // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetBone;                                        // 0x0018(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBlendTranslation;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendRotation;                                    // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendScale;                                       // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBlendBoneByChannelEntry) == 0x000008, "Wrong alignment on FBlendBoneByChannelEntry");
static_assert(sizeof(FBlendBoneByChannelEntry) == 0x000038, "Wrong size on FBlendBoneByChannelEntry");
static_assert(offsetof(FBlendBoneByChannelEntry, SourceBone) == 0x000000, "Member 'FBlendBoneByChannelEntry::SourceBone' has a wrong offset!");
static_assert(offsetof(FBlendBoneByChannelEntry, TargetBone) == 0x000018, "Member 'FBlendBoneByChannelEntry::TargetBone' has a wrong offset!");
static_assert(offsetof(FBlendBoneByChannelEntry, bBlendTranslation) == 0x000030, "Member 'FBlendBoneByChannelEntry::bBlendTranslation' has a wrong offset!");
static_assert(offsetof(FBlendBoneByChannelEntry, bBlendRotation) == 0x000031, "Member 'FBlendBoneByChannelEntry::bBlendRotation' has a wrong offset!");
static_assert(offsetof(FBlendBoneByChannelEntry, bBlendScale) == 0x000032, "Member 'FBlendBoneByChannelEntry::bBlendScale' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimPhysPlanarLimit
// 0x0050 (0x0050 - 0x0000)
struct FAnimPhysPlanarLimit final
{
public:
	struct FBoneReference                         DrivingBone;                                       // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PlaneTransform;                                    // 0x0020(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimPhysPlanarLimit) == 0x000010, "Wrong alignment on FAnimPhysPlanarLimit");
static_assert(sizeof(FAnimPhysPlanarLimit) == 0x000050, "Wrong size on FAnimPhysPlanarLimit");
static_assert(offsetof(FAnimPhysPlanarLimit, DrivingBone) == 0x000000, "Member 'FAnimPhysPlanarLimit::DrivingBone' has a wrong offset!");
static_assert(offsetof(FAnimPhysPlanarLimit, PlaneTransform) == 0x000020, "Member 'FAnimPhysPlanarLimit::PlaneTransform' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimPhysSphericalLimit
// 0x0030 (0x0030 - 0x0000)
struct FAnimPhysSphericalLimit final
{
public:
	struct FBoneReference                         DrivingBone;                                       // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                SphereLocalOffset;                                 // 0x0018(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LimitRadius;                                       // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESphericalLimitType                           LimitType;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimPhysSphericalLimit) == 0x000008, "Wrong alignment on FAnimPhysSphericalLimit");
static_assert(sizeof(FAnimPhysSphericalLimit) == 0x000030, "Wrong size on FAnimPhysSphericalLimit");
static_assert(offsetof(FAnimPhysSphericalLimit, DrivingBone) == 0x000000, "Member 'FAnimPhysSphericalLimit::DrivingBone' has a wrong offset!");
static_assert(offsetof(FAnimPhysSphericalLimit, SphereLocalOffset) == 0x000018, "Member 'FAnimPhysSphericalLimit::SphereLocalOffset' has a wrong offset!");
static_assert(offsetof(FAnimPhysSphericalLimit, LimitRadius) == 0x000024, "Member 'FAnimPhysSphericalLimit::LimitRadius' has a wrong offset!");
static_assert(offsetof(FAnimPhysSphericalLimit, LimitType) == 0x000028, "Member 'FAnimPhysSphericalLimit::LimitType' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_AnimDynamics
// 0x0210 (0x0280 - 0x0070)
struct FAnimNode_AnimDynamics final : public FAnimNode_SkeletalControlBase
{
public:
	EAnimPhysSimSpaceType                         SimulationSpace;                                   // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         RelativeSpaceBone;                                 // 0x0078(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bChain;                                            // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         BoundBone;                                         // 0x0098(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         ChainEnd;                                          // 0x00B0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtents;                                        // 0x00C8(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalJointOffset;                                  // 0x00D4(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScale;                                      // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLinearSpring;                                     // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAngularSpring;                                    // 0x00E5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearSpringConstant;                              // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularSpringConstant;                             // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWind;                                       // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWindWasEnabled;                                   // 0x00F1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WindScale;                                         // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideLinearDamping;                            // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearDampingOverride;                             // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAngularDamping;                           // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngularDampingOverride;                            // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAngularBias;                              // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngularBiasOverride;                               // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoUpdate;                                         // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoEval;                                           // 0x0111(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSolverIterationsPreUpdate;                      // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSolverIterationsPostUpdate;                     // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimPhysConstraintSetup               ConstraintSetup;                                   // 0x011C(0x005C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUsePlanarLimit;                                   // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnimPhysPlanarLimit>           PlanarLimits;                                      // 0x0180(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseSphericalLimits;                               // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnimPhysSphericalLimit>        SphericalLimits;                                   // 0x0198(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EAnimPhysCollisionType                        CollisionType;                                     // 0x01A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SphereCollisionRadius;                             // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalForce;                                     // 0x01B0(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0xC4];                                     // 0x01BC(0x00C4)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_AnimDynamics) == 0x000008, "Wrong alignment on FAnimNode_AnimDynamics");
static_assert(sizeof(FAnimNode_AnimDynamics) == 0x000280, "Wrong size on FAnimNode_AnimDynamics");
static_assert(offsetof(FAnimNode_AnimDynamics, SimulationSpace) == 0x000070, "Member 'FAnimNode_AnimDynamics::SimulationSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, RelativeSpaceBone) == 0x000078, "Member 'FAnimNode_AnimDynamics::RelativeSpaceBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bChain) == 0x000090, "Member 'FAnimNode_AnimDynamics::bChain' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, BoundBone) == 0x000098, "Member 'FAnimNode_AnimDynamics::BoundBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, ChainEnd) == 0x0000B0, "Member 'FAnimNode_AnimDynamics::ChainEnd' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, BoxExtents) == 0x0000C8, "Member 'FAnimNode_AnimDynamics::BoxExtents' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, LocalJointOffset) == 0x0000D4, "Member 'FAnimNode_AnimDynamics::LocalJointOffset' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, GravityScale) == 0x0000E0, "Member 'FAnimNode_AnimDynamics::GravityScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bLinearSpring) == 0x0000E4, "Member 'FAnimNode_AnimDynamics::bLinearSpring' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bAngularSpring) == 0x0000E5, "Member 'FAnimNode_AnimDynamics::bAngularSpring' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, LinearSpringConstant) == 0x0000E8, "Member 'FAnimNode_AnimDynamics::LinearSpringConstant' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, AngularSpringConstant) == 0x0000EC, "Member 'FAnimNode_AnimDynamics::AngularSpringConstant' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bEnableWind) == 0x0000F0, "Member 'FAnimNode_AnimDynamics::bEnableWind' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bWindWasEnabled) == 0x0000F1, "Member 'FAnimNode_AnimDynamics::bWindWasEnabled' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, WindScale) == 0x0000F4, "Member 'FAnimNode_AnimDynamics::WindScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bOverrideLinearDamping) == 0x0000F8, "Member 'FAnimNode_AnimDynamics::bOverrideLinearDamping' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, LinearDampingOverride) == 0x0000FC, "Member 'FAnimNode_AnimDynamics::LinearDampingOverride' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bOverrideAngularDamping) == 0x000100, "Member 'FAnimNode_AnimDynamics::bOverrideAngularDamping' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, AngularDampingOverride) == 0x000104, "Member 'FAnimNode_AnimDynamics::AngularDampingOverride' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bOverrideAngularBias) == 0x000108, "Member 'FAnimNode_AnimDynamics::bOverrideAngularBias' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, AngularBiasOverride) == 0x00010C, "Member 'FAnimNode_AnimDynamics::AngularBiasOverride' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bDoUpdate) == 0x000110, "Member 'FAnimNode_AnimDynamics::bDoUpdate' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bDoEval) == 0x000111, "Member 'FAnimNode_AnimDynamics::bDoEval' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, NumSolverIterationsPreUpdate) == 0x000114, "Member 'FAnimNode_AnimDynamics::NumSolverIterationsPreUpdate' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, NumSolverIterationsPostUpdate) == 0x000118, "Member 'FAnimNode_AnimDynamics::NumSolverIterationsPostUpdate' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, ConstraintSetup) == 0x00011C, "Member 'FAnimNode_AnimDynamics::ConstraintSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bUsePlanarLimit) == 0x000178, "Member 'FAnimNode_AnimDynamics::bUsePlanarLimit' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, PlanarLimits) == 0x000180, "Member 'FAnimNode_AnimDynamics::PlanarLimits' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, bUseSphericalLimits) == 0x000190, "Member 'FAnimNode_AnimDynamics::bUseSphericalLimits' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, SphericalLimits) == 0x000198, "Member 'FAnimNode_AnimDynamics::SphericalLimits' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, CollisionType) == 0x0001A8, "Member 'FAnimNode_AnimDynamics::CollisionType' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, SphereCollisionRadius) == 0x0001AC, "Member 'FAnimNode_AnimDynamics::SphereCollisionRadius' has a wrong offset!");
static_assert(offsetof(FAnimNode_AnimDynamics, ExternalForce) == 0x0001B0, "Member 'FAnimNode_AnimDynamics::ExternalForce' has a wrong offset!");

// ScriptStruct AnimGraphRuntime.AnimNode_Slot
// 0x0038 (0x0068 - 0x0030)
struct FAnimNode_Slot final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
