#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionSecondCheck

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Yakusou_Ema
// 0x000C (0x000C - 0x0000)
struct BP_ActionSecondCheck_C_SC_Yakusou_Ema final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHPRate_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Yakusou_Ema) == 0x000004, "Wrong alignment on BP_ActionSecondCheck_C_SC_Yakusou_Ema");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Yakusou_Ema) == 0x00000C, "Wrong size on BP_ActionSecondCheck_C_SC_Yakusou_Ema");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Yakusou_Ema, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Yakusou_Ema::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Yakusou_Ema, CallFunc_GetHPRate_ReturnValue) == 0x000004, "Member 'BP_ActionSecondCheck_C_SC_Yakusou_Ema::CallFunc_GetHPRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Yakusou_Ema, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_Yakusou_Ema::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Test_Hoimi
// 0x000C (0x000C - 0x0000)
struct BP_ActionSecondCheck_C_SC_Test_Hoimi final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHPRate_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Test_Hoimi) == 0x000004, "Wrong alignment on BP_ActionSecondCheck_C_SC_Test_Hoimi");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Test_Hoimi) == 0x00000C, "Wrong size on BP_ActionSecondCheck_C_SC_Test_Hoimi");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Test_Hoimi, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Test_Hoimi::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Test_Hoimi, CallFunc_GetHPRate_ReturnValue) == 0x000004, "Member 'BP_ActionSecondCheck_C_SC_Test_Hoimi::CallFunc_GetHPRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Test_Hoimi, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_Test_Hoimi::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Monster_Renkei_T
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionSecondCheck_C_SC_Monster_Renkei_T final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_CheckMonsterRenkei_OutRenkeiJoinMember;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckMonsterRenkei_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Monster_Renkei_T) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_Monster_Renkei_T");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Monster_Renkei_T) == 0x000020, "Wrong size on BP_ActionSecondCheck_C_SC_Monster_Renkei_T");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Monster_Renkei_T, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Monster_Renkei_T::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Monster_Renkei_T, CallFunc_GetRenkeiManager_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_Monster_Renkei_T::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Monster_Renkei_T, CallFunc_CheckMonsterRenkei_OutRenkeiJoinMember) == 0x000010, "Member 'BP_ActionSecondCheck_C_SC_Monster_Renkei_T::CallFunc_CheckMonsterRenkei_OutRenkeiJoinMember' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Monster_Renkei_T, CallFunc_CheckMonsterRenkei_ReturnValue) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_Monster_Renkei_T::CallFunc_CheckMonsterRenkei_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M603_AliveLeftArm
// 0x0080 (0x0080 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M603_AliveLeftArm final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReturnValue;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Parts_0;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         K2Node_DynamicCast_AsJack_Character;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetAttachSocketName_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackCharacter_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M603_AliveLeftArm");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm) == 0x000080, "Wrong size on BP_ActionSecondCheck_C_SC_M603_AliveLeftArm");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, bSuccess) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, bReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, Parts_0) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::Parts_0' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, K2Node_DynamicCast_AsJack_Character) == 0x000030, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::K2Node_DynamicCast_AsJack_Character' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_IsDead_ReturnValue) == 0x000048, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_GetAttachSocketName_ReturnValue) == 0x000050, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_GetAttachSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000059, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_GetJackCharacter_ReturnValue) == 0x000068, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_GetJackCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveLeftArm, CallFunc_GetAttachedActors_OutActors) == 0x000070, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveLeftArm::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M603_AliveRightArm
// 0x0080 (0x0080 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M603_AliveRightArm final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReturnValue;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Parts_0;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         K2Node_DynamicCast_AsJack_Character;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetAttachSocketName_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackCharacter_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M603_AliveRightArm");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm) == 0x000080, "Wrong size on BP_ActionSecondCheck_C_SC_M603_AliveRightArm");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, bSuccess) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, bReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, Parts_0) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::Parts_0' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, K2Node_DynamicCast_AsJack_Character) == 0x000030, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::K2Node_DynamicCast_AsJack_Character' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_IsDead_ReturnValue) == 0x000048, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_GetAttachSocketName_ReturnValue) == 0x000050, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_GetAttachSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000059, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_GetJackCharacter_ReturnValue) == 0x000068, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_GetJackCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_AliveRightArm, CallFunc_GetAttachedActors_OutActors) == 0x000070, "Member 'BP_ActionSecondCheck_C_SC_M603_AliveRightArm::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M603_MaskLess
// 0x000C (0x000C - 0x0000)
struct BP_ActionSecondCheck_C_SC_M603_MaskLess final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHPRate_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M603_MaskLess) == 0x000004, "Wrong alignment on BP_ActionSecondCheck_C_SC_M603_MaskLess");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M603_MaskLess) == 0x00000C, "Wrong size on BP_ActionSecondCheck_C_SC_M603_MaskLess");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_MaskLess, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M603_MaskLess::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_MaskLess, CallFunc_GetHPRate_ReturnValue) == 0x000004, "Member 'BP_ActionSecondCheck_C_SC_M603_MaskLess::CallFunc_GetHPRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_MaskLess, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M603_MaskLess::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M601_Akaikiri
// 0x0028 (0x0028 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M601_Akaikiri final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackCharacter_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleCommandAI*                   CallFunc_GetBattleCommandAI_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BCAI_Monster_M601_C*                K2Node_DynamicCast_AsBP_BCAI_Monster_M601;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M601_Akaikiri) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M601_Akaikiri");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M601_Akaikiri) == 0x000028, "Wrong size on BP_ActionSecondCheck_C_SC_M601_Akaikiri");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M601_Akaikiri, bSuccess) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M601_Akaikiri::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M601_Akaikiri, CallFunc_GetJackCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M601_Akaikiri::CallFunc_GetJackCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M601_Akaikiri, CallFunc_GetBattleCommandAI_ReturnValue) == 0x000010, "Member 'BP_ActionSecondCheck_C_SC_M601_Akaikiri::CallFunc_GetBattleCommandAI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M601_Akaikiri, K2Node_DynamicCast_AsBP_BCAI_Monster_M601) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_M601_Akaikiri::K2Node_DynamicCast_AsBP_BCAI_Monster_M601' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M601_Akaikiri, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M601_Akaikiri::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M601_Akaikiri, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'BP_ActionSecondCheck_C_SC_M601_Akaikiri::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M603_DarkMinadein_1
// 0x0078 (0x0078 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackGameCharacter*>             CasterMightGroup;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         NenziruCount;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOddEffect_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackBattleCharacterManager*            CallFunc_GetBattleCharacterManager_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackMight                                    CallFunc_GetMight_ReturnValue;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackMight>                            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackGameCharacter*>             CallFunc_GetBattleGameCharacters_ReturnValue;      // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1) == 0x000078, "Wrong size on BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, ReturnValue) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CasterMightGroup) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CasterMightGroup' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, NenziruCount) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::NenziruCount' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_Add_IntInt_ReturnValue2) == 0x000038, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_IsOddEffect_ReturnValue) == 0x00003C, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_IsOddEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_GetBattleCharacterManager_ReturnValue) == 0x000048, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_GetBattleCharacterManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_GetMight_ReturnValue) == 0x000051, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_GetMight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1, CallFunc_GetBattleGameCharacters_ReturnValue) == 0x000068, "Member 'BP_ActionSecondCheck_C_SC_M603_DarkMinadein_1::CallFunc_GetBattleGameCharacters_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_KingSlime_M005_E001
// 0x0038 (0x0038 - 0x0000)
struct BP_ActionSecondCheck_C_SC_KingSlime_M005_E001 final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackGameCharacter*>             CallFunc_FindAllBattleMonsterGameCharacters_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackGameCharacter*>             CallFunc_FindAllBattleMonsterGameCharacters_ReturnValue2; // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_KingSlime_M005_E001");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001) == 0x000038, "Wrong size on BP_ActionSecondCheck_C_SC_KingSlime_M005_E001");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, bSuccess) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_FindAllBattleMonsterGameCharacters_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_FindAllBattleMonsterGameCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_FindAllBattleMonsterGameCharacters_ReturnValue2) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_FindAllBattleMonsterGameCharacters_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_Array_Length_ReturnValue2) == 0x00002C, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000031, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_KingSlime_M005_E001, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'BP_ActionSecondCheck_C_SC_KingSlime_M005_E001::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M718_NakamaYobi_Start
// 0x0001 (0x0001 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start) == 0x000001, "Wrong alignment on BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start) == 0x000001, "Wrong size on BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M718_NakamaYobi_Start::Success' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M718_NakamaYobi_02
// 0x0028 (0x0028 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02 final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackBattleCharacterManager*            CallFunc_GetBattleCharacterManager_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 CallFunc_GetBattleMonsterCharacters_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02) == 0x000028, "Wrong size on BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02, CallFunc_GetBattleCharacterManager_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02::CallFunc_GetBattleCharacterManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02, CallFunc_GetBattleMonsterCharacters_ReturnValue) == 0x000010, "Member 'BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02::CallFunc_GetBattleMonsterCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_ActionSecondCheck_C_SC_M718_NakamaYobi_02::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M564_OriNiTozikomeru
// 0x0028 (0x0028 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru final
{
public:
	bool                                          bReturnValue;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bResult;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackCharacter_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleCommandAI*                   CallFunc_GetBattleCommandAI_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BCAI_Monster_M564_C*                K2Node_DynamicCast_AsBP_BCAI_Monster_M564;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru) == 0x000028, "Wrong size on BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, bReturnValue) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::bReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, bResult) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::bResult' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, CallFunc_GetJackCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::CallFunc_GetJackCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, CallFunc_GetBattleCommandAI_ReturnValue) == 0x000010, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::CallFunc_GetBattleCommandAI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, K2Node_DynamicCast_AsBP_BCAI_Monster_M564) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::K2Node_DynamicCast_AsBP_BCAI_Monster_M564' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_ActionSecondCheck_C_SC_M564_OriNiTozikomeru::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_M603_TokiWoUbau
// 0x0048 (0x0048 - 0x0000)
struct BP_ActionSecondCheck_C_SC_M603_TokiWoUbau final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackGameCharacter*>             NewLocalVar_0;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UJackBattleCharacterManager*            CallFunc_GetBattleCharacterManager_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackMight                                    CallFunc_GetMight_ReturnValue;                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackMight>                            K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackGameCharacter*>             CallFunc_GetBattleGameCharacters_ReturnValue;      // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau) == 0x000008, "Wrong alignment on BP_ActionSecondCheck_C_SC_M603_TokiWoUbau");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau) == 0x000048, "Wrong size on BP_ActionSecondCheck_C_SC_M603_TokiWoUbau");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, ReturnValue) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, NewLocalVar_0) == 0x000008, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, CallFunc_GetBattleCharacterManager_ReturnValue) == 0x000018, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::CallFunc_GetBattleCharacterManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, CallFunc_GetMight_ReturnValue) == 0x000025, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::CallFunc_GetMight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_M603_TokiWoUbau, CallFunc_GetBattleGameCharacters_ReturnValue) == 0x000038, "Member 'BP_ActionSecondCheck_C_SC_M603_TokiWoUbau::CallFunc_GetBattleGameCharacters_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Tgt_Mahokanta_F
// 0x0007 (0x0007 - 0x0000)
struct BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyGroupeOddEffectByStatus_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackActionExtentType                         CallFunc_GetActionExtent_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargetGroupeOddEffectByStatus_ReturnValue; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F) == 0x000001, "Wrong alignment on BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F) == 0x000007, "Wrong size on BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, CallFunc_IsEnemyGroupeOddEffectByStatus_ReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::CallFunc_IsEnemyGroupeOddEffectByStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, CallFunc_GetActionExtent_ReturnValue) == 0x000002, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::CallFunc_GetActionExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, CallFunc_IsTargetGroupeOddEffectByStatus_ReturnValue) == 0x000005, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::CallFunc_IsTargetGroupeOddEffectByStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F, CallFunc_Not_PreBool_ReturnValue2) == 0x000006, "Member 'BP_ActionSecondCheck_C_SC_Tgt_Mahokanta_F::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Cast_HP30_Up_F
// 0x0003 (0x0003 - 0x0000)
struct BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCasterHpRate_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F) == 0x000001, "Wrong alignment on BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F) == 0x000003, "Wrong size on BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F, CallFunc_IsCasterHpRate_ReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F::CallFunc_IsCasterHpRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_ActionSecondCheck_C_SC_Cast_HP30_Up_F::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Cast_HP50_Up_F
// 0x0003 (0x0003 - 0x0000)
struct BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCasterHpRate_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F) == 0x000001, "Wrong alignment on BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F) == 0x000003, "Wrong size on BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F, CallFunc_IsCasterHpRate_ReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F::CallFunc_IsCasterHpRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_ActionSecondCheck_C_SC_Cast_HP50_Up_F::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Tgt_HP50_Up_F
// 0x0003 (0x0003 - 0x0000)
struct BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargetHpRate_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F) == 0x000001, "Wrong alignment on BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F) == 0x000003, "Wrong size on BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F, CallFunc_IsTargetHpRate_ReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F::CallFunc_IsTargetHpRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_ActionSecondCheck_C_SC_Tgt_HP50_Up_F::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_TgtArea_HP50_Under_66per_T
// 0x0002 (0x0002 - 0x0000)
struct BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFriendGroupeHpRate_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T) == 0x000001, "Wrong alignment on BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T");
static_assert(sizeof(BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T) == 0x000002, "Wrong size on BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T, Success) == 0x000000, "Member 'BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T::Success' has a wrong offset!");
static_assert(offsetof(BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T, CallFunc_IsFriendGroupeHpRate_ReturnValue) == 0x000001, "Member 'BP_ActionSecondCheck_C_SC_TgtArea_HP50_Under_66per_T::CallFunc_IsFriendGroupeHpRate_ReturnValue' has a wrong offset!");

// Function BP_ActionSecondCheck.BP_ActionSecondCheck_C.SC_Tgt_OddEffect_T
// 0x0002 (0x0002 - 0x0000)
struct BP_ActionSecondCheck_C_SC_Tgt_OddEffect_T final
{
public:
