#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionExec_Inpasu

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionExec_Inpasu.BP_ActionExec_Inpasu_C.ExecuteUbergraph_BP_ActionExec_Inpasu
// 0x02A8 (0x02A8 - 0x0000)
struct BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_TextDataGame                  K2Node_MakeStruct_JackLDT_TextDataGame;            // 0x0008(0x0010)(NoDestructor)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0018(0x0048)()
	bool                                          CallFunc_HasEffectByInpasu_bFocused;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetCasterGameCharacter_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0070(0x0048)()
	struct FJackSerifuAutomationFlags             Temp_struct_Variable;                              // 0x00B8(0x0005)(NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable2;                             // 0x00D0(0x0005)(NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_TextDataGame                  K2Node_MakeStruct_JackLDT_TextDataGame2;           // 0x00D8(0x0010)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusedActionCursor_bFocused;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x0128(0x0048)()
	class FName                                   CallFunc_GetInpasuResultTextId_OutTextId;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetCasterGameCharacter_ReturnValue2;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x0180(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x01C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackGameCharacter*                     CallFunc_GetCasterGameCharacter_ReturnValue3;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue3; // 0x01F0(0x0048)()
	struct FJackLDT_TextDataGame                  K2Node_MakeStruct_JackLDT_TextDataGame3;           // 0x0238(0x0010)(NoDestructor)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x0248(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable4;                             // 0x02A0(0x0005)(NoDestructor)
};
static_assert(alignof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu) == 0x000008, "Wrong alignment on BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu");
static_assert(sizeof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu) == 0x0002A8, "Wrong size on BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, EntryPoint) == 0x000000, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeStruct_JackLDT_TextDataGame) == 0x000008, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeStruct_JackLDT_TextDataGame' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeStruct_JackMessageArgumentData) == 0x000018, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_HasEffectByInpasu_bFocused) == 0x000060, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_HasEffectByInpasu_bFocused' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetCasterGameCharacter_ReturnValue) == 0x000068, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetCasterGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000070, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, Temp_struct_Variable) == 0x0000B8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, Temp_struct_Variable2) == 0x0000D0, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeStruct_JackLDT_TextDataGame2) == 0x0000D8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeStruct_JackLDT_TextDataGame2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x0000F8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetUMGManager_ReturnValue) == 0x000100, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetUMGManager_ReturnValue2) == 0x000108, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetUMGManager_ReturnValue3) == 0x000110, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000118, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_IsFocusedActionCursor_bFocused) == 0x000120, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_IsFocusedActionCursor_bFocused' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeStruct_JackMessageArgumentData2) == 0x000128, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetInpasuResultTextId_OutTextId) == 0x000170, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetInpasuResultTextId_OutTextId' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetCasterGameCharacter_ReturnValue2) == 0x000178, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetCasterGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2) == 0x000180, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeArray_Array2) == 0x0001C8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, Temp_struct_Variable3) == 0x0001D8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_GetCasterGameCharacter_ReturnValue3) == 0x0001E8, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_GetCasterGameCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue3) == 0x0001F0, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeStruct_JackLDT_TextDataGame3) == 0x000238, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeStruct_JackLDT_TextDataGame3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeStruct_JackMessageArgumentData3) == 0x000248, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeStruct_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, K2Node_MakeArray_Array3) == 0x000290, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu, Temp_struct_Variable4) == 0x0002A0, "Member 'BP_ActionExec_Inpasu_C_ExecuteUbergraph_BP_ActionExec_Inpasu::Temp_struct_Variable4' has a wrong offset!");

// Function BP_ActionExec_Inpasu.BP_ActionExec_Inpasu_C.GetInpasuResultTextId
// 0x0058 (0x0058 - 0x0000)
struct BP_ActionExec_Inpasu_C_GetInpasuResultTextId final
{
public:
	class FName                                   OutTextId;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_TextDataGame                  K2Node_MakeStruct_JackLDT_TextDataGame;            // 0x0008(0x0010)(NoDestructor)
	class UJackInteractiveActorComponent*         CallFunc_GetFocusedInteractiveActorComponent_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InteractBigMimicBase_C*             K2Node_DynamicCast_AsBP_Interact_Big_Mimic_Base;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TreasureBoxArrangedBase_C*          K2Node_DynamicCast_AsBP_Treasure_Box_Arranged_Base; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetInpasuResultTextId_OutTextId;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetInpasuResultTextId_OutTextId2;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId) == 0x000008, "Wrong alignment on BP_ActionExec_Inpasu_C_GetInpasuResultTextId");
static_assert(sizeof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId) == 0x000058, "Wrong size on BP_ActionExec_Inpasu_C_GetInpasuResultTextId");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, OutTextId) == 0x000000, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::OutTextId' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, K2Node_MakeStruct_JackLDT_TextDataGame) == 0x000008, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::K2Node_MakeStruct_JackLDT_TextDataGame' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, CallFunc_GetFocusedInteractiveActorComponent_ReturnValue) == 0x000018, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::CallFunc_GetFocusedInteractiveActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, K2Node_DynamicCast_AsBP_Interact_Big_Mimic_Base) == 0x000028, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::K2Node_DynamicCast_AsBP_Interact_Big_Mimic_Base' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, K2Node_DynamicCast_AsBP_Treasure_Box_Arranged_Base) == 0x000038, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::K2Node_DynamicCast_AsBP_Treasure_Box_Arranged_Base' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, K2Node_DynamicCast_bSuccess2) == 0x000040, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, CallFunc_GetInpasuResultTextId_OutTextId) == 0x000048, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::CallFunc_GetInpasuResultTextId_OutTextId' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_GetInpasuResultTextId, CallFunc_GetInpasuResultTextId_OutTextId2) == 0x000050, "Member 'BP_ActionExec_Inpasu_C_GetInpasuResultTextId::CallFunc_GetInpasuResultTextId_OutTextId2' has a wrong offset!");

// Function BP_ActionExec_Inpasu.BP_ActionExec_Inpasu_C.IsFocusedActionCursor
// 0x0018 (0x0018 - 0x0000)
struct BP_ActionExec_Inpasu_C_IsFocusedActionCursor final
{
public:
	bool                                          bFocused;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackInteractiveActorComponent*         CallFunc_GetFocusedInteractiveActorComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllowUsingInpasu_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionExec_Inpasu_C_IsFocusedActionCursor) == 0x000008, "Wrong alignment on BP_ActionExec_Inpasu_C_IsFocusedActionCursor");
static_assert(sizeof(BP_ActionExec_Inpasu_C_IsFocusedActionCursor) == 0x000018, "Wrong size on BP_ActionExec_Inpasu_C_IsFocusedActionCursor");
static_assert(offsetof(BP_ActionExec_Inpasu_C_IsFocusedActionCursor, bFocused) == 0x000000, "Member 'BP_ActionExec_Inpasu_C_IsFocusedActionCursor::bFocused' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_IsFocusedActionCursor, CallFunc_GetFocusedInteractiveActorComponent_ReturnValue) == 0x000008, "Member 'BP_ActionExec_Inpasu_C_IsFocusedActionCursor::CallFunc_GetFocusedInteractiveActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_IsFocusedActionCursor, CallFunc_IsAllowUsingInpasu_ReturnValue) == 0x000010, "Member 'BP_ActionExec_Inpasu_C_IsFocusedActionCursor::CallFunc_IsAllowUsingInpasu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_IsFocusedActionCursor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'BP_ActionExec_Inpasu_C_IsFocusedActionCursor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ActionExec_Inpasu.BP_ActionExec_Inpasu_C.HasEffectByInpasu
// 0x0040 (0x0040 - 0x0000)
struct BP_ActionExec_Inpasu_C_HasEffectByInpasu final
{
public:
	bool                                          bFocused;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackInteractiveActorComponent*         CallFunc_GetFocusedInteractiveActorComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InteractBigMimicBase_C*             K2Node_DynamicCast_AsBP_Interact_Big_Mimic_Base;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TreasureBoxArrangedBase_C*          K2Node_DynamicCast_AsBP_Treasure_Box_Arranged_Base; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionExec_Inpasu_C_HasEffectByInpasu) == 0x000008, "Wrong alignment on BP_ActionExec_Inpasu_C_HasEffectByInpasu");
static_assert(sizeof(BP_ActionExec_Inpasu_C_HasEffectByInpasu) == 0x000040, "Wrong size on BP_ActionExec_Inpasu_C_HasEffectByInpasu");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, bFocused) == 0x000000, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::bFocused' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, CallFunc_GetFocusedInteractiveActorComponent_ReturnValue) == 0x000008, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::CallFunc_GetFocusedInteractiveActorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, K2Node_DynamicCast_AsBP_Interact_Big_Mimic_Base) == 0x000020, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::K2Node_DynamicCast_AsBP_Interact_Big_Mimic_Base' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, K2Node_DynamicCast_AsBP_Treasure_Box_Arranged_Base) == 0x000030, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::K2Node_DynamicCast_AsBP_Treasure_Box_Arranged_Base' has a wrong offset!");
static_assert(offsetof(BP_ActionExec_Inpasu_C_HasEffectByInpasu, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'BP_ActionExec_Inpasu_C_HasEffectByInpasu::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

