#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleFieldGenerator_BlockingVolume

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleFieldGenerator_BlockingVolume.BP_BattleFieldGenerator_BlockingVolume_C.ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume) == 0x000004, "Wrong alignment on BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume");
static_assert(sizeof(BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume) == 0x000004, "Wrong size on BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume");
static_assert(offsetof(BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume, EntryPoint) == 0x000000, "Member 'BP_BattleFieldGenerator_BlockingVolume_C_ExecuteUbergraph_BP_BattleFieldGenerator_BlockingVolume::EntryPoint' has a wrong offset!");

// Function BP_BattleFieldGenerator_BlockingVolume.BP_BattleFieldGenerator_BlockingVolume_C.SetBlockingEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable final
{
public:
	bool                                          BlockingEnable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable) == 0x000001, "Wrong alignment on BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable");
static_assert(sizeof(BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable) == 0x000001, "Wrong size on BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable");
static_assert(offsetof(BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable, BlockingEnable) == 0x000000, "Member 'BP_BattleFieldGenerator_BlockingVolume_C_SetBlockingEnable::BlockingEnable' has a wrong offset!");

}

