#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BCAI_Monster_BossBase

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_BCAI_Monster_BossBase.BP_BCAI_Monster_BossBase_C.ExecTurnCommand
// 0x0810 (0x0810 - 0x0000)
struct BP_BCAI_Monster_BossBase_C_ExecTurnCommand final
{
public:
	struct FJackBattleCommandAI_ExecTurnCommandResult ReturnValue;                                       // 0x0000(0x02A0)(Parm, OutParm, ReturnParm)
	class FName                                   NextAIID;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMoreAction_ReturnValue;                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackBattleCommandAI_ExecTurnCommandResult CallFunc_ExecTurnCommand_ReturnValue;              // 0x02B0(0x02A0)()
	class FName                                   CallFunc_ChoiceNextAIIDFromCandidates_NextAIID;    // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackBattleCommandAI_ExecTurnCommandResult CallFunc_ExecTurnCommand_ReturnValue2;             // 0x0560(0x02A0)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand) == 0x000010, "Wrong alignment on BP_BCAI_Monster_BossBase_C_ExecTurnCommand");
static_assert(sizeof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand) == 0x000810, "Wrong size on BP_BCAI_Monster_BossBase_C_ExecTurnCommand");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, ReturnValue) == 0x000000, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, NextAIID) == 0x0002A0, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::NextAIID' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_SetMoreAction_ReturnValue) == 0x0002A8, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_SetMoreAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_NotEqual_NameName_ReturnValue) == 0x0002A9, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_Add_IntInt_ReturnValue) == 0x0002AC, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_ExecTurnCommand_ReturnValue) == 0x0002B0, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_ExecTurnCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_ChoiceNextAIIDFromCandidates_NextAIID) == 0x000550, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_ChoiceNextAIIDFromCandidates_NextAIID' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_ExecTurnCommand_ReturnValue2) == 0x000560, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_ExecTurnCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ExecTurnCommand, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000800, "Member 'BP_BCAI_Monster_BossBase_C_ExecTurnCommand::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_BCAI_Monster_BossBase.BP_BCAI_Monster_BossBase_C.ChoiceNextAIIDFromCandidates
// 0x0070 (0x0070 - 0x0000)
struct BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates final
{
public:
	class FName                                   CurrentAIID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NextAIID;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Result;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempBattleAIIDNum;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TempBattleAIIDCandidates;                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates) == 0x000008, "Wrong alignment on BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates");
static_assert(sizeof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates) == 0x000070, "Wrong size on BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CurrentAIID) == 0x000000, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CurrentAIID' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, NextAIID) == 0x000008, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::NextAIID' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, Result) == 0x000010, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::Result' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, TempBattleAIIDNum) == 0x000018, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::TempBattleAIIDNum' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, TempBattleAIIDCandidates) == 0x000020, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::TempBattleAIIDCandidates' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00003C, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Array_Length_ReturnValue2) == 0x000054, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Array_Get_Item2) == 0x000058, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates, CallFunc_NotEqual_NameName_ReturnValue) == 0x000068, "Member 'BP_BCAI_Monster_BossBase_C_ChoiceNextAIIDFromCandidates::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

}

