#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleToubatuEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleToubatuEffect.BP_BattleToubatuEffect_C
// 0x0090 (0x0520 - 0x0490)
class ABP_BattleToubatuEffect_C final : public AJackBattleToubatuEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_4BB6835F470C8AA9A6A547B1E59E8941; // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_4BB6835F470C8AA9A6A547B1E59E8941; // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MI;                                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SoundAssetID;                                      // 0x04C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartDelayComplete;                                // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InitializeSoundComplete;                           // 0x04E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CrossFadeMID;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BlurMI;                                            // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BlurMID;                                           // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPlayerCameraComponent*             CameraComponent;                                   // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPlayerCameraComponent*             BlurCameraComponent;                               // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackSEADCategory>                     MuteSeCategory_2;                                  // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_BattleToubatuEffect(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnLoaded_25D9249240E0BDF4570BD2AF5D70FD20(class UObject* Loaded);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleToubatuEffect_C">();
	}
	static class ABP_BattleToubatuEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BattleToubatuEffect_C>();
	}
};
static_assert(alignof(ABP_BattleToubatuEffect_C) == 0x000008, "Wrong alignment on ABP_BattleToubatuEffect_C");
static_assert(sizeof(ABP_BattleToubatuEffect_C) == 0x000520, "Wrong size on ABP_BattleToubatuEffect_C");
static_assert(offsetof(ABP_BattleToubatuEffect_C, UberGraphFrame) == 0x000490, "Member 'ABP_BattleToubatuEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, DefaultSceneRoot) == 0x000498, "Member 'ABP_BattleToubatuEffect_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, Timeline_0_NewTrack_0_4BB6835F470C8AA9A6A547B1E59E8941) == 0x0004A0, "Member 'ABP_BattleToubatuEffect_C::Timeline_0_NewTrack_0_4BB6835F470C8AA9A6A547B1E59E8941' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, Timeline_0__Direction_4BB6835F470C8AA9A6A547B1E59E8941) == 0x0004A4, "Member 'ABP_BattleToubatuEffect_C::Timeline_0__Direction_4BB6835F470C8AA9A6A547B1E59E8941' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, Timeline_0) == 0x0004A8, "Member 'ABP_BattleToubatuEffect_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, MI) == 0x0004B0, "Member 'ABP_BattleToubatuEffect_C::MI' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, Mid) == 0x0004B8, "Member 'ABP_BattleToubatuEffect_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, SoundAssetID) == 0x0004C0, "Member 'ABP_BattleToubatuEffect_C::SoundAssetID' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, Sound) == 0x0004D8, "Member 'ABP_BattleToubatuEffect_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, StartDelayComplete) == 0x0004E0, "Member 'ABP_BattleToubatuEffect_C::StartDelayComplete' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, InitializeSoundComplete) == 0x0004E1, "Member 'ABP_BattleToubatuEffect_C::InitializeSoundComplete' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, CrossFadeMID) == 0x0004E8, "Member 'ABP_BattleToubatuEffect_C::CrossFadeMID' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, BlurMI) == 0x0004F0, "Member 'ABP_BattleToubatuEffect_C::BlurMI' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, BlurMID) == 0x0004F8, "Member 'ABP_BattleToubatuEffect_C::BlurMID' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, CameraComponent) == 0x000500, "Member 'ABP_BattleToubatuEffect_C::CameraComponent' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, BlurCameraComponent) == 0x000508, "Member 'ABP_BattleToubatuEffect_C::BlurCameraComponent' has a wrong offset!");
static_assert(offsetof(ABP_BattleToubatuEffect_C, MuteSeCategory_2) == 0x000510, "Member 'ABP_BattleToubatuEffect_C::MuteSeCategory_2' has a wrong offset!");

}

