#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BowgunTargetBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BowgunTargetBase.BP_BowgunTargetBase_C.BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature final
{
public:
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature");
static_assert(sizeof(BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong size on BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature");
static_assert(offsetof(BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000000, "Member 'BP_BowgunTargetBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_75_ComponentInteractSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");

// Function BP_BowgunTargetBase.BP_BowgunTargetBase_C.ExecuteUbergraph_BP_BowgunTargetBase_2
// 0x0004 (0x0004 - 0x0000)
struct BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2) == 0x000004, "Wrong alignment on BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2");
static_assert(sizeof(BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2) == 0x000004, "Wrong size on BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2");
static_assert(offsetof(BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_BowgunTargetBase_C_ExecuteUbergraph_BP_BowgunTargetBase_2::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_BowgunTargetBase.BP_BowgunTargetBase_C.GetSignedShaftLength
// 0x0004 (0x0004 - 0x0000)
struct BP_BowgunTargetBase_C_GetSignedShaftLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BowgunTargetBase_C_GetSignedShaftLength) == 0x000004, "Wrong alignment on BP_BowgunTargetBase_C_GetSignedShaftLength");
static_assert(sizeof(BP_BowgunTargetBase_C_GetSignedShaftLength) == 0x000004, "Wrong size on BP_BowgunTargetBase_C_GetSignedShaftLength");
static_assert(offsetof(BP_BowgunTargetBase_C_GetSignedShaftLength, ReturnValue) == 0x000000, "Member 'BP_BowgunTargetBase_C_GetSignedShaftLength::ReturnValue' has a wrong offset!");

// Function BP_BowgunTargetBase.BP_BowgunTargetBase_C.GetSignedSingleShaftLength
// 0x0004 (0x0004 - 0x0000)
struct BP_BowgunTargetBase_C_GetSignedSingleShaftLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BowgunTargetBase_C_GetSignedSingleShaftLength) == 0x000004, "Wrong alignment on BP_BowgunTargetBase_C_GetSignedSingleShaftLength");
static_assert(sizeof(BP_BowgunTargetBase_C_GetSignedSingleShaftLength) == 0x000004, "Wrong size on BP_BowgunTargetBase_C_GetSignedSingleShaftLength");
static_assert(offsetof(BP_BowgunTargetBase_C_GetSignedSingleShaftLength, ReturnValue) == 0x000000, "Member 'BP_BowgunTargetBase_C_GetSignedSingleShaftLength::ReturnValue' has a wrong offset!");

// Function BP_BowgunTargetBase.BP_BowgunTargetBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BowgunTargetBase_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BowgunTargetBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BowgunTargetBase_C_ReceiveTick");
static_assert(sizeof(BP_BowgunTargetBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_BowgunTargetBase_C_ReceiveTick");
static_assert(offsetof(BP_BowgunTargetBase_C_ReceiveTick, bpp__DeltaSeconds__pf) == 0x000000, "Member 'BP_BowgunTargetBase_C_ReceiveTick::bpp__DeltaSeconds__pf' has a wrong offset!");

}

