#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleJumonBousouEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BattleJumonBousouEffect.BP_BattleJumonBousouEffect_C
// 0x0040 (0x03D8 - 0x0398)
class ABP_BattleJumonBousouEffect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MI;                                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Param1_Name;                                       // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Param1_Curve;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeClass;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPlayerCameraComponent*             CameraComponent;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BattleJumonBousouEffect(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattleJumonBousouEffect_C">();
	}
	static class ABP_BattleJumonBousouEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BattleJumonBousouEffect_C>();
	}
};
static_assert(alignof(ABP_BattleJumonBousouEffect_C) == 0x000008, "Wrong alignment on ABP_BattleJumonBousouEffect_C");
static_assert(sizeof(ABP_BattleJumonBousouEffect_C) == 0x0003D8, "Wrong size on ABP_BattleJumonBousouEffect_C");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, UberGraphFrame) == 0x000398, "Member 'ABP_BattleJumonBousouEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_BattleJumonBousouEffect_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, MI) == 0x0003A8, "Member 'ABP_BattleJumonBousouEffect_C::MI' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, Mid) == 0x0003B0, "Member 'ABP_BattleJumonBousouEffect_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, Param1_Name) == 0x0003B8, "Member 'ABP_BattleJumonBousouEffect_C::Param1_Name' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, Param1_Curve) == 0x0003C0, "Member 'ABP_BattleJumonBousouEffect_C::Param1_Curve' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, CameraShakeClass) == 0x0003C8, "Member 'ABP_BattleJumonBousouEffect_C::CameraShakeClass' has a wrong offset!");
static_assert(offsetof(ABP_BattleJumonBousouEffect_C, CameraComponent) == 0x0003D0, "Member 'ABP_BattleJumonBousouEffect_C::CameraComponent' has a wrong offset!");

}

