#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BookshelfBase

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BookshelfBase.BP_BookshelfBase_C.BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bFromSweep__pf;                               // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             bpp__SweepResult__pf__const;                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature, bpp__OverlappedComponent__pf) == 0x000000, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature::bpp__OverlappedComponent__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000008, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherComp__pf) == 0x000010, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherComp__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherBodyIndex__pf) == 0x000018, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherBodyIndex__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature, bpp__bFromSweep__pf) == 0x00001C, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature::bpp__bFromSweep__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature, bpp__SweepResult__pf__const) == 0x000020, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_51_ComponentBeginOverlapSignature__DelegateSignature::bpp__SweepResult__pf__const' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature, bpp__OverlappedComponent__pf) == 0x000000, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature::bpp__OverlappedComponent__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000008, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature, bpp__OtherComp__pf) == 0x000010, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature::bpp__OtherComp__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature, bpp__OtherBodyIndex__pf) == 0x000018, "Member 'BP_BookshelfBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_54_ComponentEndOverlapSignature__DelegateSignature::bpp__OtherBodyIndex__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature final
{
public:
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature");
static_assert(sizeof(BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong size on BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature");
static_assert(offsetof(BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000000, "Member 'BP_BookshelfBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_62_ComponentInteractSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.CalcBookShelfID
// 0x0008 (0x0008 - 0x0000)
struct BP_BookshelfBase_C_CalcBookShelfID final
{
public:
	class FName                                   bpp__UseBookSelfID__pf;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_CalcBookShelfID) == 0x000004, "Wrong alignment on BP_BookshelfBase_C_CalcBookShelfID");
static_assert(sizeof(BP_BookshelfBase_C_CalcBookShelfID) == 0x000008, "Wrong size on BP_BookshelfBase_C_CalcBookShelfID");
static_assert(offsetof(BP_BookshelfBase_C_CalcBookShelfID, bpp__UseBookSelfID__pf) == 0x000000, "Member 'BP_BookshelfBase_C_CalcBookShelfID::bpp__UseBookSelfID__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.CalcScenarioFlagBookShelfID
// 0x0010 (0x0010 - 0x0000)
struct BP_BookshelfBase_C_CalcScenarioFlagBookShelfID final
{
public:
	bool                                          bpp__Exist__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__BookID__pf;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_CalcScenarioFlagBookShelfID) == 0x000004, "Wrong alignment on BP_BookshelfBase_C_CalcScenarioFlagBookShelfID");
static_assert(sizeof(BP_BookshelfBase_C_CalcScenarioFlagBookShelfID) == 0x000010, "Wrong size on BP_BookshelfBase_C_CalcScenarioFlagBookShelfID");
static_assert(offsetof(BP_BookshelfBase_C_CalcScenarioFlagBookShelfID, bpp__Exist__pf) == 0x000000, "Member 'BP_BookshelfBase_C_CalcScenarioFlagBookShelfID::bpp__Exist__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_CalcScenarioFlagBookShelfID, bpp__BookID__pf) == 0x000008, "Member 'BP_BookshelfBase_C_CalcScenarioFlagBookShelfID::bpp__BookID__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.ChangeCutSceneFlag
// 0x0010 (0x0010 - 0x0000)
struct BP_BookshelfBase_C_ChangeCutSceneFlag final
{
public:
	struct FJackLDT_GameFlagDataCutScene          bpp__CutSceneFlag__pf;                             // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_ChangeCutSceneFlag) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_ChangeCutSceneFlag");
static_assert(sizeof(BP_BookshelfBase_C_ChangeCutSceneFlag) == 0x000010, "Wrong size on BP_BookshelfBase_C_ChangeCutSceneFlag");
static_assert(offsetof(BP_BookshelfBase_C_ChangeCutSceneFlag, bpp__CutSceneFlag__pf) == 0x000000, "Member 'BP_BookshelfBase_C_ChangeCutSceneFlag::bpp__CutSceneFlag__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.ChangeScenarioFlag
// 0x0010 (0x0010 - 0x0000)
struct BP_BookshelfBase_C_ChangeScenarioFlag final
{
public:
	struct FJackLDT_GameFlagDataScenario          bpp__ScenarioFlag__pf;                             // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_ChangeScenarioFlag) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_ChangeScenarioFlag");
static_assert(sizeof(BP_BookshelfBase_C_ChangeScenarioFlag) == 0x000010, "Wrong size on BP_BookshelfBase_C_ChangeScenarioFlag");
static_assert(offsetof(BP_BookshelfBase_C_ChangeScenarioFlag, bpp__ScenarioFlag__pf) == 0x000000, "Member 'BP_BookshelfBase_C_ChangeScenarioFlag::bpp__ScenarioFlag__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.ExecuteUbergraph_BP_BookshelfBase_0
// 0x0004 (0x0004 - 0x0000)
struct BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0) == 0x000004, "Wrong alignment on BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0");
static_assert(sizeof(BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0) == 0x000004, "Wrong size on BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0");
static_assert(offsetof(BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_BookshelfBase_C_ExecuteUbergraph_BP_BookshelfBase_0::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.OnGenerateDebugInfoString
// 0x0010 (0x0010 - 0x0000)
struct BP_BookshelfBase_C_OnGenerateDebugInfoString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_OnGenerateDebugInfoString) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_OnGenerateDebugInfoString");
static_assert(sizeof(BP_BookshelfBase_C_OnGenerateDebugInfoString) == 0x000010, "Wrong size on BP_BookshelfBase_C_OnGenerateDebugInfoString");
static_assert(offsetof(BP_BookshelfBase_C_OnGenerateDebugInfoString, ReturnValue) == 0x000000, "Member 'BP_BookshelfBase_C_OnGenerateDebugInfoString::ReturnValue' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.QuestBegin
// 0x0018 (0x0018 - 0x0000)
struct BP_BookshelfBase_C_QuestBegin final
{
public:
	struct FJackLDT_QuestTable                    bpp__QuestID__pf;                                  // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_BookshelfBase_C_QuestBegin) == 0x000008, "Wrong alignment on BP_BookshelfBase_C_QuestBegin");
static_assert(sizeof(BP_BookshelfBase_C_QuestBegin) == 0x000018, "Wrong size on BP_BookshelfBase_C_QuestBegin");
static_assert(offsetof(BP_BookshelfBase_C_QuestBegin, bpp__QuestID__pf) == 0x000000, "Member 'BP_BookshelfBase_C_QuestBegin::bpp__QuestID__pf' has a wrong offset!");
static_assert(offsetof(BP_BookshelfBase_C_QuestBegin, bpp__Result__pf) == 0x000010, "Member 'BP_BookshelfBase_C_QuestBegin::bpp__Result__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.QuestComplete
// 0x0001 (0x0001 - 0x0000)
struct BP_BookshelfBase_C_QuestComplete final
{
public:
	bool                                          bpp__Ret__pf;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_QuestComplete) == 0x000001, "Wrong alignment on BP_BookshelfBase_C_QuestComplete");
static_assert(sizeof(BP_BookshelfBase_C_QuestComplete) == 0x000001, "Wrong size on BP_BookshelfBase_C_QuestComplete");
static_assert(offsetof(BP_BookshelfBase_C_QuestComplete, bpp__Ret__pf) == 0x000000, "Member 'BP_BookshelfBase_C_QuestComplete::bpp__Ret__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.QuestCompleteAfterTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BookshelfBase_C_QuestCompleteAfterTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_QuestCompleteAfterTick) == 0x000004, "Wrong alignment on BP_BookshelfBase_C_QuestCompleteAfterTick");
static_assert(sizeof(BP_BookshelfBase_C_QuestCompleteAfterTick) == 0x000004, "Wrong size on BP_BookshelfBase_C_QuestCompleteAfterTick");
static_assert(offsetof(BP_BookshelfBase_C_QuestCompleteAfterTick, bpp__DeltaSeconds__pf) == 0x000000, "Member 'BP_BookshelfBase_C_QuestCompleteAfterTick::bpp__DeltaSeconds__pf' has a wrong offset!");

// Function BP_BookshelfBase.BP_BookshelfBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BookshelfBase_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_BookshelfBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BookshelfBase_C_ReceiveTick");
static_assert(sizeof(BP_BookshelfBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_BookshelfBase_C_ReceiveTick");
static_assert(offsetof(BP_BookshelfBase_C_ReceiveTick, bpp__DeltaSeconds__pf) == 0x000000, "Member 'BP_BookshelfBase_C_ReceiveTick::bpp__DeltaSeconds__pf' has a wrong offset!");

}

