#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BCAI_Monster_M564

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_BCAI_Monster_M564.BP_BCAI_Monster_M564_C.ExecuteUbergraph_BP_BCAI_Monster_M564
// 0x0038 (0x0038 - 0x0000)
struct BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovementEnabled_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperational_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterInterruptActionDetail_ReturnValue; // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564) == 0x000008, "Wrong alignment on BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564");
static_assert(sizeof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564) == 0x000038, "Wrong size on BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, EntryPoint) == 0x000000, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_GetBattleManager_ReturnValue) == 0x000018, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_GetGameCharacter_ReturnValue) == 0x000020, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_IsMovementEnabled_ReturnValue) == 0x000028, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_IsMovementEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_IsOperational_ReturnValue) == 0x000029, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_IsOperational_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_Greater_IntInt_ReturnValue) == 0x00002B, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_RegisterInterruptActionDetail_ReturnValue) == 0x00002D, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_RegisterInterruptActionDetail_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'BP_BCAI_Monster_M564_C_ExecuteUbergraph_BP_BCAI_Monster_M564::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BCAI_Monster_M564.BP_BCAI_Monster_M564_C.Notify_OriNiTozikomeruExecute
// 0x0048 (0x0048 - 0x0000)
struct BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute final
{
public:
	class UJackGameCharacter*                     Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_OddEffect                     K2Node_MakeStruct_JackLDT_OddEffect;               // 0x0010(0x0010)(NoDestructor)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackOddEffectManager*                  CallFunc_GetOddEffectManager_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue2;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackOddEffectManager*                  CallFunc_GetOddEffectManager_ReturnValue2;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute) == 0x000008, "Wrong alignment on BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute");
static_assert(sizeof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute) == 0x000048, "Wrong size on BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, Target) == 0x000000, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::Target' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, bEnable) == 0x000008, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::bEnable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, K2Node_MakeStruct_JackLDT_OddEffect) == 0x000010, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::K2Node_MakeStruct_JackLDT_OddEffect' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, CallFunc_GetGameCharacter_ReturnValue) == 0x000020, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, CallFunc_GetOddEffectManager_ReturnValue) == 0x000028, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::CallFunc_GetOddEffectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, CallFunc_GetGameCharacter_ReturnValue2) == 0x000030, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::CallFunc_GetGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, CallFunc_GetOddEffectManager_ReturnValue2) == 0x000038, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::CallFunc_GetOddEffectManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000040, "Member 'BP_BCAI_Monster_M564_C_Notify_OriNiTozikomeruExecute::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");

}

