#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleFieldGenerator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleFieldGenerator.BP_BattleFieldGenerator_C.ExecuteUbergraph_BP_BattleFieldGenerator
// 0x0088 (0x0088 - 0x0000)
struct BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PermitIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_PermitIndex;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPermitVolumeValid_Valid;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AVolume*>                        CallFunc_GetActiveVolumeArray_ReturnValue;         // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator) == 0x000008, "Wrong alignment on BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator");
static_assert(sizeof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator) == 0x000088, "Wrong size on BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, EntryPoint) == 0x000000, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, K2Node_CustomEvent_PermitIndex) == 0x000028, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::K2Node_CustomEvent_PermitIndex' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_MakeLiteralString_ReturnValue) == 0x000030, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_IsPermitVolumeValid_Valid) == 0x000041, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_IsPermitVolumeValid_Valid' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_GetActiveVolumeArray_ReturnValue) == 0x000070, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_GetActiveVolumeArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_BooleanAND_ReturnValue2) == 0x000085, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_Not_PreBool_ReturnValue) == 0x000086, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000087, "Member 'BP_BattleFieldGenerator_C_ExecuteUbergraph_BP_BattleFieldGenerator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleFieldGenerator.BP_BattleFieldGenerator_C.OnBattleStart_Event_0
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleFieldGenerator_C_OnBattleStart_Event_0 final
{
public:
	int32                                         PermitIndex_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleFieldGenerator_C_OnBattleStart_Event_0) == 0x000004, "Wrong alignment on BP_BattleFieldGenerator_C_OnBattleStart_Event_0");
static_assert(sizeof(BP_BattleFieldGenerator_C_OnBattleStart_Event_0) == 0x000004, "Wrong size on BP_BattleFieldGenerator_C_OnBattleStart_Event_0");
static_assert(offsetof(BP_BattleFieldGenerator_C_OnBattleStart_Event_0, PermitIndex_0) == 0x000000, "Member 'BP_BattleFieldGenerator_C_OnBattleStart_Event_0::PermitIndex_0' has a wrong offset!");

// Function BP_BattleFieldGenerator.BP_BattleFieldGenerator_C.SetBlockngVolumeEnable
// 0x0088 (0x0088 - 0x0000)
struct BP_BattleFieldGenerator_C_SetBlockngVolumeEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PermitIndex_0;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AVolume*>                        TmpVolumes;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AJackBattleFieldGenerator_BlockingVolume*> CallFunc_GetBlockingVolumeArray_ReturnValue;       // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVolume*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVolume*                                CallFunc_Array_Get_Item2;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleFieldGenerator_BlockingVolume_C* K2Node_DynamicCast_AsBP_Battle_Field_Generator_Blocking_Volume; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleFieldGenerator_BlockingVolume_C* K2Node_DynamicCast_AsBP_Battle_Field_Generator_Blocking_Volume2; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable) == 0x000008, "Wrong alignment on BP_BattleFieldGenerator_C_SetBlockngVolumeEnable");
static_assert(sizeof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable) == 0x000088, "Wrong size on BP_BattleFieldGenerator_C_SetBlockngVolumeEnable");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, Enable) == 0x000000, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::Enable' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, PermitIndex_0) == 0x000004, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::PermitIndex_0' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, TmpVolumes) == 0x000008, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::TmpVolumes' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_GetBlockingVolumeArray_ReturnValue) == 0x000020, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_GetBlockingVolumeArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, Temp_int_Array_Index_Variable2) == 0x000038, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Array_Get_Item2) == 0x000048, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, K2Node_DynamicCast_AsBP_Battle_Field_Generator_Blocking_Volume) == 0x000050, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::K2Node_DynamicCast_AsBP_Battle_Field_Generator_Blocking_Volume' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, K2Node_DynamicCast_AsBP_Battle_Field_Generator_Blocking_Volume2) == 0x000060, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::K2Node_DynamicCast_AsBP_Battle_Field_Generator_Blocking_Volume2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Array_Length_ReturnValue2) == 0x000070, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, Temp_int_Loop_Counter_Variable2) == 0x000078, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Less_IntInt_ReturnValue2) == 0x00007C, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetBlockngVolumeEnable, CallFunc_Add_IntInt_ReturnValue2) == 0x000080, "Member 'BP_BattleFieldGenerator_C_SetBlockngVolumeEnable::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");

// Function BP_BattleFieldGenerator.BP_BattleFieldGenerator_C.IsPermitVolumeValid
// 0x0020 (0x0020 - 0x0000)
struct BP_BattleFieldGenerator_C_IsPermitVolumeValid final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Retval;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVolume*>                        CallFunc_GetPermitVolumeArray_ReturnValue;         // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleFieldGenerator_C_IsPermitVolumeValid) == 0x000008, "Wrong alignment on BP_BattleFieldGenerator_C_IsPermitVolumeValid");
static_assert(sizeof(BP_BattleFieldGenerator_C_IsPermitVolumeValid) == 0x000020, "Wrong size on BP_BattleFieldGenerator_C_IsPermitVolumeValid");
static_assert(offsetof(BP_BattleFieldGenerator_C_IsPermitVolumeValid, Valid) == 0x000000, "Member 'BP_BattleFieldGenerator_C_IsPermitVolumeValid::Valid' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_IsPermitVolumeValid, Retval) == 0x000001, "Member 'BP_BattleFieldGenerator_C_IsPermitVolumeValid::Retval' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_IsPermitVolumeValid, CallFunc_GetPermitVolumeArray_ReturnValue) == 0x000008, "Member 'BP_BattleFieldGenerator_C_IsPermitVolumeValid::CallFunc_GetPermitVolumeArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_IsPermitVolumeValid, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_BattleFieldGenerator_C_IsPermitVolumeValid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_IsPermitVolumeValid, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BP_BattleFieldGenerator_C_IsPermitVolumeValid::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleFieldGenerator.BP_BattleFieldGenerator_C.SetupVolumes
// 0x0068 (0x0068 - 0x0000)
struct BP_BattleFieldGenerator_C_SetupVolumes final
{
public:
	TArray<class AVolume*>                        TmpVolumes;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVolume*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVolume*                                CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AVolume*>                        CallFunc_GetPermitVolumeArray_ReturnValue;         // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AVolume*>                        CallFunc_GetActiveVolumeArray_ReturnValue;         // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_BattleFieldGenerator_C_SetupVolumes) == 0x000008, "Wrong alignment on BP_BattleFieldGenerator_C_SetupVolumes");
static_assert(sizeof(BP_BattleFieldGenerator_C_SetupVolumes) == 0x000068, "Wrong size on BP_BattleFieldGenerator_C_SetupVolumes");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, TmpVolumes) == 0x000000, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::TmpVolumes' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, Temp_int_Array_Index_Variable2) == 0x000024, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Array_Get_Item2) == 0x000030, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Array_Length_ReturnValue2) == 0x000038, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, Temp_int_Loop_Counter_Variable2) == 0x00003C, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_GetPermitVolumeArray_ReturnValue) == 0x000040, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_GetPermitVolumeArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Less_IntInt_ReturnValue2) == 0x000050, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_Add_IntInt_ReturnValue2) == 0x000054, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_SetupVolumes, CallFunc_GetActiveVolumeArray_ReturnValue) == 0x000058, "Member 'BP_BattleFieldGenerator_C_SetupVolumes::CallFunc_GetActiveVolumeArray_ReturnValue' has a wrong offset!");

// Function BP_BattleFieldGenerator.BP_BattleFieldGenerator_C.DisableOverlapEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_BattleFieldGenerator_C_DisableOverlapEvent final
{
public:
	class AVolume*                                Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleFieldGenerator_C_DisableOverlapEvent) == 0x000008, "Wrong alignment on BP_BattleFieldGenerator_C_DisableOverlapEvent");
static_assert(sizeof(BP_BattleFieldGenerator_C_DisableOverlapEvent) == 0x000010, "Wrong size on BP_BattleFieldGenerator_C_DisableOverlapEvent");
static_assert(offsetof(BP_BattleFieldGenerator_C_DisableOverlapEvent, Volume) == 0x000000, "Member 'BP_BattleFieldGenerator_C_DisableOverlapEvent::Volume' has a wrong offset!");
static_assert(offsetof(BP_BattleFieldGenerator_C_DisableOverlapEvent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BattleFieldGenerator_C_DisableOverlapEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

