#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BCAI_Monster_M564

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BCAI_Monster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BCAI_Monster_M564.BP_BCAI_Monster_M564_C
// 0x0028 (0x05C0 - 0x0598)
class ABP_BCAI_Monster_M564_C final : public ABP_BCAI_Monster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BCAI_Monster_M564_C;             // 0x0598(0x0008)(Transient, DuplicateTransient)
	class UJackGameCharacter*                     TozikomeruTarget;                                  // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TozikomeruCount;                                   // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Tozikomeru_OddEffectID;                            // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTozikome;                                         // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BCAI_Monster_M564(int32 EntryPoint);
	void OnRoundEndInterruptCheck_Event_0();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Notify_OriNiTozikomeruExecute(class UJackGameCharacter* Target, bool bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BCAI_Monster_M564_C">();
	}
	static class ABP_BCAI_Monster_M564_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BCAI_Monster_M564_C>();
	}
};
static_assert(alignof(ABP_BCAI_Monster_M564_C) == 0x000008, "Wrong alignment on ABP_BCAI_Monster_M564_C");
static_assert(sizeof(ABP_BCAI_Monster_M564_C) == 0x0005C0, "Wrong size on ABP_BCAI_Monster_M564_C");
static_assert(offsetof(ABP_BCAI_Monster_M564_C, UberGraphFrame_BP_BCAI_Monster_M564_C) == 0x000598, "Member 'ABP_BCAI_Monster_M564_C::UberGraphFrame_BP_BCAI_Monster_M564_C' has a wrong offset!");
static_assert(offsetof(ABP_BCAI_Monster_M564_C, TozikomeruTarget) == 0x0005A0, "Member 'ABP_BCAI_Monster_M564_C::TozikomeruTarget' has a wrong offset!");
static_assert(offsetof(ABP_BCAI_Monster_M564_C, TozikomeruCount) == 0x0005A8, "Member 'ABP_BCAI_Monster_M564_C::TozikomeruCount' has a wrong offset!");
static_assert(offsetof(ABP_BCAI_Monster_M564_C, Tozikomeru_OddEffectID) == 0x0005B0, "Member 'ABP_BCAI_Monster_M564_C::Tozikomeru_OddEffectID' has a wrong offset!");
static_assert(offsetof(ABP_BCAI_Monster_M564_C, bTozikome) == 0x0005B8, "Member 'ABP_BCAI_Monster_M564_C::bTozikome' has a wrong offset!");

}

