#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BCAI_Monster

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_BCAI_Monster.BP_BCAI_Monster_C.ExecuteUbergraph_BP_BCAI_Monster
// 0x0220 (0x0220 - 0x0000)
struct BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InMonsterBattleAIID;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackMonsterDatabase*                   CallFunc_GetMonsterDatabase_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackMonsterGameCharacter*              K2Node_DynamicCast_AsJack_Monster_Game_Character;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableMonsterBattleAI          CallFunc_GetDTMonsterBattleAIRowByID_ReturnValue;  // 0x0030(0x00F8)()
	struct FJackMonsterData                       CallFunc_GetMonsterDataBP_ReturnValue;             // 0x0128(0x00C8)()
	class FName                                   CallFunc_GetDTMonsterBattleAIID_ReturnValue;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue2;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGuestNpcGameCharacter*             K2Node_DynamicCast_AsJack_Guest_Npc_Game_Character; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBattleAI_ID_ReturnValue;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMoreAction_ReturnValue;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMoreAction_ReturnValue2;               // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster) == 0x000008, "Wrong alignment on BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster");
static_assert(sizeof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster) == 0x000220, "Wrong size on BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, EntryPoint) == 0x000000, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, K2Node_Event_InMonsterBattleAIID) == 0x000008, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::K2Node_Event_InMonsterBattleAIID' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetGameCharacter_ReturnValue) == 0x000010, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetMonsterDatabase_ReturnValue) == 0x000018, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetMonsterDatabase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, K2Node_DynamicCast_AsJack_Monster_Game_Character) == 0x000020, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::K2Node_DynamicCast_AsJack_Monster_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetDTMonsterBattleAIRowByID_ReturnValue) == 0x000030, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetDTMonsterBattleAIRowByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetMonsterDataBP_ReturnValue) == 0x000128, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetMonsterDataBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetDTMonsterBattleAIID_ReturnValue) == 0x0001F0, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetDTMonsterBattleAIID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetGameCharacter_ReturnValue2) == 0x0001F8, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, K2Node_DynamicCast_AsJack_Guest_Npc_Game_Character) == 0x000200, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::K2Node_DynamicCast_AsJack_Guest_Npc_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, K2Node_DynamicCast_bSuccess2) == 0x000208, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_GetBattleAI_ID_ReturnValue) == 0x000210, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_GetBattleAI_ID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_SetMoreAction_ReturnValue) == 0x000218, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_SetMoreAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster, CallFunc_SetMoreAction_ReturnValue2) == 0x000219, "Member 'BP_BCAI_Monster_C_ExecuteUbergraph_BP_BCAI_Monster::CallFunc_SetMoreAction_ReturnValue2' has a wrong offset!");

// Function BP_BCAI_Monster.BP_BCAI_Monster_C.InitializeMonsterBattleAI
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_BCAI_Monster_C_InitializeMonsterBattleAI final
{
public:
	class FName                                   InMonsterBattleAIID;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BCAI_Monster_C_InitializeMonsterBattleAI) == 0x000008, "Wrong alignment on BP_BCAI_Monster_C_InitializeMonsterBattleAI");
static_assert(sizeof(BP_BCAI_Monster_C_InitializeMonsterBattleAI) == 0x000008, "Wrong size on BP_BCAI_Monster_C_InitializeMonsterBattleAI");
static_assert(offsetof(BP_BCAI_Monster_C_InitializeMonsterBattleAI, InMonsterBattleAIID) == 0x000000, "Member 'BP_BCAI_Monster_C_InitializeMonsterBattleAI::InMonsterBattleAIID' has a wrong offset!");

// Function BP_BCAI_Monster.BP_BCAI_Monster_C.ExecTurnCommand
// 0x13A0 (0x13A0 - 0x0000)
struct BP_BCAI_Monster_C_ExecTurnCommand final
{
public:
	struct FJackBattleCommandAI_ExecTurnCommandResult ReturnValue;                                       // 0x0000(0x02A0)(Parm, OutParm, ReturnParm)
	TArray<class UJackGameCharacter*>             CandidateTargetGameCharacters;                     // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UJackGameCharacter*                     ExecTargetGameCharacter;                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackActionData                        ExecActionData;                                    // 0x02B8(0x00B0)(Edit, BlueprintVisible, NoDestructor)
	class FName                                   CallFunc_GetDTActionSecondCheckID_ReturnValue;     // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMonsterBattleAI_ActionSlot        CallFunc_Array_Get_Item;                           // 0x0370(0x0038)(NoDestructor)
	struct FJackMonsterBattleAI_ActionSlot        CallFunc_Array_Get_Item2;                          // 0x03A8(0x0038)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA[0x2];                                      // 0x03EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMonsterBattleAI_ActionSlot        CallFunc_Array_Get_Item3;                          // 0x03F8(0x0038)(NoDestructor)
	struct FJackMonsterBattleAI_ActionSlot        CallFunc_Array_Get_Item4;                          // 0x0430(0x0038)(NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_473[0x5];                                      // 0x0473(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackActionData                        CallFunc_CalcExceptionActionSlotsTurnCommand_OutExecActionData; // 0x0478(0x00B0)(NoDestructor)
	class UJackGameCharacter*                     CallFunc_CalcExceptionActionSlotsTurnCommand_OutExecTargetGameCharacter; // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackBattleParameter*                   CallFunc_GetBattleParameter_ReturnValue;           // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAICalcActionStrideTableCountMax_ReturnValue; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0546(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChangeAITable_ReturnValue;              // 0x0547(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FJackMonsterBattleAI_ActionSlot> CallFunc_BuildCandidateActionSlots_Result;         // 0x0548(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_BuildCandidateActionSlots_CandidateSlotIDs; // 0x0558(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x056A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x056B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcGetNextBasisActionSlotID_ReturnValue; // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_Array_Get_Item5;                          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackGameCharacter*>             CallFunc_SortCandidateTargetGameCharacters_ReturnValue; // 0x0588(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CalcSecondCheckBP_ReturnValue;            // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue2;            // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackActionPlayParam                   K2Node_MakeStruct_JackActionPlayParam;             // 0x05B0(0x0290)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_844[0xC];                                      // 0x0844(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackBattleCommandAI_ExecTurnCommandResult K2Node_MakeStruct_JackBattleCommandAI_ExecTurnCommandResult; // 0x0850(0x02A0)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0x3];                                      // 0x0AF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0AF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x7];                                      // 0x0AF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackActionDatabase*                    CallFunc_GetActionDatabase_ReturnValue;            // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackGameCharacter*>             CallFunc_CalcCanditateTargetGameCharacter_OutCanditateGameCharacters; // 0x0B08(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackActionData                        CallFunc_GetActionData_ReturnValue;                // 0x0B18(0x00B0)(NoDestructor)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue3;            // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackBattleCommandAI_ExecTurnCommandResult CallFunc_ExecTurnCommand_ReturnValue;              // 0x0BD0(0x02A0)()
	struct FJackActionPlayParam                   K2Node_MakeStruct_JackActionPlayParam2;            // 0x0E70(0x0290)()
	struct FJackBattleCommandAI_ExecTurnCommandResult K2Node_MakeStruct_JackBattleCommandAI_ExecTurnCommandResult2; // 0x1100(0x02A0)()
};
static_assert(alignof(BP_BCAI_Monster_C_ExecTurnCommand) == 0x000010, "Wrong alignment on BP_BCAI_Monster_C_ExecTurnCommand");
static_assert(sizeof(BP_BCAI_Monster_C_ExecTurnCommand) == 0x0013A0, "Wrong size on BP_BCAI_Monster_C_ExecTurnCommand");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, ReturnValue) == 0x000000, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CandidateTargetGameCharacters) == 0x0002A0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CandidateTargetGameCharacters' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, ExecTargetGameCharacter) == 0x0002B0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::ExecTargetGameCharacter' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, ExecActionData) == 0x0002B8, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::ExecActionData' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetDTActionSecondCheckID_ReturnValue) == 0x000368, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetDTActionSecondCheckID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Get_Item) == 0x000370, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Get_Item2) == 0x0003A8, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Add_IntInt_ReturnValue) == 0x0003E0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Length_ReturnValue) == 0x0003E4, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Conv_IntToBool_ReturnValue) == 0x0003E8, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Not_PreBool_ReturnValue) == 0x0003E9, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Length_ReturnValue2) == 0x0003EC, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Greater_IntInt_ReturnValue) == 0x0003F0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Get_Item3) == 0x0003F8, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Get_Item4) == 0x000430, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, Temp_bool_True_if_break_was_hit_Variable) == 0x000468, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Length_ReturnValue3) == 0x00046C, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Not_PreBool_ReturnValue2) == 0x000470, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Conv_IntToBool_ReturnValue2) == 0x000471, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Not_PreBool_ReturnValue3) == 0x000472, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_CalcExceptionActionSlotsTurnCommand_OutExecActionData) == 0x000478, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_CalcExceptionActionSlotsTurnCommand_OutExecActionData' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_CalcExceptionActionSlotsTurnCommand_OutExecTargetGameCharacter) == 0x000528, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_CalcExceptionActionSlotsTurnCommand_OutExecTargetGameCharacter' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetBattleManager_ReturnValue) == 0x000530, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetBattleParameter_ReturnValue) == 0x000538, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetBattleParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetAICalcActionStrideTableCountMax_ReturnValue) == 0x000540, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetAICalcActionStrideTableCountMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000544, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_IsValid_ReturnValue) == 0x000545, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Not_PreBool_ReturnValue4) == 0x000546, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_IsChangeAITable_ReturnValue) == 0x000547, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_IsChangeAITable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_BuildCandidateActionSlots_Result) == 0x000548, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_BuildCandidateActionSlots_Result' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_BuildCandidateActionSlots_CandidateSlotIDs) == 0x000558, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_BuildCandidateActionSlots_CandidateSlotIDs' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_IsValid_ReturnValue2) == 0x000568, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Not_PreBool_ReturnValue5) == 0x000569, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_BooleanAND_ReturnValue) == 0x00056A, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_BooleanAND_ReturnValue2) == 0x00056B, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_IsValid_ReturnValue3) == 0x00056C, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, Temp_int_Array_Index_Variable) == 0x000570, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_CalcGetNextBasisActionSlotID_ReturnValue) == 0x000574, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_CalcGetNextBasisActionSlotID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetGameCharacter_ReturnValue) == 0x000578, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Get_Item5) == 0x000580, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_SortCandidateTargetGameCharacters_ReturnValue) == 0x000588, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_SortCandidateTargetGameCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_CalcSecondCheckBP_ReturnValue) == 0x000598, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_CalcSecondCheckBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Array_Length_ReturnValue4) == 0x00059C, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetGameCharacter_ReturnValue2) == 0x0005A0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, K2Node_MakeStruct_JackActionPlayParam) == 0x0005B0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::K2Node_MakeStruct_JackActionPlayParam' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, Temp_int_Loop_Counter_Variable) == 0x000840, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, K2Node_MakeStruct_JackBattleCommandAI_ExecTurnCommandResult) == 0x000850, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::K2Node_MakeStruct_JackBattleCommandAI_ExecTurnCommandResult' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Less_IntInt_ReturnValue) == 0x000AF0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_Add_IntInt_ReturnValue2) == 0x000AF4, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_BooleanAND_ReturnValue3) == 0x000AF8, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetActionDatabase_ReturnValue) == 0x000B00, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetActionDatabase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_CalcCanditateTargetGameCharacter_OutCanditateGameCharacters) == 0x000B08, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_CalcCanditateTargetGameCharacter_OutCanditateGameCharacters' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetActionData_ReturnValue) == 0x000B18, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetActionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_GetGameCharacter_ReturnValue3) == 0x000BC8, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_GetGameCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, CallFunc_ExecTurnCommand_ReturnValue) == 0x000BD0, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::CallFunc_ExecTurnCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, K2Node_MakeStruct_JackActionPlayParam2) == 0x000E70, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::K2Node_MakeStruct_JackActionPlayParam2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_ExecTurnCommand, K2Node_MakeStruct_JackBattleCommandAI_ExecTurnCommandResult2) == 0x001100, "Member 'BP_BCAI_Monster_C_ExecTurnCommand::K2Node_MakeStruct_JackBattleCommandAI_ExecTurnCommandResult2' has a wrong offset!");

// Function BP_BCAI_Monster.BP_BCAI_Monster_C.BuildCandidateActionSlots
// 0x0128 (0x0128 - 0x0000)
struct BP_BCAI_Monster_C_BuildCandidateActionSlots final
{
public:
	TArray<struct FJackMonsterBattleAI_ActionSlot> Result;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<int32>                                 CandidateSlotIDs_0;                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<int32>                                 OutCandidateSlotIDs;                               // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FJackMonsterBattleAI_ActionSlot> OutCandidateActionSlots;                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FJackMonsterBattleAI_ActionSlot> TempCandidateActionSlots;                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMonsterBattleAI_ActionSlot        K2Node_MakeStruct_JackMonsterBattleAI_ActionSlot;  // 0x0060(0x0038)(NoDestructor)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMonsterBattleAI_ActionSlot> CallFunc_ExecFirstCheck_OutCandidateActionSlots;   // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item2;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMonsterBattleAI_ActionSlot        CallFunc_Array_Get_Item3;                          // 0x00D8(0x0038)(NoDestructor)
	TArray<int32>                                 CallFunc_CalcCandidateSlotIDs_CandidateSlotIDs;    // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckActionSlotGroupeCheck_ReturnValue;   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BCAI_Monster_C_BuildCandidateActionSlots) == 0x000008, "Wrong alignment on BP_BCAI_Monster_C_BuildCandidateActionSlots");
static_assert(sizeof(BP_BCAI_Monster_C_BuildCandidateActionSlots) == 0x000128, "Wrong size on BP_BCAI_Monster_C_BuildCandidateActionSlots");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, Result) == 0x000000, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::Result' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CandidateSlotIDs_0) == 0x000010, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CandidateSlotIDs_0' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, OutCandidateSlotIDs) == 0x000020, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::OutCandidateSlotIDs' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, OutCandidateActionSlots) == 0x000030, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::OutCandidateActionSlots' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, TempCandidateActionSlots) == 0x000040, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::TempCandidateActionSlots' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, Temp_int_Array_Index_Variable2) == 0x00005C, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, K2Node_MakeStruct_JackMonsterBattleAI_ActionSlot) == 0x000060, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::K2Node_MakeStruct_JackMonsterBattleAI_ActionSlot' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_ExecFirstCheck_OutCandidateActionSlots) == 0x0000A0, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_ExecFirstCheck_OutCandidateActionSlots' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_GetBattleManager_ReturnValue) == 0x0000B8, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Get_Item2) == 0x0000C0, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Length_ReturnValue2) == 0x0000C4, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, Temp_int_Loop_Counter_Variable2) == 0x0000CC, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Less_IntInt_ReturnValue2) == 0x0000D0, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Add_IntInt_ReturnValue2) == 0x0000D4, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Get_Item3) == 0x0000D8, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_CalcCandidateSlotIDs_CandidateSlotIDs) == 0x000110, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_CalcCandidateSlotIDs_CandidateSlotIDs' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_CheckActionSlotGroupeCheck_ReturnValue) == 0x000120, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_CheckActionSlotGroupeCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_BuildCandidateActionSlots, CallFunc_Array_Add_ReturnValue2) == 0x000124, "Member 'BP_BCAI_Monster_C_BuildCandidateActionSlots::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function BP_BCAI_Monster.BP_BCAI_Monster_C.CalcCandidateSlotIDs
// 0x01B0 (0x01B0 - 0x0000)
struct BP_BCAI_Monster_C_CalcCandidateSlotIDs final
{
public:
	TArray<struct FJackMonsterBattleAI_ActionSlot> ActionSlots;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CandidateSlotIDs_0;                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor)
	int32                                         KaitenC_StartBlock;                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KaitenB_StartBlock;                                // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OutCandidateSlotIDs;                               // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         SlotNum;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_CreateSlotsKaitenB_OutCandidateSlotIDs;   // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleActionPatternType                  CallFunc_GetActionPatternType_ActionPatternType;   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_RandomProbabilityTableArray_ReturnValue;  // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_GetDebugActionPatternSlotIDs_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_CreateSlotsKaitenC_OutCandidateSlotIDs;   // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetDebugActionPatternSlotIDs_ReturnValue2; // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable2;                                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_CreateSlotsKaitenA_OutCandidateSlotIDs;   // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue2;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue3;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue4;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue5;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue6;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue7;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue8;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_RandomProbabilityTableArray_ReturnValue2; // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue9;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue10;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue11;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue12;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array2;                           // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue13;             // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_RandomProbabilityTableArray_ReturnValue3; // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue14;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue15;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue16;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue17;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue18;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array3;                           // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_RandomProbabilityTableArray_ReturnValue4; // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackBattleActionPatternType                  CallFunc_GetActionPatternType_ActionPatternType2;  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BCAI_Monster_C_CalcCandidateSlotIDs) == 0x000008, "Wrong alignment on BP_BCAI_Monster_C_CalcCandidateSlotIDs");
static_assert(sizeof(BP_BCAI_Monster_C_CalcCandidateSlotIDs) == 0x0001B0, "Wrong size on BP_BCAI_Monster_C_CalcCandidateSlotIDs");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, ActionSlots) == 0x000000, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::ActionSlots' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CandidateSlotIDs_0) == 0x000010, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CandidateSlotIDs_0' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, KaitenC_StartBlock) == 0x000020, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::KaitenC_StartBlock' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, KaitenB_StartBlock) == 0x000024, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::KaitenB_StartBlock' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, OutCandidateSlotIDs) == 0x000028, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::OutCandidateSlotIDs' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, SlotNum) == 0x000038, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::SlotNum' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_CreateSlotsKaitenB_OutCandidateSlotIDs) == 0x000048, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_CreateSlotsKaitenB_OutCandidateSlotIDs' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Multiply_IntInt_ReturnValue) == 0x000058, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_GetActionPatternType_ActionPatternType) == 0x00005C, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_GetActionPatternType_ActionPatternType' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005D, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_RandomProbabilityTableArray_ReturnValue) == 0x000060, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_RandomProbabilityTableArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_GetDebugActionPatternSlotIDs_ReturnValue) == 0x000070, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_GetDebugActionPatternSlotIDs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_CreateSlotsKaitenC_OutCandidateSlotIDs) == 0x000080, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_CreateSlotsKaitenC_OutCandidateSlotIDs' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Array_Length_ReturnValue2) == 0x000090, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, Temp_int_Variable) == 0x000094, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Add_IntInt_ReturnValue2) == 0x00009C, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Percent_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BCAI_Monster_C_CalcCandidateSlotIDs, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_BCAI_Monster_C_CalcCandidateSlotIDs::CallFunc_Array_Get_Item' has a wrong offset!");
