#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CsPlayerWeaponCase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JackGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CsPlayerWeaponCase.BP_CsPlayerWeaponCase_C
// 0x0030 (0x03C8 - 0x0398)
class ABP_CsPlayerWeaponCase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   WeaponCaseMeshDummy;                               // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          VisibleForCoordinate;                              // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WeaponID;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          EquipeRegion;                                      // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CsPlayerWeaponCase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetEquipedWeaponItemID(class FName* Item_ID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CsPlayerWeaponCase_C">();
	}
	static class ABP_CsPlayerWeaponCase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CsPlayerWeaponCase_C>();
	}
};
static_assert(alignof(ABP_CsPlayerWeaponCase_C) == 0x000008, "Wrong alignment on ABP_CsPlayerWeaponCase_C");
static_assert(sizeof(ABP_CsPlayerWeaponCase_C) == 0x0003C8, "Wrong size on ABP_CsPlayerWeaponCase_C");
static_assert(offsetof(ABP_CsPlayerWeaponCase_C, UberGraphFrame) == 0x000398, "Member 'ABP_CsPlayerWeaponCase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CsPlayerWeaponCase_C, WeaponCaseMeshDummy) == 0x0003A0, "Member 'ABP_CsPlayerWeaponCase_C::WeaponCaseMeshDummy' has a wrong offset!");
static_assert(offsetof(ABP_CsPlayerWeaponCase_C, DefaultSceneRoot) == 0x0003A8, "Member 'ABP_CsPlayerWeaponCase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CsPlayerWeaponCase_C, VisibleForCoordinate) == 0x0003B0, "Member 'ABP_CsPlayerWeaponCase_C::VisibleForCoordinate' has a wrong offset!");
static_assert(offsetof(ABP_CsPlayerWeaponCase_C, WeaponID) == 0x0003B8, "Member 'ABP_CsPlayerWeaponCase_C::WeaponID' has a wrong offset!");
static_assert(offsetof(ABP_CsPlayerWeaponCase_C, EquipeRegion) == 0x0003C0, "Member 'ABP_CsPlayerWeaponCase_C::EquipeRegion' has a wrong offset!");

}

