#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CutSceneMenu_Debug

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_CutSceneMenu_Debug.BP_CutSceneMenu_Debug_C.ExecuteUbergraph_BP_CutSceneMenu_Debug
// 0x0940 (0x0940 - 0x0000)
struct BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x00B0(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue4;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackLDT_MapStart                      K2Node_MakeStruct_JackLDT_MapStart;                // 0x0108(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames2;        // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableCutSceneInfo             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0158(0x0190)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue3;           // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue4;           // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0310(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item2;                          // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item3;                          // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0368(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedCS_ID_CS_ID;                   // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableCutSceneInfo             CallFunc_GetDataTableRowFromName_OutRow2;          // 0x03E0(0x0190)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue2;     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0578(0x0018)(HasGetValueTypeHash)
	struct FJackLDT_MapStart                      K2Node_MakeStruct_JackLDT_MapStart2;               // 0x0590(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackTextManager*                       CallFunc_GetTextManager_ReturnValue;               // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackTextManager*                       CallFunc_GetTextManager_ReturnValue2;              // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromTextPackBP_ReturnValue;        // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromTextPackBP_ReturnValue2;       // 0x05F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0610(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue2;            // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableCutSceneInfo             CallFunc_GetDataTableRowFromName_OutRow3;          // 0x0640(0x0190)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue3;     // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x3];                                      // 0x07D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DC[0x4];                                      // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue5;           // 0x07E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F1[0x7];                                      // 0x07F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue2;         // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue3;         // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue4;         // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue5;         // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue6;         // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue7;         // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue8;         // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue9;         // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCutSceneController*                CallFunc_GetCutSceneController_ReturnValue;        // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCutSceneController*                CallFunc_GetCutSceneController_ReturnValue2;       // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeAnimationRunning_ReturnValue;       // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0850(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AMatineeActor*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0860(0x0010)(ZeroConstructor, ReferenceParm)
	class AMatineeActor*                          CallFunc_Array_Get_Item5;                          // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x087C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D[0x3];                                      // 0x087D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0880(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_884[0x4];                                      // 0x0884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0888(0x0010)(ZeroConstructor, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x0898(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x08B0(0x0018)(HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x08C8(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetRandomAccentName_RandomAccentName;     // 0x08D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x08E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array2;                           // 0x08F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetRandomAccentName_RandomAccentName2;    // 0x0908(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0918(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key5;                         // 0x0928(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug) == 0x000008, "Wrong alignment on BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug");
static_assert(sizeof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug) == 0x000940, "Wrong size on BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, EntryPoint) == 0x000000, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate4) == 0x000038, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate5) == 0x000050, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate6) == 0x000060, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_int_Array_Index_Variable2) == 0x000078, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_int_Loop_Counter_Variable2) == 0x00007C, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_IntInt_ReturnValue2) == 0x000080, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000088, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_IntInt_ReturnValue3) == 0x0000A4, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0000A8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x0000B0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x0000B4, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_IntInt_ReturnValue4) == 0x0000B8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate7) == 0x0000C8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Subtract_IntInt_ReturnValue2) == 0x0000DC, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Length_ReturnValue2) == 0x0000E0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_IntInt_ReturnValue5) == 0x0000E4, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x0000E8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Subtract_IntInt_ReturnValue3) == 0x0000EC, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Subtract_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Less_IntInt_ReturnValue2) == 0x0000F0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Subtract_IntInt_ReturnValue4) == 0x0000F4, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Subtract_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_MakeStruct_JackLDT_MapStart) == 0x000108, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_MakeStruct_JackLDT_MapStart' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_NotEqual_NameName_ReturnValue) == 0x000118, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_NameToString_ReturnValue2) == 0x000120, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_bool_Variable) == 0x000130, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000134, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowNames_OutRowNames2) == 0x000138, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowNames_OutRowNames2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Get_Item) == 0x000148, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Length_ReturnValue3) == 0x000150, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowFromName_OutRow) == 0x000158, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002E8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Less_IntInt_ReturnValue3) == 0x0002E9, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_NameToString_ReturnValue3) == 0x0002F0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_NameToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_NameToString_ReturnValue4) == 0x000300, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_NameToString_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_ParseIntoArray_ReturnValue) == 0x000310, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000320, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Get_Item2) == 0x000328, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Get_Item3) == 0x000338, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000348, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Right_ReturnValue) == 0x000350, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Len_ReturnValue) == 0x000360, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_InputKeyEvent_Key) == 0x000368, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000380, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_Select_Default) == 0x000388, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue) == 0x000398, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue2) == 0x0003A8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue3) == 0x0003B8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetSelectedCS_ID_CS_ID) == 0x0003C8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetSelectedCS_ID_CS_ID' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_StringToName_ReturnValue) == 0x0003D8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowFromName_OutRow2) == 0x0003E0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowFromName_OutRow2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowFromName_ReturnValue2) == 0x000570, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_InputKeyEvent_Key2) == 0x000578, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_MakeStruct_JackLDT_MapStart2) == 0x000590, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_MakeStruct_JackLDT_MapStart2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_NotEqual_NameName_ReturnValue2) == 0x0005A0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x0005A8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_int_Loop_Counter_Variable3) == 0x0005B0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuItem_ReturnValue) == 0x0005B8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Less_IntInt_ReturnValue4) == 0x0005C0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Add_IntInt_ReturnValue6) == 0x0005C4, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetJackPlayerController_ReturnValue) == 0x0005C8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetTextManager_ReturnValue) == 0x0005D0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetTextManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetTextManager_ReturnValue2) == 0x0005D8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetTextManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetTextFromTextPackBP_ReturnValue) == 0x0005E0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetTextFromTextPackBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetTextFromTextPackBP_ReturnValue2) == 0x0005F0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetTextFromTextPackBP_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue4) == 0x000600, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue5) == 0x000610, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, Temp_int_Array_Index_Variable3) == 0x000620, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuItem_ReturnValue2) == 0x000628, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Get_Item4) == 0x000630, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000638, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowFromName_OutRow3) == 0x000640, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowFromName_OutRow3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetDataTableRowFromName_ReturnValue3) == 0x0007D0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetDataTableRowFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_AddUnique_ReturnValue) == 0x0007D4, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Find_ReturnValue) == 0x0007D8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Conv_NameToString_ReturnValue5) == 0x0007E0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Conv_NameToString_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x0007F0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue2) == 0x0007F8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue3) == 0x000800, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue4) == 0x000808, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue5) == 0x000810, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue6) == 0x000818, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue7) == 0x000820, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue8) == 0x000828, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_AddDebugMenuCommand_ReturnValue9) == 0x000830, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_AddDebugMenuCommand_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetCutSceneController_ReturnValue) == 0x000838, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetCutSceneController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetCutSceneController_ReturnValue2) == 0x000840, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetCutSceneController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_IsFadeAnimationRunning_ReturnValue) == 0x000848, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_IsFadeAnimationRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate8) == 0x000850, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetAllActorsOfClass_OutActors) == 0x000860, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Get_Item5) == 0x000870, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Array_Length_ReturnValue4) == 0x000878, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Less_IntInt_ReturnValue5) == 0x00087C, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_MakeStruct_Color) == 0x000880, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_CreateDelegate_OutputDelegate9) == 0x000888, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_InputKeyEvent_Key3) == 0x000898, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_InputKeyEvent_Key4) == 0x0008B0, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_MakeArray_Array) == 0x0008C8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetRandomAccentName_RandomAccentName) == 0x0008D8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetRandomAccentName_RandomAccentName' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue6) == 0x0008E8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_MakeArray_Array2) == 0x0008F8, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_GetRandomAccentName_RandomAccentName2) == 0x000908, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_GetRandomAccentName_RandomAccentName2' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, CallFunc_Concat_StrStr_ReturnValue7) == 0x000918, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug, K2Node_InputKeyEvent_Key5) == 0x000928, "Member 'BP_CutSceneMenu_Debug_C_ExecuteUbergraph_BP_CutSceneMenu_Debug::K2Node_InputKeyEvent_Key5' has a wrong offset!");

// Function BP_CutSceneMenu_Debug.BP_CutSceneMenu_Debug_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CutSceneMenu_Debug_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutSceneMenu_Debug_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CutSceneMenu_Debug_C_ReceiveTick");
static_assert(sizeof(BP_CutSceneMenu_Debug_C_ReceiveTick) == 0x000004, "Wrong size on BP_CutSceneMenu_Debug_C_ReceiveTick");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CutSceneMenu_Debug_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CutSceneMenu_Debug.BP_CutSceneMenu_Debug_C.InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5");
static_assert(sizeof(BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function BP_CutSceneMenu_Debug.BP_CutSceneMenu_Debug_C.InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6");
static_assert(sizeof(BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6");
static_assert(offsetof(BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function BP_CutSceneMenu_Debug.BP_CutSceneMenu_Debug_C.InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct BP_CutSceneMenu_Debug_C_InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
