#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CutsceneChecker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CutsceneChecker.BP_CutsceneChecker_C
// 0x0030 (0x03C8 - 0x0398)
class ABP_CutsceneChecker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         MatineeActorNum;                                   // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WindDirectionalSourceNum;                          // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LightNum;                                          // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StaticStaticMesh;                                  // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CsControl;                                         // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TempArray;                                         // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_CutsceneChecker(int32 EntryPoint);
	void CsLevelCheck();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void CheckMatineeActor(class AMatineeActor* MatineeActor);
	void CheckNpc(class AJackScheduledNPC* NPC);
	void LastCheck();
	void CheckLight(class ALight* Light);
	void CheckStaticMesh(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CutsceneChecker_C">();
	}
	static class ABP_CutsceneChecker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CutsceneChecker_C>();
	}
};
static_assert(alignof(ABP_CutsceneChecker_C) == 0x000008, "Wrong alignment on ABP_CutsceneChecker_C");
static_assert(sizeof(ABP_CutsceneChecker_C) == 0x0003C8, "Wrong size on ABP_CutsceneChecker_C");
static_assert(offsetof(ABP_CutsceneChecker_C, UberGraphFrame) == 0x000398, "Member 'ABP_CutsceneChecker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_CutsceneChecker_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, MatineeActorNum) == 0x0003A8, "Member 'ABP_CutsceneChecker_C::MatineeActorNum' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, WindDirectionalSourceNum) == 0x0003AC, "Member 'ABP_CutsceneChecker_C::WindDirectionalSourceNum' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, LightNum) == 0x0003B0, "Member 'ABP_CutsceneChecker_C::LightNum' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, StaticStaticMesh) == 0x0003B4, "Member 'ABP_CutsceneChecker_C::StaticStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, CsControl) == 0x0003B5, "Member 'ABP_CutsceneChecker_C::CsControl' has a wrong offset!");
static_assert(offsetof(ABP_CutsceneChecker_C, TempArray) == 0x0003B8, "Member 'ABP_CutsceneChecker_C::TempArray' has a wrong offset!");

}

