#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_COMP_Inn

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_COMP_Inn.BP_COMP_Inn_C.ExecuteUbergraph_BP_COMP_Inn_0
// 0x0004 (0x0004 - 0x0000)
struct BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0) == 0x000004, "Wrong alignment on BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0");
static_assert(sizeof(BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0) == 0x000004, "Wrong size on BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0");
static_assert(offsetof(BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_0::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_COMP_Inn.BP_COMP_Inn_C.ExecuteUbergraph_BP_COMP_Inn_2
// 0x0004 (0x0004 - 0x0000)
struct BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2) == 0x000004, "Wrong alignment on BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2");
static_assert(sizeof(BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2) == 0x000004, "Wrong size on BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2");
static_assert(offsetof(BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_COMP_Inn_C_ExecuteUbergraph_BP_COMP_Inn_2::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_COMP_Inn.BP_COMP_Inn_C.ExecuteYadoyaMessageFlow
// 0x0008 (0x0008 - 0x0000)
struct BP_COMP_Inn_C_ExecuteYadoyaMessageFlow final
{
public:
	class FName                                   bpp__InShopID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_COMP_Inn_C_ExecuteYadoyaMessageFlow) == 0x000004, "Wrong alignment on BP_COMP_Inn_C_ExecuteYadoyaMessageFlow");
static_assert(sizeof(BP_COMP_Inn_C_ExecuteYadoyaMessageFlow) == 0x000008, "Wrong size on BP_COMP_Inn_C_ExecuteYadoyaMessageFlow");
static_assert(offsetof(BP_COMP_Inn_C_ExecuteYadoyaMessageFlow, bpp__InShopID__pf) == 0x000000, "Member 'BP_COMP_Inn_C_ExecuteYadoyaMessageFlow::bpp__InShopID__pf' has a wrong offset!");

// Function BP_COMP_Inn.BP_COMP_Inn_C.ShopTalkSequence
// 0x0010 (0x0010 - 0x0000)
struct BP_COMP_Inn_C_ShopTalkSequence final
{
public:
	class AJackScheduledNPC*                      bpp__NPC__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__LookAtEnable__pf;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_COMP_Inn_C_ShopTalkSequence) == 0x000008, "Wrong alignment on BP_COMP_Inn_C_ShopTalkSequence");
static_assert(sizeof(BP_COMP_Inn_C_ShopTalkSequence) == 0x000010, "Wrong size on BP_COMP_Inn_C_ShopTalkSequence");
static_assert(offsetof(BP_COMP_Inn_C_ShopTalkSequence, bpp__NPC__pf) == 0x000000, "Member 'BP_COMP_Inn_C_ShopTalkSequence::bpp__NPC__pf' has a wrong offset!");
static_assert(offsetof(BP_COMP_Inn_C_ShopTalkSequence, bpp__LookAtEnable__pf) == 0x000008, "Member 'BP_COMP_Inn_C_ShopTalkSequence::bpp__LookAtEnable__pf' has a wrong offset!");

// Function BP_COMP_Inn.BP_COMP_Inn_C.UniqueMenuOpen
// 0x0008 (0x0008 - 0x0000)
struct BP_COMP_Inn_C_UniqueMenuOpen final
{
public:
	class UJackUMGWidgetBase*                     bpp__Result__pf;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_COMP_Inn_C_UniqueMenuOpen) == 0x000008, "Wrong alignment on BP_COMP_Inn_C_UniqueMenuOpen");
static_assert(sizeof(BP_COMP_Inn_C_UniqueMenuOpen) == 0x000008, "Wrong size on BP_COMP_Inn_C_UniqueMenuOpen");
static_assert(offsetof(BP_COMP_Inn_C_UniqueMenuOpen, bpp__Result__pf) == 0x000000, "Member 'BP_COMP_Inn_C_UniqueMenuOpen::bpp__Result__pf' has a wrong offset!");

}

