#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CSName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CSName.BP_CSName_C
// 0x0020 (0x03B8 - 0x0398)
class ABP_CSName_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CSName(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CSName_C">();
	}
	static class ABP_CSName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CSName_C>();
	}
};
static_assert(alignof(ABP_CSName_C) == 0x000008, "Wrong alignment on ABP_CSName_C");
static_assert(sizeof(ABP_CSName_C) == 0x0003B8, "Wrong size on ABP_CSName_C");
static_assert(offsetof(ABP_CSName_C, UberGraphFrame) == 0x000398, "Member 'ABP_CSName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CSName_C, PointLight) == 0x0003A0, "Member 'ABP_CSName_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_CSName_C, TextRender) == 0x0003A8, "Member 'ABP_CSName_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_CSName_C, Cube) == 0x0003B0, "Member 'ABP_CSName_C::Cube' has a wrong offset!");

}

