#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CSName

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CSName.BP_CSName_C.ExecuteUbergraph_BP_CSName
// 0x0048 (0x0048 - 0x0000)
struct BP_CSName_C_ExecuteUbergraph_BP_CSName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPIE_ReturnValue;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CSName_C_ExecuteUbergraph_BP_CSName) == 0x000008, "Wrong alignment on BP_CSName_C_ExecuteUbergraph_BP_CSName");
static_assert(sizeof(BP_CSName_C_ExecuteUbergraph_BP_CSName) == 0x000048, "Wrong size on BP_CSName_C_ExecuteUbergraph_BP_CSName");
static_assert(offsetof(BP_CSName_C_ExecuteUbergraph_BP_CSName, EntryPoint) == 0x000000, "Member 'BP_CSName_C_ExecuteUbergraph_BP_CSName::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CSName_C_ExecuteUbergraph_BP_CSName, CallFunc_IsPIE_ReturnValue) == 0x000004, "Member 'BP_CSName_C_ExecuteUbergraph_BP_CSName::CallFunc_IsPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CSName_C_ExecuteUbergraph_BP_CSName, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_CSName_C_ExecuteUbergraph_BP_CSName::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CSName_C_ExecuteUbergraph_BP_CSName, CallFunc_GetGameFlagString_ReturnValue) == 0x000010, "Member 'BP_CSName_C_ExecuteUbergraph_BP_CSName::CallFunc_GetGameFlagString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CSName_C_ExecuteUbergraph_BP_CSName, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_CSName_C_ExecuteUbergraph_BP_CSName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CSName_C_ExecuteUbergraph_BP_CSName, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_CSName_C_ExecuteUbergraph_BP_CSName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_CSName.BP_CSName_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CSName_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CSName_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CSName_C_ReceiveTick");
static_assert(sizeof(BP_CSName_C_ReceiveTick) == 0x000004, "Wrong size on BP_CSName_C_ReceiveTick");
static_assert(offsetof(BP_CSName_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CSName_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

