#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_COMP_Church

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "BP_COMP_FacilityBase_classes.hpp"


namespace SDK
{

// DynamicClass BP_COMP_Church.BP_COMP_Church_C
// 0x0110 (0x0278 - 0x0168)
class UBP_COMP_Church_C final : public UBP_COMP_FacilityBase_C
{
public:
	struct FJackLDT_ChurchTable                   NameId;                                            // 0x0168(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0178(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable;                                // 0x0188(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable2;                               // 0x0190(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable3;                               // 0x0198(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable4;                               // 0x01A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable5;                               // 0x01A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable6;                               // 0x01B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable7;                               // 0x01B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Temp_name_Variable8;                               // 0x01C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x01C8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x01D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x01E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackSibari                                   Temp_byte_Variable;                                // 0x01F0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x01F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Select_Default;                             // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0208(0x0048)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0270(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteUbergraph_BP_COMP_Church_0(int32 bpp__EntryPoint__pf);
	void ShopTalkEnd();
	void UniqueMenuOpen(class UJackUMGWidgetBase** bpp__Result__pf);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BP_COMP_Church_C">();
	}
	static class UBP_COMP_Church_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_COMP_Church_C>();
	}
};
static_assert(alignof(UBP_COMP_Church_C) == 0x000008, "Wrong alignment on UBP_COMP_Church_C");
static_assert(sizeof(UBP_COMP_Church_C) == 0x000278, "Wrong size on UBP_COMP_Church_C");
static_assert(offsetof(UBP_COMP_Church_C, NameId) == 0x000168, "Member 'UBP_COMP_Church_C::NameId' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_struct_Variable) == 0x000178, "Member 'UBP_COMP_Church_C::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable) == 0x000188, "Member 'UBP_COMP_Church_C::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable2) == 0x000190, "Member 'UBP_COMP_Church_C::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable3) == 0x000198, "Member 'UBP_COMP_Church_C::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable4) == 0x0001A0, "Member 'UBP_COMP_Church_C::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable5) == 0x0001A8, "Member 'UBP_COMP_Church_C::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable6) == 0x0001B0, "Member 'UBP_COMP_Church_C::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable7) == 0x0001B8, "Member 'UBP_COMP_Church_C::Temp_name_Variable7' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_name_Variable8) == 0x0001C0, "Member 'UBP_COMP_Church_C::Temp_name_Variable8' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_struct_Variable2) == 0x0001C8, "Member 'UBP_COMP_Church_C::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x0001D8, "Member 'UBP_COMP_Church_C::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, CallFunc_WaitMessageEndFromBP_Result) == 0x0001E0, "Member 'UBP_COMP_Church_C::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x0001E8, "Member 'UBP_COMP_Church_C::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, Temp_byte_Variable) == 0x0001F0, "Member 'UBP_COMP_Church_C::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, CallFunc_WaitMessageEndFromBP_Result2) == 0x0001F8, "Member 'UBP_COMP_Church_C::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, K2Node_Select_Default) == 0x000200, "Member 'UBP_COMP_Church_C::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, K2Node_MakeStruct_JackMessageArgumentData) == 0x000208, "Member 'UBP_COMP_Church_C::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, K2Node_MakeArray_Array) == 0x000250, "Member 'UBP_COMP_Church_C::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x000260, "Member 'UBP_COMP_Church_C::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, CallFunc_WaitMessageEndFromBP_Result3) == 0x000268, "Member 'UBP_COMP_Church_C::CallFunc_WaitMessageEndFromBP_Result3' has a wrong offset!");
static_assert(offsetof(UBP_COMP_Church_C, K2Node_SwitchEnum_CmpSuccess) == 0x000270, "Member 'UBP_COMP_Church_C::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

