#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CutsceneChecker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CutsceneChecker.BP_CutsceneChecker_C.ExecuteUbergraph_BP_CutsceneChecker
// 0x0180 (0x0180 - 0x0000)
struct BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetLevelNames_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetLevelActorsByName_ReturnValue;         // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CsControl_C*                        K2Node_DynamicCast_AsBP_Cs_Control;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  K2Node_DynamicCast_AsExponential_Height_Fog;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAtmosphericFog*                        K2Node_DynamicCast_AsAtmospheric_Fog;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 K2Node_DynamicCast_AsLight;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWindDirectionalSource*                 K2Node_DynamicCast_AsWind_Directional_Source;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CSName_C*                           K2Node_DynamicCast_AsBP_CSName;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackScheduledNPC*                      K2Node_DynamicCast_AsJack_Scheduled_NPC;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatineeActor*                          K2Node_DynamicCast_AsMatinee_Actor;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker) == 0x000008, "Wrong alignment on BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker");
static_assert(sizeof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker) == 0x000180, "Wrong size on BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, EntryPoint) == 0x000000, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_GetLevelNames_ReturnValue) == 0x000008, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_GetLevelNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, Temp_int_Array_Index_Variable2) == 0x000024, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_FindSubstring_ReturnValue) == 0x00003C, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x000048, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, Temp_int_Loop_Counter_Variable2) == 0x000050, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000058, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000060, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Add_IntInt_ReturnValue2) == 0x00006C, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x000080, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Split_LeftS) == 0x000090, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Split_RightS) == 0x0000A0, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Split_ReturnValue) == 0x0000B0, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_GetLevelActorsByName_ReturnValue) == 0x0000C0, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_GetLevelActorsByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Add_IntInt_ReturnValue3) == 0x0000D0, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Array_Get_Item2) == 0x0000D8, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsBP_Cs_Control) == 0x0000E0, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsBP_Cs_Control' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsExponential_Height_Fog) == 0x0000F0, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsExponential_Height_Fog' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsAtmospheric_Fog) == 0x000100, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsAtmospheric_Fog' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess3) == 0x000108, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsPost_Process_Volume) == 0x000110, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsPost_Process_Volume' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess4) == 0x000118, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsLight) == 0x000120, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsLight' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess5) == 0x000128, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsWind_Directional_Source) == 0x000130, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsWind_Directional_Source' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess6) == 0x000138, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsBP_CSName) == 0x000140, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsBP_CSName' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess7) == 0x000148, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsJack_Scheduled_NPC) == 0x000150, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsJack_Scheduled_NPC' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess8) == 0x000158, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_AsMatinee_Actor) == 0x000160, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_AsMatinee_Actor' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, K2Node_DynamicCast_bSuccess9) == 0x000168, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Array_Length_ReturnValue2) == 0x00016C, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Less_IntInt_ReturnValue2) == 0x000170, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Add_IntInt_ReturnValue4) == 0x000174, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker, CallFunc_Add_IntInt_ReturnValue5) == 0x000178, "Member 'BP_CutsceneChecker_C_ExecuteUbergraph_BP_CutsceneChecker::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");

// Function BP_CutsceneChecker.BP_CutsceneChecker_C.CheckMatineeActor
// 0x0008 (0x0008 - 0x0000)
struct BP_CutsceneChecker_C_CheckMatineeActor final
{
public:
	class AMatineeActor*                          MatineeActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneChecker_C_CheckMatineeActor) == 0x000008, "Wrong alignment on BP_CutsceneChecker_C_CheckMatineeActor");
static_assert(sizeof(BP_CutsceneChecker_C_CheckMatineeActor) == 0x000008, "Wrong size on BP_CutsceneChecker_C_CheckMatineeActor");
static_assert(offsetof(BP_CutsceneChecker_C_CheckMatineeActor, MatineeActor) == 0x000000, "Member 'BP_CutsceneChecker_C_CheckMatineeActor::MatineeActor' has a wrong offset!");

// Function BP_CutsceneChecker.BP_CutsceneChecker_C.CheckNpc
// 0x0088 (0x0088 - 0x0000)
struct BP_CutsceneChecker_C_CheckNpc final
{
public:
	class AJackScheduledNPC*                      NPC;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterCoordinate_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue2;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue3;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneChecker_C_CheckNpc) == 0x000008, "Wrong alignment on BP_CutsceneChecker_C_CheckNpc");
static_assert(sizeof(BP_CutsceneChecker_C_CheckNpc) == 0x000088, "Wrong size on BP_CutsceneChecker_C_CheckNpc");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, NPC) == 0x000000, "Member 'BP_CutsceneChecker_C_CheckNpc::NPC' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_GetCharacterCoordinate_ReturnValue) == 0x000008, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_GetCharacterCoordinate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000028, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_FindSubstring_ReturnValue) == 0x00002C, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_FindSubstring_ReturnValue2) == 0x000030, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_FindSubstring_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000034, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000035, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_GetClassDisplayName_ReturnValue) == 0x000038, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_FindSubstring_ReturnValue3) == 0x00004C, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_FindSubstring_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_BooleanAND_ReturnValue2) == 0x000052, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckNpc, CallFunc_Concat_StrStr_ReturnValue2) == 0x000078, "Member 'BP_CutsceneChecker_C_CheckNpc::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");

// Function BP_CutsceneChecker.BP_CutsceneChecker_C.LastCheck
// 0x00B0 (0x00B0 - 0x0000)
struct BP_CutsceneChecker_C_LastCheck final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0014(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0078(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneChecker_C_LastCheck) == 0x000008, "Wrong alignment on BP_CutsceneChecker_C_LastCheck");
static_assert(sizeof(BP_CutsceneChecker_C_LastCheck) == 0x0000B0, "Wrong size on BP_CutsceneChecker_C_LastCheck");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, Temp_bool_Variable) == 0x000000, "Member 'BP_CutsceneChecker_C_LastCheck::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, Temp_struct_Variable) == 0x000004, "Member 'BP_CutsceneChecker_C_LastCheck::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, Temp_struct_Variable2) == 0x000014, "Member 'BP_CutsceneChecker_C_LastCheck::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_Conv_IntToString_ReturnValue2) == 0x000058, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_Concat_StrStr_ReturnValue2) == 0x000068, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, K2Node_Select_Default) == 0x000078, "Member 'BP_CutsceneChecker_C_LastCheck::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000088, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x000089, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_Conv_IntToString_ReturnValue3) == 0x000090, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_Conv_IntToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_LastCheck, CallFunc_Concat_StrStr_ReturnValue3) == 0x0000A0, "Member 'BP_CutsceneChecker_C_LastCheck::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");

// Function BP_CutsceneChecker.BP_CutsceneChecker_C.CheckLight
// 0x0028 (0x0028 - 0x0000)
struct BP_CutsceneChecker_C_CheckLight final
{
public:
	class ALight*                                 Light;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneChecker_C_CheckLight) == 0x000008, "Wrong alignment on BP_CutsceneChecker_C_CheckLight");
static_assert(sizeof(BP_CutsceneChecker_C_CheckLight) == 0x000028, "Wrong size on BP_CutsceneChecker_C_CheckLight");
static_assert(offsetof(BP_CutsceneChecker_C_CheckLight, Light) == 0x000000, "Member 'BP_CutsceneChecker_C_CheckLight::Light' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckLight, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'BP_CutsceneChecker_C_CheckLight::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckLight, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_CutsceneChecker_C_CheckLight::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_CutsceneChecker.BP_CutsceneChecker_C.CheckStaticMesh
// 0x0070 (0x0070 - 0x0000)
struct BP_CutsceneChecker_C_CheckStaticMesh final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue2;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CutsceneChecker_C_CheckStaticMesh) == 0x000008, "Wrong alignment on BP_CutsceneChecker_C_CheckStaticMesh");
static_assert(sizeof(BP_CutsceneChecker_C_CheckStaticMesh) == 0x000070, "Wrong size on BP_CutsceneChecker_C_CheckStaticMesh");
static_assert(offsetof(BP_CutsceneChecker_C_CheckStaticMesh, Actor) == 0x000000, "Member 'BP_CutsceneChecker_C_CheckStaticMesh::Actor' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckStaticMesh, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_CutsceneChecker_C_CheckStaticMesh::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CutsceneChecker_C_CheckStaticMesh, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000010, "Member 'BP_CutsceneChecker_C_CheckStaticMesh::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
