#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_COMP_Yotti_Aikotoba

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_COMP_Yotti_Aikotoba.BP_COMP_Yotti_Aikotoba_C.ExecuteUbergraph_BP_COMP_Yotti_Aikotoba
// 0x0220 (0x0220 - 0x0000)
struct BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable;                              // 0x0004(0x0005)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable3;                             // 0x0048(0x0005)(NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable5;                             // 0x0060(0x0005)(NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_TalkBase_C*                     K2Node_DynamicCast_AsBP_NPC_Talk_Base;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidYottiAikotobaFlag_Valid;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_IsValidYottiAikotobaFlag_Flag;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYottiAikotobaAllClear_AllClear;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFadeTime_ReturnValue;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable7;                             // 0x00A8(0x0005)(NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFadeTime_ReturnValue2;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetPlayTalkEndAnimation_PlayAnim;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckQuestFlag_Ret;                       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAikotobaYottiFirstTextID_TextID;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAikotobaYottiFirstTextID_LookAt;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable8;                             // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_PlayTalkStartAnimationDefaultImpl_OutMessageID; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable9;                             // 0x00F8(0x0005)(NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0148(0x0048)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x01C8(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba) == 0x000008, "Wrong alignment on BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba");
static_assert(sizeof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba) == 0x000220, "Wrong size on BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, EntryPoint) == 0x000000, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable) == 0x000004, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_bool_Variable) == 0x000009, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_name_Variable) == 0x000010, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_name_Variable2) == 0x000018, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_bool_Variable2) == 0x000020, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_name_Variable3) == 0x000028, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_name_Variable4) == 0x000030, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable2) == 0x000038, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable3) == 0x000048, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable4) == 0x000050, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable5) == 0x000060, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_NotEqual_NameName_ReturnValue) == 0x000065, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable6) == 0x000068, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_DynamicCast_AsBP_NPC_Talk_Base) == 0x000080, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_DynamicCast_AsBP_NPC_Talk_Base' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_IsValidYottiAikotobaFlag_Valid) == 0x000089, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_IsValidYottiAikotobaFlag_Valid' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_IsValidYottiAikotobaFlag_Flag) == 0x000090, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_IsValidYottiAikotobaFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_IsYottiAikotobaAllClear_AllClear) == 0x000098, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_IsYottiAikotobaAllClear_AllClear' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetFadeTime_ReturnValue) == 0x00009C, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetFadeTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_Select_Default) == 0x0000A0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable7) == 0x0000A8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetFadeTime_ReturnValue2) == 0x0000B0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetFadeTime_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetPlayTalkEndAnimation_PlayAnim) == 0x0000B8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetPlayTalkEndAnimation_PlayAnim' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000C0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_CheckQuestFlag_Ret) == 0x0000C1, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_CheckQuestFlag_Ret' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_Select2_Default) == 0x0000C8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetAikotobaYottiFirstTextID_TextID) == 0x0000D0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetAikotobaYottiFirstTextID_TextID' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetAikotobaYottiFirstTextID_LookAt) == 0x0000D8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetAikotobaYottiFirstTextID_LookAt' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable8) == 0x0000E0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_PlayTalkStartAnimationDefaultImpl_OutMessageID) == 0x0000F0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_PlayTalkStartAnimationDefaultImpl_OutMessageID' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, Temp_struct_Variable9) == 0x0000F8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Conv_NameToString_ReturnValue) == 0x000100, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Conv_StringToName_ReturnValue) == 0x000120, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Concat_StrStr_ReturnValue2) == 0x000128, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetText_ReturnValue) == 0x000138, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_MakeStruct_JackMessageArgumentData) == 0x000148, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Concat_StrStr_ReturnValue3) == 0x000190, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Concat_StrStr_ReturnValue4) == 0x0001A0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_Conv_StringToName_ReturnValue2) == 0x0001B0, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, CallFunc_GetText_ReturnValue2) == 0x0001B8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0001C8, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba, K2Node_MakeArray_Array) == 0x000210, "Member 'BP_COMP_Yotti_Aikotoba_C_ExecuteUbergraph_BP_COMP_Yotti_Aikotoba::K2Node_MakeArray_Array' has a wrong offset!");

}

