#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CsPlayerWeaponCase

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_CsPlayerWeaponCase.BP_CsPlayerWeaponCase_C.ExecuteUbergraph_BP_CsPlayerWeaponCase
// 0x0258 (0x0258 - 0x0000)
struct BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquippedWeaponStyle                      CallFunc_GetEquippedWeaponStyle_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEquipedWeaponItemID_Item_ID;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackWeaponBase*                        CallFunc_SpawnWeaponCase_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOmoideCsID_OmoideCsID;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOmoideCsID_OmoideCs;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableCutSceneInfo             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0190)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue2;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterCoordinate_ReturnValue;       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableWeaponHiddenCoordinate   CallFunc_GetDataTableRowFromName_OutRow2;          // 0x0218(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue2;     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase) == 0x000008, "Wrong alignment on BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase");
static_assert(sizeof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase) == 0x000258, "Wrong size on BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, EntryPoint) == 0x000000, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetEquippedWeaponStyle_ReturnValue) == 0x000010, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetEquippedWeaponStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetEquipedWeaponItemID_Item_ID) == 0x000018, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetEquipedWeaponItemID_Item_ID' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, Temp_name_Variable) == 0x000028, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_NotEqual_NameName_ReturnValue) == 0x000030, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_SpawnWeaponCase_ReturnValue) == 0x000038, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_SpawnWeaponCase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetOmoideCsID_OmoideCsID) == 0x000040, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetOmoideCsID_OmoideCsID' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetOmoideCsID_OmoideCs) == 0x000050, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetOmoideCsID_OmoideCs' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001F0, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001F1, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, Temp_name_Variable2) == 0x0001F8, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetJackPlayerCharacter_ReturnValue2) == 0x000200, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetJackPlayerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, Temp_bool_Variable) == 0x000208, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetCharacterCoordinate_ReturnValue) == 0x000210, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetCharacterCoordinate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetDataTableRowFromName_OutRow2) == 0x000218, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetDataTableRowFromName_OutRow2' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_GetDataTableRowFromName_ReturnValue2) == 0x000240, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_GetDataTableRowFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, K2Node_Select_Default) == 0x000248, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_Array_Find_ReturnValue) == 0x000250, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000254, "Member 'BP_CsPlayerWeaponCase_C_ExecuteUbergraph_BP_CsPlayerWeaponCase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CsPlayerWeaponCase.BP_CsPlayerWeaponCase_C.GetEquipedWeaponItemID
// 0x0060 (0x0060 - 0x0000)
struct BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID final
{
public:
	class FName                                   Item_ID;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackGameCharacterEquippedItem> TmpJackGameCharacterEquippedItem;                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackGameCharacterEquippedItem         CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(NoDestructor)
	TArray<struct FJackGameCharacterEquippedItem> CallFunc_GetEquippedItems_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID) == 0x000008, "Wrong alignment on BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID");
static_assert(sizeof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID) == 0x000060, "Wrong size on BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, Item_ID) == 0x000000, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::Item_ID' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, TmpJackGameCharacterEquippedItem) == 0x000008, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::TmpJackGameCharacterEquippedItem' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_GetGameCharacter_ReturnValue) == 0x000028, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_GetEquippedItems_ReturnValue) == 0x000040, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_GetEquippedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_CsPlayerWeaponCase_C_GetEquipedWeaponItemID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

