#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuCoordinate

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugMenuCoordinate.BP_DebugMenuCoordinate_C.ExecuteUbergraph_BP_DebugMenuCoordinate
// 0x0160 (0x0160 - 0x0000)
struct BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item2;                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item3;                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item5;                          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_Coordinate                    K2Node_MakeStruct_JackLDT_Coordinate;              // 0x00E0(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue2;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate) == 0x000008, "Wrong alignment on BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate");
static_assert(sizeof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate) == 0x000160, "Wrong size on BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, EntryPoint) == 0x000000, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000018, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Length_ReturnValue2) == 0x00002C, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Get_Item2) == 0x000040, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Get_Item3) == 0x000060, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Concat_StrStr_ReturnValue2) == 0x000070, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x000080, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, Temp_int_Array_Index_Variable2) == 0x000090, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_ParseIntoArray_ReturnValue) == 0x000098, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Get_Item4) == 0x0000A8, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Array_Get_Item5) == 0x0000B0, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Conv_NameToString_ReturnValue) == 0x0000C0, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Conv_StringToName_ReturnValue) == 0x0000D0, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_FindSubstring_ReturnValue) == 0x0000D8, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, K2Node_MakeStruct_JackLDT_Coordinate) == 0x0000E0, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::K2Node_MakeStruct_JackLDT_Coordinate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Right_ReturnValue) == 0x0000F8, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Left_ReturnValue) == 0x000108, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Conv_StringToInt_ReturnValue) == 0x000118, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Subtract_IntInt_ReturnValue) == 0x00011C, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, Temp_int_Loop_Counter_Variable2) == 0x000120, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Conv_IntToByte_ReturnValue) == 0x000124, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_GetValidValue_ReturnValue) == 0x000125, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Less_IntInt_ReturnValue2) == 0x000126, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_Add_IntInt_ReturnValue2) == 0x000128, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x000130, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, K2Node_CreateDelegate_OutputDelegate) == 0x000138, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000148, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_AddDebugMenuItem_ReturnValue2) == 0x000150, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_AddDebugMenuItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000158, "Member 'BP_DebugMenuCoordinate_C_ExecuteUbergraph_BP_DebugMenuCoordinate::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");

}

