#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugAutoPlayer

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "STRUCT_DT_DebugAutoPlay_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugAutoPlayer.BP_DebugAutoPlayer_C.ExecuteUbergraph_BP_DebugAutoPlayer
// 0x06B8 (0x06B8 - 0x0000)
struct BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue3;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost2;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue2;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue4;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue5;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FJackCommandBattleInitialize& InCommand)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue6;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue7;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue8;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost3;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue3;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue9;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue10;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue11;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue12;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost4;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue4;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue13;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0120(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue14;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue15;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue7;         // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost5;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue5;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue16;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PlayersTriggerVolume_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue2;         // 0x01A8(0x0008)(NoDestructor)
	TArray<class ABP_DontGo_C*>                   CallFunc_GetAllActorsOfClass_OutActors2;           // 0x01B0(0x0010)(ZeroConstructor, ReferenceParm)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue17;     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue8;         // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue2;     // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost6;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue6;                 // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue6;         // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue18;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue19;     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue20;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue9;         // 0x0208(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPathCost_PathCost7;                    // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavigationQueryResult                        CallFunc_GetPathCost_ReturnValue7;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue7;         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue21;     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DontGo_C*>                   CallFunc_GetAllActorsOfClass_OutActors3;           // 0x0228(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayersTriggerVolume_C*             CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayersTriggerVolume_C*>     CallFunc_GetAllActorsOfClass_OutActors4;           // 0x0248(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABP_DontGo_C*>                   CallFunc_GetAllActorsOfClass_OutActors5;           // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DontGo_C*                           CallFunc_Array_Get_Item2;                          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayersTriggerVolume_C*>     CallFunc_GetAllActorsOfClass_OutActors6;           // 0x0280(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetNearMonster_Monster;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayersTriggerVolume_C*             CallFunc_Array_Get_Item3;                          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue10;        // 0x02A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DE[0x2];                                      // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetNearMonster_Monster2;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue11;        // 0x0310(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue2;              // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue2;       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue22;     // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayersTriggerVolume_C*             CallFunc_Array_Get_Item4;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue23;     // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DontGo_C*                           CallFunc_Array_Get_Item5;                          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue24;     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID7;                                // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID6;                                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID5;                                // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID4;                                // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID3;                                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackCommandBattleInitialize           K2Node_CustomEvent_InCommand;                      // 0x03E0(0x0040)(ConstParm, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopMEForEmergency_ReturnValue;           // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearNaviTeleport_Teleport;                // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearNaviTeleport_NoNavi;                  // 0x042A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42B[0x5];                                      // 0x042B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoorTeleport_Teleport;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MapJumpTeleport_Teleport;                 // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCommand_Command;                       // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCommand_Value1;                        // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCommand_Value2;                        // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCommand_Value3;                        // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue2;             // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue3;             // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue3;           // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue4;             // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue4;           // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_StringToFloat_ReturnValue2;          // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue5;           // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue12;              // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue13;              // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue5;             // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue14;              // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue6;           // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue3;          // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0584(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0590(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue15;              // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Command_MoveMapJump_Actor;                // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorPlayerMarker_ReturnValue;          // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D5[0x3];                                      // 0x05D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DontGo_C*                           CallFunc_Array_Get_Item6;                          // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CSID2;                                // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID;                                 // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0600(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsCanAction_CanActine;                    // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCanAction_CanActine2;                   // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612[0x2];                                      // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x0625(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_626[0x2];                                      // 0x0626(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0630(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0640(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS2;                             // 0x0668(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS2;                            // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue2;                       // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameFlagString_ReturnValue2;           // 0x0690(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue25;     // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue26;     // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer) == 0x000008, "Wrong alignment on BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer");
static_assert(sizeof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer) == 0x0006B8, "Wrong size on BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, EntryPoint) == 0x000000, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost) == 0x00001C, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue) == 0x000020, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue2) == 0x000048, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue3) == 0x000050, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000058, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost2) == 0x000064, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue2) == 0x000068, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000069, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue4) == 0x000070, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue5) == 0x000078, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, K2Node_CreateDelegate_OutputDelegate2) == 0x000080, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000090, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue6) == 0x0000A0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue7) == 0x0000A8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0000B0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue8) == 0x0000C0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost3) == 0x0000C8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost3' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue3) == 0x0000CC, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x0000CD, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue9) == 0x0000D0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue10) == 0x0000D8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue11) == 0x0000F0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue12) == 0x0000F8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000100, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost4) == 0x00010C, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost4' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue4) == 0x000110, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000111, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue13) == 0x000118, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x000120, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue14) == 0x000130, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000138, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_BooleanAND_ReturnValue) == 0x000139, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue15) == 0x000140, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue7) == 0x000148, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost5) == 0x000154, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost5' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue5) == 0x000158, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue16) == 0x000160, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x000168, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetAllActorsOfClass_OutActors) == 0x000170, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, Temp_int_Array_Index_Variable) == 0x000180, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_Array_Length_ReturnValue) == 0x000184, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, Temp_int_Loop_Counter_Variable) == 0x000188, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, K2Node_CreateDelegate_OutputDelegate4) == 0x000190, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_SetTimerDelegate_ReturnValue2) == 0x0001A8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_SetTimerDelegate_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetAllActorsOfClass_OutActors2) == 0x0001B0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue17) == 0x0001C0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_Array_Length_ReturnValue2) == 0x0001C8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue8) == 0x0001CC, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, Temp_int_Loop_Counter_Variable2) == 0x0001D8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_VectorVector_ReturnValue2) == 0x0001DC, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_Add_IntInt_ReturnValue2) == 0x0001E0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, Temp_int_Array_Index_Variable2) == 0x0001E4, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost6) == 0x0001E8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost6' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue6) == 0x0001EC, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue6) == 0x0001ED, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue18) == 0x0001F0, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue19) == 0x0001F8, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue19' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetJackPlayerCharacter_ReturnValue20) == 0x000200, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetJackPlayerCharacter_ReturnValue20' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_K2_GetActorLocation_ReturnValue9) == 0x000208, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_K2_GetActorLocation_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_PathCost7) == 0x000214, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_PathCost7' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_GetPathCost_ReturnValue7) == 0x000218, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_GetPathCost_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue7) == 0x000219, "Member 'BP_DebugAutoPlayer_C_ExecuteUbergraph_BP_DebugAutoPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue7' has a wrong offset!");
