#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DishSetUp

#include "Basic.hpp"

#include "ENUM_NpcAttachmentType_structs.hpp"
#include "ENUM_DishEnableType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DishSetUp.BP_DishSetUp_C
// 0x0028 (0x03C0 - 0x0398)
class ABP_DishSetUp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Dish;                                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ENUM_NpcAttachmentType                        ChangeType;                                        // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Complete;                                          // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DishEnableType                           ScenarioType;                                      // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_BC_Scenario;                                // 0x03BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TempHiddenForCS;                                   // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_DishSetUp(int32 EntryPoint);
	void StartCutsceneBeforeLoad(class FName CSID);
	void EndCutScene(class FName CSID);
	void ChangeScenarioFlag(const struct FJackLDT_GameFlagDataScenario& ScenarioFlag);
	void SetTimeZoneProc(bool Night);
	void DayNightChangeCameraEnd();
	void DayNightChangeCameraStart();
	void ChangeSystemFlag();
	void ChangeCutSceneFlag(const struct FJackLDT_GameFlagDataCutScene& CutSceneFlag);
	void ChangeQuestProgressFlag();
	void StartCutSceneCharacterSettingAfter(class FName CSID);
	void EndCutSceneFadInBefore(class FName CSID);
	void StartCutSceneFadeOutAfter(class FName CSID);
	void EndCutSceneBeforeUnload(class FName CSID);
	void StartCutScene(class FName CSID);
	void UserConstructionScript();
	void IsHidde_TimeZone(bool IsNight, bool* Hidden);
	void Show_Actor_AC_Scenario();
	void Show_Actor_M08_OneOff();
	void Show_Actor_S11_Gorgeous(bool Enable_B_CScenario, bool* Result);
	void Show_Actor_S11_despair();
	void Show_Actor_C_Scenario_Only(bool IsNight);
	void Show_Actor_S11_AScenrio_Only(bool IsNight);
	void Show_Actor_BScenrio_Only(bool Is_Night);
	void FindHiddenTagForCS(class FName CSID, bool* FindTag);
	void ShowActorS040(bool IsNight);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DishSetUp_C">();
	}
	static class ABP_DishSetUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DishSetUp_C>();
	}
};
static_assert(alignof(ABP_DishSetUp_C) == 0x000008, "Wrong alignment on ABP_DishSetUp_C");
static_assert(sizeof(ABP_DishSetUp_C) == 0x0003C0, "Wrong size on ABP_DishSetUp_C");
static_assert(offsetof(ABP_DishSetUp_C, UberGraphFrame) == 0x000398, "Member 'ABP_DishSetUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, Dish) == 0x0003A0, "Member 'ABP_DishSetUp_C::Dish' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, TextRender) == 0x0003A8, "Member 'ABP_DishSetUp_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, ParticleSystem) == 0x0003B0, "Member 'ABP_DishSetUp_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, ChangeType) == 0x0003B8, "Member 'ABP_DishSetUp_C::ChangeType' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, Complete) == 0x0003B9, "Member 'ABP_DishSetUp_C::Complete' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, ScenarioType) == 0x0003BA, "Member 'ABP_DishSetUp_C::ScenarioType' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, Hidden_BC_Scenario) == 0x0003BB, "Member 'ABP_DishSetUp_C::Hidden_BC_Scenario' has a wrong offset!");
static_assert(offsetof(ABP_DishSetUp_C, TempHiddenForCS) == 0x0003BC, "Member 'ABP_DishSetUp_C::TempHiddenForCS' has a wrong offset!");

}

