#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DishSetUp

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_DishSetUp.BP_DishSetUp_C.ExecuteUbergraph_BP_DishSetUp
// 0x0090 (0x0090 - 0x0000)
struct BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CSID;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID5;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindHiddenTagForCS_FindTag;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CSID4;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CSID3;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_GameFlagDataCutScene          K2Node_Event_CutSceneFlag;                         // 0x0030(0x0010)(NoDestructor)
	bool                                          K2Node_Event_Night;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CSID6;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden2;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden3;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Show_Actor_S11_Gorgeous_Result;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CSID7;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Show_Actor_S11_Gorgeous_Result2;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataScenario          K2Node_Event_ScenarioFlag;                         // 0x0068(0x0010)(NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CSID2;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindHiddenTagForCS_FindTag2;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp) == 0x000008, "Wrong alignment on BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp");
static_assert(sizeof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp) == 0x000090, "Wrong size on BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, EntryPoint) == 0x000000, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID) == 0x000008, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID5) == 0x000010, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID5' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_FindHiddenTagForCS_FindTag) == 0x000018, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_FindHiddenTagForCS_FindTag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID4) == 0x000020, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID4' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID3) == 0x000028, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID3' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CutSceneFlag) == 0x000030, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CutSceneFlag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_Night) == 0x000040, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_Night' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID6) == 0x000048, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID6' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_IsHidde_TimeZone_Hidden) == 0x000050, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_IsHidde_TimeZone_Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_IsHidde_TimeZone_Hidden2) == 0x000051, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_IsHidde_TimeZone_Hidden2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_IsHidde_TimeZone_Hidden3) == 0x000052, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_IsHidde_TimeZone_Hidden3' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_SwitchEnum_CmpSuccess) == 0x000053, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_Show_Actor_S11_Gorgeous_Result) == 0x000054, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_Show_Actor_S11_Gorgeous_Result' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID7) == 0x000058, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID7' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_Show_Actor_S11_Gorgeous_Result2) == 0x000061, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_Show_Actor_S11_Gorgeous_Result2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_ScenarioFlag) == 0x000068, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_ScenarioFlag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_GetGameFlagBool_ReturnValue) == 0x000078, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, K2Node_Event_CSID2) == 0x000080, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::K2Node_Event_CSID2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp, CallFunc_FindHiddenTagForCS_FindTag2) == 0x000088, "Member 'BP_DishSetUp_C_ExecuteUbergraph_BP_DishSetUp::CallFunc_FindHiddenTagForCS_FindTag2' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.StartCutsceneBeforeLoad
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_StartCutsceneBeforeLoad final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_StartCutsceneBeforeLoad) == 0x000008, "Wrong alignment on BP_DishSetUp_C_StartCutsceneBeforeLoad");
static_assert(sizeof(BP_DishSetUp_C_StartCutsceneBeforeLoad) == 0x000008, "Wrong size on BP_DishSetUp_C_StartCutsceneBeforeLoad");
static_assert(offsetof(BP_DishSetUp_C_StartCutsceneBeforeLoad, CSID) == 0x000000, "Member 'BP_DishSetUp_C_StartCutsceneBeforeLoad::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.EndCutScene
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_EndCutScene final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_EndCutScene) == 0x000008, "Wrong alignment on BP_DishSetUp_C_EndCutScene");
static_assert(sizeof(BP_DishSetUp_C_EndCutScene) == 0x000008, "Wrong size on BP_DishSetUp_C_EndCutScene");
static_assert(offsetof(BP_DishSetUp_C_EndCutScene, CSID) == 0x000000, "Member 'BP_DishSetUp_C_EndCutScene::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.ChangeScenarioFlag
// 0x0010 (0x0010 - 0x0000)
struct BP_DishSetUp_C_ChangeScenarioFlag final
{
public:
	struct FJackLDT_GameFlagDataScenario          ScenarioFlag;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_ChangeScenarioFlag) == 0x000008, "Wrong alignment on BP_DishSetUp_C_ChangeScenarioFlag");
static_assert(sizeof(BP_DishSetUp_C_ChangeScenarioFlag) == 0x000010, "Wrong size on BP_DishSetUp_C_ChangeScenarioFlag");
static_assert(offsetof(BP_DishSetUp_C_ChangeScenarioFlag, ScenarioFlag) == 0x000000, "Member 'BP_DishSetUp_C_ChangeScenarioFlag::ScenarioFlag' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.SetTimeZoneProc
// 0x0001 (0x0001 - 0x0000)
struct BP_DishSetUp_C_SetTimeZoneProc final
{
public:
	bool                                          Night;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_SetTimeZoneProc) == 0x000001, "Wrong alignment on BP_DishSetUp_C_SetTimeZoneProc");
static_assert(sizeof(BP_DishSetUp_C_SetTimeZoneProc) == 0x000001, "Wrong size on BP_DishSetUp_C_SetTimeZoneProc");
static_assert(offsetof(BP_DishSetUp_C_SetTimeZoneProc, Night) == 0x000000, "Member 'BP_DishSetUp_C_SetTimeZoneProc::Night' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.ChangeCutSceneFlag
// 0x0010 (0x0010 - 0x0000)
struct BP_DishSetUp_C_ChangeCutSceneFlag final
{
public:
	struct FJackLDT_GameFlagDataCutScene          CutSceneFlag;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_ChangeCutSceneFlag) == 0x000008, "Wrong alignment on BP_DishSetUp_C_ChangeCutSceneFlag");
static_assert(sizeof(BP_DishSetUp_C_ChangeCutSceneFlag) == 0x000010, "Wrong size on BP_DishSetUp_C_ChangeCutSceneFlag");
static_assert(offsetof(BP_DishSetUp_C_ChangeCutSceneFlag, CutSceneFlag) == 0x000000, "Member 'BP_DishSetUp_C_ChangeCutSceneFlag::CutSceneFlag' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.StartCutSceneCharacterSettingAfter
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_StartCutSceneCharacterSettingAfter final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_StartCutSceneCharacterSettingAfter) == 0x000008, "Wrong alignment on BP_DishSetUp_C_StartCutSceneCharacterSettingAfter");
static_assert(sizeof(BP_DishSetUp_C_StartCutSceneCharacterSettingAfter) == 0x000008, "Wrong size on BP_DishSetUp_C_StartCutSceneCharacterSettingAfter");
static_assert(offsetof(BP_DishSetUp_C_StartCutSceneCharacterSettingAfter, CSID) == 0x000000, "Member 'BP_DishSetUp_C_StartCutSceneCharacterSettingAfter::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.EndCutSceneFadInBefore
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_EndCutSceneFadInBefore final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_EndCutSceneFadInBefore) == 0x000008, "Wrong alignment on BP_DishSetUp_C_EndCutSceneFadInBefore");
static_assert(sizeof(BP_DishSetUp_C_EndCutSceneFadInBefore) == 0x000008, "Wrong size on BP_DishSetUp_C_EndCutSceneFadInBefore");
static_assert(offsetof(BP_DishSetUp_C_EndCutSceneFadInBefore, CSID) == 0x000000, "Member 'BP_DishSetUp_C_EndCutSceneFadInBefore::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.StartCutSceneFadeOutAfter
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_StartCutSceneFadeOutAfter final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_StartCutSceneFadeOutAfter) == 0x000008, "Wrong alignment on BP_DishSetUp_C_StartCutSceneFadeOutAfter");
static_assert(sizeof(BP_DishSetUp_C_StartCutSceneFadeOutAfter) == 0x000008, "Wrong size on BP_DishSetUp_C_StartCutSceneFadeOutAfter");
static_assert(offsetof(BP_DishSetUp_C_StartCutSceneFadeOutAfter, CSID) == 0x000000, "Member 'BP_DishSetUp_C_StartCutSceneFadeOutAfter::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.EndCutSceneBeforeUnload
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_EndCutSceneBeforeUnload final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_EndCutSceneBeforeUnload) == 0x000008, "Wrong alignment on BP_DishSetUp_C_EndCutSceneBeforeUnload");
static_assert(sizeof(BP_DishSetUp_C_EndCutSceneBeforeUnload) == 0x000008, "Wrong size on BP_DishSetUp_C_EndCutSceneBeforeUnload");
static_assert(offsetof(BP_DishSetUp_C_EndCutSceneBeforeUnload, CSID) == 0x000000, "Member 'BP_DishSetUp_C_EndCutSceneBeforeUnload::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.StartCutScene
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_DishSetUp_C_StartCutScene final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DishSetUp_C_StartCutScene) == 0x000008, "Wrong alignment on BP_DishSetUp_C_StartCutScene");
static_assert(sizeof(BP_DishSetUp_C_StartCutScene) == 0x000008, "Wrong size on BP_DishSetUp_C_StartCutScene");
static_assert(offsetof(BP_DishSetUp_C_StartCutScene, CSID) == 0x000000, "Member 'BP_DishSetUp_C_StartCutScene::CSID' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.IsHidde TimeZone
// 0x000B (0x000B - 0x0000)
struct BP_DishSetUp_C_IsHidde_TimeZone final
{
public:
	bool                                          IsNight;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Hidden;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_IsHidde_TimeZone) == 0x000001, "Wrong alignment on BP_DishSetUp_C_IsHidde_TimeZone");
static_assert(sizeof(BP_DishSetUp_C_IsHidde_TimeZone) == 0x00000B, "Wrong size on BP_DishSetUp_C_IsHidde_TimeZone");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, IsNight) == 0x000000, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::IsNight' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, Hidden) == 0x000001, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000004, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000005, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000006, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_BooleanOR_ReturnValue2) == 0x000008, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_IsHidde_TimeZone, CallFunc_BooleanAND_ReturnValue2) == 0x00000A, "Member 'BP_DishSetUp_C_IsHidde_TimeZone::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.Show Actor AC Scenario
// 0x0020 (0x0020 - 0x0000)
struct BP_DishSetUp_C_Show_Actor_AC_Scenario final
{
public:
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden2;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress; // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_Show_Actor_AC_Scenario) == 0x000008, "Wrong alignment on BP_DishSetUp_C_Show_Actor_AC_Scenario");
static_assert(sizeof(BP_DishSetUp_C_Show_Actor_AC_Scenario) == 0x000020, "Wrong size on BP_DishSetUp_C_Show_Actor_AC_Scenario");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, CallFunc_GetGameFlagBool_ReturnValue) == 0x000000, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, CallFunc_GetGameFlagBool_ReturnValue2) == 0x000001, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, CallFunc_IsHidde_TimeZone_Hidden) == 0x000002, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::CallFunc_IsHidde_TimeZone_Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, CallFunc_IsHidde_TimeZone_Hidden2) == 0x000003, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::CallFunc_IsHidde_TimeZone_Hidden2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress) == 0x000008, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, CallFunc_GetProgressFlag_Flag) == 0x000018, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::CallFunc_GetProgressFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_AC_Scenario, CallFunc_Is2ndScenario_2ndScenario) == 0x000019, "Member 'BP_DishSetUp_C_Show_Actor_AC_Scenario::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.Show Actor M08 OneOff
// 0x0030 (0x0030 - 0x0000)
struct BP_DishSetUp_C_Show_Actor_M08_OneOff final
{
public:
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress; // 0x0000(0x0010)(NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario;    // 0x0018(0x0010)(NoDestructor)
	bool                                          CallFunc_GetScenarioFlag_Flag;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_Show_Actor_M08_OneOff) == 0x000008, "Wrong alignment on BP_DishSetUp_C_Show_Actor_M08_OneOff");
static_assert(sizeof(BP_DishSetUp_C_Show_Actor_M08_OneOff) == 0x000030, "Wrong size on BP_DishSetUp_C_Show_Actor_M08_OneOff");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress) == 0x000000, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, CallFunc_GetGameFlagBool_ReturnValue) == 0x000010, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, CallFunc_GetProgressFlag_Flag) == 0x000011, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::CallFunc_GetProgressFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, CallFunc_IsHidde_TimeZone_Hidden) == 0x000012, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::CallFunc_IsHidde_TimeZone_Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, CallFunc_Is2ndScenario_2ndScenario) == 0x000013, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, K2Node_MakeStruct_JackLDT_GameFlagDataScenario) == 0x000018, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::K2Node_MakeStruct_JackLDT_GameFlagDataScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_M08_OneOff, CallFunc_GetScenarioFlag_Flag) == 0x000028, "Member 'BP_DishSetUp_C_Show_Actor_M08_OneOff::CallFunc_GetScenarioFlag_Flag' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.Show Actor S11 Gorgeous
// 0x0030 (0x0030 - 0x0000)
struct BP_DishSetUp_C_Show_Actor_S11_Gorgeous final
{
public:
	bool                                          Enable_B_CScenario;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress; // 0x0008(0x0010)(NoDestructor)
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario;    // 0x0018(0x0010)(NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetScenarioFlag_Flag;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous) == 0x000008, "Wrong alignment on BP_DishSetUp_C_Show_Actor_S11_Gorgeous");
static_assert(sizeof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous) == 0x000030, "Wrong size on BP_DishSetUp_C_Show_Actor_S11_Gorgeous");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, Enable_B_CScenario) == 0x000000, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::Enable_B_CScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, Result) == 0x000001, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::Result' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress) == 0x000008, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, K2Node_MakeStruct_JackLDT_GameFlagDataScenario) == 0x000018, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::K2Node_MakeStruct_JackLDT_GameFlagDataScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, CallFunc_GetProgressFlag_Flag) == 0x000028, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::CallFunc_GetProgressFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, CallFunc_GetScenarioFlag_Flag) == 0x000029, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::CallFunc_GetScenarioFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_Gorgeous, CallFunc_Is2ndScenario_2ndScenario) == 0x00002A, "Member 'BP_DishSetUp_C_Show_Actor_S11_Gorgeous::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.Show Actor C Scenario Only
// 0x0004 (0x0004 - 0x0000)
struct BP_DishSetUp_C_Show_Actor_C_Scenario_Only final
{
public:
	bool                                          IsNight;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_Show_Actor_C_Scenario_Only) == 0x000001, "Wrong alignment on BP_DishSetUp_C_Show_Actor_C_Scenario_Only");
static_assert(sizeof(BP_DishSetUp_C_Show_Actor_C_Scenario_Only) == 0x000004, "Wrong size on BP_DishSetUp_C_Show_Actor_C_Scenario_Only");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_C_Scenario_Only, IsNight) == 0x000000, "Member 'BP_DishSetUp_C_Show_Actor_C_Scenario_Only::IsNight' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_C_Scenario_Only, CallFunc_IsHidde_TimeZone_Hidden) == 0x000001, "Member 'BP_DishSetUp_C_Show_Actor_C_Scenario_Only::CallFunc_IsHidde_TimeZone_Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_C_Scenario_Only, CallFunc_Is2ndScenario_2ndScenario) == 0x000002, "Member 'BP_DishSetUp_C_Show_Actor_C_Scenario_Only::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_C_Scenario_Only, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_DishSetUp_C_Show_Actor_C_Scenario_Only::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.Show Actor S11 AScenrio Only
// 0x0020 (0x0020 - 0x0000)
struct BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only final
{
public:
	bool                                          IsNight;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress; // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only) == 0x000008, "Wrong alignment on BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only");
static_assert(sizeof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only) == 0x000020, "Wrong size on BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only, IsNight) == 0x000000, "Member 'BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only::IsNight' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress) == 0x000008, "Member 'BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only, CallFunc_IsHidde_TimeZone_Hidden) == 0x000018, "Member 'BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only::CallFunc_IsHidde_TimeZone_Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only, CallFunc_GetProgressFlag_Flag) == 0x000019, "Member 'BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only::CallFunc_GetProgressFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only, CallFunc_Is2ndScenario_2ndScenario) == 0x00001A, "Member 'BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'BP_DishSetUp_C_Show_Actor_S11_AScenrio_Only::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.Show Actor BScenrio Only
// 0x0038 (0x0038 - 0x0000)
struct BP_DishSetUp_C_Show_Actor_BScenrio_Only final
{
public:
	bool                                          Is_Night;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress; // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_IsSScenario_SScenario;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress2; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_Show_Actor_BScenrio_Only) == 0x000008, "Wrong alignment on BP_DishSetUp_C_Show_Actor_BScenrio_Only");
static_assert(sizeof(BP_DishSetUp_C_Show_Actor_BScenrio_Only) == 0x000038, "Wrong size on BP_DishSetUp_C_Show_Actor_BScenrio_Only");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, Is_Night) == 0x000000, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::Is_Night' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_IsHidde_TimeZone_Hidden) == 0x000001, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_IsHidde_TimeZone_Hidden' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress) == 0x000008, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_IsSScenario_SScenario) == 0x000018, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_IsSScenario_SScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_GetProgressFlag_Flag) == 0x000019, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_GetProgressFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress2) == 0x000020, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_GetProgressFlag_Flag2) == 0x000030, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_GetProgressFlag_Flag2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000031, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_BooleanAND_ReturnValue2) == 0x000032, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_BooleanAND_ReturnValue3) == 0x000033, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_Is2ndScenario_2ndScenario) == 0x000034, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_Not_PreBool_ReturnValue2) == 0x000036, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_Show_Actor_BScenrio_Only, CallFunc_Not_PreBool_ReturnValue3) == 0x000037, "Member 'BP_DishSetUp_C_Show_Actor_BScenrio_Only::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.FindHiddenTagForCS
// 0x01B0 (0x01B0 - 0x0000)
struct BP_DishSetUp_C_FindHiddenTagForCS final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FindTag;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableCutSceneInfo             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0190)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_FindHiddenTagForCS) == 0x000008, "Wrong alignment on BP_DishSetUp_C_FindHiddenTagForCS");
static_assert(sizeof(BP_DishSetUp_C_FindHiddenTagForCS) == 0x0001B0, "Wrong size on BP_DishSetUp_C_FindHiddenTagForCS");
static_assert(offsetof(BP_DishSetUp_C_FindHiddenTagForCS, CSID) == 0x000000, "Member 'BP_DishSetUp_C_FindHiddenTagForCS::CSID' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_FindHiddenTagForCS, FindTag) == 0x000008, "Member 'BP_DishSetUp_C_FindHiddenTagForCS::FindTag' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_FindHiddenTagForCS, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_DishSetUp_C_FindHiddenTagForCS::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_FindHiddenTagForCS, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001A0, "Member 'BP_DishSetUp_C_FindHiddenTagForCS::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_FindHiddenTagForCS, CallFunc_Array_Find_ReturnValue) == 0x0001A4, "Member 'BP_DishSetUp_C_FindHiddenTagForCS::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_FindHiddenTagForCS, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_DishSetUp_C_FindHiddenTagForCS::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DishSetUp.BP_DishSetUp_C.ShowActorS040
// 0x0030 (0x0030 - 0x0000)
struct BP_DishSetUp_C_ShowActorS040 final
{
public:
	bool                                          IsNight;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectFood;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario;    // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_IsHidde_TimeZone_Hidden;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetScenarioFlag_Flag;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameFlagInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSScenario_SScenario;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DishSetUp_C_ShowActorS040) == 0x000008, "Wrong alignment on BP_DishSetUp_C_ShowActorS040");
static_assert(sizeof(BP_DishSetUp_C_ShowActorS040) == 0x000030, "Wrong size on BP_DishSetUp_C_ShowActorS040");
static_assert(offsetof(BP_DishSetUp_C_ShowActorS040, IsNight) == 0x000000, "Member 'BP_DishSetUp_C_ShowActorS040::IsNight' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ShowActorS040, SelectFood) == 0x000004, "Member 'BP_DishSetUp_C_ShowActorS040::SelectFood' has a wrong offset!");
static_assert(offsetof(BP_DishSetUp_C_ShowActorS040, K2Node_MakeStruct_JackLDT_GameFlagDataScenario) == 0x000008, "Member 'BP_DishSetUp_C_ShowActorS040::K2Node_MakeStruct_JackLDT_GameFlagDataScenario' has a wrong offset!");
