#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuBGM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JackGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DebugMenuBGM.BP_DebugMenuBGM_C
// 0x0018 (0x03B0 - 0x0398)
class ABP_DebugMenuBGM_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNight;                                           // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_DebugMenuBGM(int32 EntryPoint);
	void OpenBGMVolumeEditorEvent();
	void UseDQ8BGMEvent(bool BoolValue);
	void PlayMe();
	void DebugMEMenuInitialize();
	void MEMenuInitialize();
	void ChangedDayNightEvent(bool BoolValue);
	void ChangedDiscVersionEvent(bool BoolValue);
	void BGMMenuInitializeEvent();
	void DebugBGMMenuInitialize();
	void PlayBGM();
	void ReceiveBeginPlay();
	void StopBGMEvent();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DebugMenuBGM_C">();
	}
	static class ABP_DebugMenuBGM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DebugMenuBGM_C>();
	}
};
static_assert(alignof(ABP_DebugMenuBGM_C) == 0x000008, "Wrong alignment on ABP_DebugMenuBGM_C");
static_assert(sizeof(ABP_DebugMenuBGM_C) == 0x0003B0, "Wrong size on ABP_DebugMenuBGM_C");
static_assert(offsetof(ABP_DebugMenuBGM_C, UberGraphFrame) == 0x000398, "Member 'ABP_DebugMenuBGM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuBGM_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_DebugMenuBGM_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuBGM_C, IsNight) == 0x0003A8, "Member 'ABP_DebugMenuBGM_C::IsNight' has a wrong offset!");

}

