#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugCutsceneSkipCut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DebugCutsceneSkipCut.BP_DebugCutsceneSkipCut_C
// 0x0040 (0x03D8 - 0x0398)
class ABP_DebugCutsceneSkipCut_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CutName;                                           // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         TempInt;                                           // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCutMode;                                       // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkipCaption;                                       // 0x03BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectCut;                                         // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatineeActor*                          Matinee;                                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CutMenuIndex;                                      // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MenuHeight;                                        // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DebugCutsceneSkipCut(int32 EntryPoint);
	void PagePrev(int32 Add);
	void CutSelect(int32 Add);
	void ReceiveTick(float DeltaSeconds);
	void SkipCut();
	void InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_10(const struct FKey& Key);
	void InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_11(const struct FKey& Key);
	void InpActEvt_Left_K2Node_InputKeyEvent_12(const struct FKey& Key);
	void InpActEvt_Right_K2Node_InputKeyEvent_13(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_14(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent_15(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent_16(const struct FKey& Key);
	void InpActEvt_Enter_K2Node_InputKeyEvent_17(const struct FKey& Key);
	void InpActEvt_Down_K2Node_InputKeyEvent_18(const struct FKey& Key);
	void InpActEvt_Up_K2Node_InputKeyEvent_19(const struct FKey& Key);
	void UserConstructionScript();
	void SetEnable(bool Enable);
	void GetMatinee(class AMatineeActor** Matinee_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DebugCutsceneSkipCut_C">();
	}
	static class ABP_DebugCutsceneSkipCut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DebugCutsceneSkipCut_C>();
	}
};
static_assert(alignof(ABP_DebugCutsceneSkipCut_C) == 0x000008, "Wrong alignment on ABP_DebugCutsceneSkipCut_C");
static_assert(sizeof(ABP_DebugCutsceneSkipCut_C) == 0x0003D8, "Wrong size on ABP_DebugCutsceneSkipCut_C");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, UberGraphFrame) == 0x000398, "Member 'ABP_DebugCutsceneSkipCut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_DebugCutsceneSkipCut_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, CutName) == 0x0003A8, "Member 'ABP_DebugCutsceneSkipCut_C::CutName' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, TempInt) == 0x0003B8, "Member 'ABP_DebugCutsceneSkipCut_C::TempInt' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, SkipCutMode) == 0x0003BC, "Member 'ABP_DebugCutsceneSkipCut_C::SkipCutMode' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, SkipCaption) == 0x0003BD, "Member 'ABP_DebugCutsceneSkipCut_C::SkipCaption' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, SelectCut) == 0x0003C0, "Member 'ABP_DebugCutsceneSkipCut_C::SelectCut' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, Matinee) == 0x0003C8, "Member 'ABP_DebugCutsceneSkipCut_C::Matinee' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, CutMenuIndex) == 0x0003D0, "Member 'ABP_DebugCutsceneSkipCut_C::CutMenuIndex' has a wrong offset!");
static_assert(offsetof(ABP_DebugCutsceneSkipCut_C, MenuHeight) == 0x0003D4, "Member 'ABP_DebugCutsceneSkipCut_C::MenuHeight' has a wrong offset!");

}

