#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuAchievement

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugMenuAchievement.BP_DebugMenuAchievement_C.ExecuteUbergraph_BP_DebugMenuAchievement
// 0x0240 (0x0240 - 0x0000)
struct BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool BoolValue)>               K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool BoolValue)>               K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue2;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_Achievement                   K2Node_MakeStruct_JackLDT_Achievement;             // 0x0120(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue2;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue3;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue3;           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue4;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue2;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableBool*             CallFunc_AddDebugMenuBool_ReturnValue;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue3;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue5;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue3;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue4;           // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue6;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue4;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue3;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue4;       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BoolValue2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue5;       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue5;           // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue7;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BoolValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableBool*             CallFunc_AddDebugMenuBool_ReturnValue2;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue6;       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue6;           // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue8;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue5;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement) == 0x000008, "Wrong alignment on BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement");
static_assert(sizeof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement) == 0x000240, "Wrong size on BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, EntryPoint) == 0x000000, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetAchievementManager_ReturnValue) == 0x000008, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate4) == 0x000040, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate5) == 0x000058, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x000068, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000070, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000080, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Conv_NameToString_ReturnValue) == 0x000098, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue2) == 0x0000A8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x0000B0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate6) == 0x0000B8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuItem_ReturnValue2) == 0x0000C8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x0000D0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetAchievementManager_ReturnValue2) == 0x0000E0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetAchievementManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Split_LeftS) == 0x0000E8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Split_RightS) == 0x0000F8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Split_ReturnValue) == 0x000108, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Conv_StringToName_ReturnValue) == 0x000110, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, Temp_int_Loop_Counter_Variable) == 0x000118, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_MakeStruct_JackLDT_Achievement) == 0x000120, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_MakeStruct_JackLDT_Achievement' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_Add_IntInt_ReturnValue) == 0x000134, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_MakeLiteralString_ReturnValue) == 0x000138, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_MakeLiteralString_ReturnValue2) == 0x000148, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_MakeLiteralString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CreateDelegate_OutputDelegate7) == 0x000158, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue3) == 0x000168, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_MakeLiteralString_ReturnValue3) == 0x000170, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_MakeLiteralString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue4) == 0x000180, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuCommand_ReturnValue2) == 0x000188, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuBool_ReturnValue) == 0x000190, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuItem_ReturnValue3) == 0x000198, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue5) == 0x0001A0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuCommand_ReturnValue3) == 0x0001A8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuCommand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_MakeLiteralString_ReturnValue4) == 0x0001B0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_MakeLiteralString_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue6) == 0x0001C0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuCommand_ReturnValue4) == 0x0001C8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuCommand_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetAchievementManager_ReturnValue3) == 0x0001D0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetAchievementManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetAchievementManager_ReturnValue4) == 0x0001D8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetAchievementManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CustomEvent_BoolValue2) == 0x0001E0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CustomEvent_BoolValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetAchievementManager_ReturnValue5) == 0x0001E8, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetAchievementManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_MakeLiteralString_ReturnValue5) == 0x0001F0, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_MakeLiteralString_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue7) == 0x000200, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, K2Node_CustomEvent_BoolValue) == 0x000208, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::K2Node_CustomEvent_BoolValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuBool_ReturnValue2) == 0x000210, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetAchievementManager_ReturnValue6) == 0x000218, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetAchievementManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_MakeLiteralString_ReturnValue6) == 0x000220, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_MakeLiteralString_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_GetDebugMenuItemByPath_ReturnValue8) == 0x000230, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_GetDebugMenuItemByPath_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement, CallFunc_AddDebugMenuCommand_ReturnValue5) == 0x000238, "Member 'BP_DebugMenuAchievement_C_ExecuteUbergraph_BP_DebugMenuAchievement::CallFunc_AddDebugMenuCommand_ReturnValue5' has a wrong offset!");

// Function BP_DebugMenuAchievement.BP_DebugMenuAchievement_C.DoDisableAchievementAcquisition
// 0x0001 (0x0001 - 0x0000)
struct BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition) == 0x000001, "Wrong alignment on BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition");
static_assert(sizeof(BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition) == 0x000001, "Wrong size on BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition");
static_assert(offsetof(BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition, BoolValue) == 0x000000, "Member 'BP_DebugMenuAchievement_C_DoDisableAchievementAcquisition::BoolValue' has a wrong offset!");

// Function BP_DebugMenuAchievement.BP_DebugMenuAchievement_C.DoNotUnlockUE4Achievements
// 0x0001 (0x0001 - 0x0000)
struct BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements) == 0x000001, "Wrong alignment on BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements");
static_assert(sizeof(BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements) == 0x000001, "Wrong size on BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements");
static_assert(offsetof(BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements, BoolValue) == 0x000000, "Member 'BP_DebugMenuAchievement_C_DoNotUnlockUE4Achievements::BoolValue' has a wrong offset!");

}

