#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugEventExec

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugEventExec.BP_DebugEventExec_C.ExecuteUbergraph_BP_DebugEventExec
// 0x02F0 (0x02F0 - 0x0000)
struct BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key6;                         // 0x0008(0x0018)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent2;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorPlayerMarker_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActorPlayerMarker_ReturnValue2;         // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0158(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0180(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue2;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue3;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue4;                 // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue5;                 // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x01A0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue6;                 // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x01C0(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue2;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DebugConvertViewportPosition_CalcPositionX; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DebugConvertViewportPosition_CalcPositionY; // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_DebugFontSize;           // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeHalfWidthX;      // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeFullWidthX;      // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeY;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue3;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue7;                 // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue8;                 // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue2;             // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue9;                 // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue3;             // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue10;                // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue4;             // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue11;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue5;             // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue12;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue6;             // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue2;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue3;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue4;         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue5;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue6;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key5;                         // 0x02D8(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec");
static_assert(sizeof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec) == 0x0002F0, "Wrong size on BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, EntryPoint) == 0x000000, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_InputKeyEvent_Key6) == 0x000008, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_InputKeyEvent_Key6' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_CreateDelegate_OutputDelegate4) == 0x000050, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OverlappedComponent2) == 0x000060, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OverlappedComponent2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OtherActor2) == 0x000068, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OtherComp2) == 0x000070, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x000078, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_bFromSweep) == 0x00007C, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_SweepResult) == 0x000080, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000108, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OtherActor) == 0x000110, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OtherComp) == 0x000118, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000120, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_IsActorPlayerMarker_ReturnValue) == 0x000124, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_IsActorPlayerMarker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_IsActorPlayerMarker_ReturnValue2) == 0x000125, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_IsActorPlayerMarker_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetJackPlayerController_ReturnValue) == 0x000128, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_CreateDelegate_OutputDelegate5) == 0x000130, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue) == 0x000140, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_Event_DeltaSeconds) == 0x000144, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_InputKeyEvent_Key) == 0x000158, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Concat_StrStr_ReturnValue2) == 0x000170, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_InputKeyEvent_Key2) == 0x000180, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue2) == 0x000198, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue3) == 0x000199, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue4) == 0x00019A, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue5) == 0x00019B, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_InputKeyEvent_Key3) == 0x0001A0, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue6) == 0x0001B8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_InputKeyEvent_Key4) == 0x0001C0, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Concat_StrStr_ReturnValue3) == 0x0001D8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Concat_StrStr_ReturnValue4) == 0x0001E8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Concat_StrStr_ReturnValue5) == 0x0001F8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Concat_StrStr_ReturnValue6) == 0x000208, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetJackPlayerController_ReturnValue2) == 0x000218, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetJackPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_DebugConvertViewportPosition_CalcPositionX) == 0x000220, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_DebugConvertViewportPosition_CalcPositionX' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_DebugConvertViewportPosition_CalcPositionY) == 0x000224, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_DebugConvertViewportPosition_CalcPositionY' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetDebugFontSize_DebugFontSize) == 0x000228, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetDebugFontSize_DebugFontSize' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetDebugFontSize_CharSizeHalfWidthX) == 0x00022C, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetDebugFontSize_CharSizeHalfWidthX' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetDebugFontSize_CharSizeFullWidthX) == 0x000230, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetDebugFontSize_CharSizeFullWidthX' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetDebugFontSize_CharSizeY) == 0x000234, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetDebugFontSize_CharSizeY' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000238, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Add_FloatFloat_ReturnValue) == 0x00023C, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000240, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000244, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000248, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Add_FloatFloat_ReturnValue3) == 0x00024C, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Add_FloatFloat_ReturnValue4) == 0x000250, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000254, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_Add_FloatFloat_ReturnValue5) == 0x000258, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x000260, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_GetJackPlayerController_ReturnValue3) == 0x000270, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_GetJackPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue7) == 0x000278, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000279, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue8) == 0x00027A, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_NotEqual_StrStr_ReturnValue2) == 0x00027B, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_NotEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue9) == 0x00027C, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_NotEqual_StrStr_ReturnValue3) == 0x00027D, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_NotEqual_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue10) == 0x00027E, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_NotEqual_StrStr_ReturnValue4) == 0x00027F, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_NotEqual_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue11) == 0x000280, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_NotEqual_StrStr_ReturnValue5) == 0x000281, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_NotEqual_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_CreateDelegate_OutputDelegate6) == 0x000288, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_RemoteEvent_ReturnValue12) == 0x000298, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_RemoteEvent_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_NotEqual_StrStr_ReturnValue6) == 0x000299, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_NotEqual_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuItem_ReturnValue) == 0x0002A0, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x0002A8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuCommand_ReturnValue2) == 0x0002B0, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuCommand_ReturnValue3) == 0x0002B8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuCommand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuCommand_ReturnValue4) == 0x0002C0, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuCommand_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuCommand_ReturnValue5) == 0x0002C8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuCommand_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, CallFunc_AddDebugMenuCommand_ReturnValue6) == 0x0002D0, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::CallFunc_AddDebugMenuCommand_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec, K2Node_InputKeyEvent_Key5) == 0x0002D8, "Member 'BP_DebugEventExec_C_ExecuteUbergraph_BP_DebugEventExec::K2Node_InputKeyEvent_Key5' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DebugEventExec_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DebugEventExec_C_ReceiveTick");
static_assert(sizeof(BP_DebugEventExec_C_ReceiveTick) == 0x000004, "Wrong size on BP_DebugEventExec_C_ReceiveTick");
static_assert(offsetof(BP_DebugEventExec_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DebugEventExec_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_116_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DebugEventExec_C_BndEvt__Box_K2Node_ComponentBoundEvent_114_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8");
static_assert(sizeof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8");
static_assert(offsetof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10");
static_assert(sizeof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10) == 0x000018, "Wrong size on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10");
static_assert(offsetof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10, Key) == 0x000000, "Member 'BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_10::Key' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11");
static_assert(sizeof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11) == 0x000018, "Wrong size on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11");
static_assert(offsetof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11, Key) == 0x000000, "Member 'BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_11::Key' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9");
static_assert(sizeof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9) == 0x000018, "Wrong size on BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9");
static_assert(offsetof(BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9, Key) == 0x000000, "Member 'BP_DebugEventExec_C_InpActEvt_Gamepad_FaceButton_Top_K2Node_InputKeyEvent_9::Key' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6");
static_assert(sizeof(BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6");
static_assert(offsetof(BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'BP_DebugEventExec_C_InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function BP_DebugEventExec.BP_DebugEventExec_C.InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7");
static_assert(sizeof(BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7");
static_assert(offsetof(BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'BP_DebugEventExec_C_InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

}

