#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DebugMenuUI.BP_DebugMenuUI_C.ExecuteUbergraph_BP_DebugMenuUI
// 0x0070 (0x0070 - 0x0000)
struct BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedMenu_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue2;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI) == 0x000008, "Wrong alignment on BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI");
static_assert(sizeof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI) == 0x000070, "Wrong size on BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, EntryPoint) == 0x000000, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetJackPlayerController_ReturnValue) == 0x000008, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_OpenMenu_ReturnValue) == 0x000018, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_IsOpenedMenu_ReturnValue) == 0x000020, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_IsOpenedMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_MakeLiteralString_ReturnValue) == 0x000038, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x000058, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000060, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI, CallFunc_AddDebugMenuCommand_ReturnValue2) == 0x000068, "Member 'BP_DebugMenuUI_C_ExecuteUbergraph_BP_DebugMenuUI::CallFunc_AddDebugMenuCommand_ReturnValue2' has a wrong offset!");

}

