#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugScale

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugScale.BP_DebugScale_C.ExecuteUbergraph_BP_DebugScale
// 0x0580 (0x0580 - 0x0000)
struct BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0094(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue3;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue2;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x00C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue2;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x00E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue4;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x018C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0200(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x020C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue5;      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0220(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x022C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x0238(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue2;       // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0254(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x0280(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit2;                  // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue2;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit2;             // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap2;          // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32B[0x1];                                      // 0x032B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time2;                     // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance2;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location2;                 // 0x0334(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint2;              // 0x0340(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal2;                   // 0x034C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal2;             // 0x0358(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat2;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor2;                 // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent2;             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName2;              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem2;                  // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex2;                // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart2;               // 0x0390(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd2;                 // 0x039C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue3;     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition2;     // 0x03B0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue2;        // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x03BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle;                          // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Offset;                         // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Mirror;                         // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue2;          // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue3;           // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0410(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x041C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x0428(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegTan_ReturnValue;                       // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x0438(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0448(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue7;            // 0x0454(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit3;                  // 0x0460(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue3;             // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit3;             // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap3;          // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EB[0x1];                                      // 0x04EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time3;                     // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance3;                 // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location3;                 // 0x04F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint3;              // 0x0500(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal3;                   // 0x050C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal3;             // 0x0518(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat3;                  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor3;                 // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent3;             // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName3;              // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem3;                  // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex3;                // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart3;               // 0x0550(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd3;                 // 0x055C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition3;     // 0x0568(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue3;        // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale) == 0x000008, "Wrong alignment on BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale");
static_assert(sizeof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale) == 0x000580, "Wrong size on BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, EntryPoint) == 0x000000, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, Temp_object_Variable) == 0x000008, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, Temp_object_Variable2) == 0x000020, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, Temp_bool_Variable) == 0x000030, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, Temp_float_Variable) == 0x000034, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, Temp_float_Variable2) == 0x000038, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000040, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000054, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetActorForwardVector_ReturnValue) == 0x000058, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerController_ReturnValue) == 0x000068, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerCharacter_ReturnValue2) == 0x000080, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000094, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerCharacter_ReturnValue3) == 0x0000A0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerCharacter_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_IntFloat_ReturnValue2) == 0x0000A8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_IntFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000AC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetActorUpVector_ReturnValue) == 0x0000B8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue2) == 0x0000C4, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0000D0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerController_ReturnValue2) == 0x0000E0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue3) == 0x0000E8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerCharacter_ReturnValue4) == 0x0000F8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerCharacter_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_LineTraceSingle_OutHit) == 0x000100, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_LineTraceSingle_ReturnValue) == 0x000188, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00018C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_bBlockingHit) == 0x000198, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_bInitialOverlap) == 0x000199, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Time) == 0x00019C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Distance) == 0x0001A0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Location) == 0x0001A4, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Normal) == 0x0001BC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_FaceIndex) == 0x0001FC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_TraceStart) == 0x000200, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_TraceEnd) == 0x00020C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerCharacter_ReturnValue5) == 0x000218, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerCharacter_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000220, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x00022C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue4) == 0x000238, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetActorForwardVector_ReturnValue2) == 0x000244, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetActorForwardVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_VSize_ReturnValue) == 0x000250, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000254, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x00025C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000260, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakVector2D_X) == 0x000264, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakVector2D_Y) == 0x000268, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Conv_FloatToString_ReturnValue) == 0x000270, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, Temp_object_Variable3) == 0x000280, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Concat_StrStr_ReturnValue) == 0x000290, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_LineTraceSingle_OutHit2) == 0x0002A0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_LineTraceSingle_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_LineTraceSingle_ReturnValue2) == 0x000328, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_LineTraceSingle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_bBlockingHit2) == 0x000329, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_bBlockingHit2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_bInitialOverlap2) == 0x00032A, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_bInitialOverlap2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Time2) == 0x00032C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Time2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Distance2) == 0x000330, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Distance2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Location2) == 0x000334, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Location2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_ImpactPoint2) == 0x000340, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_ImpactPoint2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Normal2) == 0x00034C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Normal2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_ImpactNormal2) == 0x000358, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_ImpactNormal2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_PhysMat2) == 0x000368, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_PhysMat2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitActor2) == 0x000370, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitActor2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitComponent2) == 0x000378, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitComponent2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitBoneName2) == 0x000380, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitBoneName2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitItem2) == 0x000388, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitItem2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_FaceIndex2) == 0x00038C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_FaceIndex2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_TraceStart2) == 0x000390, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_TraceStart2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_TraceEnd2) == 0x00039C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_TraceEnd2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_GetJackPlayerController_ReturnValue3) == 0x0003A8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_GetJackPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_ProjectWorldToScreen_ScreenPosition2) == 0x0003B0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_ProjectWorldToScreen_ScreenPosition2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_ProjectWorldToScreen_ReturnValue2) == 0x0003B8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_ProjectWorldToScreen_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x0003BC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakVector2D_X2) == 0x0003C8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakVector2D_Y2) == 0x0003CC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_VSize_ReturnValue2) == 0x0003D0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_VSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x0003D4, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, K2Node_CustomEvent_Angle) == 0x0003D8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::K2Node_CustomEvent_Angle' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, K2Node_CustomEvent_Offset) == 0x0003DC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::K2Node_CustomEvent_Offset' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, K2Node_CustomEvent_Mirror) == 0x0003E0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::K2Node_CustomEvent_Mirror' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Conv_FloatToString_ReturnValue2) == 0x0003E8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Conv_FloatToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Concat_StrStr_ReturnValue2) == 0x0003F8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, K2Node_Select_Default) == 0x000408, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_IntFloat_ReturnValue3) == 0x00040C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_IntFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_MakeVector_ReturnValue) == 0x000410, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x00041C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue5) == 0x000428, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_DegTan_ReturnValue) == 0x000434, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue6) == 0x000438, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000444, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_MakeVector_ReturnValue2) == 0x000448, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_Add_VectorVector_ReturnValue7) == 0x000454, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_Add_VectorVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_LineTraceSingle_OutHit3) == 0x000460, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_LineTraceSingle_OutHit3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_LineTraceSingle_ReturnValue3) == 0x0004E8, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_LineTraceSingle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_bBlockingHit3) == 0x0004E9, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_bBlockingHit3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_bInitialOverlap3) == 0x0004EA, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_bInitialOverlap3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Time3) == 0x0004EC, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Time3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Distance3) == 0x0004F0, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Distance3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Location3) == 0x0004F4, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Location3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_ImpactPoint3) == 0x000500, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_ImpactPoint3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_Normal3) == 0x00050C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_Normal3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_ImpactNormal3) == 0x000518, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_ImpactNormal3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_PhysMat3) == 0x000528, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_PhysMat3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitActor3) == 0x000530, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitActor3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitComponent3) == 0x000538, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitComponent3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitBoneName3) == 0x000540, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitBoneName3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_HitItem3) == 0x000548, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_HitItem3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_FaceIndex3) == 0x00054C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_FaceIndex3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_TraceStart3) == 0x000550, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_TraceStart3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakHitResult_TraceEnd3) == 0x00055C, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakHitResult_TraceEnd3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_ProjectWorldToScreen_ScreenPosition3) == 0x000568, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_ProjectWorldToScreen_ScreenPosition3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_ProjectWorldToScreen_ReturnValue3) == 0x000570, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_ProjectWorldToScreen_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakVector2D_X3) == 0x000574, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale, CallFunc_BreakVector2D_Y3) == 0x000578, "Member 'BP_DebugScale_C_ExecuteUbergraph_BP_DebugScale::CallFunc_BreakVector2D_Y3' has a wrong offset!");

// Function BP_DebugScale.BP_DebugScale_C.SakaAngleCheck
// 0x000C (0x000C - 0x0000)
struct BP_DebugScale_C_SakaAngleCheck final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mirror;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugScale_C_SakaAngleCheck) == 0x000004, "Wrong alignment on BP_DebugScale_C_SakaAngleCheck");
static_assert(sizeof(BP_DebugScale_C_SakaAngleCheck) == 0x00000C, "Wrong size on BP_DebugScale_C_SakaAngleCheck");
static_assert(offsetof(BP_DebugScale_C_SakaAngleCheck, Angle) == 0x000000, "Member 'BP_DebugScale_C_SakaAngleCheck::Angle' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_SakaAngleCheck, Offset) == 0x000004, "Member 'BP_DebugScale_C_SakaAngleCheck::Offset' has a wrong offset!");
static_assert(offsetof(BP_DebugScale_C_SakaAngleCheck, Mirror) == 0x000008, "Member 'BP_DebugScale_C_SakaAngleCheck::Mirror' has a wrong offset!");

// Function BP_DebugScale.BP_DebugScale_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DebugScale_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugScale_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DebugScale_C_ReceiveTick");
static_assert(sizeof(BP_DebugScale_C_ReceiveTick) == 0x000004, "Wrong size on BP_DebugScale_C_ReceiveTick");
static_assert(offsetof(BP_DebugScale_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DebugScale_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DebugScale.BP_DebugScale_C.UserConstructionScript
// 0x0190 (0x0190 - 0x0000)
struct BP_DebugScale_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextRenderComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue2;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0018)()
	int32                                         Temp_int_Variable2;                                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item2;                          // 0x00D0(0x0018)()
	float                                         CallFunc_Multiply_IntFloat_ReturnValue2;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
