#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugPlayerNearActors

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugPlayerNearActors.BP_DebugPlayerNearActors_C.ExecuteUbergraph_BP_DebugPlayerNearActors
// 0x0410 (0x0410 - 0x0000)
struct BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x0060(0x0018)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00C0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETraceTypeQuery>                       K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               CallFunc_Array_Get_Item;                           // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0134(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0144(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue2;         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue3;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue4;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue5;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActorEnableCollision_ReturnValue;      // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetDebugMenuCursorLocation_ReturnValue;   // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item3;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue2;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDebugFontSize_DebugFontSize;           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeHalfWidthX;      // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeFullWidthX;      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeY;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMulti_OutHits;                // 0x0208(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMulti_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item4;                          // 0x0220(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0310(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x031C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0334(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0348(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item5;                          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue2;             // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue2;                 // 0x0378(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue2;     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue2;             // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue3;     // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue4;     // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue2;         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x03E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActorTickEnabled_ReturnValue;           // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_403[0x5];                                      // 0x0403(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue5;     // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors) == 0x000008, "Wrong alignment on BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors");
static_assert(sizeof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors) == 0x000410, "Wrong size on BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, EntryPoint) == 0x000000, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_InputKeyEvent_Key2) == 0x000018, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_bool_Variable) == 0x000030, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Array_Index_Variable2) == 0x000034, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Loop_Counter_Variable2) == 0x000038, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_IntInt_ReturnValue2) == 0x00003C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Array_Index_Variable3) == 0x000040, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_InputKeyEvent_Key3) == 0x000048, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_InputKeyEvent_Key4) == 0x000060, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_CreateDelegate_OutputDelegate2) == 0x000088, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Array_Index_Variable4) == 0x000098, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_Event_DeltaSeconds) == 0x0000B0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x0000B8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000C0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetForwardVector_ReturnValue) == 0x0000D8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_MakeArray_Array) == 0x0000E8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Get_Item) == 0x000104, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Get_Item2) == 0x000118, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Length_ReturnValue2) == 0x000120, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000128, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Less_IntInt_ReturnValue) == 0x000131, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_SelectColor_ReturnValue) == 0x000134, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000144, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetDisplayName_ReturnValue) == 0x000150, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000160, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000168, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_AddDebugMenuCommand_ReturnValue2) == 0x000170, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_AddDebugMenuCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_AddDebugMenuCommand_ReturnValue3) == 0x000178, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_AddDebugMenuCommand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_AddDebugMenuCommand_ReturnValue4) == 0x000180, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_AddDebugMenuCommand_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_AddDebugMenuCommand_ReturnValue5) == 0x000188, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_AddDebugMenuCommand_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_CreateDelegate_OutputDelegate4) == 0x000190, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001A0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_IsValid_ReturnValue2) == 0x0001A9, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetActorEnableCollision_ReturnValue) == 0x0001AA, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetActorEnableCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Not_PreBool_ReturnValue) == 0x0001AB, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_SetDebugMenuCursorLocation_ReturnValue) == 0x0001AC, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_SetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetJackPlayerController_ReturnValue) == 0x0001B0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Get_Item3) == 0x0001B8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Length_ReturnValue3) == 0x0001C0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetDisplayName_ReturnValue2) == 0x0001C8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetDisplayName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Less_IntInt_ReturnValue2) == 0x0001D8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetDebugFontSize_DebugFontSize) == 0x0001DC, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetDebugFontSize_DebugFontSize' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetDebugFontSize_CharSizeHalfWidthX) == 0x0001E0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetDebugFontSize_CharSizeHalfWidthX' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetDebugFontSize_CharSizeFullWidthX) == 0x0001E4, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetDebugFontSize_CharSizeFullWidthX' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetDebugFontSize_CharSizeY) == 0x0001E8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetDebugFontSize_CharSizeY' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_object_Variable) == 0x0001F0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_FloatFloat_ReturnValue) == 0x000200, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_CapsuleTraceMulti_OutHits) == 0x000208, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_CapsuleTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_CapsuleTraceMulti_ReturnValue) == 0x000218, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_CapsuleTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00021C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Get_Item4) == 0x000220, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_bBlockingHit) == 0x0002A8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002A9, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_Time) == 0x0002AC, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_Distance) == 0x0002B0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_Location) == 0x0002B4, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_ImpactPoint) == 0x0002C0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_Normal) == 0x0002CC, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_ImpactNormal) == 0x0002D8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_PhysMat) == 0x0002E8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_HitActor) == 0x0002F0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_HitComponent) == 0x0002F8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_HitBoneName) == 0x000300, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_HitItem) == 0x000308, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_FaceIndex) == 0x00030C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_TraceStart) == 0x000310, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_BreakHitResult_TraceEnd) == 0x00031C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Length_ReturnValue4) == 0x000328, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_AddUnique_ReturnValue) == 0x00032C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000330, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_Select_Default) == 0x000334, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_IntInt_ReturnValue3) == 0x000344, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000348, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Loop_Counter_Variable3) == 0x00034C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Length_ReturnValue5) == 0x000350, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Less_IntInt_ReturnValue3) == 0x000354, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000355, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_IntInt_ReturnValue4) == 0x000358, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Less_IntInt_ReturnValue4) == 0x00035C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_LastIndex_ReturnValue) == 0x000360, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Subtract_IntInt_ReturnValue) == 0x000364, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Get_Item5) == 0x000368, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000370, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_LastIndex_ReturnValue2) == 0x000374, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_LastIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_SelectColor_ReturnValue2) == 0x000378, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_SelectColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Max_ReturnValue) == 0x000388, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Min_ReturnValue) == 0x00038C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetJackPlayerController_ReturnValue2) == 0x000390, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetJackPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_Find_ReturnValue) == 0x000398, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_IsValid_ReturnValue3) == 0x00039C, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Array_AddUnique_ReturnValue2) == 0x0003A0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Array_AddUnique_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_CreateDelegate_OutputDelegate5) == 0x0003A8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetJackPlayerController_ReturnValue3) == 0x0003B8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetJackPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetJackPlayerController_ReturnValue4) == 0x0003C0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetJackPlayerController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, Temp_int_Loop_Counter_Variable4) == 0x0003C8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_K2_GetRootComponent_ReturnValue2) == 0x0003D0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_K2_GetRootComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Less_IntInt_ReturnValue5) == 0x0003D8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Not_PreBool_ReturnValue2) == 0x0003D9, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Add_IntInt_ReturnValue5) == 0x0003DC, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_IsValid_ReturnValue4) == 0x0003E0, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, K2Node_InputKeyEvent_Key) == 0x0003E8, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_IsValid_ReturnValue5) == 0x000400, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_IsActorTickEnabled_ReturnValue) == 0x000401, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_IsActorTickEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_Not_PreBool_ReturnValue3) == 0x000402, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors, CallFunc_GetJackPlayerController_ReturnValue5) == 0x000408, "Member 'BP_DebugPlayerNearActors_C_ExecuteUbergraph_BP_DebugPlayerNearActors::CallFunc_GetJackPlayerController_ReturnValue5' has a wrong offset!");

// Function BP_DebugPlayerNearActors.BP_DebugPlayerNearActors_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DebugPlayerNearActors_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugPlayerNearActors_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DebugPlayerNearActors_C_ReceiveTick");
static_assert(sizeof(BP_DebugPlayerNearActors_C_ReceiveTick) == 0x000004, "Wrong size on BP_DebugPlayerNearActors_C_ReceiveTick");
static_assert(offsetof(BP_DebugPlayerNearActors_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DebugPlayerNearActors_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DebugPlayerNearActors.BP_DebugPlayerNearActors_C.InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct BP_DebugPlayerNearActors_C_InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent_7 final
{
public:
