#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuEventBattle

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugMenuEventBattle.BP_DebugMenuEventBattle_C.ExecuteUbergraph_BP_DebugMenuEventBattle
// 0x0488 (0x0488 - 0x0000)
struct BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable3;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackDataTableEventBattle              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0148)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item2;                          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select2_Default;                            // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue2;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackTextManager*                       CallFunc_GetTextManager_ReturnValue;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromTextPackBP_ReturnValue;        // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS2;                             // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS2;                            // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue2;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackDataTableEventBattle              CallFunc_GetDataTableRowFromName_OutRow2;          // 0x0318(0x0148)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue2;     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_MapStart                      K2Node_MakeStruct_JackLDT_MapStart;                // 0x0478(0x0010)(NoDestructor)
};
static_assert(alignof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle) == 0x000008, "Wrong alignment on BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle");
static_assert(sizeof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle) == 0x000488, "Wrong size on BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, EntryPoint) == 0x000000, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_bool_Variable) == 0x000004, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_string_Variable) == 0x000008, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_string_Variable2) == 0x000018, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_bool_Variable2) == 0x000028, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_string_Variable3) == 0x000030, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000050, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000058, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001C8, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Conv_NameToString_ReturnValue) == 0x0001D0, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E0, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_ParseIntoArray_ReturnValue) == 0x0001F0, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Array_Get_Item2) == 0x000200, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000210, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Left_ReturnValue) == 0x000218, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Map_Find_Value) == 0x000228, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Map_Find_ReturnValue) == 0x000238, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, K2Node_Select_Default) == 0x000240, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, K2Node_Select2_Default) == 0x000258, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Less_IntInt_ReturnValue) == 0x000268, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_AddDebugMenuItem_ReturnValue2) == 0x000270, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_AddDebugMenuItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x000278, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetTextManager_ReturnValue) == 0x000288, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetTextManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Split_LeftS) == 0x000290, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Split_RightS) == 0x0002A0, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Split_ReturnValue) == 0x0002B0, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetTextFromTextPackBP_ReturnValue) == 0x0002B8, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetTextFromTextPackBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Split_LeftS2) == 0x0002C8, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Split_LeftS2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Split_RightS2) == 0x0002D8, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Split_RightS2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Split_ReturnValue2) == 0x0002E8, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Split_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Concat_StrStr_ReturnValue2) == 0x0002F0, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Conv_StringToName_ReturnValue) == 0x000300, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Concat_StrStr_ReturnValue3) == 0x000308, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetDataTableRowFromName_OutRow2) == 0x000318, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetDataTableRowFromName_OutRow2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_GetDataTableRowFromName_ReturnValue2) == 0x000460, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_GetDataTableRowFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000468, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, CallFunc_Conv_StringToName_ReturnValue2) == 0x000470, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle, K2Node_MakeStruct_JackLDT_MapStart) == 0x000478, "Member 'BP_DebugMenuEventBattle_C_ExecuteUbergraph_BP_DebugMenuEventBattle::K2Node_MakeStruct_JackLDT_MapStart' has a wrong offset!");

}

