#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuBGM

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugMenuBGM.BP_DebugMenuBGM_C.ExecuteUbergraph_BP_DebugMenuBGM
// 0x0380 (0x0380 - 0x0000)
struct BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackBGMDiscVersion                           Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool BoolValue)>               K2Node_CreateDelegate_OutputDelegate4;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBGMDiscVersion                           Temp_byte_Variable2;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPossessPlayerControl_ReturnValue;      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPossessPlayerControl_ReturnValue2;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultDeltaTime_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool BoolValue)>               K2Node_CreateDelegate_OutputDelegate7;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue2;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue2;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableBool*             CallFunc_AddDebugMenuBool_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableBool*             CallFunc_AddDebugMenuBool_ReturnValue2;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableBool*             CallFunc_AddDebugMenuBool_ReturnValue3;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue3;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool BoolValue)>               K2Node_CreateDelegate_OutputDelegate8;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_BoolValue3;                     // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_BoolValue2;                     // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackBGMDiscVersion                           K2Node_Select_Default;                             // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackBGMDiscVersion                           CallFunc_GetBGMDiscVersion_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayBGMFromBGMID_ReturnValue;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable3;                             // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select2_Default;                            // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue3;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue4;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames2;        // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue2;  // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS2;                             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS2;                            // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue2;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayMEFromMEID_ReturnValue;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue4;      // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue5;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUseDQ8BGM_ReturnValue;                  // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select3_Default;                            // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BoolValue;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue5;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue6;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue6;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue2;            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue3;            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGMenuId                                CallFunc_GetOpenMenuId_ReturnValue;                // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM) == 0x000008, "Wrong alignment on BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM");
static_assert(sizeof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM) == 0x000380, "Wrong size on BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, EntryPoint) == 0x000000, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_byte_Variable) == 0x000018, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate4) == 0x000040, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate5) == 0x000050, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_byte_Variable2) == 0x000064, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_CanPossessPlayerControl_ReturnValue) == 0x00006C, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_CanPossessPlayerControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_int_Loop_Counter_Variable2) == 0x000074, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Add_IntInt_ReturnValue2) == 0x000078, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_int_Array_Index_Variable2) == 0x00007C, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate6) == 0x000080, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_bool_Variable) == 0x000090, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_CanPossessPlayerControl_ReturnValue2) == 0x000091, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_CanPossessPlayerControl_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDefaultDeltaTime_ReturnValue) == 0x000094, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDefaultDeltaTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetUMGManager_ReturnValue) == 0x000098, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate7) == 0x0000A0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x0000B0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x0000B8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuItemByPath_ReturnValue2) == 0x0000C0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuItemByPath_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000C8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuCommand_ReturnValue2) == 0x0000D8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Conv_NameToString_ReturnValue) == 0x0000E8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_FindSubstring_ReturnValue) == 0x0000FC, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Less_IntInt_ReturnValue2) == 0x000101, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuBool_ReturnValue) == 0x000108, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuBool_ReturnValue2) == 0x000110, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuBool_ReturnValue3) == 0x000118, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuCommand_ReturnValue3) == 0x000120, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuCommand_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate8) == 0x000128, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_StopBGM_ReturnValue) == 0x000138, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CustomEvent_BoolValue3) == 0x000139, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CustomEvent_BoolValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CustomEvent_BoolValue2) == 0x00013A, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CustomEvent_BoolValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_Select_Default) == 0x00013B, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetUMGManager_ReturnValue2) == 0x000140, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000148, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000158, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Concat_StrStr_ReturnValue) == 0x000160, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetBGMDiscVersion_ReturnValue) == 0x000170, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetBGMDiscVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000171, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_string_Variable) == 0x000178, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x000188, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_string_Variable2) == 0x000198, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Split_LeftS) == 0x0001A8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Split_RightS) == 0x0001B8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Split_ReturnValue) == 0x0001C8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Concat_StrStr_ReturnValue2) == 0x0001D0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Conv_StringToName_ReturnValue) == 0x0001E0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_PlayBGMFromBGMID_ReturnValue) == 0x0001E8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_PlayBGMFromBGMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_bool_Variable2) == 0x0001E9, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_string_Variable3) == 0x0001F0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_Select2_Default) == 0x000200, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuItemByPath_ReturnValue3) == 0x000210, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuItemByPath_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Concat_StrStr_ReturnValue3) == 0x000218, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuCommand_ReturnValue4) == 0x000228, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuCommand_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDataTableRowNames_OutRowNames2) == 0x000230, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDataTableRowNames_OutRowNames2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuCursorLocation_ReturnValue2) == 0x000240, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuCursorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Array_Get_Item2) == 0x000250, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Split_LeftS2) == 0x000258, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Split_LeftS2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Split_RightS2) == 0x000268, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Split_RightS2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Split_ReturnValue2) == 0x000278, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Split_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Conv_NameToString_ReturnValue2) == 0x000280, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Concat_StrStr_ReturnValue4) == 0x000290, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Conv_StringToName_ReturnValue2) == 0x0002A0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_PlayMEFromMEID_ReturnValue) == 0x0002A8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_PlayMEFromMEID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Array_Length_ReturnValue2) == 0x0002AC, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_string_Variable4) == 0x0002B0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Less_IntInt_ReturnValue3) == 0x0002C0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuItemByPath_ReturnValue4) == 0x0002C8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuItemByPath_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuCommand_ReturnValue5) == 0x0002D0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuCommand_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetUMGManager_ReturnValue3) == 0x0002D8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0002E0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, Temp_bool_Variable3) == 0x0002E8, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_IsUseDQ8BGM_ReturnValue) == 0x0002E9, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_IsUseDQ8BGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_Select3_Default) == 0x0002F0, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CustomEvent_BoolValue) == 0x000300, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CustomEvent_BoolValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuItemByPath_ReturnValue5) == 0x000308, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuItemByPath_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Conv_BoolToString_ReturnValue) == 0x000310, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuCommand_ReturnValue6) == 0x000320, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuCommand_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_Concat_StrStr_ReturnValue5) == 0x000328, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetDebugMenuItemByPath_ReturnValue6) == 0x000338, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetDebugMenuItemByPath_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000340, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuItem_ReturnValue2) == 0x000348, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_AddDebugMenuItem_ReturnValue3) == 0x000350, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_AddDebugMenuItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetUMGManager_ReturnValue4) == 0x000358, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_GetOpenMenuId_ReturnValue) == 0x000360, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_GetOpenMenuId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, K2Node_CreateDelegate_OutputDelegate9) == 0x000368, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000378, "Member 'BP_DebugMenuBGM_C_ExecuteUbergraph_BP_DebugMenuBGM::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_DebugMenuBGM.BP_DebugMenuBGM_C.UseDQ8BGMEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_DebugMenuBGM_C_UseDQ8BGMEvent final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuBGM_C_UseDQ8BGMEvent) == 0x000001, "Wrong alignment on BP_DebugMenuBGM_C_UseDQ8BGMEvent");
static_assert(sizeof(BP_DebugMenuBGM_C_UseDQ8BGMEvent) == 0x000001, "Wrong size on BP_DebugMenuBGM_C_UseDQ8BGMEvent");
static_assert(offsetof(BP_DebugMenuBGM_C_UseDQ8BGMEvent, BoolValue) == 0x000000, "Member 'BP_DebugMenuBGM_C_UseDQ8BGMEvent::BoolValue' has a wrong offset!");

// Function BP_DebugMenuBGM.BP_DebugMenuBGM_C.ChangedDayNightEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_DebugMenuBGM_C_ChangedDayNightEvent final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuBGM_C_ChangedDayNightEvent) == 0x000001, "Wrong alignment on BP_DebugMenuBGM_C_ChangedDayNightEvent");
static_assert(sizeof(BP_DebugMenuBGM_C_ChangedDayNightEvent) == 0x000001, "Wrong size on BP_DebugMenuBGM_C_ChangedDayNightEvent");
static_assert(offsetof(BP_DebugMenuBGM_C_ChangedDayNightEvent, BoolValue) == 0x000000, "Member 'BP_DebugMenuBGM_C_ChangedDayNightEvent::BoolValue' has a wrong offset!");

// Function BP_DebugMenuBGM.BP_DebugMenuBGM_C.ChangedDiscVersionEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_DebugMenuBGM_C_ChangedDiscVersionEvent final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DebugMenuBGM_C_ChangedDiscVersionEvent) == 0x000001, "Wrong alignment on BP_DebugMenuBGM_C_ChangedDiscVersionEvent");
static_assert(sizeof(BP_DebugMenuBGM_C_ChangedDiscVersionEvent) == 0x000001, "Wrong size on BP_DebugMenuBGM_C_ChangedDiscVersionEvent");
static_assert(offsetof(BP_DebugMenuBGM_C_ChangedDiscVersionEvent, BoolValue) == 0x000000, "Member 'BP_DebugMenuBGM_C_ChangedDiscVersionEvent::BoolValue' has a wrong offset!");

}

