#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugPlayerNearActors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DebugPlayerNearActors.BP_DebugPlayerNearActors_C
// 0x0068 (0x0400 - 0x0398)
class ABP_DebugPlayerNearActors_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CurrentOverlappingActors;                          // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         NearActors;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 SelectActor;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentX;                                          // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentY;                                          // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefColor;                                          // 0x03DC(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentColor;                                      // 0x03EC(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebugMenuOpen;                                   // 0x03FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_DebugPlayerNearActors(int32 EntryPoint);
	void Destroy();
	void Tick();
	void Hidden();
	void Disable();
	void Enable();
	void ReceiveBeginPlay();
	void Collision();
	void Visible();
	void RegistDebugMenu();
	void ReceiveTick(float DeltaSeconds);
	void InpActEvt_Gamepad_DPad_Down_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_Gamepad_DPad_Up_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DebugPlayerNearActors_C">();
	}
	static class ABP_DebugPlayerNearActors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DebugPlayerNearActors_C>();
	}
};
static_assert(alignof(ABP_DebugPlayerNearActors_C) == 0x000008, "Wrong alignment on ABP_DebugPlayerNearActors_C");
static_assert(sizeof(ABP_DebugPlayerNearActors_C) == 0x000400, "Wrong size on ABP_DebugPlayerNearActors_C");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, UberGraphFrame) == 0x000398, "Member 'ABP_DebugPlayerNearActors_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_DebugPlayerNearActors_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, CurrentOverlappingActors) == 0x0003A8, "Member 'ABP_DebugPlayerNearActors_C::CurrentOverlappingActors' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, NearActors) == 0x0003B8, "Member 'ABP_DebugPlayerNearActors_C::NearActors' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, SelectActor) == 0x0003C8, "Member 'ABP_DebugPlayerNearActors_C::SelectActor' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, CurrentX) == 0x0003D0, "Member 'ABP_DebugPlayerNearActors_C::CurrentX' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, CurrentY) == 0x0003D4, "Member 'ABP_DebugPlayerNearActors_C::CurrentY' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, CurrentIndex) == 0x0003D8, "Member 'ABP_DebugPlayerNearActors_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, DefColor) == 0x0003DC, "Member 'ABP_DebugPlayerNearActors_C::DefColor' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, CurrentColor) == 0x0003EC, "Member 'ABP_DebugPlayerNearActors_C::CurrentColor' has a wrong offset!");
static_assert(offsetof(ABP_DebugPlayerNearActors_C, IsDebugMenuOpen) == 0x0003FC, "Member 'ABP_DebugPlayerNearActors_C::IsDebugMenuOpen' has a wrong offset!");

}

