#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuCoordinate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DebugMenuCoordinate.BP_DebugMenuCoordinate_C
// 0x0040 (0x03D8 - 0x0398)
class ABP_DebugMenuCoordinate_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CharacterType;                                     // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         CharacterID;                                       // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         CharacterTypeENG;                                  // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DebugMenuCoordinate(int32 EntryPoint);
	void CustomEvent_0();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DebugMenuCoordinate_C">();
	}
	static class ABP_DebugMenuCoordinate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DebugMenuCoordinate_C>();
	}
};
static_assert(alignof(ABP_DebugMenuCoordinate_C) == 0x000008, "Wrong alignment on ABP_DebugMenuCoordinate_C");
static_assert(sizeof(ABP_DebugMenuCoordinate_C) == 0x0003D8, "Wrong size on ABP_DebugMenuCoordinate_C");
static_assert(offsetof(ABP_DebugMenuCoordinate_C, UberGraphFrame) == 0x000398, "Member 'ABP_DebugMenuCoordinate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuCoordinate_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_DebugMenuCoordinate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuCoordinate_C, CharacterType) == 0x0003A8, "Member 'ABP_DebugMenuCoordinate_C::CharacterType' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuCoordinate_C, CharacterID) == 0x0003B8, "Member 'ABP_DebugMenuCoordinate_C::CharacterID' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuCoordinate_C, CharacterTypeENG) == 0x0003C8, "Member 'ABP_DebugMenuCoordinate_C::CharacterTypeENG' has a wrong offset!");

}

