#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugMenuEventBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DebugMenuEventBattle.BP_DebugMenuEventBattle_C
// 0x0060 (0x03F8 - 0x0398)
class ABP_DebugMenuEventBattle_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            MenuSubName;                                       // 0x03A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DebugMenuEventBattle(int32 EntryPoint);
	void CustomEvent_0();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DebugMenuEventBattle_C">();
	}
	static class ABP_DebugMenuEventBattle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DebugMenuEventBattle_C>();
	}
};
static_assert(alignof(ABP_DebugMenuEventBattle_C) == 0x000008, "Wrong alignment on ABP_DebugMenuEventBattle_C");
static_assert(sizeof(ABP_DebugMenuEventBattle_C) == 0x0003F8, "Wrong size on ABP_DebugMenuEventBattle_C");
static_assert(offsetof(ABP_DebugMenuEventBattle_C, UberGraphFrame) == 0x000398, "Member 'ABP_DebugMenuEventBattle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuEventBattle_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_DebugMenuEventBattle_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DebugMenuEventBattle_C, MenuSubName) == 0x0003A8, "Member 'ABP_DebugMenuEventBattle_C::MenuSubName' has a wrong offset!");

}

