#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectWeaponSMBase

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_EffectWeaponSMBase.BP_EffectWeaponSMBase_C.ExecuteUbergraph_BP_EffectWeaponSMBase
// 0x0008 (0x0008 - 0x0000)
struct BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewHidden;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase) == 0x000004, "Wrong alignment on BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase");
static_assert(sizeof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase) == 0x000008, "Wrong size on BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase");
static_assert(offsetof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase, EntryPoint) == 0x000000, "Member 'BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase, K2Node_Event_bNewHidden) == 0x000005, "Member 'BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase::K2Node_Event_bNewHidden' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase, CallFunc_Not_PreBool_ReturnValue2) == 0x000006, "Member 'BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'BP_EffectWeaponSMBase_C_ExecuteUbergraph_BP_EffectWeaponSMBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_EffectWeaponSMBase.BP_EffectWeaponSMBase_C.OnWeaponHidden
// 0x0001 (0x0001 - 0x0000)
struct BP_EffectWeaponSMBase_C_OnWeaponHidden final
{
public:
	bool                                          bNewHidden;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectWeaponSMBase_C_OnWeaponHidden) == 0x000001, "Wrong alignment on BP_EffectWeaponSMBase_C_OnWeaponHidden");
static_assert(sizeof(BP_EffectWeaponSMBase_C_OnWeaponHidden) == 0x000001, "Wrong size on BP_EffectWeaponSMBase_C_OnWeaponHidden");
static_assert(offsetof(BP_EffectWeaponSMBase_C_OnWeaponHidden, bNewHidden) == 0x000000, "Member 'BP_EffectWeaponSMBase_C_OnWeaponHidden::bNewHidden' has a wrong offset!");

// Function BP_EffectWeaponSMBase.BP_EffectWeaponSMBase_C.SpawnEffects
// 0x0078 (0x0078 - 0x0000)
struct BP_EffectWeaponSMBase_C_SpawnEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetWeaponMeshComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackEffects                           CallFunc_Array_Get_Item;                           // 0x0020(0x0040)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectWeaponSMBase_C_SpawnEffects) == 0x000008, "Wrong alignment on BP_EffectWeaponSMBase_C_SpawnEffects");
static_assert(sizeof(BP_EffectWeaponSMBase_C_SpawnEffects) == 0x000078, "Wrong size on BP_EffectWeaponSMBase_C_SpawnEffects");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_GetWeaponMeshComponent_ReturnValue) == 0x000008, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_GetWeaponMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_Array_Length_ReturnValue2) == 0x000060, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000068, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_Array_AddUnique_ReturnValue) == 0x000070, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SpawnEffects, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000074, "Member 'BP_EffectWeaponSMBase_C_SpawnEffects::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_EffectWeaponSMBase.BP_EffectWeaponSMBase_C.DeactivateEffects
// 0x0020 (0x0020 - 0x0000)
struct BP_EffectWeaponSMBase_C_DeactivateEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectWeaponSMBase_C_DeactivateEffects) == 0x000008, "Wrong alignment on BP_EffectWeaponSMBase_C_DeactivateEffects");
static_assert(sizeof(BP_EffectWeaponSMBase_C_DeactivateEffects) == 0x000020, "Wrong size on BP_EffectWeaponSMBase_C_DeactivateEffects");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001C, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_DeactivateEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BP_EffectWeaponSMBase_C_DeactivateEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_EffectWeaponSMBase.BP_EffectWeaponSMBase_C.SetHiddenEffects
// 0x0038 (0x0038 - 0x0000)
struct BP_EffectWeaponSMBase_C_SetHiddenEffects final
{
public:
	bool                                          NewHidden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectWeaponSMBase_C_SetHiddenEffects) == 0x000008, "Wrong alignment on BP_EffectWeaponSMBase_C_SetHiddenEffects");
static_assert(sizeof(BP_EffectWeaponSMBase_C_SetHiddenEffects) == 0x000038, "Wrong size on BP_EffectWeaponSMBase_C_SetHiddenEffects");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, NewHidden) == 0x000000, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::NewHidden' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, Temp_int_Variable) == 0x000004, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, Temp_int_Variable2) == 0x000008, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Add_IntInt_ReturnValue2) == 0x000010, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Array_Get_Item2) == 0x000020, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Array_Length_ReturnValue2) == 0x00002C, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectWeaponSMBase_C_SetHiddenEffects, CallFunc_Less_IntInt_ReturnValue2) == 0x000031, "Member 'BP_EffectWeaponSMBase_C_SetHiddenEffects::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

}

