#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FieldPlayerController

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_FieldPlayerController.BP_FieldPlayerController_C.ExecuteUbergraph_BP_FieldPlayerController
// 0x0020 (0x0020 - 0x0000)
struct BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CanPossessPlayerControl_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable2;                             // 0x0019(0x0005)(NoDestructor)
};
static_assert(alignof(BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController) == 0x000008, "Wrong alignment on BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController");
static_assert(sizeof(BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController) == 0x000020, "Wrong size on BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController");
static_assert(offsetof(BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController, EntryPoint) == 0x000000, "Member 'BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController, Temp_struct_Variable) == 0x000008, "Member 'BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController, CallFunc_CanPossessPlayerControl_ReturnValue) == 0x000018, "Member 'BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController::CallFunc_CanPossessPlayerControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController, Temp_struct_Variable2) == 0x000019, "Member 'BP_FieldPlayerController_C_ExecuteUbergraph_BP_FieldPlayerController::Temp_struct_Variable2' has a wrong offset!");

// Function BP_FieldPlayerController.BP_FieldPlayerController_C.SetActionGuideHelpCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_FieldPlayerController_C_SetActionGuideHelpCondition final
{
public:
	bool                                          bDisable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FieldPlayerController_C_SetActionGuideHelpCondition) == 0x000001, "Wrong alignment on BP_FieldPlayerController_C_SetActionGuideHelpCondition");
static_assert(sizeof(BP_FieldPlayerController_C_SetActionGuideHelpCondition) == 0x000001, "Wrong size on BP_FieldPlayerController_C_SetActionGuideHelpCondition");
static_assert(offsetof(BP_FieldPlayerController_C_SetActionGuideHelpCondition, bDisable) == 0x000000, "Member 'BP_FieldPlayerController_C_SetActionGuideHelpCondition::bDisable' has a wrong offset!");

}

