#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_UMG

#include "Basic.hpp"

#include "ENUM_Menu_ActionFlowResult_structs.hpp"
#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.BPFLibTestSetItemId
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FLIB_UMG_C_BPFLibTestSetItemId final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemNameFromId_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_UMG_C_BPFLibTestSetItemId) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_BPFLibTestSetItemId");
static_assert(sizeof(BP_FLIB_UMG_C_BPFLibTestSetItemId) == 0x0000B0, "Wrong size on BP_FLIB_UMG_C_BPFLibTestSetItemId");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, InItemId) == 0x000000, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::InItemId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, __WorldContext) == 0x000008, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, CallFunc_GetAccessorItem_ReturnValue) == 0x000018, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, CallFunc_GetItemNameFromId_ReturnValue) == 0x000020, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::CallFunc_GetItemNameFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_BPFLibTestSetItemId, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'BP_FLIB_UMG_C_BPFLibTestSetItemId::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.DoBattleItemAction
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_UMG_C_DoBattleItemAction final
{
public:
	class UJackUMGUIActionInfo*                   InUIActionInfo;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_UMG_C_DoBattleItemAction) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_DoBattleItemAction");
static_assert(sizeof(BP_FLIB_UMG_C_DoBattleItemAction) == 0x000028, "Wrong size on BP_FLIB_UMG_C_DoBattleItemAction");
static_assert(offsetof(BP_FLIB_UMG_C_DoBattleItemAction, InUIActionInfo) == 0x000000, "Member 'BP_FLIB_UMG_C_DoBattleItemAction::InUIActionInfo' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoBattleItemAction, __WorldContext) == 0x000008, "Member 'BP_FLIB_UMG_C_DoBattleItemAction::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoBattleItemAction, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'BP_FLIB_UMG_C_DoBattleItemAction::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoBattleItemAction, CallFunc_GetAccessorBattle_ReturnValue) == 0x000018, "Member 'BP_FLIB_UMG_C_DoBattleItemAction::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoBattleItemAction, CallFunc_BattleCommandMenuItem_ReturnValue) == 0x000020, "Member 'BP_FLIB_UMG_C_DoBattleItemAction::CallFunc_BattleCommandMenuItem_ReturnValue' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.DoItemUseCommand
// 0x0180 (0x0180 - 0x0000)
struct BP_FLIB_UMG_C_DoItemUseCommand final
{
public:
	class UJackUMGUIActionInfo*                   InUIActionInfoRef;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    FlowResult;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGUIActionFlow                          UIFrow;                                            // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   UIActionInfoRef;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_DynamicCast_AsWBP_Menu_Battle_List_001;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue2;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue2;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue2;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_DynamicCast_AsWBP_Menu_Battle_List_013;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable2;                               // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable3;                               // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable4;                               // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable5;                               // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable6;                               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable7;                               // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetFirstTargetCharacter_ReturnValue;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue2;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    K2Node_Select_Default;                             // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue3;       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue4;       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    K2Node_Select2_Default;                            // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    K2Node_Select3_Default;                            // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable8;                               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    K2Node_Select4_Default;                            // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_UMG_C_DoItemUseCommand) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_DoItemUseCommand");
static_assert(sizeof(BP_FLIB_UMG_C_DoItemUseCommand) == 0x000180, "Wrong size on BP_FLIB_UMG_C_DoItemUseCommand");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, InUIActionInfoRef) == 0x000000, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::InUIActionInfoRef' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, __WorldContext) == 0x000008, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, FlowResult) == 0x000010, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::FlowResult' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, UIFrow) == 0x000011, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::UIFrow' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, UIActionInfoRef) == 0x000018, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::UIActionInfoRef' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable) == 0x000020, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorMembers_ReturnValue) == 0x000030, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorItem_ReturnValue) == 0x000038, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue2) == 0x000040, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetBagTargetChar_ReturnValue) == 0x000048, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetBagTargetChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorBattle_ReturnValue) == 0x000050, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000058, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue3) == 0x000060, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000068, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000070, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_DynamicCast_AsWBP_Menu_Battle_List_001) == 0x000078, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_DynamicCast_AsWBP_Menu_Battle_List_001' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorItem_ReturnValue2) == 0x000088, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue4) == 0x000090, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetBagTargetChar_ReturnValue2) == 0x000098, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetBagTargetChar_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorItem_ReturnValue3) == 0x0000A0, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetJackCharacterFromType_ReturnValue2) == 0x0000A8, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetJackCharacterFromType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_ActionItem_ReturnValue) == 0x0000B0, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetBagSelectedType_ReturnValue) == 0x0000B4, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0000B8, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0000C0, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue5) == 0x0000C8, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue6) == 0x0000D0, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorItem_ReturnValue4) == 0x0000D8, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorBattle_ReturnValue2) == 0x0000E0, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_ActionItem_ReturnValue2) == 0x0000E8, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_ActionItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetBagSelectedType_ReturnValue2) == 0x0000EC, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue7) == 0x0000F0, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorBattle_ReturnValue3) == 0x0000F8, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue8) == 0x000100, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorBattle_ReturnValue4) == 0x000108, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetUMGManager_ReturnValue9) == 0x000110, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetAccessorBattle_ReturnValue5) == 0x000118, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000120, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_DynamicCast_AsWBP_Menu_Battle_List_013) == 0x000128, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_DynamicCast_AsWBP_Menu_Battle_List_013' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_DynamicCast_bSuccess2) == 0x000130, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetBattleManager_ReturnValue) == 0x000138, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_IsInBattle_ReturnValue) == 0x000140, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_NotEqual_NameName_ReturnValue) == 0x000141, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000142, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable2) == 0x000143, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_BooleanOR_ReturnValue) == 0x000144, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_BattleCommandMenuItem_ReturnValue) == 0x000148, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_BattleCommandMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_SwitchName_CmpSuccess) == 0x00014C, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00014D, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable3) == 0x00014E, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_bool_Variable) == 0x00014F, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_bool_Variable2) == 0x000150, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_SwitchName2_CmpSuccess) == 0x000151, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable4) == 0x000152, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable5) == 0x000153, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable6) == 0x000154, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable7) == 0x000155, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_GetFirstTargetCharacter_ReturnValue) == 0x000158, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_GetFirstTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_BattleCommandMenuItem_ReturnValue2) == 0x000160, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_BattleCommandMenuItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000164, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_Select_Default) == 0x000165, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_BattleCommandMenuItem_ReturnValue3) == 0x000168, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_BattleCommandMenuItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_BattleCommandMenuItem_ReturnValue4) == 0x00016C, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_BattleCommandMenuItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x000170, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x000171, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_bool_Variable3) == 0x000172, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_Select2_Default) == 0x000173, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_SwitchEnum_CmpSuccess) == 0x000174, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_SwitchEnum2_CmpSuccess) == 0x000175, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_bool_Variable4) == 0x000176, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_Select3_Default) == 0x000177, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, CallFunc_NotEqual_NameName_ReturnValue3) == 0x000178, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::CallFunc_NotEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, Temp_byte_Variable8) == 0x000179, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_DoItemUseCommand, K2Node_Select4_Default) == 0x00017A, "Member 'BP_FLIB_UMG_C_DoItemUseCommand::K2Node_Select4_Default' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.SetOddEffectList
// 0x00A0 (0x00A0 - 0x0000)
struct BP_FLIB_UMG_C_SetOddEffectList final
{
public:
	class UJackUMGAccessorMembers*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                InCharType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_Buff_000_C*>     BuffPanels;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_Buff_000_C*>     BuffPanelList;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FName>                           BuffIdList;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FName>                           CallFunc_GetOddEffectIdList_ReturnValue;           // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Buff_000_C*             CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Buff_000_C*             CallFunc_Array_Get_Item3;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_UMG_C_SetOddEffectList) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_SetOddEffectList");
static_assert(sizeof(BP_FLIB_UMG_C_SetOddEffectList) == 0x0000A0, "Wrong size on BP_FLIB_UMG_C_SetOddEffectList");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, Target) == 0x000000, "Member 'BP_FLIB_UMG_C_SetOddEffectList::Target' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, InCharType) == 0x000008, "Member 'BP_FLIB_UMG_C_SetOddEffectList::InCharType' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, BuffPanels) == 0x000010, "Member 'BP_FLIB_UMG_C_SetOddEffectList::BuffPanels' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, __WorldContext) == 0x000020, "Member 'BP_FLIB_UMG_C_SetOddEffectList::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, BuffPanelList) == 0x000028, "Member 'BP_FLIB_UMG_C_SetOddEffectList::BuffPanelList' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, BuffIdList) == 0x000038, "Member 'BP_FLIB_UMG_C_SetOddEffectList::BuffIdList' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_GetOddEffectIdList_ReturnValue) == 0x000048, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_GetOddEffectIdList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_FLIB_UMG_C_SetOddEffectList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_FLIB_UMG_C_SetOddEffectList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Array_Length_ReturnValue2) == 0x000070, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, Temp_int_Array_Index_Variable2) == 0x000078, "Member 'BP_FLIB_UMG_C_SetOddEffectList::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, Temp_int_Loop_Counter_Variable2) == 0x00007C, "Member 'BP_FLIB_UMG_C_SetOddEffectList::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Array_Get_Item2) == 0x000080, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Less_IntInt_ReturnValue2) == 0x000088, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Add_IntInt_ReturnValue2) == 0x00008C, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_Array_Get_Item3) == 0x000090, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_SetOddEffectList, CallFunc_SetOddEffectId_Debuff) == 0x000098, "Member 'BP_FLIB_UMG_C_SetOddEffectList::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.GetUMGBagText
// 0x0050 (0x0050 - 0x0000)
struct BP_FLIB_UMG_C_GetUMGBagText final
{
public:
	EJackItem_Bag                                 Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NewParam;                                          // 0x0010(0x0018)(Parm, OutParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetBagNameText_OutBagName;                // 0x0038(0x0018)()
};
static_assert(alignof(BP_FLIB_UMG_C_GetUMGBagText) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_GetUMGBagText");
static_assert(sizeof(BP_FLIB_UMG_C_GetUMGBagText) == 0x000050, "Wrong size on BP_FLIB_UMG_C_GetUMGBagText");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGBagText, Selection) == 0x000000, "Member 'BP_FLIB_UMG_C_GetUMGBagText::Selection' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGBagText, __WorldContext) == 0x000008, "Member 'BP_FLIB_UMG_C_GetUMGBagText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGBagText, NewParam) == 0x000010, "Member 'BP_FLIB_UMG_C_GetUMGBagText::NewParam' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGBagText, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'BP_FLIB_UMG_C_GetUMGBagText::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGBagText, CallFunc_GetAccessorItem_ReturnValue) == 0x000030, "Member 'BP_FLIB_UMG_C_GetUMGBagText::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGBagText, CallFunc_GetBagNameText_OutBagName) == 0x000038, "Member 'BP_FLIB_UMG_C_GetUMGBagText::CallFunc_GetBagNameText_OutBagName' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.GetNearestMiniMapCameraFromPC
// 0x0080 (0x0080 - 0x0000)
struct BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC final
{
public:
	TArray<class ABP_MiniMapCamera_C*>            BP_Mini_Map_Camera_Array;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MiniMapCamera_C*                    Nearest_BP_Mini_Map_Camera;                        // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MiniMapCamera_C*                    NearestCameraCandidate;                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraDistance;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MiniMapCamera_C*                    CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC");
static_assert(sizeof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC) == 0x000080, "Wrong size on BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, BP_Mini_Map_Camera_Array) == 0x000000, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::BP_Mini_Map_Camera_Array' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, __WorldContext) == 0x000010, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, Nearest_BP_Mini_Map_Camera) == 0x000018, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::Nearest_BP_Mini_Map_Camera' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, NearestCameraCandidate) == 0x000020, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::NearestCameraCandidate' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CameraDistance) == 0x000028, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CameraDistance' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000030, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00003C, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000058, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_VSize_ReturnValue) == 0x000074, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_FLIB_UMG_C_GetNearestMiniMapCameraFromPC::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.GetUMGTargetTaneName
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_UMG_C_GetUMGTargetTaneName final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewParam;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_UMG_C_GetUMGTargetTaneName) == 0x000008, "Wrong alignment on BP_FLIB_UMG_C_GetUMGTargetTaneName");
static_assert(sizeof(BP_FLIB_UMG_C_GetUMGTargetTaneName) == 0x000020, "Wrong size on BP_FLIB_UMG_C_GetUMGTargetTaneName");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGTargetTaneName, Selection) == 0x000000, "Member 'BP_FLIB_UMG_C_GetUMGTargetTaneName::Selection' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGTargetTaneName, __WorldContext) == 0x000008, "Member 'BP_FLIB_UMG_C_GetUMGTargetTaneName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGTargetTaneName, NewParam) == 0x000010, "Member 'BP_FLIB_UMG_C_GetUMGTargetTaneName::NewParam' has a wrong offset!");
static_assert(offsetof(BP_FLIB_UMG_C_GetUMGTargetTaneName, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_FLIB_UMG_C_GetUMGTargetTaneName::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_FLIB_UMG.BP_FLIB_UMG_C.GetUMGTaneParam
// 0x0070 (0x0070 - 0x0000)
struct BP_FLIB_UMG_C_GetUMGTaneParam final
{
public:
	class UJackGameCharacter*                     Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selection;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutTaneParam;                                      // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTokugiPoint_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackGameCharacterParameters           CallFunc_GetSeedCorrectParameters_ReturnValue;     // 0x0024(0x004C)(NoDestructor)
};
