#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flag_Debug

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_Flag_Debug.BP_Flag_Debug_C.ExecuteUbergraph_BP_Flag_Debug
// 0x07F8 (0x07F8 - 0x0000)
struct BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue2;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0060(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable8;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable9;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0078(0x0018)(HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames2;        // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow2;          // 0x0100(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue2;     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames3;        // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames4;        // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item3;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableGameFlagScenario         CallFunc_GetDataTableRowFromName_OutRow3;          // 0x0178(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue3;     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow4;          // 0x01C0(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue4;     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames5;        // 0x0208(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable8;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item5;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableGameFlagCutScene         CallFunc_GetDataTableRowFromName_OutRow5;          // 0x0228(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue5;     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames6;        // 0x0278(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item6;                          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow6;          // 0x0298(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue6;     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x02E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x02F8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x0310(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable;                              // 0x0330(0x0018)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue2;               // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key5;                         // 0x0358(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key6;                         // 0x0388(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x03A4(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable2;                             // 0x03A8(0x0018)(HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key7;                         // 0x03C8(0x0018)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue3;               // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key8;                         // 0x03F0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue10;                 // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue11;                 // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue4;             // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue8;                 // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue5;             // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0460(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue3;           // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameFlagInt_ReturnValue;               // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue4;           // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameFlagFloat_ReturnValue;             // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key9;                         // 0x0538(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key10;                        // 0x0560(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue5;           // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x05A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CA[0x2];                                      // 0x05CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameFlagInt_ReturnValue2;              // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x3];                                      // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue12;                 // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameFlagFloat_ReturnValue2;            // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue3;             // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameFlagInt_ReturnValue3;              // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameFlagFloat_ReturnValue3;            // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue6;             // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames7;        // 0x05F8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item7;                          // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow7;          // 0x0620(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue7;     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue9;                 // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65B[0x5];                                      // 0x065B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario;    // 0x0660(0x0010)(NoDestructor)
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario2;   // 0x0670(0x0010)(NoDestructor)
	bool                                          CallFunc_GetScenarioFlag_Flag;                     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_682[0x2];                                      // 0x0682(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDebugFontSize_DebugFontSize;           // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeHalfWidthX;      // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeFullWidthX;      // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeY;               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario3;   // 0x0698(0x0010)(NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario4;   // 0x06B0(0x0010)(NoDestructor)
	bool                                          CallFunc_GetScenarioFlag_Flag2;                    // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable9;                   // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue10;                // 0x06CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD[0x3];                                      // 0x06CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue13;                 // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DebugConvertViewportPosition_CalcPositionX; // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DebugConvertViewportPosition_CalcPositionY; // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames8;        // 0x06E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item8;                          // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow8;          // 0x0700(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue8;     // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue11;                // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73A[0x6];                                      // 0x073A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames9;        // 0x0740(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item9;                          // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_GameFlagDataCutScene          K2Node_MakeStruct_JackLDT_GameFlagDataCutScene;    // 0x0758(0x0010)(NoDestructor)
	struct FJackDataTableGameFlag                 CallFunc_GetDataTableRowFromName_OutRow9;          // 0x0768(0x0038)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue9;     // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataCutScene          K2Node_MakeStruct_JackLDT_GameFlagDataCutScene2;   // 0x07A8(0x0010)(NoDestructor)
	bool                                          CallFunc_GetCutSceneFlag_Flag;                     // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue12;                // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeX;                    // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeY;                    // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_DebugFontSize2;          // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeHalfWidthX2;     // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeFullWidthX2;     // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDebugFontSize_CharSizeY2;              // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue2;           // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug) == 0x000008, "Wrong alignment on BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug");
static_assert(sizeof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug) == 0x0007F8, "Wrong size on BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, EntryPoint) == 0x000000, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetValidValue_ReturnValue) == 0x000011, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable2) == 0x00001C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable3) == 0x000020, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable2) == 0x000024, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable3) == 0x000028, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue2) == 0x00002C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue3) == 0x000030, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable4) == 0x000034, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable5) == 0x000038, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable4) == 0x00003C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue4) == 0x000040, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable6) == 0x000044, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable5) == 0x000048, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable6) == 0x00004C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue5) == 0x000050, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue6) == 0x000054, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable7) == 0x000058, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable7' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_MakeLiteralInt_ReturnValue2) == 0x00005C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_MakeLiteralInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_MakeStruct_Color) == 0x000060, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable8) == 0x000064, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable8' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable7) == 0x000068, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable7' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue7) == 0x00006C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Array_Index_Variable9) == 0x000070, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Array_Index_Variable9' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_InputKeyEvent_Key) == 0x000078, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000090, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowNames_OutRowNames2) == 0x0000A0, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowNames_OutRowNames2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Get_Item2) == 0x0000B8, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000C0, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F8, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_OutRow2) == 0x000100, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_OutRow2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_ReturnValue2) == 0x000138, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Length_ReturnValue) == 0x00013C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Length_ReturnValue2) == 0x000140, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowNames_OutRowNames3) == 0x000148, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowNames_OutRowNames3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowNames_OutRowNames4) == 0x000158, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowNames_OutRowNames4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Get_Item3) == 0x000168, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Get_Item4) == 0x000170, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_OutRow3) == 0x000178, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_OutRow3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_ReturnValue3) == 0x0001B8, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_OutRow4) == 0x0001C0, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_OutRow4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_ReturnValue4) == 0x0001F8, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Length_ReturnValue3) == 0x0001FC, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Length_ReturnValue4) == 0x000200, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Less_IntInt_ReturnValue) == 0x000204, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Less_IntInt_ReturnValue2) == 0x000205, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowNames_OutRowNames5) == 0x000208, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowNames_OutRowNames5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_int_Loop_Counter_Variable8) == 0x000218, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_int_Loop_Counter_Variable8' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Get_Item5) == 0x000220, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_OutRow5) == 0x000228, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_OutRow5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_ReturnValue5) == 0x000268, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Less_IntInt_ReturnValue3) == 0x000269, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_IntInt_ReturnValue8) == 0x00026C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Length_ReturnValue5) == 0x000270, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowNames_OutRowNames6) == 0x000278, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowNames_OutRowNames6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Less_IntInt_ReturnValue4) == 0x000288, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Get_Item6) == 0x000290, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_OutRow6) == 0x000298, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_OutRow6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetDataTableRowFromName_ReturnValue6) == 0x0002D0, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetDataTableRowFromName_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Array_Length_ReturnValue6) == 0x0002D4, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Less_IntInt_ReturnValue5) == 0x0002D8, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_InputKeyEvent_Key2) == 0x0002E0, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_InputKeyEvent_Key3) == 0x0002F8, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_InputKeyEvent_Key4) == 0x000310, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_Event_DeltaSeconds) == 0x000328, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, K2Node_SwitchEnum_CmpSuccess) == 0x00032C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Add_ByteByte_ReturnValue) == 0x00032D, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, Temp_struct_Variable) == 0x000330, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_GetValidValue_ReturnValue2) == 0x000348, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_GetValidValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00034C, "Member 'BP_Flag_Debug_C_ExecuteUbergraph_BP_Flag_Debug::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
