#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_Event

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "ENUM_ScenarioNum_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_Event.BP_FLIB_Event_C.AddHeroTokugiForAwakening
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_AddHeroTokugiForAwakening final
{
public:
	class FName                                   bpp__AddHeroTokugi__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__PoweupTokugiName__pf;                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_AddHeroTokugiForAwakening) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_AddHeroTokugiForAwakening");
static_assert(sizeof(BP_FLIB_Event_C_AddHeroTokugiForAwakening) == 0x000018, "Wrong size on BP_FLIB_Event_C_AddHeroTokugiForAwakening");
static_assert(offsetof(BP_FLIB_Event_C_AddHeroTokugiForAwakening, bpp__AddHeroTokugi__pf) == 0x000000, "Member 'BP_FLIB_Event_C_AddHeroTokugiForAwakening::bpp__AddHeroTokugi__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_AddHeroTokugiForAwakening, bpp__PoweupTokugiName__pf) == 0x000008, "Member 'BP_FLIB_Event_C_AddHeroTokugiForAwakening::bpp__PoweupTokugiName__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_AddHeroTokugiForAwakening, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_AddHeroTokugiForAwakening::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.AppendZenkeiInitializeWaitNPC
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC final
{
public:
	TArray<class AActor*>                         bpp__ZenkeiCSInitializeWaitVolume__pf;             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AJackScheduledNPC*>              bpp__InitializeWaitNPC__pf;                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC");
static_assert(sizeof(BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC) == 0x000028, "Wrong size on BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC");
static_assert(offsetof(BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC, bpp__ZenkeiCSInitializeWaitVolume__pf) == 0x000000, "Member 'BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC::bpp__ZenkeiCSInitializeWaitVolume__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC, bpp__InitializeWaitNPC__pf) == 0x000018, "Member 'BP_FLIB_Event_C_AppendZenkeiInitializeWaitNPC::bpp__InitializeWaitNPC__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.B030_40_ClearCheck
// 0x0008 (0x0008 - 0x0000)
struct BP_FLIB_Event_C_B030_40_ClearCheck final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_B030_40_ClearCheck) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_B030_40_ClearCheck");
static_assert(sizeof(BP_FLIB_Event_C_B030_40_ClearCheck) == 0x000008, "Wrong size on BP_FLIB_Event_C_B030_40_ClearCheck");
static_assert(offsetof(BP_FLIB_Event_C_B030_40_ClearCheck, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_B030_40_ClearCheck::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.CallDiscardItem_Integrate
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Event_C_CallDiscardItem_Integrate final
{
public:
	struct FJackLDT_ItemTable                     bpp__ItemID__pf;                                   // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         bpp__SubCount__pf;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Out__pf;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_CallDiscardItem_Integrate) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_CallDiscardItem_Integrate");
static_assert(sizeof(BP_FLIB_Event_C_CallDiscardItem_Integrate) == 0x000028, "Wrong size on BP_FLIB_Event_C_CallDiscardItem_Integrate");
static_assert(offsetof(BP_FLIB_Event_C_CallDiscardItem_Integrate, bpp__ItemID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_CallDiscardItem_Integrate::bpp__ItemID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_CallDiscardItem_Integrate, bpp__SubCount__pf) == 0x000010, "Member 'BP_FLIB_Event_C_CallDiscardItem_Integrate::bpp__SubCount__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_CallDiscardItem_Integrate, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_Event_C_CallDiscardItem_Integrate::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_CallDiscardItem_Integrate, bpp__Out__pf) == 0x000020, "Member 'BP_FLIB_Event_C_CallDiscardItem_Integrate::bpp__Out__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.CallHasAllOrbs
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_CallHasAllOrbs final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Out__pf;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_CallHasAllOrbs) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_CallHasAllOrbs");
static_assert(sizeof(BP_FLIB_Event_C_CallHasAllOrbs) == 0x000010, "Wrong size on BP_FLIB_Event_C_CallHasAllOrbs");
static_assert(offsetof(BP_FLIB_Event_C_CallHasAllOrbs, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_CallHasAllOrbs::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_CallHasAllOrbs, bpp__Out__pf) == 0x000008, "Member 'BP_FLIB_Event_C_CallHasAllOrbs::bpp__Out__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.CheckM01Fukkou
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_CheckM01Fukkou final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Fukkou__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_CheckM01Fukkou) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_CheckM01Fukkou");
static_assert(sizeof(BP_FLIB_Event_C_CheckM01Fukkou) == 0x000010, "Wrong size on BP_FLIB_Event_C_CheckM01Fukkou");
static_assert(offsetof(BP_FLIB_Event_C_CheckM01Fukkou, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_CheckM01Fukkou::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_CheckM01Fukkou, bpp__Fukkou__pf) == 0x000008, "Member 'BP_FLIB_Event_C_CheckM01Fukkou::bpp__Fukkou__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.CheckMapPartnerTuijyu
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_CheckMapPartnerTuijyu final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__UseMapID__pf;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_CheckMapPartnerTuijyu) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_CheckMapPartnerTuijyu");
static_assert(sizeof(BP_FLIB_Event_C_CheckMapPartnerTuijyu) == 0x000010, "Wrong size on BP_FLIB_Event_C_CheckMapPartnerTuijyu");
static_assert(offsetof(BP_FLIB_Event_C_CheckMapPartnerTuijyu, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_CheckMapPartnerTuijyu::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_CheckMapPartnerTuijyu, bpp__UseMapID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_CheckMapPartnerTuijyu::bpp__UseMapID__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.ClearSaveSettings
// 0x0008 (0x0008 - 0x0000)
struct BP_FLIB_Event_C_ClearSaveSettings final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_ClearSaveSettings) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_ClearSaveSettings");
static_assert(sizeof(BP_FLIB_Event_C_ClearSaveSettings) == 0x000008, "Wrong size on BP_FLIB_Event_C_ClearSaveSettings");
static_assert(offsetof(BP_FLIB_Event_C_ClearSaveSettings, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_ClearSaveSettings::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.ConvertSenaLongHair
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_ConvertSenaLongHair final
{
public:
	class FName                                   bpp__CoordinateID__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__LongHairCoordinate__pf;                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_ConvertSenaLongHair) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_ConvertSenaLongHair");
static_assert(sizeof(BP_FLIB_Event_C_ConvertSenaLongHair) == 0x000018, "Wrong size on BP_FLIB_Event_C_ConvertSenaLongHair");
static_assert(offsetof(BP_FLIB_Event_C_ConvertSenaLongHair, bpp__CoordinateID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_ConvertSenaLongHair::bpp__CoordinateID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_ConvertSenaLongHair, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Event_C_ConvertSenaLongHair::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_ConvertSenaLongHair, bpp__LongHairCoordinate__pf) == 0x000010, "Member 'BP_FLIB_Event_C_ConvertSenaLongHair::bpp__LongHairCoordinate__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.ConvertSenaShortHair
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_ConvertSenaShortHair final
{
public:
	class FName                                   bpp__CoordinateID__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ShortHairCoordinate__pf;                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_ConvertSenaShortHair) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_ConvertSenaShortHair");
static_assert(sizeof(BP_FLIB_Event_C_ConvertSenaShortHair) == 0x000018, "Wrong size on BP_FLIB_Event_C_ConvertSenaShortHair");
static_assert(offsetof(BP_FLIB_Event_C_ConvertSenaShortHair, bpp__CoordinateID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_ConvertSenaShortHair::bpp__CoordinateID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_ConvertSenaShortHair, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Event_C_ConvertSenaShortHair::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_ConvertSenaShortHair, bpp__ShortHairCoordinate__pf) == 0x000010, "Member 'BP_FLIB_Event_C_ConvertSenaShortHair::bpp__ShortHairCoordinate__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.Convert Rura
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_Convert_Rura final
{
public:
	class FName                                   bpp__From__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__To__pf;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_Convert_Rura) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_Convert_Rura");
static_assert(sizeof(BP_FLIB_Event_C_Convert_Rura) == 0x000018, "Wrong size on BP_FLIB_Event_C_Convert_Rura");
static_assert(offsetof(BP_FLIB_Event_C_Convert_Rura, bpp__From__pf) == 0x000000, "Member 'BP_FLIB_Event_C_Convert_Rura::bpp__From__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_Convert_Rura, bpp__To__pf) == 0x000008, "Member 'BP_FLIB_Event_C_Convert_Rura::bpp__To__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_Convert_Rura, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_Convert_Rura::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.DisableCS AfterWeatherEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_FLIB_Event_C_DisableCS_AfterWeatherEffect final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_DisableCS_AfterWeatherEffect) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_DisableCS_AfterWeatherEffect");
static_assert(sizeof(BP_FLIB_Event_C_DisableCS_AfterWeatherEffect) == 0x000008, "Wrong size on BP_FLIB_Event_C_DisableCS_AfterWeatherEffect");
static_assert(offsetof(BP_FLIB_Event_C_DisableCS_AfterWeatherEffect, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_DisableCS_AfterWeatherEffect::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.DisablePartyTalk
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_DisablePartyTalk final
{
public:
	struct FJackLDT_GameFlagDataCutScene          bpp__CutSceneFlag__pf;                             // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_DisablePartyTalk) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_DisablePartyTalk");
static_assert(sizeof(BP_FLIB_Event_C_DisablePartyTalk) == 0x000018, "Wrong size on BP_FLIB_Event_C_DisablePartyTalk");
static_assert(offsetof(BP_FLIB_Event_C_DisablePartyTalk, bpp__CutSceneFlag__pf) == 0x000000, "Member 'BP_FLIB_Event_C_DisablePartyTalk::bpp__CutSceneFlag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_DisablePartyTalk, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_DisablePartyTalk::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.EnablePartyTalk
// 0x0008 (0x0008 - 0x0000)
struct BP_FLIB_Event_C_EnablePartyTalk final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_EnablePartyTalk) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_EnablePartyTalk");
static_assert(sizeof(BP_FLIB_Event_C_EnablePartyTalk) == 0x000008, "Wrong size on BP_FLIB_Event_C_EnablePartyTalk");
static_assert(offsetof(BP_FLIB_Event_C_EnablePartyTalk, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_EnablePartyTalk::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.FriendPartyInSetting
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_FriendPartyInSetting final
{
public:
	EJackCharacter                                bpp__Character__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_FriendCharacterPreset         bpp__Preset__pf;                                   // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_FriendPartyInSetting) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_FriendPartyInSetting");
static_assert(sizeof(BP_FLIB_Event_C_FriendPartyInSetting) == 0x000020, "Wrong size on BP_FLIB_Event_C_FriendPartyInSetting");
static_assert(offsetof(BP_FLIB_Event_C_FriendPartyInSetting, bpp__Character__pf) == 0x000000, "Member 'BP_FLIB_Event_C_FriendPartyInSetting::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_FriendPartyInSetting, bpp__Preset__pf) == 0x000008, "Member 'BP_FLIB_Event_C_FriendPartyInSetting::bpp__Preset__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_FriendPartyInSetting, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_Event_C_FriendPartyInSetting::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetCutSceneFlag
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetCutSceneFlag final
{
public:
	struct FJackLDT_GameFlagDataCutScene          bpp__CutScene__pf;                                 // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Flag__pf;                                     // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetCutSceneFlag) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetCutSceneFlag");
static_assert(sizeof(BP_FLIB_Event_C_GetCutSceneFlag) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetCutSceneFlag");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlag, bpp__CutScene__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetCutSceneFlag::bpp__CutScene__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlag, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetCutSceneFlag::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlag, bpp__Flag__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetCutSceneFlag::bpp__Flag__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetCutSceneFlagCheckState
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Event_C_GetCutSceneFlagCheckState final
{
public:
	TArray<struct FJackLDT_GameFlagDataCutScene>  bpp__CutSceneFlag__pf;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bpp__AndCheck__pf;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__FlagDefault__pf;                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Flag__pf;                                     // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetCutSceneFlagCheckState) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetCutSceneFlagCheckState");
static_assert(sizeof(BP_FLIB_Event_C_GetCutSceneFlagCheckState) == 0x000028, "Wrong size on BP_FLIB_Event_C_GetCutSceneFlagCheckState");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlagCheckState, bpp__CutSceneFlag__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetCutSceneFlagCheckState::bpp__CutSceneFlag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlagCheckState, bpp__AndCheck__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetCutSceneFlagCheckState::bpp__AndCheck__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlagCheckState, bpp__FlagDefault__pf) == 0x000011, "Member 'BP_FLIB_Event_C_GetCutSceneFlagCheckState::bpp__FlagDefault__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlagCheckState, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetCutSceneFlagCheckState::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetCutSceneFlagCheckState, bpp__Flag__pf) == 0x000020, "Member 'BP_FLIB_Event_C_GetCutSceneFlagCheckState::bpp__Flag__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetDirectBranchDefaultIDs
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetDirectBranchDefaultIDs final
{
public:
	class FName                                   bpp__UseMapID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           bpp__NewParam__pf;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetDirectBranchDefaultIDs) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetDirectBranchDefaultIDs");
static_assert(sizeof(BP_FLIB_Event_C_GetDirectBranchDefaultIDs) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetDirectBranchDefaultIDs");
static_assert(offsetof(BP_FLIB_Event_C_GetDirectBranchDefaultIDs, bpp__UseMapID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetDirectBranchDefaultIDs::bpp__UseMapID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetDirectBranchDefaultIDs, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetDirectBranchDefaultIDs::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetDirectBranchDefaultIDs, bpp__NewParam__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetDirectBranchDefaultIDs::bpp__NewParam__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetEmaExceptionBehaviorBranchID
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ID__pf;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID");
static_assert(sizeof(BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID) == 0x000010, "Wrong size on BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID");
static_assert(offsetof(BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID, bpp__ID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetEmaExceptionBehaviorBranchID::bpp__ID__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetFriendPartyBehaviorBranchID
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID final
{
public:
	EJackCharacter                                bpp__InID__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__UseMapID__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ID__pf;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID");
static_assert(sizeof(BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID");
static_assert(offsetof(BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID, bpp__InID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID::bpp__InID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID, bpp__UseMapID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID::bpp__UseMapID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID, bpp__ID__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetFriendPartyBehaviorBranchID::bpp__ID__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetIssyoPartner
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_GetIssyoPartner final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Partner__pf;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetIssyoPartner) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetIssyoPartner");
static_assert(sizeof(BP_FLIB_Event_C_GetIssyoPartner) == 0x000010, "Wrong size on BP_FLIB_Event_C_GetIssyoPartner");
static_assert(offsetof(BP_FLIB_Event_C_GetIssyoPartner, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetIssyoPartner::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetIssyoPartner, bpp__Partner__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetIssyoPartner::bpp__Partner__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetIssyoPartnerCharacterType
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_GetIssyoPartnerCharacterType final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackCharacter                                bpp__PartnerCharacterType__pf;                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetIssyoPartnerCharacterType) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetIssyoPartnerCharacterType");
static_assert(sizeof(BP_FLIB_Event_C_GetIssyoPartnerCharacterType) == 0x000010, "Wrong size on BP_FLIB_Event_C_GetIssyoPartnerCharacterType");
static_assert(offsetof(BP_FLIB_Event_C_GetIssyoPartnerCharacterType, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetIssyoPartnerCharacterType::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetIssyoPartnerCharacterType, bpp__PartnerCharacterType__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetIssyoPartnerCharacterType::bpp__PartnerCharacterType__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetItemIDFromDataTable
// 0x0068 (0x0068 - 0x0000)
struct BP_FLIB_Event_C_GetItemIDFromDataTable final
{
public:
	struct FJackDataTableItem_EventGet            bpp__DataTable__pf;                                // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJackLDT_ItemTable                     bpp__ItemID__pf;                                   // 0x0058(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetItemIDFromDataTable) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetItemIDFromDataTable");
static_assert(sizeof(BP_FLIB_Event_C_GetItemIDFromDataTable) == 0x000068, "Wrong size on BP_FLIB_Event_C_GetItemIDFromDataTable");
static_assert(offsetof(BP_FLIB_Event_C_GetItemIDFromDataTable, bpp__DataTable__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetItemIDFromDataTable::bpp__DataTable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetItemIDFromDataTable, bpp____WorldContext__pf) == 0x000050, "Member 'BP_FLIB_Event_C_GetItemIDFromDataTable::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetItemIDFromDataTable, bpp__ItemID__pf) == 0x000058, "Member 'BP_FLIB_Event_C_GetItemIDFromDataTable::bpp__ItemID__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetKamyuExceptionBehaviorBranchID
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NewParam__pf;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID");
static_assert(sizeof(BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID) == 0x000010, "Wrong size on BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID");
static_assert(offsetof(BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID, bpp__NewParam__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetKamyuExceptionBehaviorBranchID::bpp__NewParam__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetNerusenBattleTurnCountSrc
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc final
{
public:
	struct FJackLDT_EventBattle                   bpp__ID__pf;                                       // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Point__pf;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc");
static_assert(sizeof(BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc");
static_assert(offsetof(BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc, bpp__ID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc::bpp__ID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc, bpp__Point__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetNerusenBattleTurnCountSrc::bpp__Point__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetOmoideCsID
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetOmoideCsID final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__OmoideCsID__pf;                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__OmoideCs__pf;                                 // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetOmoideCsID) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetOmoideCsID");
static_assert(sizeof(BP_FLIB_Event_C_GetOmoideCsID) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetOmoideCsID");
static_assert(offsetof(BP_FLIB_Event_C_GetOmoideCsID, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetOmoideCsID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetOmoideCsID, bpp__OmoideCsID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetOmoideCsID::bpp__OmoideCsID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetOmoideCsID, bpp__OmoideCs__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetOmoideCsID::bpp__OmoideCs__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetOrbsAllGetFlag
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_GetOrbsAllGetFlag final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJackLDT_GameFlagDataScenario          bpp__Flag__pf;                                     // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetOrbsAllGetFlag) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetOrbsAllGetFlag");
static_assert(sizeof(BP_FLIB_Event_C_GetOrbsAllGetFlag) == 0x000018, "Wrong size on BP_FLIB_Event_C_GetOrbsAllGetFlag");
static_assert(offsetof(BP_FLIB_Event_C_GetOrbsAllGetFlag, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetOrbsAllGetFlag::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetOrbsAllGetFlag, bpp__Flag__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetOrbsAllGetFlag::bpp__Flag__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetPafuPafuRandomValue
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetPafuPafuRandomValue final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           bpp__TextID__pf;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   bpp__SExTrackName__pfT;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetPafuPafuRandomValue) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetPafuPafuRandomValue");
static_assert(sizeof(BP_FLIB_Event_C_GetPafuPafuRandomValue) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetPafuPafuRandomValue");
static_assert(offsetof(BP_FLIB_Event_C_GetPafuPafuRandomValue, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetPafuPafuRandomValue::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPafuPafuRandomValue, bpp__TextID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetPafuPafuRandomValue::bpp__TextID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPafuPafuRandomValue, bpp__SExTrackName__pfT) == 0x000018, "Member 'BP_FLIB_Event_C_GetPafuPafuRandomValue::bpp__SExTrackName__pfT' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetPartnerTsuijyuBehaviorBranchID
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID final
{
public:
	EJackCharacter                                bpp__InID__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__UseMapID__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ID__pf;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID");
static_assert(sizeof(BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID");
static_assert(offsetof(BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID, bpp__InID__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID::bpp__InID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID, bpp__UseMapID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID::bpp__UseMapID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID, bpp__ID__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetPartnerTsuijyuBehaviorBranchID::bpp__ID__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetPartyCoordinate
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_GetPartyCoordinate final
{
public:
	EJackCharacter                                bpp__Character__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Coordinate__pf;                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetPartyCoordinate) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetPartyCoordinate");
static_assert(sizeof(BP_FLIB_Event_C_GetPartyCoordinate) == 0x000018, "Wrong size on BP_FLIB_Event_C_GetPartyCoordinate");
static_assert(offsetof(BP_FLIB_Event_C_GetPartyCoordinate, bpp__Character__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetPartyCoordinate::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPartyCoordinate, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetPartyCoordinate::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPartyCoordinate, bpp__Coordinate__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetPartyCoordinate::bpp__Coordinate__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetPlayerWeaponInfo
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Event_C_GetPlayerWeaponInfo final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__MainWeaponItemID__pf;                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__MainWeaponSocket__pf;                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SubWeaponItemID__pf;                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SubWeaponSocket__pf;                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetPlayerWeaponInfo) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetPlayerWeaponInfo");
static_assert(sizeof(BP_FLIB_Event_C_GetPlayerWeaponInfo) == 0x000028, "Wrong size on BP_FLIB_Event_C_GetPlayerWeaponInfo");
static_assert(offsetof(BP_FLIB_Event_C_GetPlayerWeaponInfo, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetPlayerWeaponInfo::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPlayerWeaponInfo, bpp__MainWeaponItemID__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetPlayerWeaponInfo::bpp__MainWeaponItemID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPlayerWeaponInfo, bpp__MainWeaponSocket__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetPlayerWeaponInfo::bpp__MainWeaponSocket__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPlayerWeaponInfo, bpp__SubWeaponItemID__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetPlayerWeaponInfo::bpp__SubWeaponItemID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetPlayerWeaponInfo, bpp__SubWeaponSocket__pf) == 0x000020, "Member 'BP_FLIB_Event_C_GetPlayerWeaponInfo::bpp__SubWeaponSocket__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetProgressEventState
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetProgressEventState final
{
public:
	struct FJackLDT_GameFlagDataGameProgress      bpp__NewParam__pf;                                 // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__State__pf;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetProgressEventState) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetProgressEventState");
static_assert(sizeof(BP_FLIB_Event_C_GetProgressEventState) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetProgressEventState");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressEventState, bpp__NewParam__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetProgressEventState::bpp__NewParam__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressEventState, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetProgressEventState::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressEventState, bpp__State__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetProgressEventState::bpp__State__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetProgressFlag
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetProgressFlag final
{
public:
	struct FJackLDT_GameFlagDataGameProgress      bpp__GameProgress__pf;                             // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Flag__pf;                                     // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetProgressFlag) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetProgressFlag");
static_assert(sizeof(BP_FLIB_Event_C_GetProgressFlag) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetProgressFlag");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressFlag, bpp__GameProgress__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetProgressFlag::bpp__GameProgress__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressFlag, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetProgressFlag::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressFlag, bpp__Flag__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetProgressFlag::bpp__Flag__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetProgressScenarioFlags
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_GetProgressScenarioFlags final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           bpp__OutxFlags__pfT;                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetProgressScenarioFlags) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetProgressScenarioFlags");
static_assert(sizeof(BP_FLIB_Event_C_GetProgressScenarioFlags) == 0x000018, "Wrong size on BP_FLIB_Event_C_GetProgressScenarioFlags");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressScenarioFlags, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetProgressScenarioFlags::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressScenarioFlags, bpp__OutxFlags__pfT) == 0x000008, "Member 'BP_FLIB_Event_C_GetProgressScenarioFlags::bpp__OutxFlags__pfT' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetProgressScenarioNum
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Event_C_GetProgressScenarioNum final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__ScenarioNum__pf;                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Event_C_GetProgressScenarioNum) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetProgressScenarioNum");
static_assert(sizeof(BP_FLIB_Event_C_GetProgressScenarioNum) == 0x000018, "Wrong size on BP_FLIB_Event_C_GetProgressScenarioNum");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressScenarioNum, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetProgressScenarioNum::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetProgressScenarioNum, bpp__ScenarioNum__pf) == 0x000008, "Member 'BP_FLIB_Event_C_GetProgressScenarioNum::bpp__ScenarioNum__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetScenarioCount
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetScenarioCount final
{
public:
	struct FJackLDT_GameFlagDataScenario          bpp__Scenario__pf;                                 // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Count__pf;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetScenarioCount) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetScenarioCount");
static_assert(sizeof(BP_FLIB_Event_C_GetScenarioCount) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetScenarioCount");
static_assert(offsetof(BP_FLIB_Event_C_GetScenarioCount, bpp__Scenario__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetScenarioCount::bpp__Scenario__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetScenarioCount, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetScenarioCount::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetScenarioCount, bpp__Count__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetScenarioCount::bpp__Count__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetScenarioFlag
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Event_C_GetScenarioFlag final
{
public:
	struct FJackLDT_GameFlagDataScenario          bpp__Scenario__pf;                                 // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Flag__pf;                                     // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Event_C_GetScenarioFlag) == 0x000008, "Wrong alignment on BP_FLIB_Event_C_GetScenarioFlag");
static_assert(sizeof(BP_FLIB_Event_C_GetScenarioFlag) == 0x000020, "Wrong size on BP_FLIB_Event_C_GetScenarioFlag");
static_assert(offsetof(BP_FLIB_Event_C_GetScenarioFlag, bpp__Scenario__pf) == 0x000000, "Member 'BP_FLIB_Event_C_GetScenarioFlag::bpp__Scenario__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetScenarioFlag, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Event_C_GetScenarioFlag::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Event_C_GetScenarioFlag, bpp__Flag__pf) == 0x000018, "Member 'BP_FLIB_Event_C_GetScenarioFlag::bpp__Flag__pf' has a wrong offset!");

// Function BP_FLIB_Event.BP_FLIB_Event_C.GetScenarioFlagCheckState
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Event_C_GetScenarioFlagCheckState final
{
public:
	TArray<struct FJackLDT_GameFlagDataScenario>  bpp__ScenarioFlag__pf;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bpp__AndCheck__pf;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__FlagDefault__pf;                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 bpp__CheckActor__pf;                               // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
