#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_PlayerController

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.UpdateGroundAffects
// 0x00F0 (0x00F0 - 0x0000)
struct BP_FLIB_PlayerController_C_UpdateGroundAffects final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackGroundAffectComponent*>     TmpJackGroundAffect;                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class AJackCharacter*>                 TmpJackCharacter;                                  // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Index_0;                                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 CallFunc_GetGuestNPCCharacters_ReturnValue;        // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackGroundAffectComponent*>     CallFunc_GetComponentsByClass_ReturnValue;         // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGroundAffectComponent*             CallFunc_Array_Get_Item2;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackGroundAffectComponent*>     CallFunc_GetComponentsByClass_ReturnValue2;        // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGroundAffectComponent*             CallFunc_Array_Get_Item3;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x00DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_UpdateGroundAffects) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_UpdateGroundAffects");
static_assert(sizeof(BP_FLIB_PlayerController_C_UpdateGroundAffects) == 0x0000F0, "Wrong size on BP_FLIB_PlayerController_C_UpdateGroundAffects");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, PlayerController) == 0x000000, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, __WorldContext) == 0x000008, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, TmpJackGroundAffect) == 0x000010, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::TmpJackGroundAffect' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, TmpJackCharacter) == 0x000020, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::TmpJackCharacter' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Index_0) == 0x000030, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Index_0' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_GetGuestNPCCharacters_ReturnValue) == 0x000038, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_GetGuestNPCCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_K2_GetPawn_ReturnValue) == 0x000050, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000059, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_GetComponentsByClass_ReturnValue) == 0x000060, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Temp_int_Loop_Counter_Variable2) == 0x000074, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Add_IntInt_ReturnValue2) == 0x000078, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Temp_int_Loop_Counter_Variable3) == 0x000080, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Add_IntInt_ReturnValue3) == 0x000088, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Temp_int_Array_Index_Variable2) == 0x00008C, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Array_Get_Item2) == 0x000098, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_GetComponentsByClass_ReturnValue2) == 0x0000A0, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_GetComponentsByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Array_Length_ReturnValue2) == 0x0000BC, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Less_IntInt_ReturnValue2) == 0x0000C0, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, Temp_int_Array_Index_Variable3) == 0x0000C4, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Array_Length_ReturnValue3) == 0x0000C8, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Array_Get_Item3) == 0x0000D0, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Less_IntInt_ReturnValue3) == 0x0000D8, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x0000DC, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Add_IntInt_ReturnValue4) == 0x0000E8, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_UpdateGroundAffects, CallFunc_Add_IntInt_ReturnValue5) == 0x0000EC, "Member 'BP_FLIB_PlayerController_C_UpdateGroundAffects::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.SetFootLocationMaterialParameter
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParameterValue;                                    // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x001C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter");
static_assert(sizeof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter) == 0x000030, "Wrong size on BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter, Index_0) == 0x000000, "Member 'BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter::Index_0' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter, ParameterValue) == 0x000004, "Member 'BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter::ParameterValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter, __WorldContext) == 0x000010, "Member 'BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00001C, "Member 'BP_FLIB_PlayerController_C_SetFootLocationMaterialParameter::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.SetPartyOddEffect
// 0x0080 (0x0080 - 0x0000)
struct BP_FLIB_PlayerController_C_SetPartyOddEffect final
{
public:
	struct FJackLDT_OddEffect                     InOddEffect;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackFriendGameCharacter*>       TmpJackFriendGameCharacter;                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UJackGameCharacter*>             TempChaArray;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackFriendGameCharacter*>       CallFunc_GetPartyMembers_ReturnValue;              // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_SetPartyOddEffect) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_SetPartyOddEffect");
static_assert(sizeof(BP_FLIB_PlayerController_C_SetPartyOddEffect) == 0x000080, "Wrong size on BP_FLIB_PlayerController_C_SetPartyOddEffect");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, InOddEffect) == 0x000000, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::InOddEffect' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, __WorldContext) == 0x000010, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, TmpJackFriendGameCharacter) == 0x000018, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::TmpJackFriendGameCharacter' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, TempChaArray) == 0x000028, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::TempChaArray' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_GetJackGamePlayer_ReturnValue) == 0x000038, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_GetJackGamePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_GetPartyMembers_ReturnValue) == 0x000048, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_GetPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_GetCharacterType_ReturnValue) == 0x000068, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_GetGameCharacter_ReturnValue) == 0x000070, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetPartyOddEffect, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'BP_FLIB_PlayerController_C_SetPartyOddEffect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.SetCharaOddEffectCore
// 0x0050 (0x0050 - 0x0000)
struct BP_FLIB_PlayerController_C_SetCharaOddEffectCore final
{
public:
	TArray<class UJackGameCharacter*>             CharaArray;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	struct FJackLDT_OddEffect                     InOddEffect;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackOddEffectManager*                  CallFunc_GetOddEffectManager_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_SetCharaOddEffectCore");
static_assert(sizeof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore) == 0x000050, "Wrong size on BP_FLIB_PlayerController_C_SetCharaOddEffectCore");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CharaArray) == 0x000000, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CharaArray' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, InOddEffect) == 0x000010, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::InOddEffect' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, __WorldContext) == 0x000020, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CallFunc_GetOddEffectManager_ReturnValue) == 0x000028, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CallFunc_GetOddEffectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffectCore, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffectCore::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.SetCharaOddEffect
// 0x0060 (0x0060 - 0x0000)
struct BP_FLIB_PlayerController_C_SetCharaOddEffect final
{
public:
	TArray<EJackCharacter>                        CharaIDArray;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	struct FJackLDT_OddEffect                     InOddEffect;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackGameCharacter*>             TempChaArray;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_Array_Get_Item;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_SetCharaOddEffect) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_SetCharaOddEffect");
static_assert(sizeof(BP_FLIB_PlayerController_C_SetCharaOddEffect) == 0x000060, "Wrong size on BP_FLIB_PlayerController_C_SetCharaOddEffect");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CharaIDArray) == 0x000000, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CharaIDArray' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, InOddEffect) == 0x000010, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::InOddEffect' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, __WorldContext) == 0x000020, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, TempChaArray) == 0x000028, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::TempChaArray' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CallFunc_Array_Get_Item) == 0x000044, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CallFunc_GetGameCharacter_ReturnValue) == 0x000048, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_SetCharaOddEffect, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'BP_FLIB_PlayerController_C_SetCharaOddEffect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.IsDeadCharacter
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_PlayerController_C_IsDeadCharacter final
{
public:
	EJackCharacter                                CharaID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHP_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_PlayerController_C_IsDeadCharacter) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_IsDeadCharacter");
static_assert(sizeof(BP_FLIB_PlayerController_C_IsDeadCharacter) == 0x000028, "Wrong size on BP_FLIB_PlayerController_C_IsDeadCharacter");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, CharaID) == 0x000000, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::CharaID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, __WorldContext) == 0x000008, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, Dead) == 0x000010, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::Dead' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, CallFunc_GetGameCharacter_ReturnValue) == 0x000018, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, CallFunc_GetHP_ReturnValue) == 0x000020, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::CallFunc_GetHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_IsDeadCharacter, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000025, "Member 'BP_FLIB_PlayerController_C_IsDeadCharacter::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.GetPlayerLevel
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_PlayerController_C_GetPlayerLevel final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewParam;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_GetPlayerLevel) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_GetPlayerLevel");
static_assert(sizeof(BP_FLIB_PlayerController_C_GetPlayerLevel) == 0x000020, "Wrong size on BP_FLIB_PlayerController_C_GetPlayerLevel");
static_assert(offsetof(BP_FLIB_PlayerController_C_GetPlayerLevel, __WorldContext) == 0x000000, "Member 'BP_FLIB_PlayerController_C_GetPlayerLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_GetPlayerLevel, NewParam) == 0x000008, "Member 'BP_FLIB_PlayerController_C_GetPlayerLevel::NewParam' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_GetPlayerLevel, CallFunc_GetGameCharacter_ReturnValue) == 0x000010, "Member 'BP_FLIB_PlayerController_C_GetPlayerLevel::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_GetPlayerLevel, CallFunc_GetLevel_ReturnValue) == 0x000018, "Member 'BP_FLIB_PlayerController_C_GetPlayerLevel::CallFunc_GetLevel_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.CalcPlayerGroundLocation
// 0x0068 (0x0068 - 0x0000)
struct BP_FLIB_PlayerController_C_CalcPlayerGroundLocation final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SweepDistance;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutLocation;                                       // 0x0018(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempLocation;                                      // 0x0024(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_CalcPlayerGroundLocation");
static_assert(sizeof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation) == 0x000068, "Wrong size on BP_FLIB_PlayerController_C_CalcPlayerGroundLocation");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, InLocation) == 0x000000, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::InLocation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, SweepDistance) == 0x00000C, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::SweepDistance' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, __WorldContext) == 0x000010, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, OutLocation) == 0x000018, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, TempLocation) == 0x000024, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::TempLocation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000030, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_GetGroundLocation_ReturnValue) == 0x000038, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000044, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_BreakVector_Y) == 0x00004C, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcPlayerGroundLocation, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_FLIB_PlayerController_C_CalcPlayerGroundLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.VehicleForceUnmount
// 0x0038 (0x0038 - 0x0000)
struct BP_FLIB_PlayerController_C_VehicleForceUnmount final
{
public:
	bool                                          Destroy;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackVehicle*                           RetVehicle;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackVehicle*                           TempVehicle;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackVehicle*                           K2Node_DynamicCast_AsJack_Vehicle;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_PlayerController_C_VehicleForceUnmount) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_VehicleForceUnmount");
static_assert(sizeof(BP_FLIB_PlayerController_C_VehicleForceUnmount) == 0x000038, "Wrong size on BP_FLIB_PlayerController_C_VehicleForceUnmount");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, Destroy) == 0x000000, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::Destroy' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, __WorldContext) == 0x000008, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, RetVehicle) == 0x000010, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::RetVehicle' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, TempVehicle) == 0x000018, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::TempVehicle' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000020, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, K2Node_DynamicCast_AsJack_Vehicle) == 0x000028, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::K2Node_DynamicCast_AsJack_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_VehicleForceUnmount, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_FLIB_PlayerController_C_VehicleForceUnmount::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.CalcNpcGroundLocation
// 0x0068 (0x0068 - 0x0000)
struct BP_FLIB_PlayerController_C_CalcNpcGroundLocation final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackScheduledNPC*                      NPC;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutLocation;                                       // 0x0020(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempLocation;                                      // 0x002C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGroundLocation_ReturnValue;            // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_CalcNpcGroundLocation");
static_assert(sizeof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation) == 0x000068, "Wrong size on BP_FLIB_PlayerController_C_CalcNpcGroundLocation");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, InLocation) == 0x000000, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::InLocation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, NPC) == 0x000010, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::NPC' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, __WorldContext) == 0x000018, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, OutLocation) == 0x000020, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, TempLocation) == 0x00002C, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::TempLocation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_GetGroundLocation_ReturnValue) == 0x000038, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_GetGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_BreakVector_X) == 0x000044, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_BreakVector_Y) == 0x000048, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_BreakVector_Z) == 0x00004C, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000050, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_CalcNpcGroundLocation, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_FLIB_PlayerController_C_CalcNpcGroundLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_FLIB_PlayerController.BP_FLIB_PlayerController_C.PlayerNijiiroNoEdaEffect
// 0x0058 (0x0058 - 0x0000)
struct BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TempActor;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_Gimmick_C>      K2Node_DynamicCast_AsBP_IF_Gimmick;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect) == 0x000008, "Wrong alignment on BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect");
static_assert(sizeof(BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect) == 0x000058, "Wrong size on BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect");
static_assert(offsetof(BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect, __WorldContext) == 0x000000, "Member 'BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect, TempActor) == 0x000008, "Member 'BP_FLIB_PlayerController_C_PlayerNijiiroNoEdaEffect::TempActor' has a wrong offset!");
