#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_SaveData

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "ENUM_AchievementPafupafu_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.SaveRestartPoint
// 0x00D8 (0x00D8 - 0x0000)
struct BP_FLIB_SaveData_C_SaveRestartPoint final
{
public:
	struct FJackLDT_Restart                       RestartPointTag;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_Restart                       K2Node_MakeStruct_JackLDT_Restart;                 // 0x0020(0x0010)(NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackDataTableRestart                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvalidRestartPointName_OutResult;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CalcSaveRestartPointFlagName_OutFullName; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue3;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_SaveRestartPoint) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_SaveRestartPoint");
static_assert(sizeof(BP_FLIB_SaveData_C_SaveRestartPoint) == 0x0000D8, "Wrong size on BP_FLIB_SaveData_C_SaveRestartPoint");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, RestartPointTag) == 0x000000, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::RestartPointTag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, Result) == 0x000018, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, K2Node_MakeStruct_JackLDT_Restart) == 0x000020, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::K2Node_MakeStruct_JackLDT_Restart' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000090, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_Conv_NameToString_ReturnValue2) == 0x000098, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_IsInvalidRestartPointName_OutResult) == 0x0000A8, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_IsInvalidRestartPointName_OutResult' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_Not_PreBool_ReturnValue) == 0x0000A9, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_CalcSaveRestartPointFlagName_OutFullName) == 0x0000B0, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_CalcSaveRestartPointFlagName_OutFullName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_Conv_NameToString_ReturnValue3) == 0x0000B8, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_Conv_NameToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPoint, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'BP_FLIB_SaveData_C_SaveRestartPoint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.GetInvalidString
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_SaveData_C_GetInvalidString final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InvalidName;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_GetInvalidString) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_GetInvalidString");
static_assert(sizeof(BP_FLIB_SaveData_C_GetInvalidString) == 0x000010, "Wrong size on BP_FLIB_SaveData_C_GetInvalidString");
static_assert(offsetof(BP_FLIB_SaveData_C_GetInvalidString, __WorldContext) == 0x000000, "Member 'BP_FLIB_SaveData_C_GetInvalidString::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetInvalidString, InvalidName) == 0x000008, "Member 'BP_FLIB_SaveData_C_GetInvalidString::InvalidName' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.ResetRestartPoint
// 0x0078 (0x0078 - 0x0000)
struct BP_FLIB_SaveData_C_ResetRestartPoint final
{
public:
	struct FJackLDT_Restart                       NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackRestartProcessType                       RestartProcess;                                    // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableRestart                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0050)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_ResetRestartPoint) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_ResetRestartPoint");
static_assert(sizeof(BP_FLIB_SaveData_C_ResetRestartPoint) == 0x000078, "Wrong size on BP_FLIB_SaveData_C_ResetRestartPoint");
static_assert(offsetof(BP_FLIB_SaveData_C_ResetRestartPoint, NewParam) == 0x000000, "Member 'BP_FLIB_SaveData_C_ResetRestartPoint::NewParam' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_ResetRestartPoint, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_ResetRestartPoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_ResetRestartPoint, RestartProcess) == 0x000018, "Member 'BP_FLIB_SaveData_C_ResetRestartPoint::RestartProcess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_ResetRestartPoint, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'BP_FLIB_SaveData_C_ResetRestartPoint::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_ResetRestartPoint, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'BP_FLIB_SaveData_C_ResetRestartPoint::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_ResetRestartPoint, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BP_FLIB_SaveData_C_ResetRestartPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.CalcSaveRestartPointFlagName
// 0x0048 (0x0048 - 0x0000)
struct BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName final
{
public:
	EJackRestartProcessType                       In_RestartProcess;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OutFullName;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRestartSrcNameByEnum_OutName;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName");
static_assert(sizeof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName) == 0x000048, "Wrong size on BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, In_RestartProcess) == 0x000000, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::In_RestartProcess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, OutFullName) == 0x000010, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::OutFullName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, CallFunc_GetRestartSrcNameByEnum_OutName) == 0x000018, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::CallFunc_GetRestartSrcNameByEnum_OutName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_FLIB_SaveData_C_CalcSaveRestartPointFlagName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.GetRestartSrcNameByEnum
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_SaveData_C_GetRestartSrcNameByEnum final
{
public:
	EJackRestartProcessType                       InRestartProcess;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OutName;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SrcName;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_GetRestartSrcNameByEnum");
static_assert(sizeof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum) == 0x000028, "Wrong size on BP_FLIB_SaveData_C_GetRestartSrcNameByEnum");
static_assert(offsetof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum, InRestartProcess) == 0x000000, "Member 'BP_FLIB_SaveData_C_GetRestartSrcNameByEnum::InRestartProcess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_GetRestartSrcNameByEnum::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum, OutName) == 0x000010, "Member 'BP_FLIB_SaveData_C_GetRestartSrcNameByEnum::OutName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum, SrcName) == 0x000018, "Member 'BP_FLIB_SaveData_C_GetRestartSrcNameByEnum::SrcName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetRestartSrcNameByEnum, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_FLIB_SaveData_C_GetRestartSrcNameByEnum::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.GetSaveRestartPointFlag
// 0x0048 (0x0048 - 0x0000)
struct BP_FLIB_SaveData_C_GetSaveRestartPointFlag final
{
public:
	EJackRestartProcessType                       In_Type;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OutName;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsInvalid;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CalcSaveRestartPointFlagName_OutFullName; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvalidRestartPointName_OutResult;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_GetSaveRestartPointFlag");
static_assert(sizeof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag) == 0x000048, "Wrong size on BP_FLIB_SaveData_C_GetSaveRestartPointFlag");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, In_Type) == 0x000000, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::In_Type' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, OutName) == 0x000010, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::OutName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, IsInvalid) == 0x000020, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::IsInvalid' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, CallFunc_CalcSaveRestartPointFlagName_OutFullName) == 0x000028, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::CallFunc_CalcSaveRestartPointFlagName_OutFullName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, CallFunc_GetGameFlagString_ReturnValue) == 0x000030, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::CallFunc_GetGameFlagString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetSaveRestartPointFlag, CallFunc_IsInvalidRestartPointName_OutResult) == 0x000040, "Member 'BP_FLIB_SaveData_C_GetSaveRestartPointFlag::CallFunc_IsInvalidRestartPointName_OutResult' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.IsInvalidRestartPointName
// 0x0050 (0x0050 - 0x0000)
struct BP_FLIB_SaveData_C_IsInvalidRestartPointName final
{
public:
	class FString                                 InFlagName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetInvalidString_InvalidName;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_IsInvalidRestartPointName) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_IsInvalidRestartPointName");
static_assert(sizeof(BP_FLIB_SaveData_C_IsInvalidRestartPointName) == 0x000050, "Wrong size on BP_FLIB_SaveData_C_IsInvalidRestartPointName");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, InFlagName) == 0x000000, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::InFlagName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, OutResult) == 0x000018, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::OutResult' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, CallFunc_GetInvalidString_InvalidName) == 0x000020, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::CallFunc_GetInvalidString_InvalidName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, CallFunc_GetSubstring_ReturnValue) == 0x000028, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, CallFunc_Conv_NameToString_ReturnValue) == 0x000038, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000048, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000049, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsInvalidRestartPointName, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'BP_FLIB_SaveData_C_IsInvalidRestartPointName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.SaveRestartPointFromMapID
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_SaveData_C_SaveRestartPointFromMapID final
{
public:
	class FName                                   RestartID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_Restart                       K2Node_MakeStruct_JackLDT_Restart;                 // 0x0018(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveRestartPoint_Result;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_SaveRestartPointFromMapID");
static_assert(sizeof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID) == 0x000030, "Wrong size on BP_FLIB_SaveData_C_SaveRestartPointFromMapID");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, RestartID) == 0x000000, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::RestartID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, Result) == 0x000010, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, K2Node_MakeStruct_JackLDT_Restart) == 0x000018, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::K2Node_MakeStruct_JackLDT_Restart' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, CallFunc_NotEqual_NameName_ReturnValue) == 0x000028, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, CallFunc_SaveRestartPoint_Result) == 0x000029, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::CallFunc_SaveRestartPoint_Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, CallFunc_NotEqual_NameName_ReturnValue2) == 0x00002A, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SaveRestartPointFromMapID, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BP_FLIB_SaveData_C_SaveRestartPointFromMapID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.DecreaseGold
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_SaveData_C_DecreaseGold final
{
public:
	int32                                         LostGold;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DecreaseGold_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_DecreaseGold) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_DecreaseGold");
static_assert(sizeof(BP_FLIB_SaveData_C_DecreaseGold) == 0x000028, "Wrong size on BP_FLIB_SaveData_C_DecreaseGold");
static_assert(offsetof(BP_FLIB_SaveData_C_DecreaseGold, LostGold) == 0x000000, "Member 'BP_FLIB_SaveData_C_DecreaseGold::LostGold' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_DecreaseGold, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_DecreaseGold::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_DecreaseGold, CallFunc_GetJackGamePlayer_ReturnValue) == 0x000010, "Member 'BP_FLIB_SaveData_C_DecreaseGold::CallFunc_GetJackGamePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_DecreaseGold, CallFunc_GetGold_ReturnValue) == 0x000018, "Member 'BP_FLIB_SaveData_C_DecreaseGold::CallFunc_GetGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_DecreaseGold, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_FLIB_SaveData_C_DecreaseGold::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_DecreaseGold, CallFunc_DecreaseGold_ReturnValue) == 0x000020, "Member 'BP_FLIB_SaveData_C_DecreaseGold::CallFunc_DecreaseGold_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.IsCurrentMapShipLocation
// 0x0040 (0x0040 - 0x0000)
struct BP_FLIB_SaveData_C_IsCurrentMapShipLocation final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResult;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataGameProgress      K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress; // 0x0010(0x0010)(NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetProgressFlag_Flag;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is2ndScenario_2ndScenario;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveMapID_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShipLocationFromMapID_bResult;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_IsCurrentMapShipLocation");
static_assert(sizeof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation) == 0x000040, "Wrong size on BP_FLIB_SaveData_C_IsCurrentMapShipLocation");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, __WorldContext) == 0x000000, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, bResult) == 0x000008, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::bResult' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress) == 0x000010, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::K2Node_MakeStruct_JackLDT_GameFlagDataGameProgress' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_GetGameFlagBool_ReturnValue) == 0x000020, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_GetProgressFlag_Flag) == 0x000021, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_GetProgressFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_Is2ndScenario_2ndScenario) == 0x000023, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_Is2ndScenario_2ndScenario' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_GetGameFlagBool_ReturnValue2) == 0x000024, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_Not_PreBool_ReturnValue2) == 0x000025, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_GetSaveData_ReturnValue) == 0x000028, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_GetActiveMapID_ReturnValue) == 0x000030, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_GetActiveMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsCurrentMapShipLocation, CallFunc_IsShipLocationFromMapID_bResult) == 0x000038, "Member 'BP_FLIB_SaveData_C_IsCurrentMapShipLocation::CallFunc_IsShipLocationFromMapID_bResult' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.IsShipLocationFromMapID
// 0x0040 (0x0040 - 0x0000)
struct BP_FLIB_SaveData_C_IsShipLocationFromMapID final
{
public:
	class FName                                   MapId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResult;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_IsShipLocationFromMapID) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_IsShipLocationFromMapID");
static_assert(sizeof(BP_FLIB_SaveData_C_IsShipLocationFromMapID) == 0x000040, "Wrong size on BP_FLIB_SaveData_C_IsShipLocationFromMapID");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, MapId) == 0x000000, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::MapId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, bResult) == 0x000010, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::bResult' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_GetGameFlagString_ReturnValue) == 0x000018, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_GetGameFlagString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000028, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000038, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000039, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x00003B, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_IsShipLocationFromMapID, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'BP_FLIB_SaveData_C_IsShipLocationFromMapID::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.SetShipLocation
// 0x00E0 (0x00E0 - 0x0000)
struct BP_FLIB_SaveData_C_SetShipLocation final
{
public:
	class FName                                   MapStart;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MapId;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackDataTableMap                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue2;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue3;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableMapStart                 CallFunc_GetDataTableRowFromName_OutRow2;          // 0x00B8(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue2;     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_SaveData_C_SetShipLocation) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_SetShipLocation");
static_assert(sizeof(BP_FLIB_SaveData_C_SetShipLocation) == 0x0000E0, "Wrong size on BP_FLIB_SaveData_C_SetShipLocation");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, MapStart) == 0x000000, "Member 'BP_FLIB_SaveData_C_SetShipLocation::MapStart' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, MapId) == 0x000008, "Member 'BP_FLIB_SaveData_C_SetShipLocation::MapId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_SetShipLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_GetSubstring_ReturnValue) == 0x000088, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000098, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_GetSubstring_ReturnValue2) == 0x0000A0, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_GetSubstring_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x0000B0, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_EqualEqual_StrStr_ReturnValue3) == 0x0000B1, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_EqualEqual_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000B2, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_BooleanOR_ReturnValue) == 0x0000B3, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_BooleanOR_ReturnValue2) == 0x0000B4, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_NotEqual_NameName_ReturnValue2) == 0x0000B5, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_NotEqual_NameName_ReturnValue3) == 0x0000B6, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_NotEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_GetDataTableRowFromName_OutRow2) == 0x0000B8, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_GetDataTableRowFromName_OutRow2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_GetDataTableRowFromName_ReturnValue2) == 0x0000D8, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_GetDataTableRowFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocation, CallFunc_BooleanAND_ReturnValue) == 0x0000D9, "Member 'BP_FLIB_SaveData_C_SetShipLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.SetShipLocationCore
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_SaveData_C_SetShipLocationCore final
{
public:
	class FName                                   MapId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_SetShipLocationCore) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_SetShipLocationCore");
static_assert(sizeof(BP_FLIB_SaveData_C_SetShipLocationCore) == 0x000020, "Wrong size on BP_FLIB_SaveData_C_SetShipLocationCore");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocationCore, MapId) == 0x000000, "Member 'BP_FLIB_SaveData_C_SetShipLocationCore::MapId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocationCore, __WorldContext) == 0x000008, "Member 'BP_FLIB_SaveData_C_SetShipLocationCore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocationCore, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'BP_FLIB_SaveData_C_SetShipLocationCore::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.SetShipLocationAtCurrentMap
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveMapID_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap");
static_assert(sizeof(BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap) == 0x000018, "Wrong size on BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap, __WorldContext) == 0x000000, "Member 'BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap, CallFunc_GetSaveData_ReturnValue) == 0x000008, "Member 'BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap, CallFunc_GetActiveMapID_ReturnValue) == 0x000010, "Member 'BP_FLIB_SaveData_C_SetShipLocationAtCurrentMap::CallFunc_GetActiveMapID_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.AcquireAchievementDirect
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_SaveData_C_AcquireAchievementDirect final
{
public:
	struct FJackLDT_Achievement                   Achievement;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_AcquireAchievementDirect) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_AcquireAchievementDirect");
static_assert(sizeof(BP_FLIB_SaveData_C_AcquireAchievementDirect) == 0x000020, "Wrong size on BP_FLIB_SaveData_C_AcquireAchievementDirect");
static_assert(offsetof(BP_FLIB_SaveData_C_AcquireAchievementDirect, Achievement) == 0x000000, "Member 'BP_FLIB_SaveData_C_AcquireAchievementDirect::Achievement' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_AcquireAchievementDirect, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_AcquireAchievementDirect::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_AcquireAchievementDirect, CallFunc_GetAchievementManager_ReturnValue) == 0x000018, "Member 'BP_FLIB_SaveData_C_AcquireAchievementDirect::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.GetAchievementStringParameter
// 0x0040 (0x0040 - 0x0000)
struct BP_FLIB_SaveData_C_GetAchievementStringParameter final
{
public:
	struct FJackLDT_Achievement                   Achievement;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Value;                                             // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringParameter_ReturnValue;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_GetAchievementStringParameter) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_GetAchievementStringParameter");
static_assert(sizeof(BP_FLIB_SaveData_C_GetAchievementStringParameter) == 0x000040, "Wrong size on BP_FLIB_SaveData_C_GetAchievementStringParameter");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementStringParameter, Achievement) == 0x000000, "Member 'BP_FLIB_SaveData_C_GetAchievementStringParameter::Achievement' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementStringParameter, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_GetAchievementStringParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementStringParameter, Value) == 0x000018, "Member 'BP_FLIB_SaveData_C_GetAchievementStringParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementStringParameter, CallFunc_GetAchievementManager_ReturnValue) == 0x000028, "Member 'BP_FLIB_SaveData_C_GetAchievementStringParameter::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementStringParameter, CallFunc_GetStringParameter_ReturnValue) == 0x000030, "Member 'BP_FLIB_SaveData_C_GetAchievementStringParameter::CallFunc_GetStringParameter_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.GetAchievementNumericalParameter
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_SaveData_C_GetAchievementNumericalParameter final
{
public:
	struct FJackLDT_Achievement                   Achievement;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumericalParameter_ReturnValue;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter) == 0x000008, "Wrong alignment on BP_FLIB_SaveData_C_GetAchievementNumericalParameter");
static_assert(sizeof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter) == 0x000030, "Wrong size on BP_FLIB_SaveData_C_GetAchievementNumericalParameter");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter, Achievement) == 0x000000, "Member 'BP_FLIB_SaveData_C_GetAchievementNumericalParameter::Achievement' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter, __WorldContext) == 0x000010, "Member 'BP_FLIB_SaveData_C_GetAchievementNumericalParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter, Value) == 0x000018, "Member 'BP_FLIB_SaveData_C_GetAchievementNumericalParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter, CallFunc_GetAchievementManager_ReturnValue) == 0x000020, "Member 'BP_FLIB_SaveData_C_GetAchievementNumericalParameter::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_SaveData_C_GetAchievementNumericalParameter, CallFunc_GetNumericalParameter_ReturnValue) == 0x000028, "Member 'BP_FLIB_SaveData_C_GetAchievementNumericalParameter::CallFunc_GetNumericalParameter_ReturnValue' has a wrong offset!");

// Function BP_FLIB_SaveData.BP_FLIB_SaveData_C.AllIslandVisitAchievementCheck
// 0x0078 (0x0078 - 0x0000)
struct BP_FLIB_SaveData_C_AllIslandVisitAchievementCheck final
{
public:
	class FName                                   NowMapID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
