#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_Quest

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "ENUM_LoadScreenType_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.CheckQuestComplete
// 0x01D8 (0x01D8 - 0x0000)
struct BP_FLIB_Quest_C_CheckQuestComplete final
{
public:
	struct FJackLDT_QuestTable                    Quest;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Completed;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RetID;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckMartinaCoordinate_Result;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableQuest                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x00D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item3;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item5;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item6;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEquipment_Result;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item7;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item8;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item9;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item10;                         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item11;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array2;                           // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckParameter_Result;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCoordinate_Result;                   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckEquipment_Result2;                   // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item12;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item13;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item14;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item15;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array3;                           // 0x01B8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckQuestFlagCore_Ret;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItem_Result;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CheckItem_ItemID;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Quest_C_CheckQuestComplete) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_CheckQuestComplete");
static_assert(sizeof(BP_FLIB_Quest_C_CheckQuestComplete) == 0x0001D8, "Wrong size on BP_FLIB_Quest_C_CheckQuestComplete");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, Quest) == 0x000000, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::Quest' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, __WorldContext) == 0x000010, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, Completed) == 0x000018, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::Completed' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, RetID) == 0x000020, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::RetID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckMartinaCoordinate_Result) == 0x000028, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckMartinaCoordinate_Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_GetGameFlagBool_ReturnValue) == 0x000029, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, K2Node_SwitchName_CmpSuccess) == 0x00002A, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000100, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item) == 0x000108, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item2) == 0x000110, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item3) == 0x000118, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item4) == 0x000120, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item5) == 0x000128, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, K2Node_MakeArray_Array) == 0x000130, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item6) == 0x000140, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckEquipment_Result) == 0x000148, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckEquipment_Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_GetGameFlagBool_ReturnValue2) == 0x000149, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_NotEqual_NameName_ReturnValue) == 0x00014A, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item7) == 0x000150, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item8) == 0x000158, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item9) == 0x000160, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item10) == 0x000168, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item10' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item11) == 0x000170, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item11' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, K2Node_MakeArray_Array2) == 0x000178, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckParameter_Result) == 0x000188, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckParameter_Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckCoordinate_Result) == 0x000189, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckCoordinate_Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckEquipment_Result2) == 0x00018A, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckEquipment_Result2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item12) == 0x000190, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item12' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item13) == 0x000198, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item13' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item14) == 0x0001A0, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item14' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_Array_Get_Item15) == 0x0001A8, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_Array_Get_Item15' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, K2Node_SwitchEnum_CmpSuccess) == 0x0001B0, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, K2Node_MakeArray_Array3) == 0x0001B8, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckQuestFlagCore_Ret) == 0x0001C8, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckQuestFlagCore_Ret' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckItem_Result) == 0x0001C9, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckItem_Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestComplete, CallFunc_CheckItem_ItemID) == 0x0001D0, "Member 'BP_FLIB_Quest_C_CheckQuestComplete::CallFunc_CheckItem_ItemID' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.CheckEquipment
// 0x00A0 (0x00A0 - 0x0000)
struct BP_FLIB_Quest_C_CheckEquipment final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ItemIds;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackGameCharacterEquippedItem> TmpJackGameCharacterEquippedItem;                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          LocalResult;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_CalcCharacterNameToID_ID;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackGameCharacterEquippedItem> CallFunc_GetEquippedItems_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackGameCharacterEquippedItem         CallFunc_Array_Get_Item2;                          // 0x0088(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Quest_C_CheckEquipment) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_CheckEquipment");
static_assert(sizeof(BP_FLIB_Quest_C_CheckEquipment) == 0x0000A0, "Wrong size on BP_FLIB_Quest_C_CheckEquipment");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CharacterID) == 0x000000, "Member 'BP_FLIB_Quest_C_CheckEquipment::CharacterID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, ItemIds) == 0x000008, "Member 'BP_FLIB_Quest_C_CheckEquipment::ItemIds' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, __WorldContext) == 0x000018, "Member 'BP_FLIB_Quest_C_CheckEquipment::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, Result) == 0x000020, "Member 'BP_FLIB_Quest_C_CheckEquipment::Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, TmpJackGameCharacterEquippedItem) == 0x000028, "Member 'BP_FLIB_Quest_C_CheckEquipment::TmpJackGameCharacterEquippedItem' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, LocalResult) == 0x000038, "Member 'BP_FLIB_Quest_C_CheckEquipment::LocalResult' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_CalcCharacterNameToID_ID) == 0x000039, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_CalcCharacterNameToID_ID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_GetGameCharacter_ReturnValue) == 0x000040, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_FLIB_Quest_C_CheckEquipment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_GetEquippedItems_ReturnValue) == 0x000050, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_GetEquippedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, Temp_bool_True_if_break_was_hit_Variable) == 0x000064, "Member 'BP_FLIB_Quest_C_CheckEquipment::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, Temp_int_Array_Index_Variable) == 0x000068, "Member 'BP_FLIB_Quest_C_CheckEquipment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Not_PreBool_ReturnValue) == 0x00006C, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, Temp_int_Loop_Counter_Variable2) == 0x000070, "Member 'BP_FLIB_Quest_C_CheckEquipment::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Add_IntInt_ReturnValue2) == 0x000078, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, Temp_int_Array_Index_Variable2) == 0x00007C, "Member 'BP_FLIB_Quest_C_CheckEquipment::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Array_Get_Item2) == 0x000088, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Array_Length_ReturnValue2) == 0x000098, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_Less_IntInt_ReturnValue2) == 0x00009C, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00009D, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckEquipment, CallFunc_BooleanAND_ReturnValue) == 0x00009E, "Member 'BP_FLIB_Quest_C_CheckEquipment::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.CheckParameter
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FLIB_Quest_C_CheckParameter final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParamID;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Value;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_CalcCharacterNameToID_ID;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetGameCharacter_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTokugiPoint_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackGameCharacterParameters           CallFunc_GetEquippedParameters_ReturnValue;        // 0x0048(0x004C)(NoDestructor)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue5;        // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue6;        // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue7;        // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue8;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue4;            // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue5;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue6;            // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue7;            // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue8;            // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue9;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue10;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue11;           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue12;           // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Quest_C_CheckParameter) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_CheckParameter");
static_assert(sizeof(BP_FLIB_Quest_C_CheckParameter) == 0x0000B0, "Wrong size on BP_FLIB_Quest_C_CheckParameter");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CharacterID) == 0x000000, "Member 'BP_FLIB_Quest_C_CheckParameter::CharacterID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, ParamID) == 0x000008, "Member 'BP_FLIB_Quest_C_CheckParameter::ParamID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, Value) == 0x000010, "Member 'BP_FLIB_Quest_C_CheckParameter::Value' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, __WorldContext) == 0x000018, "Member 'BP_FLIB_Quest_C_CheckParameter::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, Result) == 0x000020, "Member 'BP_FLIB_Quest_C_CheckParameter::Result' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_CalcCharacterNameToID_ID) == 0x000021, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_CalcCharacterNameToID_ID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_GetGameCharacter_ReturnValue) == 0x000038, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_GetGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000040, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_GetTokugiPoint_ReturnValue) == 0x000044, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_GetTokugiPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_GetEquippedParameters_ReturnValue) == 0x000048, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_GetEquippedParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_Conv_StringToInt_ReturnValue) == 0x000094, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000099, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x00009A, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x00009B, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue4) == 0x00009C, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue5) == 0x00009D, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue6) == 0x00009E, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue7) == 0x00009F, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_FloatFloat_ReturnValue8) == 0x0000A0, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x0000A1, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue3) == 0x0000A2, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue4) == 0x0000A3, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue5) == 0x0000A4, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue6) == 0x0000A5, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue7) == 0x0000A6, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue8) == 0x0000A7, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue9) == 0x0000A8, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue10) == 0x0000A9, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue11) == 0x0000AA, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, CallFunc_LessEqual_IntInt_ReturnValue12) == 0x0000AB, "Member 'BP_FLIB_Quest_C_CheckParameter::CallFunc_LessEqual_IntInt_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckParameter, K2Node_SwitchName_CmpSuccess) == 0x0000AC, "Member 'BP_FLIB_Quest_C_CheckParameter::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.SetQuestFlag
// 0x01D8 (0x01D8 - 0x0000)
struct BP_FLIB_Quest_C_SetQuestFlag final
{
public:
	class FName                                   QuestId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackProgression                              Flag;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableQuest                    QuestData;                                         // 0x0018(0x00D0)(Parm, OutParm)
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQuestIDToQuestFlag_Success;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetQuestIDToQuestFlag_QuestFlag;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableQuest                    CallFunc_GetQuestIDToQuestFlag_QuestData;          // 0x0100(0x00D0)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Quest_C_SetQuestFlag) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_SetQuestFlag");
static_assert(sizeof(BP_FLIB_Quest_C_SetQuestFlag) == 0x0001D8, "Wrong size on BP_FLIB_Quest_C_SetQuestFlag");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, QuestId) == 0x000000, "Member 'BP_FLIB_Quest_C_SetQuestFlag::QuestId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, Flag) == 0x000008, "Member 'BP_FLIB_Quest_C_SetQuestFlag::Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, __WorldContext) == 0x000010, "Member 'BP_FLIB_Quest_C_SetQuestFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, QuestData) == 0x000018, "Member 'BP_FLIB_Quest_C_SetQuestFlag::QuestData' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, CallFunc_GetSaveData_ReturnValue) == 0x0000E8, "Member 'BP_FLIB_Quest_C_SetQuestFlag::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, CallFunc_GetQuestIDToQuestFlag_Success) == 0x0000F0, "Member 'BP_FLIB_Quest_C_SetQuestFlag::CallFunc_GetQuestIDToQuestFlag_Success' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, CallFunc_GetQuestIDToQuestFlag_QuestFlag) == 0x0000F8, "Member 'BP_FLIB_Quest_C_SetQuestFlag::CallFunc_GetQuestIDToQuestFlag_QuestFlag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, CallFunc_GetQuestIDToQuestFlag_QuestData) == 0x000100, "Member 'BP_FLIB_Quest_C_SetQuestFlag::CallFunc_GetQuestIDToQuestFlag_QuestData' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D0, "Member 'BP_FLIB_Quest_C_SetQuestFlag::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlag, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001D4, "Member 'BP_FLIB_Quest_C_SetQuestFlag::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.CheckQuestFlag
// 0x0100 (0x0100 - 0x0000)
struct BP_FLIB_Quest_C_CheckQuestFlag final
{
public:
	class FName                                   QuestId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackProgression                              Flag;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetQuestIDToQuestFlag_Success;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetQuestIDToQuestFlag_QuestFlag;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableQuest                    CallFunc_GetQuestIDToQuestFlag_QuestData;          // 0x0028(0x00D0)()
	bool                                          CallFunc_CheckQuestFlagCore_Ret;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Quest_C_CheckQuestFlag) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_CheckQuestFlag");
static_assert(sizeof(BP_FLIB_Quest_C_CheckQuestFlag) == 0x000100, "Wrong size on BP_FLIB_Quest_C_CheckQuestFlag");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, QuestId) == 0x000000, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::QuestId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, Flag) == 0x000008, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, __WorldContext) == 0x000010, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, Ret) == 0x000018, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::Ret' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, CallFunc_GetQuestIDToQuestFlag_Success) == 0x000019, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::CallFunc_GetQuestIDToQuestFlag_Success' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, CallFunc_GetQuestIDToQuestFlag_QuestFlag) == 0x000020, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::CallFunc_GetQuestIDToQuestFlag_QuestFlag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, CallFunc_GetQuestIDToQuestFlag_QuestData) == 0x000028, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::CallFunc_GetQuestIDToQuestFlag_QuestData' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlag, CallFunc_CheckQuestFlagCore_Ret) == 0x0000F8, "Member 'BP_FLIB_Quest_C_CheckQuestFlag::CallFunc_CheckQuestFlagCore_Ret' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.CheckQuestFlagCore
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Quest_C_CheckQuestFlagCore final
{
public:
	class FName                                   QuestFlag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackProgression                              Flag;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackProgression                              CallFunc_GetQuestFlag_Flag;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Quest_C_CheckQuestFlagCore) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_CheckQuestFlagCore");
static_assert(sizeof(BP_FLIB_Quest_C_CheckQuestFlagCore) == 0x000020, "Wrong size on BP_FLIB_Quest_C_CheckQuestFlagCore");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagCore, QuestFlag) == 0x000000, "Member 'BP_FLIB_Quest_C_CheckQuestFlagCore::QuestFlag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagCore, Flag) == 0x000008, "Member 'BP_FLIB_Quest_C_CheckQuestFlagCore::Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagCore, __WorldContext) == 0x000010, "Member 'BP_FLIB_Quest_C_CheckQuestFlagCore::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagCore, Ret) == 0x000018, "Member 'BP_FLIB_Quest_C_CheckQuestFlagCore::Ret' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagCore, CallFunc_GetQuestFlag_Flag) == 0x000019, "Member 'BP_FLIB_Quest_C_CheckQuestFlagCore::CallFunc_GetQuestFlag_Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagCore, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'BP_FLIB_Quest_C_CheckQuestFlagCore::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.GetQuestFlag
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Quest_C_GetQuestFlag final
{
public:
	class FName                                   QuestFlag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackProgression                              Flag;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameFlagInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Quest_C_GetQuestFlag) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_GetQuestFlag");
static_assert(sizeof(BP_FLIB_Quest_C_GetQuestFlag) == 0x000020, "Wrong size on BP_FLIB_Quest_C_GetQuestFlag");
static_assert(offsetof(BP_FLIB_Quest_C_GetQuestFlag, QuestFlag) == 0x000000, "Member 'BP_FLIB_Quest_C_GetQuestFlag::QuestFlag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_GetQuestFlag, __WorldContext) == 0x000008, "Member 'BP_FLIB_Quest_C_GetQuestFlag::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_GetQuestFlag, Flag) == 0x000010, "Member 'BP_FLIB_Quest_C_GetQuestFlag::Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_GetQuestFlag, CallFunc_GetGameFlagInt_ReturnValue) == 0x000014, "Member 'BP_FLIB_Quest_C_GetQuestFlag::CallFunc_GetGameFlagInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_GetQuestFlag, CallFunc_Conv_IntToByte_ReturnValue) == 0x000018, "Member 'BP_FLIB_Quest_C_GetQuestFlag::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_GetQuestFlag, CallFunc_GetValidValue_ReturnValue) == 0x000019, "Member 'BP_FLIB_Quest_C_GetQuestFlag::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.SetQuestFlagToComplete
// 0x0180 (0x0180 - 0x0000)
struct BP_FLIB_Quest_C_SetQuestFlagToComplete final
{
public:
	class FName                                   SetQuestID;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TempTextID;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FJackDataTableQuest                    CallFunc_SetQuestFlag_QuestData;                   // 0x0020(0x00D0)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0128(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_FLIB_Quest_C_SetQuestFlagToComplete) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_SetQuestFlagToComplete");
static_assert(sizeof(BP_FLIB_Quest_C_SetQuestFlagToComplete) == 0x000180, "Wrong size on BP_FLIB_Quest_C_SetQuestFlagToComplete");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, SetQuestID) == 0x000000, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::SetQuestID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, __WorldContext) == 0x000008, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, TempTextID) == 0x000010, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::TempTextID' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, CallFunc_SetQuestFlag_QuestData) == 0x000020, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::CallFunc_SetQuestFlag_QuestData' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F0, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F8, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, CallFunc_GetText_ReturnValue) == 0x000108, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, CallFunc_Concat_StrStr_ReturnValue) == 0x000118, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, K2Node_MakeStruct_JackMessageArgumentData) == 0x000128, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_SetQuestFlagToComplete, K2Node_MakeArray_Array) == 0x000170, "Member 'BP_FLIB_Quest_C_SetQuestFlagToComplete::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_FLIB_Quest.BP_FLIB_Quest_C.CheckQuestFlagOver
// 0x0100 (0x0100 - 0x0000)
struct BP_FLIB_Quest_C_CheckQuestFlagOver final
{
public:
	class FName                                   QuestId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackProgression                              Flag;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetQuestIDToQuestFlag_Success;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetQuestIDToQuestFlag_QuestFlag;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableQuest                    CallFunc_GetQuestIDToQuestFlag_QuestData;          // 0x0028(0x00D0)()
	EJackProgression                              CallFunc_GetQuestFlag_Flag;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Quest_C_CheckQuestFlagOver) == 0x000008, "Wrong alignment on BP_FLIB_Quest_C_CheckQuestFlagOver");
static_assert(sizeof(BP_FLIB_Quest_C_CheckQuestFlagOver) == 0x000100, "Wrong size on BP_FLIB_Quest_C_CheckQuestFlagOver");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagOver, QuestId) == 0x000000, "Member 'BP_FLIB_Quest_C_CheckQuestFlagOver::QuestId' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagOver, Flag) == 0x000008, "Member 'BP_FLIB_Quest_C_CheckQuestFlagOver::Flag' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagOver, __WorldContext) == 0x000010, "Member 'BP_FLIB_Quest_C_CheckQuestFlagOver::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Quest_C_CheckQuestFlagOver, Ret) == 0x000018, "Member 'BP_FLIB_Quest_C_CheckQuestFlagOver::Ret' has a wrong offset!");
