#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_AnimExpression

#include "Basic.hpp"

#include "ENUM_CoordinateMeshSlot_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_RotAxis_structs.hpp"
#include "ENUM_HairBoneBlendSpaceCotrolMode_structs.hpp"
#include "JackAnimNodeRuntime_structs.hpp"
#include "STRUCT_SoftBoneChainSettings_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_MaxOrMinRot_structs.hpp"
#include "STRUCT_AnimExpInfo_structs.hpp"
#include "STRUCT_AnimExpressionBonesName_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.AddRotOffset
// 0x00A8 (0x00A8 - 0x0000)
struct BP_FLIB_AnimExpression_C_AddRotOffset final
{
public:
	class ACharacter*                             bpp__Character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__TargetBone__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__TargetRot__pf;                                // 0x0010(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_AnimExpressionBonesName        bpp__AnimExpInfo__pf;                              // 0x0020(0x0070)(Parm, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0090(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__Result__pf;                                   // 0x0098(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_AnimExpression_C_AddRotOffset) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_AddRotOffset");
static_assert(sizeof(BP_FLIB_AnimExpression_C_AddRotOffset) == 0x0000A8, "Wrong size on BP_FLIB_AnimExpression_C_AddRotOffset");
static_assert(offsetof(BP_FLIB_AnimExpression_C_AddRotOffset, bpp__Character__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_AddRotOffset::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_AddRotOffset, bpp__TargetBone__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_AddRotOffset::bpp__TargetBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_AddRotOffset, bpp__TargetRot__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_AddRotOffset::bpp__TargetRot__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_AddRotOffset, bpp__AnimExpInfo__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_AddRotOffset::bpp__AnimExpInfo__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_AddRotOffset, bpp____WorldContext__pf) == 0x000090, "Member 'BP_FLIB_AnimExpression_C_AddRotOffset::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_AddRotOffset, bpp__Result__pf) == 0x000098, "Member 'BP_FLIB_AnimExpression_C_AddRotOffset::bpp__Result__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneA.Rot-BoneB.Rot
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot final
{
public:
	class ACharacter*                             bpp__Character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneA__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneB__pf;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__Result__pf;                                   // 0x0020(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot");
static_assert(sizeof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot) == 0x000030, "Wrong size on BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot, bpp__Character__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot, bpp__BoneA__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot::bpp__BoneA__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot, bpp__BoneB__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot::bpp__BoneB__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot, bpp__Result__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotMinusBoneB_Rot::bpp__Result__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneA.Rot+BoneB.Rot
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot final
{
public:
	class ACharacter*                             bpp__Character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneA__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneB__pf;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__Result__pf;                                   // 0x0020(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot");
static_assert(sizeof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot) == 0x000030, "Wrong size on BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot, bpp__Character__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot, bpp__BoneA__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot::bpp__BoneA__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot, bpp__BoneB__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot::bpp__BoneB__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot, bpp__Result__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_BoneA_RotPlusBoneB_Rot::bpp__Result__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneEx8WayRot
// 0x0198 (0x0198 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneEx8WayRot final
{
public:
	bool                                          bpp__Enable__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             bpp__Character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__LeftThighBone__pf;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__RightThighBone__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SouthBone__pf;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SouthWestBone__pf;                            // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SouthWestWestRatio__pf;                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__WestBone__pf;                                 // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthWestWestRatio__pf;                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthWestLerpRatio__pf;                       // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NorthBone__pf;                                // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthEastLerpRatio__pf;                       // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthEastEastRatio__pf;                       // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__EastBone__pf;                                 // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SouthEastEastRatio__pf;                       // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__SouthEastBone__pf;                            // 0x0068(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SouthSouthEastRatio__pf;                      // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_AnimExpressionBonesName        bpp__AnimExpInfo__pf;                              // 0x0078(0x0070)(Parm, NativeAccessSpecifierPublic)
	bool                                          bpp__Debug__pf;                                    // 0x00E8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x00F0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__South__pf;                                    // 0x00F8(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthWest__pf;                                // 0x0104(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthWestWest__pf;                            // 0x0110(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__West__pf;                                     // 0x011C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthWestWest__pf;                            // 0x0128(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthWest__pf;                                // 0x0134(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__North__pf;                                    // 0x0140(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthEast__pf;                                // 0x014C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthEastEast__pf;                            // 0x0158(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__East__pf;                                     // 0x0164(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthEastEast__pf;                            // 0x0170(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthEast__pf;                                // 0x017C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthSouthEast__pf;                           // 0x0188(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_AnimExpression_C_BoneEx8WayRot) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_BoneEx8WayRot");
static_assert(sizeof(BP_FLIB_AnimExpression_C_BoneEx8WayRot) == 0x000198, "Wrong size on BP_FLIB_AnimExpression_C_BoneEx8WayRot");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__Enable__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__Enable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__Character__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__LeftThighBone__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__LeftThighBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__RightThighBone__pf) == 0x000018, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__RightThighBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthBone__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthWestBone__pf) == 0x000028, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthWestBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthWestWestRatio__pf) == 0x000030, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthWestWestRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__WestBone__pf) == 0x000038, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__WestBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthWestWestRatio__pf) == 0x000040, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthWestWestRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthWestLerpRatio__pf) == 0x000044, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthWestLerpRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthBone__pf) == 0x000048, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthEastLerpRatio__pf) == 0x000050, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthEastLerpRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthEastEastRatio__pf) == 0x000054, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthEastEastRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__EastBone__pf) == 0x000058, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__EastBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthEastEastRatio__pf) == 0x000060, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthEastEastRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthEastBone__pf) == 0x000068, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthEastBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthSouthEastRatio__pf) == 0x000070, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthSouthEastRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__AnimExpInfo__pf) == 0x000078, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__AnimExpInfo__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__Debug__pf) == 0x0000E8, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__Debug__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp____WorldContext__pf) == 0x0000F0, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__South__pf) == 0x0000F8, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__South__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthWest__pf) == 0x000104, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthWestWest__pf) == 0x000110, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthWestWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__West__pf) == 0x00011C, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__West__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthWestWest__pf) == 0x000128, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthWestWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthWest__pf) == 0x000134, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__North__pf) == 0x000140, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__North__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthEast__pf) == 0x00014C, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__NorthEastEast__pf) == 0x000158, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__NorthEastEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__East__pf) == 0x000164, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__East__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthEastEast__pf) == 0x000170, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthEastEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthEast__pf) == 0x00017C, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WayRot, bpp__SouthSouthEast__pf) == 0x000188, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WayRot::bpp__SouthSouthEast__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneEx8WaySwitchTrace
// 0x01A0 (0x01A0 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace final
{
public:
	bool                                          bpp__Enable__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             bpp__Character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__LeftThighBone__pf;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__RightThighBone__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SouthBone__pf;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SouthWestBone__pf;                            // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SouthWestWestRatio__pf;                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__WestBone__pf;                                 // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthWestWestRatio__pf;                       // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthWestLerpRatio__pf;                       // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NorthBone__pf;                                // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthEastLerpRatio__pf;                       // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__NorthEastEastRatio__pf;                       // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__EastBone__pf;                                 // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SouthEastEastRatio__pf;                       // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__SouthEastBone__pf;                            // 0x0068(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SouthSouthEastRatio__pf;                      // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_AnimExpressionBonesName        bpp__AnimExpInfo__pf;                              // 0x0078(0x0070)(Parm, NativeAccessSpecifierPublic)
	bool                                          bpp__Debug__pf;                                    // 0x00E8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x00F0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__South__pf;                                    // 0x00F8(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthWest__pf;                                // 0x0104(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthWestWest__pf;                            // 0x0110(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__West__pf;                                     // 0x011C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthWestWest__pf;                            // 0x0128(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthWest__pf;                                // 0x0134(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__North__pf;                                    // 0x0140(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthEast__pf;                                // 0x014C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__NorthEastEast__pf;                            // 0x0158(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__East__pf;                                     // 0x0164(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthEastEast__pf;                            // 0x0170(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthEast__pf;                                // 0x017C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__SouthSouthEast__pf;                           // 0x0188(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  bpp__OutputPin__pf;                                // 0x0198(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace");
static_assert(sizeof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace) == 0x0001A0, "Wrong size on BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__Enable__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__Enable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__Character__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__LeftThighBone__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__LeftThighBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__RightThighBone__pf) == 0x000018, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__RightThighBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthBone__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthWestBone__pf) == 0x000028, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthWestBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthWestWestRatio__pf) == 0x000030, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthWestWestRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__WestBone__pf) == 0x000038, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__WestBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthWestWestRatio__pf) == 0x000040, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthWestWestRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthWestLerpRatio__pf) == 0x000044, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthWestLerpRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthBone__pf) == 0x000048, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthEastLerpRatio__pf) == 0x000050, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthEastLerpRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthEastEastRatio__pf) == 0x000054, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthEastEastRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__EastBone__pf) == 0x000058, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__EastBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthEastEastRatio__pf) == 0x000060, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthEastEastRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthEastBone__pf) == 0x000068, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthEastBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthSouthEastRatio__pf) == 0x000070, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthSouthEastRatio__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__AnimExpInfo__pf) == 0x000078, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__AnimExpInfo__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__Debug__pf) == 0x0000E8, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__Debug__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp____WorldContext__pf) == 0x0000F0, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__South__pf) == 0x0000F8, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__South__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthWest__pf) == 0x000104, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthWestWest__pf) == 0x000110, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthWestWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__West__pf) == 0x00011C, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__West__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthWestWest__pf) == 0x000128, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthWestWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthWest__pf) == 0x000134, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthWest__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__North__pf) == 0x000140, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__North__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthEast__pf) == 0x00014C, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__NorthEastEast__pf) == 0x000158, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__NorthEastEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__East__pf) == 0x000164, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__East__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthEastEast__pf) == 0x000170, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthEastEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthEast__pf) == 0x00017C, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__SouthSouthEast__pf) == 0x000188, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__SouthSouthEast__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace, bpp__OutputPin__pf) == 0x000198, "Member 'BP_FLIB_AnimExpression_C_BoneEx8WaySwitchTrace::bpp__OutputPin__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneExAimRot
// 0x00F0 (0x00F0 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneExAimRot final
{
public:
	bool                                          bpp__Enable__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__EnableAim__pf;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             bpp__Character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneA__pf;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneA_Child__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneB__pf;                                    // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneB_Child__pf;                              // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__X1__pf;                                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Y1__pf;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Z1__pf;                                       // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__AimOffset__pf;                                // 0x003C(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__TargetBone__pf;                               // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_AnimExpressionBonesName        bpp__AnimExpInfo__pf;                              // 0x0050(0x0070)(Parm, NativeAccessSpecifierPublic)
	bool                                          bpp__bClampByPositiveRange__pf;                    // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_RotAxis                                  bpp__SelectClampAxis__pf;                          // 0x00C1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bExceptionClampRot__pf;                       // 0x00C2(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_CoordinateMeshSlot                       bpp__PartsSlot__pf;                                // 0x00C3(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bUseAimToCenterLocation__pf;                  // 0x00C4(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x00C8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__Result__pf;                                   // 0x00D0(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Location__pf;                                 // 0x00DC(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bUsedTargetBone__pf;                          // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Alpha__pf;                                    // 0x00EC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_AnimExpression_C_BoneExAimRot) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_BoneExAimRot");
static_assert(sizeof(BP_FLIB_AnimExpression_C_BoneExAimRot) == 0x0000F0, "Wrong size on BP_FLIB_AnimExpression_C_BoneExAimRot");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Enable__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Enable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__EnableAim__pf) == 0x000001, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__EnableAim__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Character__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__BoneA__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__BoneA__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__BoneA_Child__pf) == 0x000018, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__BoneA_Child__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__BoneB__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__BoneB__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__BoneB_Child__pf) == 0x000028, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__BoneB_Child__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__X1__pf) == 0x000030, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__X1__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Y1__pf) == 0x000034, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Y1__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Z1__pf) == 0x000038, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Z1__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__AimOffset__pf) == 0x00003C, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__AimOffset__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__TargetBone__pf) == 0x000048, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__TargetBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__AnimExpInfo__pf) == 0x000050, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__AnimExpInfo__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__bClampByPositiveRange__pf) == 0x0000C0, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__bClampByPositiveRange__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__SelectClampAxis__pf) == 0x0000C1, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__SelectClampAxis__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__bExceptionClampRot__pf) == 0x0000C2, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__bExceptionClampRot__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__PartsSlot__pf) == 0x0000C3, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__PartsSlot__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__bUseAimToCenterLocation__pf) == 0x0000C4, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__bUseAimToCenterLocation__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp____WorldContext__pf) == 0x0000C8, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Result__pf) == 0x0000D0, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Result__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Location__pf) == 0x0000DC, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Location__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__bUsedTargetBone__pf) == 0x0000E8, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__bUsedTargetBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAimRot, bpp__Alpha__pf) == 0x0000EC, "Member 'BP_FLIB_AnimExpression_C_BoneExAimRot::bpp__Alpha__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneExAverageRot
// 0x00E8 (0x00E8 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneExAverageRot final
{
public:
	bool                                          bpp__Enable__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             bpp__Character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneA__pf;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneB__pf;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__X1__pf;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Y1__pf;                                       // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Z1__pf;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__TargetBone__pf;                               // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_AnimExpressionBonesName        bpp__AnimExpInfo__pf;                              // 0x0038(0x0070)(Parm, NativeAccessSpecifierPublic)
	ENUM_CoordinateMeshSlot                       bpp__MeshSlot__pf;                                 // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bUseClamp__pf;                                // 0x00A9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__ClampMin__pf;                                 // 0x00AC(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__ClampMax__pf;                                 // 0x00B8(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bUseDataTable__pf;                            // 0x00C4(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SkipRotOffset__pf;                            // 0x00C5(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x00C8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__Result__pf;                                   // 0x00D0(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bpp__bUsedTargetBone__pf;                          // 0x00DC(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Alpha__pf;                                    // 0x00E0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_AnimExpression_C_BoneExAverageRot) == 0x000008, "Wrong alignment on BP_FLIB_AnimExpression_C_BoneExAverageRot");
static_assert(sizeof(BP_FLIB_AnimExpression_C_BoneExAverageRot) == 0x0000E8, "Wrong size on BP_FLIB_AnimExpression_C_BoneExAverageRot");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__Enable__pf) == 0x000000, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__Enable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__Character__pf) == 0x000008, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__Character__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__BoneA__pf) == 0x000010, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__BoneA__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__BoneB__pf) == 0x000018, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__BoneB__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__X1__pf) == 0x000020, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__X1__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__Y1__pf) == 0x000024, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__Y1__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__Z1__pf) == 0x000028, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__Z1__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__TargetBone__pf) == 0x000030, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__TargetBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__AnimExpInfo__pf) == 0x000038, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__AnimExpInfo__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__MeshSlot__pf) == 0x0000A8, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__MeshSlot__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__bUseClamp__pf) == 0x0000A9, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__bUseClamp__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__ClampMin__pf) == 0x0000AC, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__ClampMin__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__ClampMax__pf) == 0x0000B8, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__ClampMax__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__bUseDataTable__pf) == 0x0000C4, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__bUseDataTable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__SkipRotOffset__pf) == 0x0000C5, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__SkipRotOffset__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp____WorldContext__pf) == 0x0000C8, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__Result__pf) == 0x0000D0, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__Result__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__bUsedTargetBone__pf) == 0x0000DC, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__bUsedTargetBone__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_AnimExpression_C_BoneExAverageRot, bpp__Alpha__pf) == 0x0000E0, "Member 'BP_FLIB_AnimExpression_C_BoneExAverageRot::bpp__Alpha__pf' has a wrong offset!");

// Function BP_FLIB_AnimExpression.BP_FLIB_AnimExpression_C.BoneExAverageRotArray
// 0x00F8 (0x00F8 - 0x0000)
struct BP_FLIB_AnimExpression_C_BoneExAverageRotArray final
{
public:
	bool                                          bpp__Enable__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             bpp__Character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneA__pf;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BoneB__pf;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
