#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_Renkei

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.MatineeRenkeiFadeStart
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Renkei_C_MatineeRenkeiFadeStart final
{
public:
	float                                         FadeTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRenkeiPlay_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_MatineeRenkeiFadeStart");
static_assert(sizeof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart) == 0x000030, "Wrong size on BP_FLIB_Renkei_C_MatineeRenkeiFadeStart");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, FadeTime) == 0x000000, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::FadeTime' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, __WorldContext) == 0x000008, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, CallFunc_GetJackGameMode_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, CallFunc_GetRenkeiManager_ReturnValue) == 0x000018, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000020, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFadeStart, CallFunc_IsRenkeiPlay_ReturnValue) == 0x000029, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFadeStart::CallFunc_IsRenkeiPlay_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.MatineeRenkeiDamageReaction
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRenkeiPlay_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction");
static_assert(sizeof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction) == 0x000028, "Wrong size on BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction, CallFunc_GetJackGameMode_ReturnValue) == 0x000008, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction, CallFunc_GetRenkeiManager_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000018, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction, CallFunc_IsRenkeiPlay_ReturnValue) == 0x000021, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiDamageReaction::CallFunc_IsRenkeiPlay_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.MatineeRenkeiFinish
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Renkei_C_MatineeRenkeiFinish final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRenkeiPlay_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_MatineeRenkeiFinish) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_MatineeRenkeiFinish");
static_assert(sizeof(BP_FLIB_Renkei_C_MatineeRenkeiFinish) == 0x000028, "Wrong size on BP_FLIB_Renkei_C_MatineeRenkeiFinish");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFinish, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFinish::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFinish, CallFunc_GetJackGameMode_ReturnValue) == 0x000008, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFinish::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFinish, CallFunc_GetRenkeiManager_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFinish::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFinish, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000018, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFinish::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFinish, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFinish::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiFinish, CallFunc_IsRenkeiPlay_ReturnValue) == 0x000021, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiFinish::CallFunc_IsRenkeiPlay_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.GetRenkeiManager
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Renkei_C_GetRenkeiManager final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    RenkeiManager;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_GetRenkeiManager) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_GetRenkeiManager");
static_assert(sizeof(BP_FLIB_Renkei_C_GetRenkeiManager) == 0x000030, "Wrong size on BP_FLIB_Renkei_C_GetRenkeiManager");
static_assert(offsetof(BP_FLIB_Renkei_C_GetRenkeiManager, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_GetRenkeiManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetRenkeiManager, RenkeiManager) == 0x000008, "Member 'BP_FLIB_Renkei_C_GetRenkeiManager::RenkeiManager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetRenkeiManager, CallFunc_GetJackGameMode_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_GetRenkeiManager::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetRenkeiManager, CallFunc_GetRenkeiManager_ReturnValue) == 0x000018, "Member 'BP_FLIB_Renkei_C_GetRenkeiManager::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetRenkeiManager, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000020, "Member 'BP_FLIB_Renkei_C_GetRenkeiManager::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetRenkeiManager, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FLIB_Renkei_C_GetRenkeiManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.GetMatineeTargetMonsterSize
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackMatineeRenkeiMonsterSize                 Size;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackMatineeRenkeiMonsterSize                 CallFunc_GetMatineeMonsterSize_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize");
static_assert(sizeof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize) == 0x000030, "Wrong size on BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, Size) == 0x000008, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::Size' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, CallFunc_GetJackGameMode_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, CallFunc_GetRenkeiManager_ReturnValue) == 0x000018, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000020, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize, CallFunc_GetMatineeMonsterSize_ReturnValue) == 0x000029, "Member 'BP_FLIB_Renkei_C_GetMatineeTargetMonsterSize::CallFunc_GetMatineeMonsterSize_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.MatineeRenkeiTargetLocationUpdeta
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRenkeiPlay_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta");
static_assert(sizeof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta) == 0x000028, "Wrong size on BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta, CallFunc_GetJackGameMode_ReturnValue) == 0x000008, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta, CallFunc_GetRenkeiManager_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000018, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta, CallFunc_IsRenkeiPlay_ReturnValue) == 0x000021, "Member 'BP_FLIB_Renkei_C_MatineeRenkeiTargetLocationUpdeta::CallFunc_IsRenkeiPlay_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.IsSpectaclShowSuccess
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Renkei_C_IsSpectaclShowSuccess final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpectaclShowSuccess_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_IsSpectaclShowSuccess");
static_assert(sizeof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess) == 0x000030, "Wrong size on BP_FLIB_Renkei_C_IsSpectaclShowSuccess");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, Success) == 0x000008, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::Success' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, CallFunc_GetJackGameMode_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, CallFunc_GetRenkeiManager_ReturnValue) == 0x000018, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000020, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_IsSpectaclShowSuccess, CallFunc_IsSpectaclShowSuccess_ReturnValue) == 0x000029, "Member 'BP_FLIB_Renkei_C_IsSpectaclShowSuccess::CallFunc_IsSpectaclShowSuccess_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.SkipMatineeRenkei
// 0x0058 (0x0058 - 0x0000)
struct BP_FLIB_Renkei_C_SkipMatineeRenkei final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatineeRenkeiPlay_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatineeActor*                          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatineeActor*                          CallFunc_Array_Get_Item2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Renkei_C_SkipMatineeRenkei) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_SkipMatineeRenkei");
static_assert(sizeof(BP_FLIB_Renkei_C_SkipMatineeRenkei) == 0x000058, "Wrong size on BP_FLIB_Renkei_C_SkipMatineeRenkei");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_GetJackGameMode_ReturnValue) == 0x000010, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_GetRenkeiManager_ReturnValue) == 0x000020, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_GetRenkeiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, K2Node_DynamicCast_AsBP_Renkei_Manager) == 0x000028, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::K2Node_DynamicCast_AsBP_Renkei_Manager' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_IsMatineeRenkeiPlay_ReturnValue) == 0x000031, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_IsMatineeRenkeiPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SkipMatineeRenkei, CallFunc_Array_Get_Item2) == 0x000050, "Member 'BP_FLIB_Renkei_C_SkipMatineeRenkei::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.SetRenkeiCoordinateSetting
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HiddenSilviaParadeHane;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiddenSilviaSaikyoHane;                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiddenElevenParadeHane;                            // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TempActor;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetLevelActorsByName_ReturnValue;         // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         K2Node_DynamicCast_AsJack_Character;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterCoordinate_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkinnedMeshComponent*                  CallFunc_GetCoordinatePartsMeshComponent_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterCoordinate_ReturnValue2;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  CallFunc_GetCoordinatePartsMeshComponent_ReturnValue2; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting");
static_assert(sizeof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting) == 0x0000B0, "Wrong size on BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, LevelName) == 0x000000, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::LevelName' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, HiddenSilviaParadeHane) == 0x000008, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::HiddenSilviaParadeHane' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, HiddenSilviaSaikyoHane) == 0x000009, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::HiddenSilviaSaikyoHane' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, HiddenElevenParadeHane) == 0x00000A, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::HiddenElevenParadeHane' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, __WorldContext) == 0x000010, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, TempActor) == 0x000018, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::TempActor' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_GetLevelActorsByName_ReturnValue) == 0x000030, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_GetLevelActorsByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_BooleanOR_ReturnValue2) == 0x000048, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, K2Node_DynamicCast_AsJack_Character) == 0x000068, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::K2Node_DynamicCast_AsJack_Character' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_GetCharacterCoordinate_ReturnValue) == 0x000078, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_GetCharacterCoordinate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_GetCoordinatePartsMeshComponent_ReturnValue) == 0x000080, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_GetCoordinatePartsMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000088, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_BooleanAND_ReturnValue) == 0x000089, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_GetCharacterCoordinate_ReturnValue2) == 0x000090, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_GetCharacterCoordinate_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000098, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000099, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_BooleanAND_ReturnValue2) == 0x00009A, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_BooleanAND_ReturnValue3) == 0x00009B, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_GetCoordinatePartsMeshComponent_ReturnValue2) == 0x0000A0, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_GetCoordinatePartsMeshComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_BooleanOR_ReturnValue3) == 0x0000A8, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_GetCharacterType_ReturnValue) == 0x0000A9, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, CallFunc_IsValid_ReturnValue) == 0x0000AA, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting, K2Node_SwitchEnum_CmpSuccess) == 0x0000AB, "Member 'BP_FLIB_Renkei_C_SetRenkeiCoordinateSetting::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_FLIB_Renkei.BP_FLIB_Renkei_C.SetReservation_SkipMatineeRenkei
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackRenkeiManager*                     CallFunc_GetRenkeiManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RenkeiManager_C*                    K2Node_DynamicCast_AsBP_Renkei_Manager;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei) == 0x000008, "Wrong alignment on BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei");
static_assert(sizeof(BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei) == 0x000028, "Wrong size on BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei");
static_assert(offsetof(BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei, __WorldContext) == 0x000000, "Member 'BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei, CallFunc_GetJackGameMode_ReturnValue) == 0x000008, "Member 'BP_FLIB_Renkei_C_SetReservation_SkipMatineeRenkei::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
