#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_Gameplay

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_MedalExchangeFirstContact_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Player Input Disabled
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Gameplay_C_Player_Input_Disabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Player_Input_Disabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Player_Input_Disabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Player_Input_Disabled) == 0x000018, "Wrong size on BP_FLIB_Gameplay_C_Player_Input_Disabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Input_Disabled, __WorldContext) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Player_Input_Disabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Input_Disabled, CallFunc_GetJackPlayerController_ReturnValue) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Player_Input_Disabled::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Input_Disabled, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Player_Input_Disabled::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Player Input Enabled
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Gameplay_C_Player_Input_Enabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Player_Input_Enabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Player_Input_Enabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Player_Input_Enabled) == 0x000018, "Wrong size on BP_FLIB_Gameplay_C_Player_Input_Enabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Input_Enabled, __WorldContext) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Player_Input_Enabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Input_Enabled, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Player_Input_Enabled::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Input_Enabled, CallFunc_GetJackPlayerController_ReturnValue) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Player_Input_Enabled::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Character Movement Enabled
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Gameplay_C_Character_Movement_Enabled final
{
public:
	class AJackCharacter*                         JackCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Character_Movement_Enabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Character_Movement_Enabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Character_Movement_Enabled) == 0x000010, "Wrong size on BP_FLIB_Gameplay_C_Character_Movement_Enabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Character_Movement_Enabled, JackCharacter) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Character_Movement_Enabled::JackCharacter' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Character_Movement_Enabled, __WorldContext) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Character_Movement_Enabled::__WorldContext' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Character Movement Disabled
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Gameplay_C_Character_Movement_Disabled final
{
public:
	class AJackCharacter*                         JackCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Character_Movement_Disabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Character_Movement_Disabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Character_Movement_Disabled) == 0x000010, "Wrong size on BP_FLIB_Gameplay_C_Character_Movement_Disabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Character_Movement_Disabled, JackCharacter) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Character_Movement_Disabled::JackCharacter' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Character_Movement_Disabled, __WorldContext) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Character_Movement_Disabled::__WorldContext' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Player Camera Reset
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Gameplay_C_Player_Camera_Reset final
{
public:
	float                                         Interp_Second;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Player_Camera_Reset) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Player_Camera_Reset");
static_assert(sizeof(BP_FLIB_Gameplay_C_Player_Camera_Reset) == 0x000018, "Wrong size on BP_FLIB_Gameplay_C_Player_Camera_Reset");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Camera_Reset, Interp_Second) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Player_Camera_Reset::Interp_Second' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Camera_Reset, __WorldContext) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Player_Camera_Reset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Camera_Reset, CallFunc_GetJackPlayerController_ReturnValue) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Player_Camera_Reset::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Talk Camera Enabled
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Gameplay_C_Talk_Camera_Enabled final
{
public:
	class AJackCharacter*                         TalkCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocationUpdate;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Talk_Camera_Enabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Talk_Camera_Enabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Talk_Camera_Enabled) == 0x000020, "Wrong size on BP_FLIB_Gameplay_C_Talk_Camera_Enabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Talk_Camera_Enabled, TalkCharacter) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Talk_Camera_Enabled::TalkCharacter' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Talk_Camera_Enabled, LocationUpdate) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Talk_Camera_Enabled::LocationUpdate' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Talk_Camera_Enabled, __WorldContext) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Talk_Camera_Enabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Talk_Camera_Enabled, CallFunc_GetJackPlayerController_ReturnValue) == 0x000018, "Member 'BP_FLIB_Gameplay_C_Talk_Camera_Enabled::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Talk Camera Disabled
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Gameplay_C_Talk_Camera_Disabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Talk_Camera_Disabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Talk_Camera_Disabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Talk_Camera_Disabled) == 0x000010, "Wrong size on BP_FLIB_Gameplay_C_Talk_Camera_Disabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Talk_Camera_Disabled, __WorldContext) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Talk_Camera_Disabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Talk_Camera_Disabled, CallFunc_GetJackPlayerController_ReturnValue) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Talk_Camera_Disabled::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Player Movement Enabled
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Gameplay_C_Player_Movement_Enabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Player_Movement_Enabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Player_Movement_Enabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Player_Movement_Enabled) == 0x000010, "Wrong size on BP_FLIB_Gameplay_C_Player_Movement_Enabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Movement_Enabled, __WorldContext) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Player_Movement_Enabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Movement_Enabled, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Player_Movement_Enabled::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Player Movement Disabled
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Gameplay_C_Player_Movement_Disabled final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Player_Movement_Disabled) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Player_Movement_Disabled");
static_assert(sizeof(BP_FLIB_Gameplay_C_Player_Movement_Disabled) == 0x000010, "Wrong size on BP_FLIB_Gameplay_C_Player_Movement_Disabled");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Movement_Disabled, __WorldContext) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Player_Movement_Disabled::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Movement_Disabled, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Player_Movement_Disabled::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Set Hidden All Characters
// 0x0078 (0x0078 - 0x0000)
struct BP_FLIB_Gameplay_C_Set_Hidden_All_Characters final
{
public:
	EJackCharacterHiddenPurpose                   Purpose;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewHidden;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayerPause;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IgnoreSymbolMonster;                               // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 TmpJackCharacters;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AJackCharacter*>                 CallFunc_GetCharacters_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActorControlledByPlayer_ReturnValue;    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackMonsterCharacter*                  K2Node_DynamicCast_AsJack_Monster_Character;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Set_Hidden_All_Characters");
static_assert(sizeof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters) == 0x000078, "Wrong size on BP_FLIB_Gameplay_C_Set_Hidden_All_Characters");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, Purpose) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::Purpose' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, NewHidden) == 0x000001, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::NewHidden' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, PlayerPause) == 0x000002, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::PlayerPause' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, IgnoreSymbolMonster) == 0x000003, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::IgnoreSymbolMonster' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, __WorldContext) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, TmpJackCharacters) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::TmpJackCharacters' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_GetBattleManager_ReturnValue) == 0x000028, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_IsInBattle_ReturnValue) == 0x000030, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_GetCharacters_ReturnValue) == 0x000038, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_GetCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_IsActorControlledByPlayer_ReturnValue) == 0x00005D, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_IsActorControlledByPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_BooleanAND_ReturnValue) == 0x00005E, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, K2Node_DynamicCast_AsJack_Monster_Character) == 0x000060, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::K2Node_DynamicCast_AsJack_Monster_Character' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Hidden_All_Characters, CallFunc_BooleanAND_ReturnValue2) == 0x000070, "Member 'BP_FLIB_Gameplay_C_Set_Hidden_All_Characters::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.AddInteractiveActorComponent
// 0x0068 (0x0068 - 0x0000)
struct BP_FLIB_Gameplay_C_AddInteractiveActorComponent final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackInteractiveActorComponent*         InComponent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackInteractorComponent*>       TmpJackInteractorComponent;                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackInteractorComponent*>       CallFunc_GetComponentsByClass_ReturnValue;         // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackInteractorComponent*               CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_AddInteractiveActorComponent");
static_assert(sizeof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent) == 0x000068, "Wrong size on BP_FLIB_Gameplay_C_AddInteractiveActorComponent");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, InActor) == 0x000000, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::InActor' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, InComponent) == 0x000008, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::InComponent' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, __WorldContext) == 0x000010, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, TmpJackInteractorComponent) == 0x000018, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::TmpJackInteractorComponent' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x000041, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_AddInteractiveActorComponent, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'BP_FLIB_Gameplay_C_AddInteractiveActorComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.RemoveInteractiveActorComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackInteractiveActorComponent*         InComponent;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackInteractorComponent*>       TmpJackInteractorComponent;                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UJackInteractorComponent*>       CallFunc_GetComponentsByClass_ReturnValue;         // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackInteractorComponent*               CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent");
static_assert(sizeof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent) == 0x000060, "Wrong size on BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, InActor) == 0x000000, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::InActor' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, InComponent) == 0x000008, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::InComponent' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, __WorldContext) == 0x000010, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, TmpJackInteractorComponent) == 0x000018, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::TmpJackInteractorComponent' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'BP_FLIB_Gameplay_C_RemoveInteractiveActorComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Get Time Color
// 0x0040 (0x0040 - 0x0000)
struct BP_FLIB_Gameplay_C_Get_Time_Color final
{
public:
	TArray<struct FLinearColor>                   ColorTable;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         Time;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0020(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTimeColorNative_ReturnValue;           // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Get_Time_Color) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Get_Time_Color");
static_assert(sizeof(BP_FLIB_Gameplay_C_Get_Time_Color) == 0x000040, "Wrong size on BP_FLIB_Gameplay_C_Get_Time_Color");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Color, ColorTable) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Get_Time_Color::ColorTable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Color, Time) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Get_Time_Color::Time' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Color, __WorldContext) == 0x000018, "Member 'BP_FLIB_Gameplay_C_Get_Time_Color::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Color, Color) == 0x000020, "Member 'BP_FLIB_Gameplay_C_Get_Time_Color::Color' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Color, CallFunc_GetTimeColorNative_ReturnValue) == 0x000030, "Member 'BP_FLIB_Gameplay_C_Get_Time_Color::CallFunc_GetTimeColorNative_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Get Time Float
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Gameplay_C_Get_Time_Float final
{
public:
	TArray<float>                                 FloatTable;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         Time;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Float;                                             // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeFloatNative_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Get_Time_Float) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Get_Time_Float");
static_assert(sizeof(BP_FLIB_Gameplay_C_Get_Time_Float) == 0x000028, "Wrong size on BP_FLIB_Gameplay_C_Get_Time_Float");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Float, FloatTable) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Get_Time_Float::FloatTable' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Float, Time) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Get_Time_Float::Time' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Float, __WorldContext) == 0x000018, "Member 'BP_FLIB_Gameplay_C_Get_Time_Float::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Float, Float) == 0x000020, "Member 'BP_FLIB_Gameplay_C_Get_Time_Float::Float' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Get_Time_Float, CallFunc_GetTimeFloatNative_ReturnValue) == 0x000024, "Member 'BP_FLIB_Gameplay_C_Get_Time_Float::CallFunc_GetTimeFloatNative_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Set Player Camera Rotation
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         Length;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSeconds;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRelativeRotation;                                 // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation");
static_assert(sizeof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation) == 0x000030, "Wrong size on BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, Rotation) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::Rotation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, Length) == 0x00000C, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::Length' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, InterpSeconds) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::InterpSeconds' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, bRelativeRotation) == 0x000014, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::bRelativeRotation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, __WorldContext) == 0x000018, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation, CallFunc_GetJackPlayerController_ReturnValue) == 0x000028, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Rotation::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Set Player Camera Target Rotation
// 0x0070 (0x0070 - 0x0000)
struct BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Length;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSeconds;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotator;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0058(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0064(0x000C)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation");
static_assert(sizeof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation) == 0x000070, "Wrong size on BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, Target) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::Target' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, Length) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::Length' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, InterpSeconds) == 0x00000C, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::InterpSeconds' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, OffsetRotator) == 0x000010, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::OffsetRotator' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, __WorldContext) == 0x000020, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000038, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000040, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000058, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation, CallFunc_ComposeRotators_ReturnValue) == 0x000064, "Member 'BP_FLIB_Gameplay_C_Set_Player_Camera_Target_Rotation::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Player Teleport And Camera Reset
// 0x0090 (0x0090 - 0x0000)
struct BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         CameraInterpSeconds;                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CameraRelativeRotation;                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0074(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset) == 0x000010, "Wrong alignment on BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset");
static_assert(sizeof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset) == 0x000090, "Wrong size on BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, Actor) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::Actor' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CameraRotation) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CameraRotation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CameraInterpSeconds) == 0x000014, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CameraInterpSeconds' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CameraRelativeRotation) == 0x000018, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CameraRelativeRotation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, __WorldContext) == 0x000020, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000060, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CallFunc_BreakTransform_Location) == 0x000068, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CallFunc_BreakTransform_Rotation) == 0x000074, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CallFunc_BreakTransform_Scale) == 0x000080, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset, CallFunc_K2_TeleportTo_ReturnValue) == 0x00008C, "Member 'BP_FLIB_Gameplay_C_Player_Teleport_And_Camera_Reset::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.Set Player Condition Riding On Horse
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse) == 0x000008, "Wrong alignment on BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse");
static_assert(sizeof(BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse) == 0x000010, "Wrong size on BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse, __WorldContext) == 0x000000, "Member 'BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse, CallFunc_GetJackGamePlayer_ReturnValue) == 0x000008, "Member 'BP_FLIB_Gameplay_C_Set_Player_Condition_Riding_On_Horse::CallFunc_GetJackGamePlayer_ReturnValue' has a wrong offset!");

// Function BP_FLIB_Gameplay.BP_FLIB_Gameplay_C.On Begin Gimmick
// 0x0058 (0x0058 - 0x0000)
struct BP_FLIB_Gameplay_C_On_Begin_Gimmick final
{
public:
	class AJackCharacter*                         JackCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreLookAt;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreFootIK;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreFieldActionControl;                         // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
