#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FukidasiWindowController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FukidasiWindowController.BP_FukidasiWindowController_C.ExecuteUbergraph_BP_FukidasiWindowController
// 0x06A0 (0x06A0 - 0x0000)
struct BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable2;                             // 0x0010(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable3;                             // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable4;                             // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable5;                             // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget19;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data24;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget18;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data23;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGFukidasiData*                   K2Node_DynamicCast_AsJack_UMGFukidasi_Data;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGActionCursorData*               K2Node_DynamicCast_AsJack_UMGAction_Cursor_Data;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_ActionCursor_Arrow_001_C*      K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_Arrow_001; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_SpawnActionCursor3dActor_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_UI3d_Icon_ActionCursor_Arrow_C*     K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Fukidasi_Window_000_modern_C*  K2Node_DynamicCast_AsWBP_Hud_Fukidasi_Window_000_Modern; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget17;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data22;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget16;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data21;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemGetIconData*                K2Node_DynamicCast_AsJack_UMGItem_Get_Icon_Data;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGFukidasiData*                   K2Node_DynamicCast_AsJack_UMGFukidasi_Data2;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Fukidasi_Window_000_modern_C*  K2Node_DynamicCast_AsWBP_Hud_Fukidasi_Window_000_Modern2; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Kakutoku_All_000_C*            K2Node_DynamicCast_AsWBP_Hud_Kakutoku_All_000;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget15;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data20;                               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget14;                             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data19;                               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_ActionCursor_All_000_C*        K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_000; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnActionCursor3dActor_ReturnValue2;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UI3d_Icon_ActionCursor_Arrow_C*     K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow2; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_ActionCursor_All_000_C*        K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_0002; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UI3d_Icon_BattleCursor_C*           K2Node_DynamicCast_AsBP_UI3d_Icon_Battle_Cursor;   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget13;                             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data18;                               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data17;                               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue4;               // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_SpawnActionCursor3dActor_ReturnValue3;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UI3d_Icon_ActionCursor_Arrow_C*     K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow3; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UI3d_Icon_EmotionIcon_C*            K2Node_DynamicCast_AsBP_UI3d_Icon_Emotion_Icon;    // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMonsterEmotionIconData*         K2Node_DynamicCast_AsJack_UMGMonster_Emotion_Icon_Data; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWBP_Hud_Emotion_000_C*                 K2Node_DynamicCast_AsWBP_Hud_Emotion_000;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x02D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_363[0x1];                                      // 0x0363(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable6;                             // 0x0364(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget12;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data16;                               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0384(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Name_000_modern_C*             K2Node_DynamicCast_AsWBP_Hud_Name_000_Modern;      // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMG3DWidgetData*                   K2Node_Event_Data15;                               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget11;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data14;                               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget10;                             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data13;                               // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Name_000_modern_C*             K2Node_DynamicCast_AsWBP_Hud_Name_000_Modern2;     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess19;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0xF];                                      // 0x03D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue5;               // 0x03E0(0x0030)(IsPlainOldData, NoDestructor)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data12;                               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select2_Default;                            // 0x041C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable7;                             // 0x0428(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult2;     // 0x0438(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue2;        // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget9;                              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data11;                               // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data10;                               // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget8;                              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data9;                                // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget7;                              // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data8;                                // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGFukidasiIconData*               K2Node_DynamicCast_AsJack_UMGFukidasi_Icon_Data;   // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess20;                     // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Npc_Icon_000_C*                K2Node_DynamicCast_AsWBP_Hud_Npc_Icon_000;         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess21;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget6;                              // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data7;                                // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0xF];                                      // 0x0531(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue6;               // 0x0540(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_SpawnActionCursor3dActor_ReturnValue4;    // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UI3d_Icon_ActionCursor_Arrow_C*     K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow4; // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess22;                     // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UI3d_Icon_BattleCursor_C*           K2Node_DynamicCast_AsBP_UI3d_Icon_Battle_Cursor2;  // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess23;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_ActionCursor_All_000_C*        K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_0003; // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess24;                     // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget5;                              // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data6;                                // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data5;                                // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget4;                              // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data4;                                // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI3d_Kazi_Material_C*              K2Node_DynamicCast_AsWBP_UI3d_Kazi_Material;       // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess25;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget3;                              // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data3;                                // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI3d_Kazi_Failed_C*                K2Node_DynamicCast_AsWBP_UI3d_Kazi_Failed;         // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess26;                     // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget2;                              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data2;                                // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_ActionCursor_Arrow_001_C*      K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_Arrow_0012; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess27;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMG3DWidgetData*                   K2Node_Event_Data;                                 // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI3d_Kazi_Success_C*               K2Node_DynamicCast_AsWBP_UI3d_Kazi_Success;        // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess28;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable8;                             // 0x063C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x0645(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_646[0x2];                                      // 0x0646(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMonsterEmotionIconData*         CallFunc_Array_Get_Item;                           // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_UI3d_Icon_ActionCursor_Arrow_C*     K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow5; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess29;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select3_Default;                            // 0x065C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select4_Default;                            // 0x066C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMonsterEmotionLoopIconData*     CallFunc_Array_Get_Item2;                          // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UI3d_Icon_ActionCursor_Arrow_C*     K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow6; // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess30;                     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController) == 0x000010, "Wrong alignment on BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController");
static_assert(sizeof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController) == 0x0006A0, "Wrong size on BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, EntryPoint) == 0x000000, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_bool_Variable) == 0x000004, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_struct_Variable) == 0x000008, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_struct_Variable2) == 0x000010, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_bool_Variable2) == 0x000024, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_bool_Variable3) == 0x000025, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_struct_Variable3) == 0x000028, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_struct_Variable4) == 0x000030, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_struct_Variable5) == 0x000038, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_int_Loop_Counter_Variable2) == 0x000040, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_Add_IntInt_ReturnValue2) == 0x000044, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, Temp_int_Array_Index_Variable2) == 0x000048, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget19) == 0x000050, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget19' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data24) == 0x000058, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data24' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget18) == 0x000060, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget18' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data23) == 0x000068, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data23' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsJack_UMGFukidasi_Data) == 0x000070, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsJack_UMGFukidasi_Data' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsJack_UMGAction_Cursor_Data) == 0x000080, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsJack_UMGAction_Cursor_Data' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess2) == 0x000088, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008A, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_Arrow_001) == 0x000090, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_Arrow_001' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess3) == 0x000098, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_SpawnActionCursor3dActor_ReturnValue) == 0x0000D0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_SpawnActionCursor3dActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_MakeTransform_ReturnValue2) == 0x0000E0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow) == 0x000110, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess4) == 0x000118, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Fukidasi_Window_000_Modern) == 0x000120, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Fukidasi_Window_000_Modern' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess5) == 0x000128, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget17) == 0x000130, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget17' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data22) == 0x000138, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data22' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget16) == 0x000140, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget16' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data21) == 0x000148, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data21' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsJack_UMGItem_Get_Icon_Data) == 0x000150, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsJack_UMGItem_Get_Icon_Data' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess6) == 0x000158, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsJack_UMGFukidasi_Data2) == 0x000160, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsJack_UMGFukidasi_Data2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess7) == 0x000168, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Fukidasi_Window_000_Modern2) == 0x000170, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Fukidasi_Window_000_Modern2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess8) == 0x000178, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Kakutoku_All_000) == 0x000180, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Kakutoku_All_000' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess9) == 0x000188, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget15) == 0x000190, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget15' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data20) == 0x000198, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data20' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget14) == 0x0001A0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget14' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data19) == 0x0001A8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data19' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_000) == 0x0001B0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_000' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess10) == 0x0001B8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_MakeTransform_ReturnValue3) == 0x0001C0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_IsValid_ReturnValue2) == 0x0001F0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_SpawnActionCursor3dActor_ReturnValue2) == 0x0001F8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_SpawnActionCursor3dActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow2) == 0x000200, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow2' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess11) == 0x000208, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_0002) == 0x000210, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_0002' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess12) == 0x000218, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsBP_UI3d_Icon_Battle_Cursor) == 0x000220, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsBP_UI3d_Icon_Battle_Cursor' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess13) == 0x000228, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Widget13) == 0x000230, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Widget13' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data18) == 0x000238, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data18' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_Event_Data17) == 0x000240, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_Event_Data17' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_IsValid_ReturnValue3) == 0x000248, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_MakeTransform_ReturnValue4) == 0x000250, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_MakeTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_SpawnActionCursor3dActor_ReturnValue3) == 0x000280, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_SpawnActionCursor3dActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow3) == 0x000288, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsBP_UI3d_Icon_Action_Cursor_Arrow3' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess14) == 0x000290, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsBP_UI3d_Icon_Emotion_Icon) == 0x000298, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsBP_UI3d_Icon_Emotion_Icon' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess15) == 0x0002A0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsJack_UMGMonster_Emotion_Icon_Data) == 0x0002A8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsJack_UMGMonster_Emotion_Icon_Data' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess16) == 0x0002B0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_IsValid_ReturnValue4) == 0x0002B1, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0002B8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_AsWBP_Hud_Emotion_000) == 0x0002C8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_AsWBP_Hud_Emotion_000' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, K2Node_DynamicCast_bSuccess17) == 0x0002D0, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002D1, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0002D8, "Member 'BP_FukidasiWindowController_C_ExecuteUbergraph_BP_FukidasiWindowController::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
