#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FLIB_Npc

#include "Basic.hpp"

#include "ENUM_ChairTarget_structs.hpp"
#include "JackGame_structs.hpp"
#include "STRUCT_TalkParamCustom_structs.hpp"
#include "STRUCT_NpcLookatParam_structs.hpp"
#include "ENUM_Schedule_Pattern_structs.hpp"
#include "ENUM_AfterInterruptPlayerLeaveDistance_structs.hpp"
#include "STRUCT_NpcMoveParam_structs.hpp"
#include "STRUCT_MoveAndAnimParam_structs.hpp"
#include "ENUM_NpcChairPosition_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_NpcFukidasiDisc_structs.hpp"


namespace SDK::Params
{

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.CreateFukidasiDialogue
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Npc_C_CreateFukidasiDialogue final
{
public:
	TArray<struct FSTRUCT_NpcFukidasiDisc>        bpp__FukidasiDiscArray__pf;                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__CreateInstance__pf;                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_CreateFukidasiDialogue) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_CreateFukidasiDialogue");
static_assert(sizeof(BP_FLIB_Npc_C_CreateFukidasiDialogue) == 0x000020, "Wrong size on BP_FLIB_Npc_C_CreateFukidasiDialogue");
static_assert(offsetof(BP_FLIB_Npc_C_CreateFukidasiDialogue, bpp__FukidasiDiscArray__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_CreateFukidasiDialogue::bpp__FukidasiDiscArray__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_CreateFukidasiDialogue, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_CreateFukidasiDialogue::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_CreateFukidasiDialogue, bpp__CreateInstance__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_CreateFukidasiDialogue::bpp__CreateInstance__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetChairTargetFromIndex
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Npc_C_GetChairTargetFromIndex final
{
public:
	class ABP_ChairTargetBase_C*                  bpp__TargetChair__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_ChairTarget                              bpp__Index__pf;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   bpp__Target__pf;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_GetChairTargetFromIndex) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetChairTargetFromIndex");
static_assert(sizeof(BP_FLIB_Npc_C_GetChairTargetFromIndex) == 0x000020, "Wrong size on BP_FLIB_Npc_C_GetChairTargetFromIndex");
static_assert(offsetof(BP_FLIB_Npc_C_GetChairTargetFromIndex, bpp__TargetChair__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetChairTargetFromIndex::bpp__TargetChair__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetChairTargetFromIndex, bpp__Index__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetChairTargetFromIndex::bpp__Index__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetChairTargetFromIndex, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetChairTargetFromIndex::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetChairTargetFromIndex, bpp__Target__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_GetChairTargetFromIndex::bpp__Target__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetGuestCharacterFromID
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_GetGuestCharacterFromID final
{
public:
	EJackCharacter                                bpp__GuestID__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJackCharacter*                         bpp__GuestInst__pf;                                // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_GetGuestCharacterFromID) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetGuestCharacterFromID");
static_assert(sizeof(BP_FLIB_Npc_C_GetGuestCharacterFromID) == 0x000018, "Wrong size on BP_FLIB_Npc_C_GetGuestCharacterFromID");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestCharacterFromID, bpp__GuestID__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetGuestCharacterFromID::bpp__GuestID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestCharacterFromID, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetGuestCharacterFromID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestCharacterFromID, bpp__GuestInst__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetGuestCharacterFromID::bpp__GuestInst__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetGuestLocation
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Npc_C_GetGuestLocation final
{
public:
	EJackCharacter                                bpp__GuestID__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__GuestLocation__pf;                            // 0x0010(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Npc_C_GetGuestLocation) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetGuestLocation");
static_assert(sizeof(BP_FLIB_Npc_C_GetGuestLocation) == 0x000020, "Wrong size on BP_FLIB_Npc_C_GetGuestLocation");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestLocation, bpp__GuestID__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetGuestLocation::bpp__GuestID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestLocation, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetGuestLocation::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestLocation, bpp__GuestLocation__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetGuestLocation::bpp__GuestLocation__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetGuestRotation
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Npc_C_GetGuestRotation final
{
public:
	EJackCharacter                                bpp__GuestID__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               bpp__GuestRotation__pf;                            // 0x0010(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Npc_C_GetGuestRotation) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetGuestRotation");
static_assert(sizeof(BP_FLIB_Npc_C_GetGuestRotation) == 0x000020, "Wrong size on BP_FLIB_Npc_C_GetGuestRotation");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestRotation, bpp__GuestID__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetGuestRotation::bpp__GuestID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestRotation, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetGuestRotation::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetGuestRotation, bpp__GuestRotation__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetGuestRotation::bpp__GuestRotation__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetLocationVolumeInfoFromID
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Npc_C_GetLocationVolumeInfoFromID final
{
public:
	struct FJackLDT_UIMapInfo                     bpp__ID__pf;                                       // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackFloorLevel                               bpp__FloorLv__pf;                                  // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackFloorArea                                bpp__FloorArea__pf;                                // 0x001A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetLocationVolumeInfoFromID");
static_assert(sizeof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID) == 0x000020, "Wrong size on BP_FLIB_Npc_C_GetLocationVolumeInfoFromID");
static_assert(offsetof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID, bpp__ID__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetLocationVolumeInfoFromID::bpp__ID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetLocationVolumeInfoFromID::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID, bpp__Result__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_GetLocationVolumeInfoFromID::bpp__Result__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID, bpp__FloorLv__pf) == 0x000019, "Member 'BP_FLIB_Npc_C_GetLocationVolumeInfoFromID::bpp__FloorLv__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLocationVolumeInfoFromID, bpp__FloorArea__pf) == 0x00001A, "Member 'BP_FLIB_Npc_C_GetLocationVolumeInfoFromID::bpp__FloorArea__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetLookAtTargetInfoDefaultForOther
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Angle__pf;                                    // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther");
static_assert(sizeof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther) == 0x000010, "Wrong size on BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther, bpp__Distance__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther::bpp__Distance__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther, bpp__Angle__pf) == 0x00000C, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForOther::bpp__Angle__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetLookAtTargetInfoDefaultForPlayer
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer final
{
public:
	bool                                          bpp__IsInRoom__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Angle__pf;                                    // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer");
static_assert(sizeof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer) == 0x000018, "Wrong size on BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer, bpp__IsInRoom__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer::bpp__IsInRoom__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer, bpp__Distance__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer::bpp__Distance__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer, bpp__Angle__pf) == 0x000014, "Member 'BP_FLIB_Npc_C_GetLookAtTargetInfoDefaultForPlayer::bpp__Angle__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.GetPlayTalkEndAnimation
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Npc_C_GetPlayTalkEndAnimation final
{
public:
	bool                                          bpp__PlayFlag__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ForceSkipAnimation__pf;                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           bpp__DefaultAnim__pf;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__ReplaceAnim__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__PlayAnim__pf;                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_GetPlayTalkEndAnimation");
static_assert(sizeof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation) == 0x000028, "Wrong size on BP_FLIB_Npc_C_GetPlayTalkEndAnimation");
static_assert(offsetof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation, bpp__PlayFlag__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_GetPlayTalkEndAnimation::bpp__PlayFlag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation, bpp__ForceSkipAnimation__pf) == 0x000001, "Member 'BP_FLIB_Npc_C_GetPlayTalkEndAnimation::bpp__ForceSkipAnimation__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation, bpp__DefaultAnim__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_GetPlayTalkEndAnimation::bpp__DefaultAnim__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation, bpp__ReplaceAnim__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_GetPlayTalkEndAnimation::bpp__ReplaceAnim__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_GetPlayTalkEndAnimation::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_GetPlayTalkEndAnimation, bpp__PlayAnim__pf) == 0x000020, "Member 'BP_FLIB_Npc_C_GetPlayTalkEndAnimation::bpp__PlayAnim__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.Get ChairLoopAnim
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_Get_ChairLoopAnim final
{
public:
	class AJackScheduledNPC*                      bpp__Target__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__ChairAnimLoop__pf;                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_Get_ChairLoopAnim) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_Get_ChairLoopAnim");
static_assert(sizeof(BP_FLIB_Npc_C_Get_ChairLoopAnim) == 0x000018, "Wrong size on BP_FLIB_Npc_C_Get_ChairLoopAnim");
static_assert(offsetof(BP_FLIB_Npc_C_Get_ChairLoopAnim, bpp__Target__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_Get_ChairLoopAnim::bpp__Target__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_Get_ChairLoopAnim, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_Get_ChairLoopAnim::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_Get_ChairLoopAnim, bpp__ChairAnimLoop__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_Get_ChairLoopAnim::bpp__ChairAnimLoop__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.MonsterVariantFormEnable
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_MonsterVariantFormEnable final
{
public:
	class ABP_NPC_Monster_Base_C*                 bpp__Monster__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bMonsterVariantForm__pf;                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_MonsterVariantFormEnable) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_MonsterVariantFormEnable");
static_assert(sizeof(BP_FLIB_Npc_C_MonsterVariantFormEnable) == 0x000018, "Wrong size on BP_FLIB_Npc_C_MonsterVariantFormEnable");
static_assert(offsetof(BP_FLIB_Npc_C_MonsterVariantFormEnable, bpp__Monster__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_MonsterVariantFormEnable::bpp__Monster__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_MonsterVariantFormEnable, bpp__bMonsterVariantForm__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_MonsterVariantFormEnable::bpp__bMonsterVariantForm__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_MonsterVariantFormEnable, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_MonsterVariantFormEnable::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.MovableForciblyNotGrounded
// 0x0010 (0x0010 - 0x0000)
struct BP_FLIB_Npc_C_MovableForciblyNotGrounded final
{
public:
	class AJackScheduledNPC*                      bpp__TargetNpc__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_MovableForciblyNotGrounded) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_MovableForciblyNotGrounded");
static_assert(sizeof(BP_FLIB_Npc_C_MovableForciblyNotGrounded) == 0x000010, "Wrong size on BP_FLIB_Npc_C_MovableForciblyNotGrounded");
static_assert(offsetof(BP_FLIB_Npc_C_MovableForciblyNotGrounded, bpp__TargetNpc__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_MovableForciblyNotGrounded::bpp__TargetNpc__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_MovableForciblyNotGrounded, bpp____WorldContext__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_MovableForciblyNotGrounded::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.NpcAttachmentVisibleCtrl
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl final
{
public:
	class ABP_NPC_Human_Base_C*                   bpp__NPC__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bHidden__pf;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl");
static_assert(sizeof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl) == 0x000018, "Wrong size on BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl");
static_assert(offsetof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl, bpp__NPC__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl::bpp__NPC__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl, bpp__bHidden__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl::bpp__bHidden__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_NpcAttachmentVisibleCtrl::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.NpcAttachmentVisibleCtrlFromTimeZone
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone final
{
public:
	class AJackScheduledNPC*                      bpp__NPC__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_Schedule_Pattern                         bpp__SchedulePtn__pf;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone");
static_assert(sizeof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone) == 0x000018, "Wrong size on BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone");
static_assert(offsetof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone, bpp__NPC__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone::bpp__NPC__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone, bpp__SchedulePtn__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone::bpp__SchedulePtn__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_NpcAttachmentVisibleCtrlFromTimeZone::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.PlayTalkStartAnimationCoreImpl
// 0x0058 (0x0058 - 0x0000)
struct BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl final
{
public:
	class AJackScheduledNPC*                      bpp__NPC__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__PlayFlag__pf;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           bpp__AnimMontage__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__AdddiveAnimMongage__pf;                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__WithTurn__pf;                                 // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__MessagexID__pfT;                              // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__TalkxBehind__pfT;                             // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         bpp__GazexCharacter__pfT;                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__OutMessageID__pf;                             // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bExecuteStartAnimation__pf;                   // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl");
static_assert(sizeof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl) == 0x000058, "Wrong size on BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__NPC__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__NPC__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__PlayFlag__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__PlayFlag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__AnimMontage__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__AnimMontage__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__AdddiveAnimMongage__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__AdddiveAnimMongage__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__WithTurn__pf) == 0x000020, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__WithTurn__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__MessagexID__pfT) == 0x000028, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__MessagexID__pfT' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__TalkxBehind__pfT) == 0x000030, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__TalkxBehind__pfT' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__GazexCharacter__pfT) == 0x000038, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__GazexCharacter__pfT' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp____WorldContext__pf) == 0x000040, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__OutMessageID__pf) == 0x000048, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__OutMessageID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl, bpp__bExecuteStartAnimation__pf) == 0x000050, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationCoreImpl::bpp__bExecuteStartAnimation__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.PlayTalkStartAnimationDefaultForCamp
// 0x0020 (0x0020 - 0x0000)
struct BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp final
{
public:
	class ABP_NPC_TalkBase_C*                     bpp__NPC__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__MessageID__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__OutMessageID__pf;                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp");
static_assert(sizeof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp) == 0x000020, "Wrong size on BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp, bpp__NPC__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp::bpp__NPC__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp, bpp__MessageID__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp::bpp__MessageID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp, bpp__OutMessageID__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultForCamp::bpp__OutMessageID__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.PlayTalkStartAnimationDefaultImpl
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl final
{
public:
	class ABP_NPC_TalkBase_C*                     bpp__NPC__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__AdditiveAnimMontage__pf;                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__MessageID__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__AddiveAnimeDisable__pf;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__OutMessageID__pf;                             // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl");
static_assert(sizeof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl) == 0x000030, "Wrong size on BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl, bpp__NPC__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl::bpp__NPC__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl, bpp__AdditiveAnimMontage__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl::bpp__AdditiveAnimMontage__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl, bpp__MessageID__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl::bpp__MessageID__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl, bpp__AddiveAnimeDisable__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl::bpp__AddiveAnimeDisable__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl, bpp____WorldContext__pf) == 0x000020, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl, bpp__OutMessageID__pf) == 0x000028, "Member 'BP_FLIB_Npc_C_PlayTalkStartAnimationDefaultImpl::bpp__OutMessageID__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.Reset NPC Schedule NowTime
// 0x0008 (0x0008 - 0x0000)
struct BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime");
static_assert(sizeof(BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime) == 0x000008, "Wrong size on BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime");
static_assert(offsetof(BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime, bpp____WorldContext__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_Reset_NPC_Schedule_NowTime::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.ScheduleChangeDisableDither
// 0x0018 (0x0018 - 0x0000)
struct BP_FLIB_Npc_C_ScheduleChangeDisableDither final
{
public:
	TArray<class AJackScheduledNPC*>              bpp__TargetNpc__pf;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_ScheduleChangeDisableDither) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_ScheduleChangeDisableDither");
static_assert(sizeof(BP_FLIB_Npc_C_ScheduleChangeDisableDither) == 0x000018, "Wrong size on BP_FLIB_Npc_C_ScheduleChangeDisableDither");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleChangeDisableDither, bpp__TargetNpc__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_ScheduleChangeDisableDither::bpp__TargetNpc__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleChangeDisableDither, bpp____WorldContext__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_ScheduleChangeDisableDither::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.ScheduleEntryTypeChair
// 0x0058 (0x0058 - 0x0000)
struct BP_FLIB_Npc_C_ScheduleEntryTypeChair final
{
public:
	class AJackScheduledNPC*                      bpp__Target__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ChairTag__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__LoopAnimation__pf;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__AddiveAnimation__pf;                          // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_TalkParamCustom                bpp__TalkDisc__pf;                                 // 0x0020(0x0028)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_Schedule_Pattern                         bpp__Pattern__pf;                                  // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReduction__pf;            // 0x0049(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf;      // 0x004A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_FLIB_Npc_C_ScheduleEntryTypeChair) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_ScheduleEntryTypeChair");
static_assert(sizeof(BP_FLIB_Npc_C_ScheduleEntryTypeChair) == 0x000058, "Wrong size on BP_FLIB_Npc_C_ScheduleEntryTypeChair");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__Target__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__Target__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__ChairTag__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__ChairTag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__LoopAnimation__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__LoopAnimation__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__AddiveAnimation__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__AddiveAnimation__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__TalkDisc__pf) == 0x000020, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__TalkDisc__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__Pattern__pf) == 0x000048, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__Pattern__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__bDoNotSkipTickAtLoadReduction__pf) == 0x000049, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__bDoNotSkipTickAtLoadReduction__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf) == 0x00004A, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeChair, bpp____WorldContext__pf) == 0x000050, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeChair::bpp____WorldContext__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.ScheduleEntryTypeStaticChair_Multi
// 0x0030 (0x0030 - 0x0000)
struct BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi final
{
public:
	class AJackScheduledNPC*                      bpp__Target__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_Schedule_Pattern                         bpp__Ptn__pf;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Loop__pf;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Disappear__pf;                                // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReduction__pf;            // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf;      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ChairTag__pf;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_ChairTarget                              bpp__TargetIndex__pf;                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi");
static_assert(sizeof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi) == 0x000030, "Wrong size on BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__Target__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__Target__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__Ptn__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__Ptn__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__Loop__pf) == 0x000009, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__Loop__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__Disappear__pf) == 0x00000A, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__Disappear__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__bDoNotSkipTickAtLoadReduction__pf) == 0x00000B, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__bDoNotSkipTickAtLoadReduction__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf) == 0x00000C, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__ChairTag__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__ChairTag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__TargetIndex__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__TargetIndex__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp____WorldContext__pf) == 0x000020, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi, bpp__Result__pf) == 0x000028, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Multi::bpp__Result__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.ScheduleEntryTypeStaticChair_Single
// 0x0028 (0x0028 - 0x0000)
struct BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single final
{
public:
	class AJackScheduledNPC*                      bpp__Target__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_Schedule_Pattern                         bpp__Ptn__pf;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Loop__pf;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Disappear__pf;                                // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReduction__pf;            // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf;      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ChairTag__pf;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single) == 0x000008, "Wrong alignment on BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single");
static_assert(sizeof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single) == 0x000028, "Wrong size on BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__Target__pf) == 0x000000, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__Target__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__Ptn__pf) == 0x000008, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__Ptn__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__Loop__pf) == 0x000009, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__Loop__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__Disappear__pf) == 0x00000A, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__Disappear__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__bDoNotSkipTickAtLoadReduction__pf) == 0x00000B, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__bDoNotSkipTickAtLoadReduction__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf) == 0x00000C, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__ChairTag__pf) == 0x000010, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__ChairTag__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp____WorldContext__pf) == 0x000018, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp____WorldContext__pf' has a wrong offset!");
static_assert(offsetof(BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single, bpp__Result__pf) == 0x000020, "Member 'BP_FLIB_Npc_C_ScheduleEntryTypeStaticChair_Single::bpp__Result__pf' has a wrong offset!");

// Function BP_FLIB_Npc.BP_FLIB_Npc_C.ScheduleEntryTypeStaticMultiChair_Talk
// 0x0080 (0x0080 - 0x0000)
struct BP_FLIB_Npc_C_ScheduleEntryTypeStaticMultiChair_Talk final
{
public:
	class AJackScheduledNPC*                      bpp__Target__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_Schedule_Pattern                         bpp__Ptn__pf;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Loop__pf;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Disappear__pf;                                // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReduction__pf;            // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bDoNotSkipTickAtLoadReductionDoSkip__pf;      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           bpp__ChairAnim__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           bpp__AddiveAnim__pf;                               // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ChairTag__pf;                                 // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__UsexCommonxTalkxCamera__pfTTT;                // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__TalkxSequencexEventxxName__pfTTTT;            // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__GazeModeLookAtDisable__pf;                    // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_ChairTarget                              bpp__TartetIndex__pf;                              // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__FukidasiID__pf__const;                        // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
