#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HUD.BP_HUD_C
// 0x0040 (0x06B0 - 0x0670)
class ABP_HUD_C final : public AJackHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SenrekiActor;                                      // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Balloon_002_C*                 NewVar_0;                                          // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Balloon_003_C*                 NewVar_1;                                          // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Balloon_004_C*                 NewVar_2;                                          // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TestOffset;                                        // 0x06A0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HUD(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SpawnPopupBalloon(const struct FVector& InWorldLocation, EJackPopupBalloon InPopupBalloon, int32 InNumber, class UJackGameCharacter* InGameCharacter, class USkeletalMeshComponent* InLocalMesh, class FName InSocketName);
	void CheckReamAttack(const struct FVector& InPosition, class UJackGameCharacter* InGameCharacter, struct FVector* OutPosition);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HUD_C">();
	}
	static class ABP_HUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HUD_C>();
	}
};
static_assert(alignof(ABP_HUD_C) == 0x000008, "Wrong alignment on ABP_HUD_C");
static_assert(sizeof(ABP_HUD_C) == 0x0006B0, "Wrong size on ABP_HUD_C");
static_assert(offsetof(ABP_HUD_C, UberGraphFrame) == 0x000670, "Member 'ABP_HUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HUD_C, DefaultSceneRoot) == 0x000678, "Member 'ABP_HUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HUD_C, SenrekiActor) == 0x000680, "Member 'ABP_HUD_C::SenrekiActor' has a wrong offset!");
static_assert(offsetof(ABP_HUD_C, NewVar_0) == 0x000688, "Member 'ABP_HUD_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_HUD_C, NewVar_1) == 0x000690, "Member 'ABP_HUD_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ABP_HUD_C, NewVar_2) == 0x000698, "Member 'ABP_HUD_C::NewVar_2' has a wrong offset!");
static_assert(offsetof(ABP_HUD_C, TestOffset) == 0x0006A0, "Member 'ABP_HUD_C::TestOffset' has a wrong offset!");

}

