#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemPresentManager

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemPresentManager.BP_ItemPresentManager_C.ExecuteUbergraph_BP_ItemPresentManager
// 0x0810 (0x0810 - 0x0000)
struct BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable;                              // 0x0020(0x0005)(NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackRecipeBookManager*                 CallFunc_GetRecipeBookManager_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable2;                             // 0x0030(0x0005)(NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue2;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue3;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue4;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackRecipeBookManager*                 CallFunc_GetRecipeBookManager_ReturnValue2;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue5;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackRecipeBookManager*                 CallFunc_GetRecipeBookManager_ReturnValue3;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue6;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue7;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue8;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackRecipeBookManager*                 CallFunc_GetRecipeBookManager_ReturnValue4;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue9;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue3;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue10;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue3;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue11;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue12;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue2;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue13;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue2;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue14;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue3;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue15;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue16;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue3;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue17;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x01C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue4;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue18;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue4;           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable6;                             // 0x0218(0x0005)(NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue4;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable7;                             // 0x0228(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable8;                             // 0x022D(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable9;                             // 0x0232(0x0005)(NoDestructor)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue19;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable10;                            // 0x0240(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable11;                            // 0x0245(0x0005)(NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue4;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue20;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable12;                            // 0x0260(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable13;                            // 0x0265(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable14;                            // 0x026A(0x0005)(NoDestructor)
	uint8                                         Pad_26F[0x1];                                      // 0x026F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable5;                             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable6;                             // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable15;                            // 0x0291(0x0005)(NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue5;           // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue21;             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue5;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue5;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable16;                            // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable17;                            // 0x02E0(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable18;                            // 0x02E5(0x0005)(NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable7;                             // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DlcId;                                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue5;       // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackItemPresentPackage                CallFunc_GetItemPresentPackage_OutPackage;         // 0x0310(0x0048)()
	bool                                          CallFunc_GetItemPresentPackage_ReturnValue;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresentPackage                CallFunc_GetItemPresentPackage_OutPackage2;        // 0x0360(0x0048)()
	bool                                          CallFunc_GetItemPresentPackage_ReturnValue2;       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresent                       CallFunc_Array_Get_Item;                           // 0x03B0(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue;                    // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag2;                   // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue2;                   // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_Selling_ReturnValue;             // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGoldGetMessageTag_ReturnValue;        // 0x03E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayFieldMessageAtTextID_ReturnValue;  // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncreaseGold_ReturnValue;                 // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x03FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FF[0x1];                                      // 0x03FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeItemGetMessageTag_ReturnValue;        // 0x0400(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_LearningRecipeBookFromItemId_OutLearningList; // 0x0418(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LearningRecipeBookFromItemId_ReturnValue; // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGetAndReadRecipeBookMessageTag_ReturnValue; // 0x0440(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeItemGetMessageTextID_ReturnValue;     // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistItem_ReturnValue;                  // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Classification                      CallFunc_GetClassification_ReturnValue;            // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x046B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckExcessItem_ReturnValue;              // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x046E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46F[0x1];                                      // 0x046F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresentPackage                CallFunc_GetItemPresentPackage_OutPackage3;        // 0x0470(0x0048)()
	bool                                          CallFunc_GetItemPresentPackage_ReturnValue3;       // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGoldGetMessageTag_ReturnValue2;       // 0x04C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayFieldMessageAtTextID_ReturnValue2; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackItemPresent                       CallFunc_Array_Get_Item2;                          // 0x04D8(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag3;                   // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue3;                   // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag4;                   // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue4;                   // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_Selling_ReturnValue2;            // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGoldGetMessageTag_ReturnValue3;       // 0x0508(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayFieldMessageAtTextID_ReturnValue3; // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncreaseGold_ReturnValue2;                // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0525(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x0526(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527[0x1];                                      // 0x0527(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeItemGetMessageTag_ReturnValue2;       // 0x0528(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_LearningRecipeBookFromItemId_OutLearningList2; // 0x0540(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LearningRecipeBookFromItemId_ReturnValue2; // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select2_Default;                            // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGetAndReadRecipeBookMessageTag_ReturnValue2; // 0x0568(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeItemGetMessageTextID_ReturnValue2;    // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistItem_ReturnValue2;                 // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Classification                      CallFunc_GetClassification_ReturnValue2;           // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue6;         // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x0593(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0595(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_596[0x2];                                      // 0x0596(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IncreaseGold_ReturnValue3;                // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue5;              // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresentPackage                CallFunc_GetItemPresentPackage_OutPackage4;        // 0x05A0(0x0048)()
	bool                                          CallFunc_GetItemPresentPackage_ReturnValue4;       // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresentPackage                CallFunc_GetItemPresentPackage_OutPackage5;        // 0x05F0(0x0048)()
	bool                                          CallFunc_GetItemPresentPackage_ReturnValue5;       // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresent                       CallFunc_Array_Get_Item3;                          // 0x0640(0x0010)(NoDestructor)
	struct FJackItemPresent                       CallFunc_Array_Get_Item4;                          // 0x0650(0x0010)(NoDestructor)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag5;                   // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue5;                   // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag6;                   // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue6;                   // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag7;                   // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StoreItem_ReturnValue7;                   // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_Selling_ReturnValue3;            // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue3;             // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGoldGetMessageTag_ReturnValue4;       // 0x0680(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayFieldMessageAtTextID_ReturnValue4; // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncreaseGold_ReturnValue4;                // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue6;              // 0x069C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue7;         // 0x069D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue8;         // 0x069E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69F[0x1];                                      // 0x069F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeItemGetMessageTag_ReturnValue3;       // 0x06A0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_LearningRecipeBookFromItemId_OutLearningList3; // 0x06B8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LearningRecipeBookFromItemId_ReturnValue3; // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select3_Default;                            // 0x06D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGetAndReadRecipeBookMessageTag_ReturnValue3; // 0x06E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x06F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeItemGetMessageTextID_ReturnValue3;    // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistItem_ReturnValue3;                 // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Classification                      CallFunc_GetClassification_ReturnValue3;           // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue9;         // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_StoreItem_OutStoreBag8;                   // 0x070B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StoreItem_ReturnValue8;                   // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue4;             // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue10;        // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue11;        // 0x0712(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_713[0x5];                                      // 0x0713(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeItemGetMessageTag_ReturnValue4;       // 0x0718(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPrice_Selling_ReturnValue4;            // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_LearningRecipeBookFromItemId_OutLearningList4; // 0x0730(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LearningRecipeBookFromItemId_ReturnValue4; // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGoldGetMessageTag_ReturnValue5;       // 0x0748(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayFieldMessageAtTextID_ReturnValue5; // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncreaseGold_ReturnValue5;                // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue7;              // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_765[0x3];                                      // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeGetAndReadRecipeBookMessageTag_ReturnValue4; // 0x0768(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsExistItem_ReturnValue4;                 // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Classification                      CallFunc_GetClassification_ReturnValue4;           // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue12;        // 0x077A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77B[0x1];                                      // 0x077B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue8;              // 0x0784(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0785(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x0786(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_787[0x1];                                      // 0x0787(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue4;             // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue9;              // 0x0795(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue4;            // 0x0796(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0797(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 Temp_string_Variable8;                             // 0x0798(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable19;                            // 0x07A8(0x0005)(NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x07AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AE[0x2];                                      // 0x07AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue6;       // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select4_Default;                            // 0x07B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x07C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue7;       // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeItemGetMessageTextID_ReturnValue4;    // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVestedFlag_ReturnValue;                 // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable20;                            // 0x07E9(0x0005)(NoDestructor)
	uint8                                         Pad_7EE[0x2];                                      // 0x07EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable21;                            // 0x07F0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable22;                            // 0x0800(0x0005)(NoDestructor)
	struct FJackSerifuAutomationFlags             Temp_struct_Variable23;                            // 0x0805(0x0005)(NoDestructor)
};
static_assert(alignof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager) == 0x000008, "Wrong alignment on BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager");
static_assert(sizeof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager) == 0x000810, "Wrong size on BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, EntryPoint) == 0x000000, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_string_Variable) == 0x000008, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue) == 0x000018, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_struct_Variable) == 0x000020, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetRecipeBookManager_ReturnValue) == 0x000028, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetRecipeBookManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_struct_Variable2) == 0x000030, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue2) == 0x000038, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue3) == 0x000040, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_string_Variable2) == 0x000048, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_string_Variable3) == 0x000058, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue4) == 0x000068, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetRecipeBookManager_ReturnValue2) == 0x000070, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetRecipeBookManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue5) == 0x000078, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetRecipeBookManager_ReturnValue3) == 0x000080, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetRecipeBookManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_NameToString_ReturnValue) == 0x000088, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue6) == 0x000098, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_struct_Variable3) == 0x0000B0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue7) == 0x0000C8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_bool_Variable) == 0x0000D0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_NameToString_ReturnValue2) == 0x0000D8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue8) == 0x0000E8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000F0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemPresentManager_ReturnValue) == 0x000100, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemPresentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_StringToName_ReturnValue2) == 0x000108, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetRecipeBookManager_ReturnValue4) == 0x000110, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetRecipeBookManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue9) == 0x000118, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_NameToString_ReturnValue3) == 0x000120, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_NameToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue10) == 0x000130, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Concat_StrStr_ReturnValue3) == 0x000138, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_StringToName_ReturnValue3) == 0x000148, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_StringToName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetJackGamePlayer_ReturnValue) == 0x000150, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetJackGamePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue11) == 0x000158, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue12) == 0x000160, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_bool_Variable2) == 0x000168, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemPresentManager_ReturnValue2) == 0x000170, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemPresentManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue13) == 0x000178, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetJackGamePlayer_ReturnValue2) == 0x000180, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetJackGamePlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue14) == 0x000188, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetJackGamePlayer_ReturnValue3) == 0x000190, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetJackGamePlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue15) == 0x000198, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue16) == 0x0001A0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_string_Variable4) == 0x0001A8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemPresentManager_ReturnValue3) == 0x0001B8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemPresentManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue17) == 0x0001C0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_struct_Variable4) == 0x0001C8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetJackGamePlayer_ReturnValue4) == 0x0001D8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetJackGamePlayer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_GetItemManager_ReturnValue18) == 0x0001E0, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_GetItemManager_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_NameToString_ReturnValue4) == 0x0001E8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_NameToString_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_struct_Variable5) == 0x0001F8, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Concat_StrStr_ReturnValue4) == 0x000208, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, Temp_struct_Variable6) == 0x000218, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager, CallFunc_Conv_StringToName_ReturnValue4) == 0x000220, "Member 'BP_ItemPresentManager_C_ExecuteUbergraph_BP_ItemPresentManager::CallFunc_Conv_StringToName_ReturnValue4' has a wrong offset!");
