#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IF_BoneDynamicsParameterTrial

#include "Basic.hpp"

#include "STRUCT_SoftBoneChainSettings_structs.hpp"
#include "STRUCT_MaxOrMinRot_structs.hpp"


namespace SDK::Params
{

// Function BP_IF_BoneDynamicsParameterTrial.BP_IF_BoneDynamicsParameterTrial_C.GetMaxOrMinRotParam
// 0x0040 (0x0040 - 0x0000)
struct BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 bpp__Class__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__StateName__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_MaxOrMinRot                    bpp__Result__pf;                                   // 0x0018(0x0028)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam) == 0x000008, "Wrong alignment on BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam");
static_assert(sizeof(BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam) == 0x000040, "Wrong size on BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam, bpp__Index__pf) == 0x000000, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam::bpp__Index__pf' has a wrong offset!");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam, bpp__Class__pf) == 0x000008, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam::bpp__Class__pf' has a wrong offset!");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam, bpp__StateName__pf) == 0x000010, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam::bpp__StateName__pf' has a wrong offset!");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam, bpp__Result__pf) == 0x000018, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetMaxOrMinRotParam::bpp__Result__pf' has a wrong offset!");

// Function BP_IF_BoneDynamicsParameterTrial.BP_IF_BoneDynamicsParameterTrial_C.GetSoftBoneChainSettings
// 0x0020 (0x0020 - 0x0000)
struct BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 bpp__Class__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_SoftBoneChainSettings          bpp__Result__pf;                                   // 0x0010(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings) == 0x000008, "Wrong alignment on BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings");
static_assert(sizeof(BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings) == 0x000020, "Wrong size on BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings, bpp__Index__pf) == 0x000000, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings::bpp__Index__pf' has a wrong offset!");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings, bpp__Class__pf) == 0x000008, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings::bpp__Class__pf' has a wrong offset!");
static_assert(offsetof(BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings, bpp__Result__pf) == 0x000010, "Member 'BP_IF_BoneDynamicsParameterTrial_C_GetSoftBoneChainSettings::bpp__Result__pf' has a wrong offset!");

}

