#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemGettableObjectBase_3StepItem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemGettableObjectBase_3StepItem.BP_ItemGettableObjectBase_3StepItem_C.ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0) == 0x000004, "Wrong alignment on BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0");
static_assert(sizeof(BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0) == 0x000004, "Wrong size on BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_ItemGettableObjectBase_3StepItem_C_ExecuteUbergraph_BP_ItemGettableObjectBase_3StepItem_0::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_ItemGettableObjectBase_3StepItem.BP_ItemGettableObjectBase_3StepItem_C.IsShowPause
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemGettableObjectBase_3StepItem_C_IsShowPause final
{
public:
	bool                                          bpp__IsInBattle__pf;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_ItemGettableObjectBase_3StepItem_C_IsShowPause) == 0x000001, "Wrong alignment on BP_ItemGettableObjectBase_3StepItem_C_IsShowPause");
static_assert(sizeof(BP_ItemGettableObjectBase_3StepItem_C_IsShowPause) == 0x000001, "Wrong size on BP_ItemGettableObjectBase_3StepItem_C_IsShowPause");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_IsShowPause, bpp__IsInBattle__pf) == 0x000000, "Member 'BP_ItemGettableObjectBase_3StepItem_C_IsShowPause::bpp__IsInBattle__pf' has a wrong offset!");

// Function BP_ItemGettableObjectBase_3StepItem.BP_ItemGettableObjectBase_3StepItem_C.ItemGetObject
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject final
{
public:
	class ABP_KiraSpawnBase_C*                    bpp__KiraSpawnBase__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__InStartDelaySec__pf;                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DelayMessageSec__pf;                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject) == 0x000008, "Wrong alignment on BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject");
static_assert(sizeof(BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject) == 0x000010, "Wrong size on BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject, bpp__KiraSpawnBase__pf) == 0x000000, "Member 'BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject::bpp__KiraSpawnBase__pf' has a wrong offset!");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject, bpp__InStartDelaySec__pf) == 0x000008, "Member 'BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject::bpp__InStartDelaySec__pf' has a wrong offset!");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject, bpp__DelayMessageSec__pf) == 0x00000C, "Member 'BP_ItemGettableObjectBase_3StepItem_C_ItemGetObject::bpp__DelayMessageSec__pf' has a wrong offset!");

// Function BP_ItemGettableObjectBase_3StepItem.BP_ItemGettableObjectBase_3StepItem_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay");
static_assert(sizeof(BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay, bpp__EndPlayReason__pf) == 0x000000, "Member 'BP_ItemGettableObjectBase_3StepItem_C_ReceiveEndPlay::bpp__EndPlayReason__pf' has a wrong offset!");

// Function BP_ItemGettableObjectBase_3StepItem.BP_ItemGettableObjectBase_3StepItem_C.SetItemDirect
// 0x0028 (0x0028 - 0x0000)
struct BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect final
{
public:
	TArray<class FName>                           bpp__ItemID__pf;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 bpp__ItemNum__pf;                                  // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   bpp__RespawnSaveFlagName__pf;                      // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect) == 0x000008, "Wrong alignment on BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect");
static_assert(sizeof(BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect) == 0x000028, "Wrong size on BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect, bpp__ItemID__pf) == 0x000000, "Member 'BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect::bpp__ItemID__pf' has a wrong offset!");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect, bpp__ItemNum__pf) == 0x000010, "Member 'BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect::bpp__ItemNum__pf' has a wrong offset!");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect, bpp__RespawnSaveFlagName__pf) == 0x000020, "Member 'BP_ItemGettableObjectBase_3StepItem_C_SetItemDirect::bpp__RespawnSaveFlagName__pf' has a wrong offset!");

// Function BP_ItemGettableObjectBase_3StepItem.BP_ItemGettableObjectBase_3StepItem_C.ShowItemAfter
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter final
{
public:
	bool                                          bpp__Ret__pf;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter) == 0x000001, "Wrong alignment on BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter");
static_assert(sizeof(BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter) == 0x000001, "Wrong size on BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter");
static_assert(offsetof(BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter, bpp__Ret__pf) == 0x000000, "Member 'BP_ItemGettableObjectBase_3StepItem_C_ShowItemAfter::bpp__Ret__pf' has a wrong offset!");

}

