#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IF_SaveDataCheck

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_IF_SaveDataCheck.BP_IF_SaveDataCheck_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck");
static_assert(sizeof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck");
static_assert(offsetof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'BP_IF_SaveDataCheck_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function BP_IF_SaveDataCheck.BP_IF_SaveDataCheck_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck");
static_assert(sizeof(BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck) == 0x000002, "Wrong size on BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck");
static_assert(offsetof(BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck, CheckPoint) == 0x000000, "Member 'BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck::CheckPoint' has a wrong offset!");
static_assert(offsetof(BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck, Result) == 0x000001, "Member 'BP_IF_SaveDataCheck_C_OnFinishSaveDataCheck::Result' has a wrong offset!");

// Function BP_IF_SaveDataCheck.BP_IF_SaveDataCheck_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'BP_IF_SaveDataCheck_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function BP_IF_SaveDataCheck.BP_IF_SaveDataCheck_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'BP_IF_SaveDataCheck_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

}

