#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IF_CharachterCaptureDebug

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_IF_CharachterCaptureDebug.BP_IF_CharachterCaptureDebug_C.SetDebugTargetSize
// 0x001C (0x001C - 0x0000)
struct BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlideTargetOrigin;                                 // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxSlideTargetSize;                                // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinSlideTargetSize;                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize) == 0x000004, "Wrong alignment on BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize");
static_assert(sizeof(BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize) == 0x00001C, "Wrong size on BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize");
static_assert(offsetof(BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize, bVisible) == 0x000000, "Member 'BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize::bVisible' has a wrong offset!");
static_assert(offsetof(BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize, SlideTargetOrigin) == 0x000004, "Member 'BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize::SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize, MaxSlideTargetSize) == 0x00000C, "Member 'BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize::MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize, MinSlideTargetSize) == 0x000014, "Member 'BP_IF_CharachterCaptureDebug_C_SetDebugTargetSize::MinSlideTargetSize' has a wrong offset!");

}

