#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IF_CutScene

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_IF_CutScene.BP_IF_CutScene_C.EndCutScene
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_EndCutScene final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_EndCutScene) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_EndCutScene");
static_assert(sizeof(BP_IF_CutScene_C_EndCutScene) == 0x000008, "Wrong size on BP_IF_CutScene_C_EndCutScene");
static_assert(offsetof(BP_IF_CutScene_C_EndCutScene, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_EndCutScene::bpp__CSID__pf' has a wrong offset!");

// Function BP_IF_CutScene.BP_IF_CutScene_C.EndCutSceneBeforeUnload
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_EndCutSceneBeforeUnload final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_EndCutSceneBeforeUnload) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_EndCutSceneBeforeUnload");
static_assert(sizeof(BP_IF_CutScene_C_EndCutSceneBeforeUnload) == 0x000008, "Wrong size on BP_IF_CutScene_C_EndCutSceneBeforeUnload");
static_assert(offsetof(BP_IF_CutScene_C_EndCutSceneBeforeUnload, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_EndCutSceneBeforeUnload::bpp__CSID__pf' has a wrong offset!");

// Function BP_IF_CutScene.BP_IF_CutScene_C.EndCutSceneFadInBefore
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_EndCutSceneFadInBefore final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_EndCutSceneFadInBefore) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_EndCutSceneFadInBefore");
static_assert(sizeof(BP_IF_CutScene_C_EndCutSceneFadInBefore) == 0x000008, "Wrong size on BP_IF_CutScene_C_EndCutSceneFadInBefore");
static_assert(offsetof(BP_IF_CutScene_C_EndCutSceneFadInBefore, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_EndCutSceneFadInBefore::bpp__CSID__pf' has a wrong offset!");

// Function BP_IF_CutScene.BP_IF_CutScene_C.StartCutScene
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_StartCutScene final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_StartCutScene) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_StartCutScene");
static_assert(sizeof(BP_IF_CutScene_C_StartCutScene) == 0x000008, "Wrong size on BP_IF_CutScene_C_StartCutScene");
static_assert(offsetof(BP_IF_CutScene_C_StartCutScene, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_StartCutScene::bpp__CSID__pf' has a wrong offset!");

// Function BP_IF_CutScene.BP_IF_CutScene_C.StartCutsceneBeforeLoad
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_StartCutsceneBeforeLoad final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_StartCutsceneBeforeLoad) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_StartCutsceneBeforeLoad");
static_assert(sizeof(BP_IF_CutScene_C_StartCutsceneBeforeLoad) == 0x000008, "Wrong size on BP_IF_CutScene_C_StartCutsceneBeforeLoad");
static_assert(offsetof(BP_IF_CutScene_C_StartCutsceneBeforeLoad, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_StartCutsceneBeforeLoad::bpp__CSID__pf' has a wrong offset!");

// Function BP_IF_CutScene.BP_IF_CutScene_C.StartCutSceneCharacterSettingAfter
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter");
static_assert(sizeof(BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter) == 0x000008, "Wrong size on BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter");
static_assert(offsetof(BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_StartCutSceneCharacterSettingAfter::bpp__CSID__pf' has a wrong offset!");

// Function BP_IF_CutScene.BP_IF_CutScene_C.StartCutSceneFadeOutAfter
// 0x0008 (0x0008 - 0x0000)
struct BP_IF_CutScene_C_StartCutSceneFadeOutAfter final
{
public:
	class FName                                   bpp__CSID__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_IF_CutScene_C_StartCutSceneFadeOutAfter) == 0x000004, "Wrong alignment on BP_IF_CutScene_C_StartCutSceneFadeOutAfter");
static_assert(sizeof(BP_IF_CutScene_C_StartCutSceneFadeOutAfter) == 0x000008, "Wrong size on BP_IF_CutScene_C_StartCutSceneFadeOutAfter");
static_assert(offsetof(BP_IF_CutScene_C_StartCutSceneFadeOutAfter, bpp__CSID__pf) == 0x000000, "Member 'BP_IF_CutScene_C_StartCutSceneFadeOutAfter::bpp__CSID__pf' has a wrong offset!");

}

