#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractBigMimicBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.BattleWinSetFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractBigMimicBase_C_BattleWinSetFlag final
{
public:
	bool                                          bpp__Ret__pf;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_BattleWinSetFlag) == 0x000001, "Wrong alignment on BP_InteractBigMimicBase_C_BattleWinSetFlag");
static_assert(sizeof(BP_InteractBigMimicBase_C_BattleWinSetFlag) == 0x000001, "Wrong size on BP_InteractBigMimicBase_C_BattleWinSetFlag");
static_assert(offsetof(BP_InteractBigMimicBase_C_BattleWinSetFlag, bpp__Ret__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_BattleWinSetFlag::bpp__Ret__pf' has a wrong offset!");

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature final
{
public:
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature");
static_assert(sizeof(BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong size on BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature");
static_assert(offsetof(BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_107_ComponentInteractSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.DestroyCheck
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractBigMimicBase_C_DestroyCheck final
{
public:
	bool                                          bpp__Destroy__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_DestroyCheck) == 0x000001, "Wrong alignment on BP_InteractBigMimicBase_C_DestroyCheck");
static_assert(sizeof(BP_InteractBigMimicBase_C_DestroyCheck) == 0x000001, "Wrong size on BP_InteractBigMimicBase_C_DestroyCheck");
static_assert(offsetof(BP_InteractBigMimicBase_C_DestroyCheck, bpp__Destroy__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_DestroyCheck::bpp__Destroy__pf' has a wrong offset!");

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.ExecuteUbergraph_BP_InteractBigMimicBase_0
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0) == 0x000004, "Wrong alignment on BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0");
static_assert(sizeof(BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0) == 0x000004, "Wrong size on BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0");
static_assert(offsetof(BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_ExecuteUbergraph_BP_InteractBigMimicBase_0::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.GetInpasuResultTextId
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractBigMimicBase_C_GetInpasuResultTextId final
{
public:
	class FName                                   bpp__OutTextId__pf;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_GetInpasuResultTextId) == 0x000004, "Wrong alignment on BP_InteractBigMimicBase_C_GetInpasuResultTextId");
static_assert(sizeof(BP_InteractBigMimicBase_C_GetInpasuResultTextId) == 0x000008, "Wrong size on BP_InteractBigMimicBase_C_GetInpasuResultTextId");
static_assert(offsetof(BP_InteractBigMimicBase_C_GetInpasuResultTextId, bpp__OutTextId__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_GetInpasuResultTextId::bpp__OutTextId__pf' has a wrong offset!");

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.SelfHidden
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractBigMimicBase_C_SelfHidden final
{
public:
	bool                                          bpp__NewHidden__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_SelfHidden) == 0x000001, "Wrong alignment on BP_InteractBigMimicBase_C_SelfHidden");
static_assert(sizeof(BP_InteractBigMimicBase_C_SelfHidden) == 0x000001, "Wrong size on BP_InteractBigMimicBase_C_SelfHidden");
static_assert(offsetof(BP_InteractBigMimicBase_C_SelfHidden, bpp__NewHidden__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_SelfHidden::bpp__NewHidden__pf' has a wrong offset!");

// Function BP_InteractBigMimicBase.BP_InteractBigMimicBase_C.SetCurrentParam
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractBigMimicBase_C_SetCurrentParam final
{
public:
	bool                                          bpp__Success__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_InteractBigMimicBase_C_SetCurrentParam) == 0x000001, "Wrong alignment on BP_InteractBigMimicBase_C_SetCurrentParam");
static_assert(sizeof(BP_InteractBigMimicBase_C_SetCurrentParam) == 0x000001, "Wrong size on BP_InteractBigMimicBase_C_SetCurrentParam");
static_assert(offsetof(BP_InteractBigMimicBase_C_SetCurrentParam, bpp__Success__pf) == 0x000000, "Member 'BP_InteractBigMimicBase_C_SetCurrentParam::bpp__Success__pf' has a wrong offset!");

}

