#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LazyMessageManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LazyMessageManager.BP_LazyMessageManager_C
// 0x0020 (0x03D0 - 0x03B0)
class ABP_LazyMessageManager_C final : public AJackLazyMessageManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   VeiwAllEnd;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void VeiwAllEnd__DelegateSignature();
	void ExecuteUbergraph_BP_LazyMessageManager(int32 EntryPoint);
	void OnViewAllEnd();
	void OnViewTabiNoKokoroe(class FName RowName);
	void OnViewStartMessage(class FName TextID, const TArray<struct FJackMessageArgumentData>& Args);
	void OnTryPossessControll();
	void ReceiveTick(float DeltaSeconds);
	void OnViewStartAchievement(class FName AchieveId);
	void UserConstructionScript();
	void SetGameCondition(bool bOn);
	void SetPlayerMoveCondition(bool Condition);

	bool IsNoFallWait() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LazyMessageManager_C">();
	}
	static class ABP_LazyMessageManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LazyMessageManager_C>();
	}
};
static_assert(alignof(ABP_LazyMessageManager_C) == 0x000008, "Wrong alignment on ABP_LazyMessageManager_C");
static_assert(sizeof(ABP_LazyMessageManager_C) == 0x0003D0, "Wrong size on ABP_LazyMessageManager_C");
static_assert(offsetof(ABP_LazyMessageManager_C, UberGraphFrame) == 0x0003B0, "Member 'ABP_LazyMessageManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LazyMessageManager_C, DefaultSceneRoot) == 0x0003B8, "Member 'ABP_LazyMessageManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LazyMessageManager_C, VeiwAllEnd) == 0x0003C0, "Member 'ABP_LazyMessageManager_C::VeiwAllEnd' has a wrong offset!");

}

