#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelStreamingVolume

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.ExecuteUbergraph_BP_LevelStreamingVolume
// 0x01C0 (0x01C0 - 0x0000)
struct BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent2;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelVisibleDummy_C*                K2Node_DynamicCast_AsBP_Level_Visible_Dummy;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue2;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInBattle_ReturnValue2;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors2;  // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue2;  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue3;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue4;  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue5;  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPIE_ReturnValue;                        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPIE_ReturnValue2;                       // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapJumping_Result;                      // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelVisibleDummy_C*                K2Node_DynamicCast_AsBP_Level_Visible_Dummy2;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue6;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue7;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue2;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue8;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue9;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue3;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue4;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue5;          // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIgnoreCS_Result;                     // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIgnoreCS_Result2;                    // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WaitStart_Result;                         // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x01B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WaitStart_Result2;                        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapJumping_Result2;                     // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume) == 0x000008, "Wrong alignment on BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume");
static_assert(sizeof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume) == 0x0001C0, "Wrong size on BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, EntryPoint) == 0x000000, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OverlappedComponent2) == 0x000010, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OverlappedComponent2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OtherActor2) == 0x000018, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OtherComp2) == 0x000020, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x000028, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000B8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OtherActor) == 0x0000C0, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OtherComp) == 0x0000C8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D0, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_DynamicCast_AsBP_Level_Visible_Dummy) == 0x0000D8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_DynamicCast_AsBP_Level_Visible_Dummy' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetBattleManager_ReturnValue) == 0x0000E8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetBattleManager_ReturnValue2) == 0x0000F0, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetBattleManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsInBattle_ReturnValue) == 0x0000F8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsInBattle_ReturnValue2) == 0x0000F9, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsInBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000100, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000114, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetOverlappingActors_OverlappingActors2) == 0x000118, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetOverlappingActors_OverlappingActors2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_Array_Length_ReturnValue2) == 0x000128, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x00012C, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue2) == 0x000130, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsOverlappingActor_ReturnValue) == 0x000138, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue3) == 0x000140, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_Not_PreBool_ReturnValue) == 0x000148, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_BooleanAND_ReturnValue) == 0x000149, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue4) == 0x000150, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue5) == 0x000158, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsPIE_ReturnValue) == 0x000160, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000161, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsPIE_ReturnValue2) == 0x000162, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsPIE_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsMapJumping_Result) == 0x000163, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsMapJumping_Result' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000164, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_DynamicCast_AsBP_Level_Visible_Dummy2) == 0x000168, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_DynamicCast_AsBP_Level_Visible_Dummy2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, K2Node_DynamicCast_bSuccess2) == 0x000170, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue6) == 0x000178, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000180, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue7) == 0x000188, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsOverlappingActor_ReturnValue2) == 0x000190, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsOverlappingActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue8) == 0x000198, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue4) == 0x0001A0, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetJackPlayerCameraManager_ReturnValue9) == 0x0001A8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetJackPlayerCameraManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsOverlappingActor_ReturnValue3) == 0x0001B0, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsOverlappingActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsOverlappingActor_ReturnValue4) == 0x0001B1, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsOverlappingActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsOverlappingActor_ReturnValue5) == 0x0001B2, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsOverlappingActor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_CheckIgnoreCS_Result) == 0x0001B3, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_CheckIgnoreCS_Result' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_CheckIgnoreCS_Result2) == 0x0001B4, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_CheckIgnoreCS_Result2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_BooleanOR_ReturnValue) == 0x0001B5, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_WaitStart_Result) == 0x0001B6, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_WaitStart_Result' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_BooleanOR_ReturnValue2) == 0x0001B7, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_WaitStart_Result2) == 0x0001B8, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_WaitStart_Result2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_BooleanOR_ReturnValue3) == 0x0001B9, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_GetGameFlagBool_ReturnValue) == 0x0001BA, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_IsMapJumping_Result2) == 0x0001BB, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_IsMapJumping_Result2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_Not_PreBool_ReturnValue2) == 0x0001BC, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume, CallFunc_BooleanOR_ReturnValue4) == 0x0001BD, "Member 'BP_LevelStreamingVolume_C_ExecuteUbergraph_BP_LevelStreamingVolume::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushOuter_K2Node_ComponentBoundEvent_49_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_LevelStreamingVolume_C_BndEvt__BrushComponent_K2Node_ComponentBoundEvent_45_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_LevelStreamingVolume_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelStreamingVolume_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_LevelStreamingVolume_C_UserConstructionScript");
static_assert(sizeof(BP_LevelStreamingVolume_C_UserConstructionScript) == 0x000018, "Wrong size on BP_LevelStreamingVolume_C_UserConstructionScript");
static_assert(offsetof(BP_LevelStreamingVolume_C_UserConstructionScript, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'BP_LevelStreamingVolume_C_UserConstructionScript::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00000C, "Member 'BP_LevelStreamingVolume_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.BindBattle
// 0x0018 (0x0018 - 0x0000)
struct BP_LevelStreamingVolume_C_BindBattle final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelStreamingVolume_C_BindBattle) == 0x000008, "Wrong alignment on BP_LevelStreamingVolume_C_BindBattle");
static_assert(sizeof(BP_LevelStreamingVolume_C_BindBattle) == 0x000018, "Wrong size on BP_LevelStreamingVolume_C_BindBattle");
static_assert(offsetof(BP_LevelStreamingVolume_C_BindBattle, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_LevelStreamingVolume_C_BindBattle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_BindBattle, CallFunc_GetBattleManager_ReturnValue) == 0x000010, "Member 'BP_LevelStreamingVolume_C_BindBattle::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.CheckIgnoreCS
// 0x0050 (0x0050 - 0x0000)
struct BP_LevelStreamingVolume_C_CheckIgnoreCS final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalResult;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_CutSceneInfo                  CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelStreamingVolume_C_CheckIgnoreCS) == 0x000008, "Wrong alignment on BP_LevelStreamingVolume_C_CheckIgnoreCS");
static_assert(sizeof(BP_LevelStreamingVolume_C_CheckIgnoreCS) == 0x000050, "Wrong size on BP_LevelStreamingVolume_C_CheckIgnoreCS");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, Result) == 0x000000, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::Result' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, LocalResult) == 0x000001, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::LocalResult' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_GetGameFlagBool_ReturnValue) == 0x00002D, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_GetGameFlagString_ReturnValue) == 0x000030, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_GetGameFlagString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_CheckIgnoreCS, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000048, "Member 'BP_LevelStreamingVolume_C_CheckIgnoreCS::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_LevelStreamingVolume.BP_LevelStreamingVolume_C.WaitStart
// 0x0030 (0x0030 - 0x0000)
struct BP_LevelStreamingVolume_C_WaitStart final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelScriptActor*                      CallFunc_GetLevelScriptActor_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_LevelStreaming_C> K2Node_DynamicCast_AsBP_IF_Level_Streaming;        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetLoadCompleted_LoadCompleted;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelStreamingVolume_C_WaitStart) == 0x000008, "Wrong alignment on BP_LevelStreamingVolume_C_WaitStart");
static_assert(sizeof(BP_LevelStreamingVolume_C_WaitStart) == 0x000030, "Wrong size on BP_LevelStreamingVolume_C_WaitStart");
static_assert(offsetof(BP_LevelStreamingVolume_C_WaitStart, Result) == 0x000000, "Member 'BP_LevelStreamingVolume_C_WaitStart::Result' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_WaitStart, CallFunc_GetStreamingLevel_ReturnValue) == 0x000008, "Member 'BP_LevelStreamingVolume_C_WaitStart::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelStreamingVolume_C_WaitStart, CallFunc_GetLevelScriptActor_ReturnValue) == 0x000010, "Member 'BP_LevelStreamingVolume_C_WaitStart::CallFunc_GetLevelScriptActor_ReturnValue' has a wrong offset!");
