#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MonsterPopArea

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MonsterPopArea.BP_MonsterPopArea_C.UserConstructionScript
// 0x0180 (0x0180 - 0x0000)
struct BP_MonsterPopArea_C_UserConstructionScript final
{
public:
	class FName                                   DisplayMonsterId;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableMonster                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0108)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackMonsterCharacter*                  CallFunc_LoadMonsterClass_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameWorld_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMonsterDeployHeadId_ReturnValue;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MonsterPopArea_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_MonsterPopArea_C_UserConstructionScript");
static_assert(sizeof(BP_MonsterPopArea_C_UserConstructionScript) == 0x000180, "Wrong size on BP_MonsterPopArea_C_UserConstructionScript");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, DisplayMonsterId) == 0x000000, "Member 'BP_MonsterPopArea_C_UserConstructionScript::DisplayMonsterId' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_NotEqual_NameName_ReturnValue) == 0x000111, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_LoadMonsterClass_ReturnValue) == 0x000118, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_LoadMonsterClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_IsGameWorld_ReturnValue) == 0x000120, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_IsGameWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000121, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000122, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_GetMonsterDeployHeadId_ReturnValue) == 0x000128, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_GetMonsterDeployHeadId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000160, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000168, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue2) == 0x000170, "Member 'BP_MonsterPopArea_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function BP_MonsterPopArea.BP_MonsterPopArea_C.OverrideMonsterDeployTable
// 0x0010 (0x0010 - 0x0000)
struct BP_MonsterPopArea_C_OverrideMonsterDeployTable final
{
public:
	class UDataTable*                             InTableAsset;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MonsterPopArea_C_OverrideMonsterDeployTable) == 0x000008, "Wrong alignment on BP_MonsterPopArea_C_OverrideMonsterDeployTable");
static_assert(sizeof(BP_MonsterPopArea_C_OverrideMonsterDeployTable) == 0x000010, "Wrong size on BP_MonsterPopArea_C_OverrideMonsterDeployTable");
static_assert(offsetof(BP_MonsterPopArea_C_OverrideMonsterDeployTable, InTableAsset) == 0x000000, "Member 'BP_MonsterPopArea_C_OverrideMonsterDeployTable::InTableAsset' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_OverrideMonsterDeployTable, ReturnValue) == 0x000008, "Member 'BP_MonsterPopArea_C_OverrideMonsterDeployTable::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterPopArea_C_OverrideMonsterDeployTable, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'BP_MonsterPopArea_C_OverrideMonsterDeployTable::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

