#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcAttachmentAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NpcAttachmentBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcAttachmentAnimation.BP_NpcAttachmentAnimation_C
// 0x0018 (0x03D0 - 0x03B8)
class ABP_NpcAttachmentAnimation_C final : public ABP_NpcAttachmentBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Animation;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NpcAttachmentAnimation(int32 EntryPoint);
	void OnHiddenInGameChanged(bool bNewHiddenInGame);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcAttachmentAnimation_C">();
	}
	static class ABP_NpcAttachmentAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcAttachmentAnimation_C>();
	}
};
static_assert(alignof(ABP_NpcAttachmentAnimation_C) == 0x000008, "Wrong alignment on ABP_NpcAttachmentAnimation_C");
static_assert(sizeof(ABP_NpcAttachmentAnimation_C) == 0x0003D0, "Wrong size on ABP_NpcAttachmentAnimation_C");
static_assert(offsetof(ABP_NpcAttachmentAnimation_C, UberGraphFrame) == 0x0003B8, "Member 'ABP_NpcAttachmentAnimation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NpcAttachmentAnimation_C, SkeletalMesh) == 0x0003C0, "Member 'ABP_NpcAttachmentAnimation_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_NpcAttachmentAnimation_C, Animation) == 0x0003C8, "Member 'ABP_NpcAttachmentAnimation_C::Animation' has a wrong offset!");

}

