#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcFukidasiDIalogue

#include "Basic.hpp"

#include "STRUCT_NpcFukidasiDisc_structs.hpp"
#include "ENUM_Schedule_Pattern_structs.hpp"


namespace SDK::Params
{

// Function BP_NpcFukidasiDIalogue.BP_NpcFukidasiDIalogue_C.ExecuteUbergraph_BP_NpcFukidasiDIalogue
// 0x00C0 (0x00C0 - 0x0000)
struct BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_NpcFukidasiDisc                CallFunc_Array_Get_Item;                           // 0x0008(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_NpcFukidasiDisc                CallFunc_Array_Get_Item2;                          // 0x0050(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Schedule_Pattern                         CallFunc_GetSchedulePattern_PatternID;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue2;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_NpcFukidasiDisc                CallFunc_Array_Get_Item3;                          // 0x0088(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue3;         // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue4;         // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue) == 0x000008, "Wrong alignment on BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue");
static_assert(sizeof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue) == 0x0000C0, "Wrong size on BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, EntryPoint) == 0x000000, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000034, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Array_Get_Item2) == 0x000050, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Add_IntInt_ReturnValue2) == 0x000078, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_GetSchedulePattern_PatternID) == 0x00007C, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_GetSchedulePattern_PatternID' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007D, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x00007E, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00007F, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_BoolBool_ReturnValue2) == 0x000080, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_BoolBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Array_Get_Item3) == 0x000088, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Array_Length_ReturnValue2) == 0x0000B0, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x0000B5, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_BoolBool_ReturnValue3) == 0x0000B6, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_BoolBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_EqualEqual_BoolBool_ReturnValue4) == 0x0000B7, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_EqualEqual_BoolBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue, CallFunc_BooleanAND_ReturnValue2) == 0x0000B8, "Member 'BP_NpcFukidasiDIalogue_C_ExecuteUbergraph_BP_NpcFukidasiDIalogue::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function BP_NpcFukidasiDIalogue.BP_NpcFukidasiDIalogue_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NpcFukidasiDIalogue_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcFukidasiDIalogue_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NpcFukidasiDIalogue_C_ReceiveTick");
static_assert(sizeof(BP_NpcFukidasiDIalogue_C_ReceiveTick) == 0x000004, "Wrong size on BP_NpcFukidasiDIalogue_C_ReceiveTick");
static_assert(offsetof(BP_NpcFukidasiDIalogue_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NpcFukidasiDIalogue_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

