#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcChecker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcChecker.BP_NpcChecker_C
// 0x0020 (0x03B8 - 0x0398)
class ABP_NpcChecker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         TempArray;                                         // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_NpcChecker(int32 EntryPoint);
	void NpcLevelCheck();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcChecker_C">();
	}
	static class ABP_NpcChecker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcChecker_C>();
	}
};
static_assert(alignof(ABP_NpcChecker_C) == 0x000008, "Wrong alignment on ABP_NpcChecker_C");
static_assert(sizeof(ABP_NpcChecker_C) == 0x0003B8, "Wrong size on ABP_NpcChecker_C");
static_assert(offsetof(ABP_NpcChecker_C, UberGraphFrame) == 0x000398, "Member 'ABP_NpcChecker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NpcChecker_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_NpcChecker_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_NpcChecker_C, TempArray) == 0x0003A8, "Member 'ABP_NpcChecker_C::TempArray' has a wrong offset!");

}

