#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcFukidasiDIalogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STRUCT_NpcFukidasiDisc_structs.hpp"
#include "ENUM_Schedule_Pattern_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcFukidasiDIalogue.BP_NpcFukidasiDIalogue_C
// 0x0030 (0x03C8 - 0x0398)
class ABP_NpcFukidasiDIalogue_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_NpcFukidasiDisc>        FukidasiDisc;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          bDelayCompleted;                                   // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FukidasiDiscIndex;                                 // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MuchingSchedule;                                   // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MuchingScheduleOld;                                // 0x03C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_NpcFukidasiDIalogue(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void FukidasiKakeaiMain();
	void FukidasiKakeaiNext();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcFukidasiDIalogue_C">();
	}
	static class ABP_NpcFukidasiDIalogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NpcFukidasiDIalogue_C>();
	}
};
static_assert(alignof(ABP_NpcFukidasiDIalogue_C) == 0x000008, "Wrong alignment on ABP_NpcFukidasiDIalogue_C");
static_assert(sizeof(ABP_NpcFukidasiDIalogue_C) == 0x0003C8, "Wrong size on ABP_NpcFukidasiDIalogue_C");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, UberGraphFrame) == 0x000398, "Member 'ABP_NpcFukidasiDIalogue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, DefaultSceneRoot) == 0x0003A0, "Member 'ABP_NpcFukidasiDIalogue_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, FukidasiDisc) == 0x0003A8, "Member 'ABP_NpcFukidasiDIalogue_C::FukidasiDisc' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, bDelayCompleted) == 0x0003B8, "Member 'ABP_NpcFukidasiDIalogue_C::bDelayCompleted' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, FukidasiDiscIndex) == 0x0003BC, "Member 'ABP_NpcFukidasiDIalogue_C::FukidasiDiscIndex' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, Enable) == 0x0003C0, "Member 'ABP_NpcFukidasiDIalogue_C::Enable' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, MuchingSchedule) == 0x0003C1, "Member 'ABP_NpcFukidasiDIalogue_C::MuchingSchedule' has a wrong offset!");
static_assert(offsetof(ABP_NpcFukidasiDIalogue_C, MuchingScheduleOld) == 0x0003C2, "Member 'ABP_NpcFukidasiDIalogue_C::MuchingScheduleOld' has a wrong offset!");

}

