#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcChecker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NpcChecker.BP_NpcChecker_C.ExecuteUbergraph_BP_NpcChecker
// 0x0158 (0x0158 - 0x0000)
struct BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableMenu*             CallFunc_GetDebugMenuItemByPath_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetLevelNames_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackDebugMenuVariableMenu*             CallFunc_AddDebugMenuItem_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugMenuCursorLocation_ReturnValue;   // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetLevelActorsByName_ReturnValue;         // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackScheduledNPC*                      K2Node_DynamicCast_AsJack_Scheduled_NPC;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item2;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue2;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item3;                          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue2;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackDebugMenuVariableCommand*          CallFunc_AddDebugMenuCommand_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker) == 0x000008, "Wrong alignment on BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker");
static_assert(sizeof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker) == 0x000158, "Wrong size on BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, EntryPoint) == 0x000000, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_int_Loop_Counter_Variable2) == 0x000010, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Add_IntInt_ReturnValue2) == 0x000028, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_int_Array_Index_Variable2) == 0x000030, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_int_Array_Index_Variable3) == 0x000038, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetDebugMenuItemByPath_ReturnValue) == 0x000040, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetDebugMenuItemByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetLevelNames_ReturnValue) == 0x000048, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetLevelNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_AddDebugMenuItem_ReturnValue) == 0x000058, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_AddDebugMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, Temp_int_Loop_Counter_Variable3) == 0x000060, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Add_IntInt_ReturnValue3) == 0x000064, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetDebugMenuCursorLocation_ReturnValue) == 0x000068, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetDebugMenuCursorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Split_LeftS) == 0x000078, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Split_RightS) == 0x000088, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Split_ReturnValue) == 0x000098, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A0, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetLevelActorsByName_ReturnValue) == 0x0000A8, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetLevelActorsByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, K2Node_DynamicCast_AsJack_Scheduled_NPC) == 0x0000C8, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::K2Node_DynamicCast_AsJack_Scheduled_NPC' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Less_IntInt_ReturnValue) == 0x0000D1, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetMaterials_ReturnValue) == 0x0000D8, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetDisplayName_ReturnValue) == 0x0000E8, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Array_Get_Item2) == 0x0000F8, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_GetDisplayName_ReturnValue2) == 0x000110, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_GetDisplayName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_FindSubstring_ReturnValue) == 0x000120, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Array_Length_ReturnValue2) == 0x000124, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000128, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Less_IntInt_ReturnValue2) == 0x000129, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_BooleanAND_ReturnValue) == 0x00012A, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Array_Get_Item3) == 0x000130, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Array_Length_ReturnValue3) == 0x000140, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_FindSubstring_ReturnValue2) == 0x000144, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_FindSubstring_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_Less_IntInt_ReturnValue3) == 0x000148, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000149, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker, CallFunc_AddDebugMenuCommand_ReturnValue) == 0x000150, "Member 'BP_NpcChecker_C_ExecuteUbergraph_BP_NpcChecker::CallFunc_AddDebugMenuCommand_ReturnValue' has a wrong offset!");

}

