#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerCameraManager.BP_PlayerCameraManager_C
// 0x0020 (0x3730 - 0x3710)
class ABP_PlayerCameraManager_C final : public AJackPlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3710(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LightCheckCharacter;                               // 0x3718(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   CameraPointLight;                                  // 0x3720(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerCameraManager(int32 EntryPoint);
	void OnCameraLightDisableChanged(bool bDisable);
	void UserConstructionScript();
	bool BlueprintUpdateCamera(class AActor* CameraTarget, struct FVector* NewCameraLocation, struct FRotator* NewCameraRotation, float* NewCameraFOV);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerCameraManager_C">();
	}
	static class ABP_PlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerCameraManager_C>();
	}
};
static_assert(alignof(ABP_PlayerCameraManager_C) == 0x000010, "Wrong alignment on ABP_PlayerCameraManager_C");
static_assert(sizeof(ABP_PlayerCameraManager_C) == 0x003730, "Wrong size on ABP_PlayerCameraManager_C");
static_assert(offsetof(ABP_PlayerCameraManager_C, UberGraphFrame) == 0x003710, "Member 'ABP_PlayerCameraManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCameraManager_C, LightCheckCharacter) == 0x003718, "Member 'ABP_PlayerCameraManager_C::LightCheckCharacter' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCameraManager_C, CameraPointLight) == 0x003720, "Member 'ABP_PlayerCameraManager_C::CameraPointLight' has a wrong offset!");

}

