#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhotoModeCapture

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhotoModeCapture.BP_PhotoModeCapture_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_PhotoModeCapture_C final : public AJackPhotoModeCapture
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PhotoModeCapture(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void RunPhotoModeCapture();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PhotoModeCapture_C">();
	}
	static class ABP_PhotoModeCapture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhotoModeCapture_C>();
	}
};
static_assert(alignof(ABP_PhotoModeCapture_C) == 0x000008, "Wrong alignment on ABP_PhotoModeCapture_C");
static_assert(sizeof(ABP_PhotoModeCapture_C) == 0x0003B8, "Wrong size on ABP_PhotoModeCapture_C");
static_assert(offsetof(ABP_PhotoModeCapture_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_PhotoModeCapture_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PhotoModeCapture_C, SceneCaptureComponent2D) == 0x0003A8, "Member 'ABP_PhotoModeCapture_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_PhotoModeCapture_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_PhotoModeCapture_C::DefaultSceneRoot' has a wrong offset!");

}

