#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoomEnter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RoomEnter.BP_RoomEnter_C.BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bFromSweep__pf;                               // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             bpp__SweepResult__pf__const;                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature, bpp__OverlappedComponent__pf) == 0x000000, "Member 'BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature::bpp__OverlappedComponent__pf' has a wrong offset!");
static_assert(offsetof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000008, "Member 'BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");
static_assert(offsetof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherComp__pf) == 0x000010, "Member 'BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherComp__pf' has a wrong offset!");
static_assert(offsetof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherBodyIndex__pf) == 0x000018, "Member 'BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherBodyIndex__pf' has a wrong offset!");
static_assert(offsetof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature, bpp__bFromSweep__pf) == 0x00001C, "Member 'BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature::bpp__bFromSweep__pf' has a wrong offset!");
static_assert(offsetof(BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature, bpp__SweepResult__pf__const) == 0x000020, "Member 'BP_RoomEnter_C_BndEvt__InRoom_K2Node_ComponentBoundEvent_131_ComponentBeginOverlapSignature__DelegateSignature::bpp__SweepResult__pf__const' has a wrong offset!");

}

