#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RenkeiManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RenkeiManager.BP_RenkeiManager_C.OnPlayPreInitialize__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature final
{
public:
	class AMatineeActor*                          MatineeActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature");
static_assert(sizeof(BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature) == 0x000008, "Wrong size on BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature");
static_assert(offsetof(BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature, MatineeActor) == 0x000000, "Member 'BP_RenkeiManager_C_OnPlayPreInitialize__DelegateSignature::MatineeActor' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.OnPlayEndFinalize__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature final
{
public:
	class AMatineeActor*                          MatineeActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature");
static_assert(sizeof(BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature) == 0x000008, "Wrong size on BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature");
static_assert(offsetof(BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature, MatineeActor) == 0x000000, "Member 'BP_RenkeiManager_C_OnPlayEndFinalize__DelegateSignature::MatineeActor' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.ExecuteUbergraph_BP_RenkeiManager
// 0x0208 (0x0208 - 0x0000)
struct BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_RenkeiName;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_RenkeiLevelName;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 K2Node_Event_AttackerCharaList;                    // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class AJackCharacter*                         K2Node_Event_TargetCharacter1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Hidden_Renkei_Character_Setting_MartinaDevilMode; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Event_RenkeiLevelNames;                     // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_Event_LevelNamePass;                        // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatineeLevelsVisible_IsVisible;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item3;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item5;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item6;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item7;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue5;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item8;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue6;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMatineeActor*                          CallFunc_Array_Get_Item9;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BattleManager_C*                    K2Node_DynamicCast_AsBP_Battle_Manager;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InHidden;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatineeRenkeiSkip_ReturnValue;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMatineeActor*                          CallFunc_Array_Get_Item10;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	class AMatineeActor*                          CallFunc_Array_Get_Item11;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_CapsuleOverlapActors_OutActors;           // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CapsuleOverlapActors_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllTextureStreamLoaded_ReturnValue;     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatineeActor*                          CallFunc_Array_Get_Item12;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatineeRenkeiSkip_ReturnValue2;         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoiceJapanese_VoiceJapanese;            // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item13;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue11;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue12;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMatineeActor*                          CallFunc_Array_Get_Item14;                         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager");
static_assert(sizeof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager) == 0x000208, "Wrong size on BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, EntryPoint) == 0x000000, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_RenkeiName) == 0x000008, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_RenkeiName' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_RenkeiLevelName) == 0x000010, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_RenkeiLevelName' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_AttackerCharaList) == 0x000018, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_AttackerCharaList' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_TargetCharacter1) == 0x000028, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_TargetCharacter1' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item2) == 0x000038, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetStreamingLevel_ReturnValue) == 0x000040, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Set_Hidden_Renkei_Character_Setting_MartinaDevilMode) == 0x000054, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Set_Hidden_Renkei_Character_Setting_MartinaDevilMode' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_RenkeiLevelNames) == 0x000058, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_RenkeiLevelNames' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_LevelNamePass) == 0x000068, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_LevelNamePass' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Array_Index_Variable2) == 0x000078, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_IsMatineeLevelsVisible_IsVisible) == 0x00007C, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_IsMatineeLevelsVisible_IsVisible' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Loop_Counter_Variable2) == 0x000080, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item3) == 0x000088, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue2) == 0x000090, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Add_IntInt_ReturnValue2) == 0x000098, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item4) == 0x0000A0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item5) == 0x0000A8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue3) == 0x0000B0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue4) == 0x0000B4, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Greater_IntInt_ReturnValue2) == 0x0000B8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Greater_IntInt_ReturnValue3) == 0x0000B9, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item6) == 0x0000C0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item7) == 0x0000C8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue5) == 0x0000D0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue6) == 0x0000D4, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Greater_IntInt_ReturnValue4) == 0x0000D8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Greater_IntInt_ReturnValue5) == 0x0000D9, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Greater_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item8) == 0x0000E0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue7) == 0x0000E8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Greater_IntInt_ReturnValue6) == 0x0000EC, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Greater_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Loop_Counter_Variable3) == 0x0000F0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Add_IntInt_ReturnValue3) == 0x0000F4, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item9) == 0x0000F8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue8) == 0x000100, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue9) == 0x000108, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Less_IntInt_ReturnValue2) == 0x00010C, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetUMGManager_ReturnValue) == 0x000110, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetUMGManager_ReturnValue2) == 0x000118, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetBattleManager_ReturnValue) == 0x000120, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_DynamicCast_AsBP_Battle_Manager) == 0x000128, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_DynamicCast_AsBP_Battle_Manager' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000138, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_Event_InHidden) == 0x000140, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_Event_InHidden' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_IsMatineeRenkeiSkip_ReturnValue) == 0x000141, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_IsMatineeRenkeiSkip_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Array_Index_Variable3) == 0x000144, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetUMGManager_ReturnValue3) == 0x000148, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item10) == 0x000150, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item10' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000158, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Array_Index_Variable4) == 0x000160, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_object_Variable) == 0x000168, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item11) == 0x000178, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item11' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Array_Index_Variable5) == 0x000180, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, K2Node_MakeArray_Array) == 0x000188, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_CapsuleOverlapActors_OutActors) == 0x000198, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_CapsuleOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_CapsuleOverlapActors_ReturnValue) == 0x0001A8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_CapsuleOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_IsAllTextureStreamLoaded_ReturnValue) == 0x0001A9, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_IsAllTextureStreamLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item12) == 0x0001B0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item12' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue10) == 0x0001B8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_IsMatineeRenkeiSkip_ReturnValue2) == 0x0001BC, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_IsMatineeRenkeiSkip_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Loop_Counter_Variable4) == 0x0001C0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, Temp_int_Loop_Counter_Variable5) == 0x0001C4, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Less_IntInt_ReturnValue3) == 0x0001C8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Add_IntInt_ReturnValue4) == 0x0001CC, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Less_IntInt_ReturnValue4) == 0x0001D0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Add_IntInt_ReturnValue5) == 0x0001D4, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GetGameFlagBool_ReturnValue) == 0x0001D8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_IsVoiceJapanese_VoiceJapanese) == 0x0001D9, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_IsVoiceJapanese_VoiceJapanese' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item13) == 0x0001E0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item13' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue11) == 0x0001E8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Add_IntInt_ReturnValue6) == 0x0001EC, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001F0, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Length_ReturnValue12) == 0x0001F4, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Length_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Array_Get_Item14) == 0x0001F8, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Array_Get_Item14' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager, CallFunc_Less_IntInt_ReturnValue5) == 0x000200, "Member 'BP_RenkeiManager_C_ExecuteUbergraph_BP_RenkeiManager::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.OnSetBattleWhiteLineHiddenDecal
// 0x0001 (0x0001 - 0x0000)
struct BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal final
{
public:
	bool                                          InHidden;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal) == 0x000001, "Wrong alignment on BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal");
static_assert(sizeof(BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal) == 0x000001, "Wrong size on BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal");
static_assert(offsetof(BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal, InHidden) == 0x000000, "Member 'BP_RenkeiManager_C_OnSetBattleWhiteLineHiddenDecal::InHidden' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.OnMatineeRenkeiDivisionLoad
// 0x0020 (0x0020 - 0x0000)
struct BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad final
{
public:
	TArray<class FName>                           RenkeiLevelNames;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class FName>                           LevelNamePass;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad");
static_assert(sizeof(BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad) == 0x000020, "Wrong size on BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad");
static_assert(offsetof(BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad, RenkeiLevelNames) == 0x000000, "Member 'BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad::RenkeiLevelNames' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad, LevelNamePass) == 0x000010, "Member 'BP_RenkeiManager_C_OnMatineeRenkeiDivisionLoad::LevelNamePass' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.OnMatineeRenkeiPlay
// 0x0028 (0x0028 - 0x0000)
struct BP_RenkeiManager_C_OnMatineeRenkeiPlay final
{
public:
	class FName                                   RenkeiName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RenkeiLevelName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 AttackerCharaList;                                 // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class AJackCharacter*                         TargetCharacter1;                                  // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenkeiManager_C_OnMatineeRenkeiPlay) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_OnMatineeRenkeiPlay");
static_assert(sizeof(BP_RenkeiManager_C_OnMatineeRenkeiPlay) == 0x000028, "Wrong size on BP_RenkeiManager_C_OnMatineeRenkeiPlay");
static_assert(offsetof(BP_RenkeiManager_C_OnMatineeRenkeiPlay, RenkeiName) == 0x000000, "Member 'BP_RenkeiManager_C_OnMatineeRenkeiPlay::RenkeiName' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_OnMatineeRenkeiPlay, RenkeiLevelName) == 0x000008, "Member 'BP_RenkeiManager_C_OnMatineeRenkeiPlay::RenkeiLevelName' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_OnMatineeRenkeiPlay, AttackerCharaList) == 0x000010, "Member 'BP_RenkeiManager_C_OnMatineeRenkeiPlay::AttackerCharaList' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_OnMatineeRenkeiPlay, TargetCharacter1) == 0x000020, "Member 'BP_RenkeiManager_C_OnMatineeRenkeiPlay::TargetCharacter1' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.IsHiddenActor
// 0x0050 (0x0050 - 0x0000)
struct BP_RenkeiManager_C_IsHiddenActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHidden_0;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHiddenLocal;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         K2Node_DynamicCast_AsJack_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWindDirectionalSource*                 K2Node_DynamicCast_AsWind_Directional_Source;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 K2Node_DynamicCast_AsLight;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenkeiManager_C_IsHiddenActor) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_IsHiddenActor");
static_assert(sizeof(BP_RenkeiManager_C_IsHiddenActor) == 0x000050, "Wrong size on BP_RenkeiManager_C_IsHiddenActor");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, Actor) == 0x000000, "Member 'BP_RenkeiManager_C_IsHiddenActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, bHidden_0) == 0x000008, "Member 'BP_RenkeiManager_C_IsHiddenActor::bHidden_0' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, bHiddenLocal) == 0x000009, "Member 'BP_RenkeiManager_C_IsHiddenActor::bHiddenLocal' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_AsJack_Character) == 0x000010, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_AsJack_Character' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_AsWind_Directional_Source) == 0x000020, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_AsWind_Directional_Source' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_AsPost_Process_Volume) == 0x000030, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_AsPost_Process_Volume' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_bSuccess3) == 0x000038, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, CallFunc_IsActive_ReturnValue) == 0x000039, "Member 'BP_RenkeiManager_C_IsHiddenActor::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_AsLight) == 0x000040, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_AsLight' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_IsHiddenActor, K2Node_DynamicCast_bSuccess4) == 0x000048, "Member 'BP_RenkeiManager_C_IsHiddenActor::K2Node_DynamicCast_bSuccess4' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.SetHiddenActor
// 0x0050 (0x0050 - 0x0000)
struct BP_RenkeiManager_C_SetHiddenActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHidden_0;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 K2Node_DynamicCast_AsLight;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         K2Node_DynamicCast_AsJack_Character;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWindDirectionalSource*                 K2Node_DynamicCast_AsWind_Directional_Source;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RenkeiManager_C_SetHiddenActor) == 0x000008, "Wrong alignment on BP_RenkeiManager_C_SetHiddenActor");
static_assert(sizeof(BP_RenkeiManager_C_SetHiddenActor) == 0x000050, "Wrong size on BP_RenkeiManager_C_SetHiddenActor");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, Actor) == 0x000000, "Member 'BP_RenkeiManager_C_SetHiddenActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, bHidden_0) == 0x000008, "Member 'BP_RenkeiManager_C_SetHiddenActor::bHidden_0' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_AsLight) == 0x000010, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_AsLight' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_RenkeiManager_C_SetHiddenActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_AsJack_Character) == 0x000020, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_AsJack_Character' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_AsWind_Directional_Source) == 0x000030, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_AsWind_Directional_Source' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_bSuccess3) == 0x000038, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_AsPost_Process_Volume) == 0x000040, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_AsPost_Process_Volume' has a wrong offset!");
static_assert(offsetof(BP_RenkeiManager_C_SetHiddenActor, K2Node_DynamicCast_bSuccess4) == 0x000048, "Member 'BP_RenkeiManager_C_SetHiddenActor::K2Node_DynamicCast_bSuccess4' has a wrong offset!");

// Function BP_RenkeiManager.BP_RenkeiManager_C.SetHiddenAllActors
// 0x00B0 (0x00B0 - 0x0000)
struct BP_RenkeiManager_C_SetHiddenAllActors final
{
public:
	bool                                          bHidden_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULevel*>                         CallFunc_GetLoadedLevels_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevel*                                 CallFunc_Array_Get_Item2;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item3;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
