#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SerifuWindowController

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_SerifuWindowController.BP_SerifuWindowController_C.ExecuteUbergraph_BP_SerifuWindowController
// 0x00E8 (0x00E8 - 0x0000)
struct BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetDisableColorChoicesFlagList_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTextDelegateType                         K2Node_CustomEvent_EventType;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PageIndex;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PageLineIndex;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGWindowBase*                     K2Node_Event_InSelectWindow;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Event_ItemNameList;                         // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 K2Node_Event_CountList;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         K2Node_Event_ItemNameLangth;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Message_Sentaku_Blacksmith_modern_C* K2Node_DynamicCast_AsWBP_Menu_Message_Sentaku_Blacksmith_Modern; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     K2Node_Event_InRenkeiInfoWindow;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGTuyosaRenkeiData*               K2Node_Event_RenkeiData;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Renkei_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Common_Renkei_000_Modern; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWindowBase*                     K2Node_Event_InSelectWindow2;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Message_Sentaku_Custom_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Message_Sentaku_Custom_000_Modern; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackUMGTextColorSet>                  CallFunc_GetChoicesColorList_ReturnValue;          // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackUMGTextColorSet>                  CallFunc_GetChoicesColorList_ReturnValue2;         // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController) == 0x000008, "Wrong alignment on BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController");
static_assert(sizeof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController) == 0x0000E8, "Wrong size on BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, EntryPoint) == 0x000000, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, CallFunc_GetDisableColorChoicesFlagList_ReturnValue) == 0x000008, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::CallFunc_GetDisableColorChoicesFlagList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_CustomEvent_Sender) == 0x000018, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_CustomEvent_CurrentTextID) == 0x000020, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_CustomEvent_EventType) == 0x000028, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_CustomEvent_PageIndex) == 0x00002C, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_CustomEvent_PageIndex' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_CustomEvent_PageLineIndex) == 0x000030, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_CustomEvent_PageLineIndex' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_CustomEvent_SelectDialogIndex) == 0x000034, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_InSelectWindow) == 0x000048, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_InSelectWindow' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_ItemNameList) == 0x000050, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_ItemNameList' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_CountList) == 0x000060, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_CountList' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_ItemNameLangth) == 0x000070, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_ItemNameLangth' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_DynamicCast_AsWBP_Menu_Message_Sentaku_Blacksmith_Modern) == 0x000078, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_DynamicCast_AsWBP_Menu_Message_Sentaku_Blacksmith_Modern' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_InRenkeiInfoWindow) == 0x000088, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_InRenkeiInfoWindow' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_RenkeiData) == 0x000090, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_RenkeiData' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_DynamicCast_AsWBP_Menu_Common_Renkei_000_Modern) == 0x000098, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_DynamicCast_AsWBP_Menu_Common_Renkei_000_Modern' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_DynamicCast_bSuccess2) == 0x0000A0, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_Event_InSelectWindow2) == 0x0000A8, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_Event_InSelectWindow2' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_DynamicCast_AsWBP_Menu_Message_Sentaku_Custom_000_Modern) == 0x0000B0, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_DynamicCast_AsWBP_Menu_Message_Sentaku_Custom_000_Modern' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, K2Node_DynamicCast_bSuccess3) == 0x0000B8, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, CallFunc_GetChoicesColorList_ReturnValue) == 0x0000C0, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::CallFunc_GetChoicesColorList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController, CallFunc_GetChoicesColorList_ReturnValue2) == 0x0000D8, "Member 'BP_SerifuWindowController_C_ExecuteUbergraph_BP_SerifuWindowController::CallFunc_GetChoicesColorList_ReturnValue2' has a wrong offset!");

// Function BP_SerifuWindowController.BP_SerifuWindowController_C.OnOpenRenkeiInfoWindow
// 0x0010 (0x0010 - 0x0000)
struct BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow final
{
public:
	class UJackUMGWidgetBase*                     InRenkeiInfoWindow;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGTuyosaRenkeiData*               RenkeiData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow) == 0x000008, "Wrong alignment on BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow");
static_assert(sizeof(BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow) == 0x000010, "Wrong size on BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow, InRenkeiInfoWindow) == 0x000000, "Member 'BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow::InRenkeiInfoWindow' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow, RenkeiData) == 0x000008, "Member 'BP_SerifuWindowController_C_OnOpenRenkeiInfoWindow::RenkeiData' has a wrong offset!");

// Function BP_SerifuWindowController.BP_SerifuWindowController_C.TextBPDelegate_Event_0
// 0x0020 (0x0020 - 0x0000)
struct BP_SerifuWindowController_C_TextBPDelegate_Event_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTextDelegateType                         EventType;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PageIndex;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageLineIndex;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerifuWindowController_C_TextBPDelegate_Event_0) == 0x000008, "Wrong alignment on BP_SerifuWindowController_C_TextBPDelegate_Event_0");
static_assert(sizeof(BP_SerifuWindowController_C_TextBPDelegate_Event_0) == 0x000020, "Wrong size on BP_SerifuWindowController_C_TextBPDelegate_Event_0");
static_assert(offsetof(BP_SerifuWindowController_C_TextBPDelegate_Event_0, Sender) == 0x000000, "Member 'BP_SerifuWindowController_C_TextBPDelegate_Event_0::Sender' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_TextBPDelegate_Event_0, CurrentTextID) == 0x000008, "Member 'BP_SerifuWindowController_C_TextBPDelegate_Event_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_TextBPDelegate_Event_0, EventType) == 0x000010, "Member 'BP_SerifuWindowController_C_TextBPDelegate_Event_0::EventType' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_TextBPDelegate_Event_0, PageIndex) == 0x000014, "Member 'BP_SerifuWindowController_C_TextBPDelegate_Event_0::PageIndex' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_TextBPDelegate_Event_0, PageLineIndex) == 0x000018, "Member 'BP_SerifuWindowController_C_TextBPDelegate_Event_0::PageLineIndex' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_TextBPDelegate_Event_0, SelectDialogIndex) == 0x00001C, "Member 'BP_SerifuWindowController_C_TextBPDelegate_Event_0::SelectDialogIndex' has a wrong offset!");

// Function BP_SerifuWindowController.BP_SerifuWindowController_C.OnOpenBlacksmithCreateSelectWindow
// 0x0030 (0x0030 - 0x0000)
struct BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow final
{
public:
	class UJackUMGWindowBase*                     InSelectWindow;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ItemNameList;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CountList;                                         // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         ItemNameLangth;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow) == 0x000008, "Wrong alignment on BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow");
static_assert(sizeof(BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow) == 0x000030, "Wrong size on BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow, InSelectWindow) == 0x000000, "Member 'BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow::InSelectWindow' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow, ItemNameList) == 0x000008, "Member 'BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow::ItemNameList' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow, CountList) == 0x000018, "Member 'BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow::CountList' has a wrong offset!");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow, ItemNameLangth) == 0x000028, "Member 'BP_SerifuWindowController_C_OnOpenBlacksmithCreateSelectWindow::ItemNameLangth' has a wrong offset!");

// Function BP_SerifuWindowController.BP_SerifuWindowController_C.OnOpenSelectWindow
// 0x0008 (0x0008 - 0x0000)
struct BP_SerifuWindowController_C_OnOpenSelectWindow final
{
public:
	class UJackUMGWindowBase*                     InSelectWindow;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SerifuWindowController_C_OnOpenSelectWindow) == 0x000008, "Wrong alignment on BP_SerifuWindowController_C_OnOpenSelectWindow");
static_assert(sizeof(BP_SerifuWindowController_C_OnOpenSelectWindow) == 0x000008, "Wrong size on BP_SerifuWindowController_C_OnOpenSelectWindow");
static_assert(offsetof(BP_SerifuWindowController_C_OnOpenSelectWindow, InSelectWindow) == 0x000000, "Member 'BP_SerifuWindowController_C_OnOpenSelectWindow::InSelectWindow' has a wrong offset!");

}

