#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_S001_E001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_S001_E001.BP_S001_E001_C
// 0x0018 (0x03C8 - 0x03B0)
class ABP_S001_E001_C final : public AJackPropActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_S001_E001(int32 EntryPoint);
	void OnHiddenInGameChanged(bool bNewHiddenInGame);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_S001_E001_C">();
	}
	static class ABP_S001_E001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_S001_E001_C>();
	}
};
static_assert(alignof(ABP_S001_E001_C) == 0x000008, "Wrong alignment on ABP_S001_E001_C");
static_assert(sizeof(ABP_S001_E001_C) == 0x0003C8, "Wrong size on ABP_S001_E001_C");
static_assert(offsetof(ABP_S001_E001_C, UberGraphFrame) == 0x0003B0, "Member 'ABP_S001_E001_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_S001_E001_C, StaticMesh) == 0x0003B8, "Member 'ABP_S001_E001_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_S001_E001_C, Scene) == 0x0003C0, "Member 'ABP_S001_E001_C::Scene' has a wrong offset!");

}

