#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_S002_E001

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_S002_E001.BP_S002_E001_C.ExecuteUbergraph_BP_S002_E001
// 0x0008 (0x0008 - 0x0000)
struct BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewHiddenInGame;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001) == 0x000004, "Wrong alignment on BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001");
static_assert(sizeof(BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001) == 0x000008, "Wrong size on BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001");
static_assert(offsetof(BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001, EntryPoint) == 0x000000, "Member 'BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001, K2Node_Event_bNewHiddenInGame) == 0x000004, "Member 'BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001::K2Node_Event_bNewHiddenInGame' has a wrong offset!");
static_assert(offsetof(BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_S002_E001_C_ExecuteUbergraph_BP_S002_E001::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_S002_E001.BP_S002_E001_C.OnHiddenInGameChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_S002_E001_C_OnHiddenInGameChanged final
{
public:
	bool                                          bNewHiddenInGame;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_S002_E001_C_OnHiddenInGameChanged) == 0x000001, "Wrong alignment on BP_S002_E001_C_OnHiddenInGameChanged");
static_assert(sizeof(BP_S002_E001_C_OnHiddenInGameChanged) == 0x000001, "Wrong size on BP_S002_E001_C_OnHiddenInGameChanged");
static_assert(offsetof(BP_S002_E001_C_OnHiddenInGameChanged, bNewHiddenInGame) == 0x000000, "Member 'BP_S002_E001_C_OnHiddenInGameChanged::bNewHiddenInGame' has a wrong offset!");

}

