#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScheduledKira

#include "Basic.hpp"

#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScheduledKira.BP_ScheduledKira_C
// 0x0018 (0x03F8 - 0x03E0)
class ABP_ScheduledKira_C final : public AJackScheduledKira
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UJackMiniMapTargetComponent*            JackMiniMapTarget;                                 // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	class AActor* OnSpawnKira(class FName& ItemID, int32 ItemNum, struct FVector& Location, class FName& RespawnSaveFlagName);
	bool OnRequestDestroy(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ScheduledKira_C">();
	}
	static class ABP_ScheduledKira_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScheduledKira_C>();
	}
};
static_assert(alignof(ABP_ScheduledKira_C) == 0x000008, "Wrong alignment on ABP_ScheduledKira_C");
static_assert(sizeof(ABP_ScheduledKira_C) == 0x0003F8, "Wrong size on ABP_ScheduledKira_C");
static_assert(offsetof(ABP_ScheduledKira_C, TextRender) == 0x0003E0, "Member 'ABP_ScheduledKira_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_ScheduledKira_C, JackMiniMapTarget) == 0x0003E8, "Member 'ABP_ScheduledKira_C::JackMiniMapTarget' has a wrong offset!");
static_assert(offsetof(ABP_ScheduledKira_C, Sphere) == 0x0003F0, "Member 'ABP_ScheduledKira_C::Sphere' has a wrong offset!");

}

