#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeChangeCloud

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TimeChangeCloud.BP_TimeChangeCloud_C.GetNowCloudParameter
// 0x0024 (0x0024 - 0x0000)
struct BP_TimeChangeCloud_C_GetNowCloudParameter final
{
public:
	int32                                         bpp__Time__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           bpp__CloudColor__pf;                               // 0x0004(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           bpp__CloudColorShadow__pf;                         // 0x0014(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TimeChangeCloud_C_GetNowCloudParameter) == 0x000004, "Wrong alignment on BP_TimeChangeCloud_C_GetNowCloudParameter");
static_assert(sizeof(BP_TimeChangeCloud_C_GetNowCloudParameter) == 0x000024, "Wrong size on BP_TimeChangeCloud_C_GetNowCloudParameter");
static_assert(offsetof(BP_TimeChangeCloud_C_GetNowCloudParameter, bpp__Time__pf) == 0x000000, "Member 'BP_TimeChangeCloud_C_GetNowCloudParameter::bpp__Time__pf' has a wrong offset!");
static_assert(offsetof(BP_TimeChangeCloud_C_GetNowCloudParameter, bpp__CloudColor__pf) == 0x000004, "Member 'BP_TimeChangeCloud_C_GetNowCloudParameter::bpp__CloudColor__pf' has a wrong offset!");
static_assert(offsetof(BP_TimeChangeCloud_C_GetNowCloudParameter, bpp__CloudColorShadow__pf) == 0x000014, "Member 'BP_TimeChangeCloud_C_GetNowCloudParameter::bpp__CloudColorShadow__pf' has a wrong offset!");

// Function BP_TimeChangeCloud.BP_TimeChangeCloud_C.SetCloudWeather
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeChangeCloud_C_SetCloudWeather final
{
public:
	EJackWorldWeather                             bpp__NewxWeather__pfT;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__WeatherChangeRate__pf;                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TimeChangeCloud_C_SetCloudWeather) == 0x000004, "Wrong alignment on BP_TimeChangeCloud_C_SetCloudWeather");
static_assert(sizeof(BP_TimeChangeCloud_C_SetCloudWeather) == 0x000008, "Wrong size on BP_TimeChangeCloud_C_SetCloudWeather");
static_assert(offsetof(BP_TimeChangeCloud_C_SetCloudWeather, bpp__NewxWeather__pfT) == 0x000000, "Member 'BP_TimeChangeCloud_C_SetCloudWeather::bpp__NewxWeather__pfT' has a wrong offset!");
static_assert(offsetof(BP_TimeChangeCloud_C_SetCloudWeather, bpp__WeatherChangeRate__pf) == 0x000004, "Member 'BP_TimeChangeCloud_C_SetCloudWeather::bpp__WeatherChangeRate__pf' has a wrong offset!");

// Function BP_TimeChangeCloud.BP_TimeChangeCloud_C.UpdateEnvironment
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeChangeCloud_C_UpdateEnvironment final
{
public:
	int32                                         bpp__Time__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__UpdateCounter__pf;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TimeChangeCloud_C_UpdateEnvironment) == 0x000004, "Wrong alignment on BP_TimeChangeCloud_C_UpdateEnvironment");
static_assert(sizeof(BP_TimeChangeCloud_C_UpdateEnvironment) == 0x000008, "Wrong size on BP_TimeChangeCloud_C_UpdateEnvironment");
static_assert(offsetof(BP_TimeChangeCloud_C_UpdateEnvironment, bpp__Time__pf) == 0x000000, "Member 'BP_TimeChangeCloud_C_UpdateEnvironment::bpp__Time__pf' has a wrong offset!");
static_assert(offsetof(BP_TimeChangeCloud_C_UpdateEnvironment, bpp__UpdateCounter__pf) == 0x000004, "Member 'BP_TimeChangeCloud_C_UpdateEnvironment::bpp__UpdateCounter__pf' has a wrong offset!");

}

