#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeChangeEnvironmentBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TimeChangeEnvironmentBase.BP_TimeChangeEnvironmentBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TimeChangeEnvironmentBase_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TimeChangeEnvironmentBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TimeChangeEnvironmentBase_C_ReceiveTick");
static_assert(sizeof(BP_TimeChangeEnvironmentBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_TimeChangeEnvironmentBase_C_ReceiveTick");
static_assert(offsetof(BP_TimeChangeEnvironmentBase_C_ReceiveTick, bpp__DeltaSeconds__pf) == 0x000000, "Member 'BP_TimeChangeEnvironmentBase_C_ReceiveTick::bpp__DeltaSeconds__pf' has a wrong offset!");

// Function BP_TimeChangeEnvironmentBase.BP_TimeChangeEnvironmentBase_C.UpdateEnvironment
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeChangeEnvironmentBase_C_UpdateEnvironment final
{
public:
	int32                                         bpp__Time__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__UpdateCounter__pf;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TimeChangeEnvironmentBase_C_UpdateEnvironment) == 0x000004, "Wrong alignment on BP_TimeChangeEnvironmentBase_C_UpdateEnvironment");
static_assert(sizeof(BP_TimeChangeEnvironmentBase_C_UpdateEnvironment) == 0x000008, "Wrong size on BP_TimeChangeEnvironmentBase_C_UpdateEnvironment");
static_assert(offsetof(BP_TimeChangeEnvironmentBase_C_UpdateEnvironment, bpp__Time__pf) == 0x000000, "Member 'BP_TimeChangeEnvironmentBase_C_UpdateEnvironment::bpp__Time__pf' has a wrong offset!");
static_assert(offsetof(BP_TimeChangeEnvironmentBase_C_UpdateEnvironment, bpp__UpdateCounter__pf) == 0x000004, "Member 'BP_TimeChangeEnvironmentBase_C_UpdateEnvironment::bpp__UpdateCounter__pf' has a wrong offset!");

}

