#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureBox_Kira

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TreasureBox_Kira.BP_TreasureBox_Kira_C.ExecuteUbergraph_BP_TreasureBox_Kira_1
// 0x0004 (0x0004 - 0x0000)
struct BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1) == 0x000004, "Wrong alignment on BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1");
static_assert(sizeof(BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1) == 0x000004, "Wrong size on BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1");
static_assert(offsetof(BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_TreasureBox_Kira_C_ExecuteUbergraph_BP_TreasureBox_Kira_1::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_TreasureBox_Kira.BP_TreasureBox_Kira_C.OnGenerateDebugInfoString
// 0x0010 (0x0010 - 0x0000)
struct BP_TreasureBox_Kira_C_OnGenerateDebugInfoString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBox_Kira_C_OnGenerateDebugInfoString) == 0x000008, "Wrong alignment on BP_TreasureBox_Kira_C_OnGenerateDebugInfoString");
static_assert(sizeof(BP_TreasureBox_Kira_C_OnGenerateDebugInfoString) == 0x000010, "Wrong size on BP_TreasureBox_Kira_C_OnGenerateDebugInfoString");
static_assert(offsetof(BP_TreasureBox_Kira_C_OnGenerateDebugInfoString, ReturnValue) == 0x000000, "Member 'BP_TreasureBox_Kira_C_OnGenerateDebugInfoString::ReturnValue' has a wrong offset!");

// Function BP_TreasureBox_Kira.BP_TreasureBox_Kira_C.RequestDestroy
// 0x0001 (0x0001 - 0x0000)
struct BP_TreasureBox_Kira_C_RequestDestroy final
{
public:
	bool                                          bpp__Accept__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBox_Kira_C_RequestDestroy) == 0x000001, "Wrong alignment on BP_TreasureBox_Kira_C_RequestDestroy");
static_assert(sizeof(BP_TreasureBox_Kira_C_RequestDestroy) == 0x000001, "Wrong size on BP_TreasureBox_Kira_C_RequestDestroy");
static_assert(offsetof(BP_TreasureBox_Kira_C_RequestDestroy, bpp__Accept__pf) == 0x000000, "Member 'BP_TreasureBox_Kira_C_RequestDestroy::bpp__Accept__pf' has a wrong offset!");

// Function BP_TreasureBox_Kira.BP_TreasureBox_Kira_C.SetGettableItemCommon
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBox_Kira_C_SetGettableItemCommon final
{
public:
	class FName                                   bpp__KIraID__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBox_Kira_C_SetGettableItemCommon) == 0x000004, "Wrong alignment on BP_TreasureBox_Kira_C_SetGettableItemCommon");
static_assert(sizeof(BP_TreasureBox_Kira_C_SetGettableItemCommon) == 0x000008, "Wrong size on BP_TreasureBox_Kira_C_SetGettableItemCommon");
static_assert(offsetof(BP_TreasureBox_Kira_C_SetGettableItemCommon, bpp__KIraID__pf) == 0x000000, "Member 'BP_TreasureBox_Kira_C_SetGettableItemCommon::bpp__KIraID__pf' has a wrong offset!");

// Function BP_TreasureBox_Kira.BP_TreasureBox_Kira_C.SetGettableItemDirect
// 0x0018 (0x0018 - 0x0000)
struct BP_TreasureBox_Kira_C_SetGettableItemDirect final
{
public:
	class FName                                   bpp__ItemID__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__ItemNum__pf;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__RespawnSaveFlagName__pf;                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBox_Kira_C_SetGettableItemDirect) == 0x000004, "Wrong alignment on BP_TreasureBox_Kira_C_SetGettableItemDirect");
static_assert(sizeof(BP_TreasureBox_Kira_C_SetGettableItemDirect) == 0x000018, "Wrong size on BP_TreasureBox_Kira_C_SetGettableItemDirect");
static_assert(offsetof(BP_TreasureBox_Kira_C_SetGettableItemDirect, bpp__ItemID__pf) == 0x000000, "Member 'BP_TreasureBox_Kira_C_SetGettableItemDirect::bpp__ItemID__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Kira_C_SetGettableItemDirect, bpp__ItemNum__pf) == 0x000008, "Member 'BP_TreasureBox_Kira_C_SetGettableItemDirect::bpp__ItemNum__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Kira_C_SetGettableItemDirect, bpp__RespawnSaveFlagName__pf) == 0x000010, "Member 'BP_TreasureBox_Kira_C_SetGettableItemDirect::bpp__RespawnSaveFlagName__pf' has a wrong offset!");

}

