#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureBoxBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// DelegateFunction BP_TreasureBoxBase.BP_TreasureBoxBase_C.OnSystemFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature final
{
public:
	class UParticleSystemComponent*               bpp__PSystem__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature");
static_assert(sizeof(BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature) == 0x000008, "Wrong size on BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature");
static_assert(offsetof(BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature, bpp__PSystem__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_OnSystemFinished__DelegateSignature::bpp__PSystem__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature final
{
public:
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature");
static_assert(sizeof(BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature) == 0x000008, "Wrong size on BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_BndEvt__JackInteractiveActor_K2Node_ComponentBoundEvent_108_ComponentInteractSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature, bpp__OverlappedComponent__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature::bpp__OverlappedComponent__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000008, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature, bpp__OtherComp__pf) == 0x000010, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature::bpp__OtherComp__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature, bpp__OtherBodyIndex__pf) == 0x000018, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_36_ComponentEndOverlapSignature__DelegateSignature::bpp__OtherBodyIndex__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bFromSweep__pf;                               // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             bpp__SweepResult__pf__const;                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bpp__OverlappedComponent__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bpp__OverlappedComponent__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherActor__pf) == 0x000008, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherActor__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherComp__pf) == 0x000010, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherComp__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bpp__OtherBodyIndex__pf) == 0x000018, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bpp__OtherBodyIndex__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bpp__bFromSweep__pf) == 0x00001C, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bpp__bFromSweep__pf' has a wrong offset!");
static_assert(offsetof(BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bpp__SweepResult__pf__const) == 0x000020, "Member 'BP_TreasureBoxBase_C_BndEvt__TriggerBox_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bpp__SweepResult__pf__const' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.ExecuteUbergraph_BP_TreasureBoxBase_0
// 0x0004 (0x0004 - 0x0000)
struct BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0) == 0x000004, "Wrong alignment on BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0");
static_assert(sizeof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0) == 0x000004, "Wrong size on BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0");
static_assert(offsetof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_0::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.ExecuteUbergraph_BP_TreasureBoxBase_1
// 0x0004 (0x0004 - 0x0000)
struct BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1) == 0x000004, "Wrong alignment on BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1");
static_assert(sizeof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1) == 0x000004, "Wrong size on BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1");
static_assert(offsetof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_1::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.ExecuteUbergraph_BP_TreasureBoxBase_4
// 0x0004 (0x0004 - 0x0000)
struct BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4) == 0x000004, "Wrong alignment on BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4");
static_assert(sizeof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4) == 0x000004, "Wrong size on BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4");
static_assert(offsetof(BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4, bpp__EntryPoint__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_ExecuteUbergraph_BP_TreasureBoxBase_4::bpp__EntryPoint__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.OnInteract_Kira
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBoxBase_C_OnInteract_Kira final
{
public:
	class AJackCharacter*                         bpp__JackCharacter__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_OnInteract_Kira) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_OnInteract_Kira");
static_assert(sizeof(BP_TreasureBoxBase_C_OnInteract_Kira) == 0x000008, "Wrong size on BP_TreasureBoxBase_C_OnInteract_Kira");
static_assert(offsetof(BP_TreasureBoxBase_C_OnInteract_Kira, bpp__JackCharacter__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_OnInteract_Kira::bpp__JackCharacter__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.OnInteract_TreasureBox
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBoxBase_C_OnInteract_TreasureBox final
{
public:
	class AJackCharacter*                         bpp__JackCharacter__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_OnInteract_TreasureBox) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_OnInteract_TreasureBox");
static_assert(sizeof(BP_TreasureBoxBase_C_OnInteract_TreasureBox) == 0x000008, "Wrong size on BP_TreasureBoxBase_C_OnInteract_TreasureBox");
static_assert(offsetof(BP_TreasureBoxBase_C_OnInteract_TreasureBox, bpp__JackCharacter__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_OnInteract_TreasureBox::bpp__JackCharacter__pf' has a wrong offset!");

// Function BP_TreasureBoxBase.BP_TreasureBoxBase_C.OnSystemFinished_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBoxBase_C_OnSystemFinished_Event_0 final
{
public:
	class UParticleSystemComponent*               bpp__PSystem__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxBase_C_OnSystemFinished_Event_0) == 0x000008, "Wrong alignment on BP_TreasureBoxBase_C_OnSystemFinished_Event_0");
static_assert(sizeof(BP_TreasureBoxBase_C_OnSystemFinished_Event_0) == 0x000008, "Wrong size on BP_TreasureBoxBase_C_OnSystemFinished_Event_0");
static_assert(offsetof(BP_TreasureBoxBase_C_OnSystemFinished_Event_0, bpp__PSystem__pf) == 0x000000, "Member 'BP_TreasureBoxBase_C_OnSystemFinished_Event_0::bpp__PSystem__pf' has a wrong offset!");

}

