#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureBoxArrangedBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TreasureBoxArrangedBase.BP_TreasureBoxArrangedBase_C.EnableTreasureBox
// 0x0001 (0x0001 - 0x0000)
struct BP_TreasureBoxArrangedBase_C_EnableTreasureBox final
{
public:
	bool                                          bpp__Change__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxArrangedBase_C_EnableTreasureBox) == 0x000001, "Wrong alignment on BP_TreasureBoxArrangedBase_C_EnableTreasureBox");
static_assert(sizeof(BP_TreasureBoxArrangedBase_C_EnableTreasureBox) == 0x000001, "Wrong size on BP_TreasureBoxArrangedBase_C_EnableTreasureBox");
static_assert(offsetof(BP_TreasureBoxArrangedBase_C_EnableTreasureBox, bpp__Change__pf) == 0x000000, "Member 'BP_TreasureBoxArrangedBase_C_EnableTreasureBox::bpp__Change__pf' has a wrong offset!");

// Function BP_TreasureBoxArrangedBase.BP_TreasureBoxArrangedBase_C.GetInpasuResultTextId
// 0x0008 (0x0008 - 0x0000)
struct BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId final
{
public:
	class FName                                   bpp__OutTextId__pf;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId) == 0x000004, "Wrong alignment on BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId");
static_assert(sizeof(BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId) == 0x000008, "Wrong size on BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId");
static_assert(offsetof(BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId, bpp__OutTextId__pf) == 0x000000, "Member 'BP_TreasureBoxArrangedBase_C_GetInpasuResultTextId::bpp__OutTextId__pf' has a wrong offset!");

// Function BP_TreasureBoxArrangedBase.BP_TreasureBoxArrangedBase_C.OnGenerateDebugInfoString
// 0x0010 (0x0010 - 0x0000)
struct BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString) == 0x000008, "Wrong alignment on BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString");
static_assert(sizeof(BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString) == 0x000010, "Wrong size on BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString");
static_assert(offsetof(BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString, ReturnValue) == 0x000000, "Member 'BP_TreasureBoxArrangedBase_C_OnGenerateDebugInfoString::ReturnValue' has a wrong offset!");

}

