#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureBox_Battle

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TreasureBox_Battle.BP_TreasureBox_Battle_C.ExecuteUbergraph_BP_TreasureBox_Battle
// 0x0038 (0x0038 - 0x0000)
struct BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Message;                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Sender;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Message, class AActor* Sender)> K2Node_CreateDelegate_OutputDelegate_0;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleSimpleCameraMode_ReturnValue;     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle) == 0x000008, "Wrong alignment on BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle");
static_assert(sizeof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle) == 0x000038, "Wrong size on BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle");
static_assert(offsetof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle, EntryPoint) == 0x000000, "Member 'BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle, K2Node_CustomEvent_Message) == 0x000008, "Member 'BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle, K2Node_CustomEvent_Sender) == 0x000018, "Member 'BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle, K2Node_CreateDelegate_OutputDelegate_0) == 0x000020, "Member 'BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle::K2Node_CreateDelegate_OutputDelegate_0' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle, K2Node_SwitchString_CmpSuccess) == 0x000030, "Member 'BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle, CallFunc_IsBattleSimpleCameraMode_ReturnValue) == 0x000031, "Member 'BP_TreasureBox_Battle_C_ExecuteUbergraph_BP_TreasureBox_Battle::CallFunc_IsBattleSimpleCameraMode_ReturnValue' has a wrong offset!");

// Function BP_TreasureBox_Battle.BP_TreasureBox_Battle_C.OnReceiveMessage_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_TreasureBox_Battle_C_OnReceiveMessage_Event final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 Sender;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TreasureBox_Battle_C_OnReceiveMessage_Event) == 0x000008, "Wrong alignment on BP_TreasureBox_Battle_C_OnReceiveMessage_Event");
static_assert(sizeof(BP_TreasureBox_Battle_C_OnReceiveMessage_Event) == 0x000018, "Wrong size on BP_TreasureBox_Battle_C_OnReceiveMessage_Event");
static_assert(offsetof(BP_TreasureBox_Battle_C_OnReceiveMessage_Event, Message) == 0x000000, "Member 'BP_TreasureBox_Battle_C_OnReceiveMessage_Event::Message' has a wrong offset!");
static_assert(offsetof(BP_TreasureBox_Battle_C_OnReceiveMessage_Event, Sender) == 0x000010, "Member 'BP_TreasureBox_Battle_C_OnReceiveMessage_Event::Sender' has a wrong offset!");

}

