#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureBoxArrangedBase

#include "Basic.hpp"

#include "BP_TreasureBoxBase_classes.hpp"
#include "JackGame_structs.hpp"
#include "STRUCT_ItemSet_structs.hpp"


namespace SDK
{

// DynamicClass BP_TreasureBoxArrangedBase.BP_TreasureBoxArrangedBase_C
// 0x01A8 (0x10D0 - 0x0F28)
class ABP_TreasureBoxArrangedBase_C : public ABP_TreasureBoxBase_C
{
public:
	class UBP_COMP_WorldBroken_C*                 BP_COMP_WorldBroken;                               // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   SideOpenCollision;                                 // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TreasureID;                                        // 0x0F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlacementConditionName;                            // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackTreasureBoxPlacementCondition            PlacementConditionType;                            // 0x0F48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceRedWhenInpasu;                               // 0x0F49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4A[0x6];                                      // 0x0F4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_TextDataGame                  TextID_Inpasu_Red;                                 // 0x0F50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackLDT_TextDataGame                  TextID_Inpasu_Yellow;                              // 0x0F60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackLDT_TextDataGame                  TextID_Inpasu_Blue;                                // 0x0F70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackLDT_TextDataGame                  TextID_Inpasu_DoNothing;                           // 0x0F80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackDataTableItemGettable_TreasureBox CallFunc_GetDataTableRowFromName_OutRow;           // 0x0F90(0x0078)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	struct FSTRUCT_ItemSet                        K2Node_MakeStruct_STRUCT_ItemSet;                  // 0x1008(0x0010)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_ItemSet                        K2Node_MakeStruct_STRUCT_ItemSet2;                 // 0x1018(0x0010)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_ItemSet                        K2Node_MakeStruct_STRUCT_ItemSet3;                 // 0x1028(0x0010)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSTRUCT_ItemSet>                K2Node_MakeArray_Array_BP_TreasureBoxArrangedBase_C; // 0x1038(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchEnum_CmpSuccess_BP_TreasureBoxArrangedBase_C; // 0x1048(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1049[0x7];                                     // 0x1049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableItemGettable_TreasureBox CallFunc_GetDataTableRowFromName_OutRow2;          // 0x1050(0x0078)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	bool                                          CallFunc_EnableTreasureBox_Change;                 // 0x10C8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_IsItemGotten_ItemGotten_BP_TreasureBoxArrangedBase_C; // 0x10C9(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x10CA(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10CB[0x5];                                     // 0x10CB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableTresureBox();
	void EnableTreasureBox(bool* bpp__Change__pf);
	void GetInpasuResultTextId(class FName* bpp__OutTextId__pf);
	class FString OnGenerateDebugInfoString();
	void OnOpenMoveEnd();
	void OnOpenMoveStart();
	void OnWinEventBattle();
	void ReceiveBeginPlay();
	void RefreshTreasureBox();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BP_TreasureBoxArrangedBase_C">();
	}
	static class ABP_TreasureBoxArrangedBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TreasureBoxArrangedBase_C>();
	}
};
static_assert(alignof(ABP_TreasureBoxArrangedBase_C) == 0x000008, "Wrong alignment on ABP_TreasureBoxArrangedBase_C");
static_assert(sizeof(ABP_TreasureBoxArrangedBase_C) == 0x0010D0, "Wrong size on ABP_TreasureBoxArrangedBase_C");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, BP_COMP_WorldBroken) == 0x000F28, "Member 'ABP_TreasureBoxArrangedBase_C::BP_COMP_WorldBroken' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, SideOpenCollision) == 0x000F30, "Member 'ABP_TreasureBoxArrangedBase_C::SideOpenCollision' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, TreasureID) == 0x000F38, "Member 'ABP_TreasureBoxArrangedBase_C::TreasureID' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, PlacementConditionName) == 0x000F40, "Member 'ABP_TreasureBoxArrangedBase_C::PlacementConditionName' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, PlacementConditionType) == 0x000F48, "Member 'ABP_TreasureBoxArrangedBase_C::PlacementConditionType' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, bForceRedWhenInpasu) == 0x000F49, "Member 'ABP_TreasureBoxArrangedBase_C::bForceRedWhenInpasu' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, TextID_Inpasu_Red) == 0x000F50, "Member 'ABP_TreasureBoxArrangedBase_C::TextID_Inpasu_Red' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, TextID_Inpasu_Yellow) == 0x000F60, "Member 'ABP_TreasureBoxArrangedBase_C::TextID_Inpasu_Yellow' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, TextID_Inpasu_Blue) == 0x000F70, "Member 'ABP_TreasureBoxArrangedBase_C::TextID_Inpasu_Blue' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, TextID_Inpasu_DoNothing) == 0x000F80, "Member 'ABP_TreasureBoxArrangedBase_C::TextID_Inpasu_DoNothing' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, CallFunc_GetDataTableRowFromName_OutRow) == 0x000F90, "Member 'ABP_TreasureBoxArrangedBase_C::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, K2Node_MakeStruct_STRUCT_ItemSet) == 0x001008, "Member 'ABP_TreasureBoxArrangedBase_C::K2Node_MakeStruct_STRUCT_ItemSet' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, K2Node_MakeStruct_STRUCT_ItemSet2) == 0x001018, "Member 'ABP_TreasureBoxArrangedBase_C::K2Node_MakeStruct_STRUCT_ItemSet2' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, K2Node_MakeStruct_STRUCT_ItemSet3) == 0x001028, "Member 'ABP_TreasureBoxArrangedBase_C::K2Node_MakeStruct_STRUCT_ItemSet3' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, K2Node_MakeArray_Array_BP_TreasureBoxArrangedBase_C) == 0x001038, "Member 'ABP_TreasureBoxArrangedBase_C::K2Node_MakeArray_Array_BP_TreasureBoxArrangedBase_C' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, K2Node_SwitchEnum_CmpSuccess_BP_TreasureBoxArrangedBase_C) == 0x001048, "Member 'ABP_TreasureBoxArrangedBase_C::K2Node_SwitchEnum_CmpSuccess_BP_TreasureBoxArrangedBase_C' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, CallFunc_GetDataTableRowFromName_OutRow2) == 0x001050, "Member 'ABP_TreasureBoxArrangedBase_C::CallFunc_GetDataTableRowFromName_OutRow2' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, CallFunc_EnableTreasureBox_Change) == 0x0010C8, "Member 'ABP_TreasureBoxArrangedBase_C::CallFunc_EnableTreasureBox_Change' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, CallFunc_IsItemGotten_ItemGotten_BP_TreasureBoxArrangedBase_C) == 0x0010C9, "Member 'ABP_TreasureBoxArrangedBase_C::CallFunc_IsItemGotten_ItemGotten_BP_TreasureBoxArrangedBase_C' has a wrong offset!");
static_assert(offsetof(ABP_TreasureBoxArrangedBase_C, K2Node_SwitchEnum2_CmpSuccess) == 0x0010CA, "Member 'ABP_TreasureBoxArrangedBase_C::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");

}

