#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TextManager

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_TextManager.BP_TextManager_C.DetermineBoukenGuideIDinBP
// 0x06B0 (0x06B0 - 0x0000)
struct BP_TextManager_C_DetermineBoukenGuideIDinBP final
{
public:
	EJackScenarioID                               ScenarioID;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ScenarioFlag;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow; // 0x0020(0x0078)()
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue3;             // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound2;  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk2;   // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow2; // 0x00A0(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound3;  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk3;   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow3; // 0x0120(0x0078)()
	bool                                          CallFunc_GetGameFlagBool_ReturnValue4;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue5;             // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound4;  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk4;   // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow4; // 0x01A0(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound5;  // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk5;   // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow5; // 0x0220(0x0078)()
	bool                                          CallFunc_GetGameFlagBool_ReturnValue6;             // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue9;                  // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue10;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound6;  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk6;   // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow6; // 0x02A0(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue11;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue7;             // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound7;  // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk7;   // 0x031B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow7; // 0x0320(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue12;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue13;                 // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue8;             // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue9;             // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue14;                 // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound8;  // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk8;   // 0x039E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39F[0x1];                                      // 0x039F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow8; // 0x03A0(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue15;                 // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound9;  // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk9;   // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow9; // 0x0420(0x0078)()
	bool                                          CallFunc_GetGameFlagBool_ReturnValue10;            // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue16;                 // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue17;                 // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue11;            // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue12;            // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue18;                 // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue13;            // 0x049E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue14;            // 0x049F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue15;            // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue16;            // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue17;            // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue18;            // 0x04A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue19;            // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue20;            // 0x04A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue21;            // 0x04A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue22;            // 0x04A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue23;            // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue24;            // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue25;            // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue26;            // 0x04AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound10; // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk10;  // 0x04AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AE[0x2];                                      // 0x04AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow10; // 0x04B0(0x0078)()
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound11; // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk11;  // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52A[0x6];                                      // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow11; // 0x0530(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue19;                 // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue20;                 // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue21;                 // 0x05AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue22;                 // 0x05AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue27;            // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound12; // 0x05AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk12;  // 0x05AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF[0x1];                                      // 0x05AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow12; // 0x05B0(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue23;                 // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue24;                 // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue28;            // 0x062A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bFound13; // 0x062B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCustomConditionBoukenGuide_bIsOk13;  // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D[0x3];                                      // 0x062D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              CallFunc_CheckCustomConditionBoukenGuide_TableRow13; // 0x0630(0x0078)()
	bool                                          CallFunc_BooleanAND_ReturnValue25;                 // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue26;                 // 0x06A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TextManager_C_DetermineBoukenGuideIDinBP) == 0x000008, "Wrong alignment on BP_TextManager_C_DetermineBoukenGuideIDinBP");
static_assert(sizeof(BP_TextManager_C_DetermineBoukenGuideIDinBP) == 0x0006B0, "Wrong size on BP_TextManager_C_DetermineBoukenGuideIDinBP");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, ScenarioID) == 0x000000, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::ScenarioID' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, ScenarioFlag) == 0x000008, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::ScenarioFlag' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, ReturnValue) == 0x000010, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound) == 0x000018, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk) == 0x000019, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow) == 0x000020, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue) == 0x000098, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue) == 0x000099, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue2) == 0x00009A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue3) == 0x00009B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue2) == 0x00009C, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound2) == 0x00009D, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound2' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk2) == 0x00009E, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk2' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow2) == 0x0000A0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow2' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue3) == 0x000118, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound3) == 0x000119, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound3' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk3) == 0x00011A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk3' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow3) == 0x000120, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow3' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue4) == 0x000198, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue4) == 0x000199, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue5) == 0x00019A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue5) == 0x00019B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound4) == 0x00019C, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound4' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk4) == 0x00019D, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk4' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow4) == 0x0001A0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow4' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue6) == 0x000218, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue7) == 0x000219, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound5) == 0x00021A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound5' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk5) == 0x00021B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk5' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow5) == 0x000220, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow5' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue6) == 0x000298, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue8) == 0x000299, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue9) == 0x00029A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue10) == 0x00029B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound6) == 0x00029C, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound6' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk6) == 0x00029D, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk6' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow6) == 0x0002A0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow6' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue11) == 0x000318, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue7) == 0x000319, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound7) == 0x00031A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound7' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk7) == 0x00031B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk7' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow7) == 0x000320, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow7' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue12) == 0x000398, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue13) == 0x000399, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue8) == 0x00039A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue9) == 0x00039B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue14) == 0x00039C, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound8) == 0x00039D, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound8' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk8) == 0x00039E, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk8' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow8) == 0x0003A0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow8' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue15) == 0x000418, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound9) == 0x000419, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound9' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk9) == 0x00041A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk9' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow9) == 0x000420, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow9' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue10) == 0x000498, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue16) == 0x000499, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue17) == 0x00049A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue11) == 0x00049B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue12) == 0x00049C, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue18) == 0x00049D, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue13) == 0x00049E, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue14) == 0x00049F, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue15) == 0x0004A0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue16) == 0x0004A1, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue17) == 0x0004A2, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue18) == 0x0004A3, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue19) == 0x0004A4, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue19' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue20) == 0x0004A5, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue20' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue21) == 0x0004A6, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue21' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue22) == 0x0004A7, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue22' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue23) == 0x0004A8, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue23' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue24) == 0x0004A9, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue24' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue25) == 0x0004AA, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue25' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue26) == 0x0004AB, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue26' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound10) == 0x0004AC, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound10' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk10) == 0x0004AD, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk10' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow10) == 0x0004B0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow10' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound11) == 0x000528, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound11' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk11) == 0x000529, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk11' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow11) == 0x000530, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow11' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue19) == 0x0005A8, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue19' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue20) == 0x0005A9, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue20' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue21) == 0x0005AA, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue21' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue22) == 0x0005AB, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue22' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue27) == 0x0005AC, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue27' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound12) == 0x0005AD, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound12' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk12) == 0x0005AE, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk12' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow12) == 0x0005B0, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow12' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue23) == 0x000628, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue23' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue24) == 0x000629, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue24' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_GetGameFlagBool_ReturnValue28) == 0x00062A, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_GetGameFlagBool_ReturnValue28' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bFound13) == 0x00062B, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bFound13' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_bIsOk13) == 0x00062C, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_bIsOk13' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_CheckCustomConditionBoukenGuide_TableRow13) == 0x000630, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_CheckCustomConditionBoukenGuide_TableRow13' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue25) == 0x0006A8, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue25' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_DetermineBoukenGuideIDinBP, CallFunc_BooleanAND_ReturnValue26) == 0x0006A9, "Member 'BP_TextManager_C_DetermineBoukenGuideIDinBP::CallFunc_BooleanAND_ReturnValue26' has a wrong offset!");

// Function BP_TextManager.BP_TextManager_C.CheckCustomConditionBoukenGuide
// 0x0148 (0x0148 - 0x0000)
struct BP_TextManager_C_CheckCustomConditionBoukenGuide final
{
public:
	class FName                                   BoukenGuideID;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFound;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsOk;                                             // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableBoukenGuide              TableRow;                                          // 0x0010(0x0078)(Parm, OutParm)
	int32                                         CallFunc_GetGameFlagInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetGameFlagString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableBoukenGuide              CallFunc_GetDataTableRowFromName_OutRow;           // 0x00B0(0x0078)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveScenarioFlag_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TextManager_C_CheckCustomConditionBoukenGuide) == 0x000008, "Wrong alignment on BP_TextManager_C_CheckCustomConditionBoukenGuide");
static_assert(sizeof(BP_TextManager_C_CheckCustomConditionBoukenGuide) == 0x000148, "Wrong size on BP_TextManager_C_CheckCustomConditionBoukenGuide");
static_assert(offsetof(BP_TextManager_C_CheckCustomConditionBoukenGuide, BoukenGuideID) == 0x000000, "Member 'BP_TextManager_C_CheckCustomConditionBoukenGuide::BoukenGuideID' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_CheckCustomConditionBoukenGuide, bFound) == 0x000008, "Member 'BP_TextManager_C_CheckCustomConditionBoukenGuide::bFound' has a wrong offset!");
static_assert(offsetof(BP_TextManager_C_CheckCustomConditionBoukenGuide, bIsOk) == 0x000009, "Member 'BP_TextManager_C_CheckCustomConditionBoukenGuide::bIsOk' has a wrong offset!");
