#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TenkuuNoPafuPafuSuffixTable

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TenkuuNoPafuPafuSuffixTable.BP_TenkuuNoPafuPafuSuffixTable_C
// 0x0030 (0x0068 - 0x0038)
class UBP_TenkuuNoPafuPafuSuffixTable_C final : public UObject
{
public:
	class FString                                 Default;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         Sexy;                                              // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         Other;                                             // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TenkuuNoPafuPafuSuffixTable_C">();
	}
	static class UBP_TenkuuNoPafuPafuSuffixTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TenkuuNoPafuPafuSuffixTable_C>();
	}
};
static_assert(alignof(UBP_TenkuuNoPafuPafuSuffixTable_C) == 0x000008, "Wrong alignment on UBP_TenkuuNoPafuPafuSuffixTable_C");
static_assert(sizeof(UBP_TenkuuNoPafuPafuSuffixTable_C) == 0x000068, "Wrong size on UBP_TenkuuNoPafuPafuSuffixTable_C");
static_assert(offsetof(UBP_TenkuuNoPafuPafuSuffixTable_C, Default) == 0x000038, "Member 'UBP_TenkuuNoPafuPafuSuffixTable_C::Default' has a wrong offset!");
static_assert(offsetof(UBP_TenkuuNoPafuPafuSuffixTable_C, Sexy) == 0x000048, "Member 'UBP_TenkuuNoPafuPafuSuffixTable_C::Sexy' has a wrong offset!");
static_assert(offsetof(UBP_TenkuuNoPafuPafuSuffixTable_C, Other) == 0x000058, "Member 'UBP_TenkuuNoPafuPafuSuffixTable_C::Other' has a wrong offset!");

}

