#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI3d_Icon_ActionCursor_Arrow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UI3d_Icon_ActionCursor_Arrow.BP_UI3d_Icon_ActionCursor_Arrow_C.DrawUpdate
// 0x0230 (0x0230 - 0x0000)
struct BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayerCameraFov_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPlayerCameraLocation_ReturnValue;      // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegTan_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0078(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition2;     // 0x0098(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue2;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X2;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x00BC(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetInverseRotator_ReturnValue;            // 0x00CC(0x000C)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerCameraManager*               CallFunc_GetJackPlayerCameraManager_ReturnValue2;  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue2;           // 0x018C(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetInverseRotator_ReturnValue2;           // 0x0198(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult2;      // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate) == 0x000008, "Wrong alignment on BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate");
static_assert(sizeof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate) == 0x000230, "Wrong size on BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, Temp_byte_Variable) == 0x000000, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetPlayerCameraFov_ReturnValue) == 0x000010, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetPlayerCameraFov_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetPlayerCameraLocation_ReturnValue) == 0x000024, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetPlayerCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_DegTan_ReturnValue) == 0x000030, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_DegTan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000048, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000054, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetJackPlayerController_ReturnValue) == 0x000060, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, Temp_bool_Variable) == 0x000068, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00006C, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000078, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000080, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000084, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_BreakVector2D_X) == 0x000090, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_BreakVector2D_Y) == 0x000094, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_ProjectWorldToScreen_ScreenPosition2) == 0x000098, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_ProjectWorldToScreen_ScreenPosition2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_ProjectWorldToScreen_ReturnValue2) == 0x0000A0, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_ProjectWorldToScreen_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_BreakVector2D_X2) == 0x0000A4, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_BreakVector2D_Y2) == 0x0000A8, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetJackPlayerCameraManager_ReturnValue) == 0x0000B0, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetJackPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetCameraRotation_ReturnValue) == 0x0000BC, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x0000C8, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetInverseRotator_ReturnValue) == 0x0000CC, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetInverseRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000D8, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, Temp_byte_Variable2) == 0x000160, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, K2Node_Select_Default) == 0x000161, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Add_FloatFloat_ReturnValue) == 0x000164, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x000168, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x00016C, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Abs_ReturnValue) == 0x000170, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_Less_FloatFloat_ReturnValue) == 0x000174, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_SelectFloat_ReturnValue) == 0x000178, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetJackPlayerCameraManager_ReturnValue2) == 0x000180, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetJackPlayerCameraManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetCameraRotation_ReturnValue2) == 0x00018C, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetCameraRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_GetInverseRotator_ReturnValue2) == 0x000198, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_GetInverseRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate, CallFunc_K2_SetWorldRotation_SweepHitResult2) == 0x0001A8, "Member 'BP_UI3d_Icon_ActionCursor_Arrow_C_DrawUpdate::CallFunc_K2_SetWorldRotation_SweepHitResult2' has a wrong offset!");

}

