#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI3d_Icon_EmotionIcon

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UI3d_Icon_EmotionIcon.BP_UI3d_Icon_EmotionIcon_C.ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon
// 0x0030 (0x0030 - 0x0000)
struct BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackMonsterEmotionIcon                       K2Node_CustomEvent_EmotionType;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Emotion_000_C*                 K2Node_DynamicCast_AsWBP_Hud_Emotion_000;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon) == 0x000008, "Wrong alignment on BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon");
static_assert(sizeof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon) == 0x000030, "Wrong size on BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, EntryPoint) == 0x000000, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, K2Node_CustomEvent_EmotionType) == 0x000004, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::K2Node_CustomEvent_EmotionType' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, K2Node_DynamicCast_AsWBP_Hud_Emotion_000) == 0x000020, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::K2Node_DynamicCast_AsWBP_Hud_Emotion_000' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_UI3d_Icon_EmotionIcon_C_ExecuteUbergraph_BP_UI3d_Icon_EmotionIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UI3d_Icon_EmotionIcon.BP_UI3d_Icon_EmotionIcon_C.InitData
// 0x0001 (0x0001 - 0x0000)
struct BP_UI3d_Icon_EmotionIcon_C_InitData final
{
public:
	EJackMonsterEmotionIcon                       EmotionType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI3d_Icon_EmotionIcon_C_InitData) == 0x000001, "Wrong alignment on BP_UI3d_Icon_EmotionIcon_C_InitData");
static_assert(sizeof(BP_UI3d_Icon_EmotionIcon_C_InitData) == 0x000001, "Wrong size on BP_UI3d_Icon_EmotionIcon_C_InitData");
static_assert(offsetof(BP_UI3d_Icon_EmotionIcon_C_InitData, EmotionType) == 0x000000, "Member 'BP_UI3d_Icon_EmotionIcon_C_InitData::EmotionType' has a wrong offset!");

}

