#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI3d_Icon_BattleCursor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UI3d_Icon_BattleCursor.BP_UI3d_Icon_BattleCursor_C.ExecuteUbergraph_BP_UI3d_Icon_BattleCursor
// 0x0020 (0x0020 - 0x0000)
struct BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_ActionCursor_All_000_C*        K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_000; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor) == 0x000008, "Wrong alignment on BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor");
static_assert(sizeof(BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor) == 0x000020, "Wrong size on BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor");
static_assert(offsetof(BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor, EntryPoint) == 0x000000, "Member 'BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor, K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_000) == 0x000010, "Member 'BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor::K2Node_DynamicCast_AsWBP_Hud_Action_Cursor_All_000' has a wrong offset!");
static_assert(offsetof(BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_UI3d_Icon_BattleCursor_C_ExecuteUbergraph_BP_UI3d_Icon_BattleCursor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

