#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMGManagerCommon

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.ExecuteUbergraph_BP_UMGManagerCommon
// 0x0390 (0x0390 - 0x0000)
struct BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoadDataTrial_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    Temp_byte_Variable2;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackSaveLoadResult SaveLoadResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EJackSaveLoadResult SaveLoadResult)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EJackSaveLoadResult SaveLoadResult)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_CustomEvent_SaveLoadResult3;                // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_CustomEvent_SaveLoadResult2;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2; // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_CustomEvent_SaveLoadResult;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue3; // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue3;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue4;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result4;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable4;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable6;                               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0208(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result5;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x0248(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable7;                             // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable8;                             // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result6;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue7; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result7;             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable9;                             // 0x0298(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue8; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result8;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable10;                            // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue9; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result9;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable7;                               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable8;                               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable9;                               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable10;                              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable11;                              // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoadDataTrial_ReturnValue2;             // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue10; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable11;                            // 0x0360(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result10;            // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue11; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result11;            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon) == 0x000008, "Wrong alignment on BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon");
static_assert(sizeof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon) == 0x000390, "Wrong size on BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, EntryPoint) == 0x000000, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_IsLoadDataTrial_ReturnValue) == 0x000010, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_IsLoadDataTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable) == 0x000018, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable2) == 0x000020, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_byte_Variable) == 0x000028, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_byte_Variable2) == 0x000029, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_CreateDelegate_OutputDelegate3) == 0x000050, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable) == 0x000060, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000070, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable2) == 0x000078, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result) == 0x000088, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000090, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result2) == 0x000098, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable3) == 0x0000A0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x0000B0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result3) == 0x0000B8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_CheckPoint4) == 0x0000C0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_Result) == 0x0000C1, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_CheckPoint3) == 0x0000C2, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_CustomEvent_SaveLoadResult3) == 0x0000C3, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_CustomEvent_SaveLoadResult3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000C8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_CustomEvent_SaveLoadResult2) == 0x0000F0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_CustomEvent_SaveLoadResult2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2) == 0x0000F8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchEnum2_CmpSuccess) == 0x000108, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_Concat_StrStr_ReturnValue2) == 0x000110, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_CustomEvent_SaveLoadResult) == 0x000120, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_CustomEvent_SaveLoadResult' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue3) == 0x000128, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchEnum3_CmpSuccess) == 0x000138, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_Concat_StrStr_ReturnValue3) == 0x000140, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_MakeLiteralName_ReturnValue) == 0x000150, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_MakeLiteralName_ReturnValue2) == 0x000158, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_MakeLiteralName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_MakeLiteralName_ReturnValue3) == 0x000160, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_MakeLiteralName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_MakeLiteralName_ReturnValue4) == 0x000168, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_MakeLiteralName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable4) == 0x000170, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x000180, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result4) == 0x000188, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_Sender2) == 0x000190, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_CheckPoint2) == 0x0001A0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchInteger_CmpSuccess) == 0x0001A1, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable3) == 0x0001A8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable4) == 0x0001B8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchEnum4_CmpSuccess) == 0x0001C0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Select_Default) == 0x0001C8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchEnum5_CmpSuccess) == 0x0001D0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchEnum6_CmpSuccess) == 0x0001D1, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_Sender) == 0x0001D8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_CheckPoint) == 0x0001E8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_CheckPoint' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Event_CheckRusult) == 0x0001E9, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_bool_Variable) == 0x0001EA, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Select2_Default) == 0x0001F0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable5) == 0x0001F8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable6) == 0x000200, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable5) == 0x000208, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetUMGManager_ReturnValue2) == 0x000218, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5) == 0x000220, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000228, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result5) == 0x000230, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result5' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetUMGManager_ReturnValue3) == 0x000238, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000240, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable6) == 0x000248, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable7) == 0x000258, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6) == 0x000268, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable8) == 0x000270, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result6) == 0x000280, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result6' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue7) == 0x000288, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result7) == 0x000290, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result7' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable9) == 0x000298, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue8) == 0x0002A8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchInteger2_CmpSuccess) == 0x0002B0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result8) == 0x0002B8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result8' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable10) == 0x0002C0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchInteger3_CmpSuccess) == 0x0002D0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue9) == 0x0002D8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result9) == 0x0002E0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result9' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetUMGManager_ReturnValue4) == 0x0002E8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable7) == 0x0002F0, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable7' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x0002F8, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetUMGManager_ReturnValue5) == 0x000300, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000308, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable8) == 0x000310, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable8' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable9) == 0x000318, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable9' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000320, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable10) == 0x000328, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable10' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000330, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_name_Variable11) == 0x000338, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_name_Variable11' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_GetUMGManager_ReturnValue6) == 0x000340, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_IsLoadDataTrial_ReturnValue2) == 0x000348, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_IsLoadDataTrial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_Select3_Default) == 0x000350, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue10) == 0x000358, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, Temp_struct_Variable11) == 0x000360, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result10) == 0x000370, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result10' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue11) == 0x000378, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, CallFunc_WaitMessageEndFromBP_Result11) == 0x000380, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::CallFunc_WaitMessageEndFromBP_Result11' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon, K2Node_SwitchInteger4_CmpSuccess) == 0x000388, "Member 'BP_UMGManagerCommon_C_ExecuteUbergraph_BP_UMGManagerCommon::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'BP_UMGManagerCommon_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct BP_UMGManagerCommon_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on BP_UMGManagerCommon_C_ExecuteSaveDataCheck");
static_assert(sizeof(BP_UMGManagerCommon_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on BP_UMGManagerCommon_C_ExecuteSaveDataCheck");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'BP_UMGManagerCommon_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'BP_UMGManagerCommon_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.SaveDataCheckResultMain
// 0x0001 (0x0001 - 0x0000)
struct BP_UMGManagerCommon_C_SaveDataCheckResultMain final
{
public:
	EJackSaveLoadResult                           SaveLoadResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_SaveDataCheckResultMain) == 0x000001, "Wrong alignment on BP_UMGManagerCommon_C_SaveDataCheckResultMain");
static_assert(sizeof(BP_UMGManagerCommon_C_SaveDataCheckResultMain) == 0x000001, "Wrong size on BP_UMGManagerCommon_C_SaveDataCheckResultMain");
static_assert(offsetof(BP_UMGManagerCommon_C_SaveDataCheckResultMain, SaveLoadResult) == 0x000000, "Member 'BP_UMGManagerCommon_C_SaveDataCheckResultMain::SaveLoadResult' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.OnFinishRestoreAsync_Event_0
// 0x0001 (0x0001 - 0x0000)
struct BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0 final
{
public:
	EJackSaveLoadResult                           SaveLoadResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0) == 0x000001, "Wrong alignment on BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0");
static_assert(sizeof(BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0) == 0x000001, "Wrong size on BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0");
static_assert(offsetof(BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0, SaveLoadResult) == 0x000000, "Member 'BP_UMGManagerCommon_C_OnFinishRestoreAsync_Event_0::SaveLoadResult' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.OnFinishCreateAsync_Event_0
// 0x0001 (0x0001 - 0x0000)
struct BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0 final
{
public:
	EJackSaveLoadResult                           SaveLoadResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0) == 0x000001, "Wrong alignment on BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0");
static_assert(sizeof(BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0) == 0x000001, "Wrong size on BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0");
static_assert(offsetof(BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0, SaveLoadResult) == 0x000000, "Member 'BP_UMGManagerCommon_C_OnFinishCreateAsync_Event_0::SaveLoadResult' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'BP_UMGManagerCommon_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

// Function BP_UMGManagerCommon.BP_UMGManagerCommon_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct BP_UMGManagerCommon_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMGManagerCommon_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on BP_UMGManagerCommon_C_OnFinishSaveDataCheck");
static_assert(sizeof(BP_UMGManagerCommon_C_OnFinishSaveDataCheck) == 0x000002, "Wrong size on BP_UMGManagerCommon_C_OnFinishSaveDataCheck");
static_assert(offsetof(BP_UMGManagerCommon_C_OnFinishSaveDataCheck, CheckPoint) == 0x000000, "Member 'BP_UMGManagerCommon_C_OnFinishSaveDataCheck::CheckPoint' has a wrong offset!");
static_assert(offsetof(BP_UMGManagerCommon_C_OnFinishSaveDataCheck, Result) == 0x000001, "Member 'BP_UMGManagerCommon_C_OnFinishSaveDataCheck::Result' has a wrong offset!");

}

