#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMGManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UMGManager.BP_UMGManager_C
// 0x0038 (0x0648 - 0x0610)
class UBP_UMGManager_C final : public UJackUMGManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(Transient, DuplicateTransient)
	bool                                          bShowLoadingWidget;                                // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCreatedLoadingWidget;                             // 0x0619(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61A[0x6];                                      // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                HudLoading002Ref;                                  // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ToBeContinuedAsset;                                // 0x0628(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_Hud_Loading_002_modern_C*          HudLoading002ModernRef;                            // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UMGManager(int32 EntryPoint);
	void OpenToBeContinuedWidget();
	void HideForceWalkingLoadingWidget();
	void ShowForceWalkingLoadingWidget();
	void HideMenu();
	void ShowMenu();
	void OnFinishSaveDataCheck(EJackUMGSaveDataCheckPoint CheckPoint, EJackUMGSaveDataCheckResult Result);
	void OpenWorldMapFromMenu();
	void SetFadeWidget(class UJackUMGWidgetBase* Widget, class FName WidgetName, int32 ZOrder, float FadeAlpha, const struct FLinearColor& FadeColor);
	void ExecuteSaveDataCheckResult(TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender, EJackUMGSaveDataCheckPoint CheckPoint, EJackSaveLoadResult CheckRusult);
	void ExecuteSaveDataCheck(TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender, EJackUMGSaveDataCheckPoint CheckPoint);
	void OnDisplayMessageFromSaveDataCheck(EJackUMGSaveDataCheckPoint CheckPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UMGManager_C">();
	}
	static class UBP_UMGManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UMGManager_C>();
	}
};
static_assert(alignof(UBP_UMGManager_C) == 0x000008, "Wrong alignment on UBP_UMGManager_C");
static_assert(sizeof(UBP_UMGManager_C) == 0x000648, "Wrong size on UBP_UMGManager_C");
static_assert(offsetof(UBP_UMGManager_C, UberGraphFrame) == 0x000610, "Member 'UBP_UMGManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UMGManager_C, bShowLoadingWidget) == 0x000618, "Member 'UBP_UMGManager_C::bShowLoadingWidget' has a wrong offset!");
static_assert(offsetof(UBP_UMGManager_C, bCreatedLoadingWidget) == 0x000619, "Member 'UBP_UMGManager_C::bCreatedLoadingWidget' has a wrong offset!");
static_assert(offsetof(UBP_UMGManager_C, HudLoading002Ref) == 0x000620, "Member 'UBP_UMGManager_C::HudLoading002Ref' has a wrong offset!");
static_assert(offsetof(UBP_UMGManager_C, ToBeContinuedAsset) == 0x000628, "Member 'UBP_UMGManager_C::ToBeContinuedAsset' has a wrong offset!");
static_assert(offsetof(UBP_UMGManager_C, HudLoading002ModernRef) == 0x000640, "Member 'UBP_UMGManager_C::HudLoading002ModernRef' has a wrong offset!");

}

