#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorldWeather

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function BP_WorldWeather.BP_WorldWeather_C.ExecuteUbergraph_BP_WorldWeather
// 0x0050 (0x0050 - 0x0000)
struct BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackWeatherAffectComponent*            CallFunc_GetPlayerWeatherAffectComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_COMP_WeatherAffect_C*               K2Node_DynamicCast_AsBP_COMP_Weather_Affect;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeWeatherReportMessage_OutTextID;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       CallFunc_MakeWeatherReportMessage_OutTagValueList; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather) == 0x000008, "Wrong alignment on BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather");
static_assert(sizeof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather) == 0x000050, "Wrong size on BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, EntryPoint) == 0x000000, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, CallFunc_GetPlayerWeatherAffectComponent_ReturnValue) == 0x000010, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::CallFunc_GetPlayerWeatherAffectComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, CallFunc_GetGameFlagBool_ReturnValue) == 0x000018, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, K2Node_DynamicCast_AsBP_COMP_Weather_Affect) == 0x000020, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::K2Node_DynamicCast_AsBP_COMP_Weather_Affect' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, CallFunc_MakeWeatherReportMessage_OutTextID) == 0x000030, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::CallFunc_MakeWeatherReportMessage_OutTextID' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, CallFunc_MakeWeatherReportMessage_OutTagValueList) == 0x000038, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::CallFunc_MakeWeatherReportMessage_OutTagValueList' has a wrong offset!");
static_assert(offsetof(BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'BP_WorldWeather_C_ExecuteUbergraph_BP_WorldWeather::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");

}

