#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZenkeiCSInitializeWaitVolume

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ZenkeiCSInitializeWaitVolume.BP_ZenkeiCSInitializeWaitVolume_C.ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume
// 0x0040 (0x0040 - 0x0000)
struct BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackScheduledNPC*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class AJackScheduledNPC*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledSphereRadius_ReturnValue;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume) == 0x000008, "Wrong alignment on BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume");
static_assert(sizeof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume) == 0x000040, "Wrong size on BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, EntryPoint) == 0x000000, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_GetScaledSphereRadius_ReturnValue) == 0x000034, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_GetScaledSphereRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_GetDistanceTo_ReturnValue) == 0x000038, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ExecuteUbergraph_BP_ZenkeiCSInitializeWaitVolume::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_ZenkeiCSInitializeWaitVolume.BP_ZenkeiCSInitializeWaitVolume_C.ConvZenkeiTag
// 0x0038 (0x0038 - 0x0000)
struct BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag final
{
public:
	class FName                                   CSID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ConvTag;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag) == 0x000008, "Wrong alignment on BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag");
static_assert(sizeof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag) == 0x000038, "Wrong size on BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag, CSID) == 0x000000, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag::CSID' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag, ConvTag) == 0x000008, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag::ConvTag' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_ConvZenkeiTag::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function BP_ZenkeiCSInitializeWaitVolume.BP_ZenkeiCSInitializeWaitVolume_C.IsInCameraZenkei
// 0x0010 (0x0010 - 0x0000)
struct BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleDegree;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei) == 0x000008, "Wrong alignment on BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei");
static_assert(sizeof(BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei) == 0x000010, "Wrong size on BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei, Actor) == 0x000000, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei::Actor' has a wrong offset!");
static_assert(offsetof(BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei, AngleDegree) == 0x000008, "Member 'BP_ZenkeiCSInitializeWaitVolume_C_IsInCameraZenkei::AngleDegree' has a wrong offset!");

}

