#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothingSystemRuntime

#include "Basic.hpp"

#include "ClothingSystemRuntimeInterface_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ClothingSystemRuntime_structs.hpp"


namespace SDK
{

// Class ClothingSystemRuntime.ClothingAssetCustomData
// 0x0000 (0x0038 - 0x0038)
class UClothingAssetCustomData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAssetCustomData">();
	}
	static class UClothingAssetCustomData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAssetCustomData>();
	}
};
static_assert(alignof(UClothingAssetCustomData) == 0x000008, "Wrong alignment on UClothingAssetCustomData");
static_assert(sizeof(UClothingAssetCustomData) == 0x000038, "Wrong size on UClothingAssetCustomData");

// Class ClothingSystemRuntime.ClothingAsset
// 0x0118 (0x0170 - 0x0058)
class UClothingAsset final : public UClothingAssetBase
{
public:
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClothConfig                           ClothConfig;                                       // 0x0060(0x00BC)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FClothLODData>                  LODData;                                           // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 LodMap;                                            // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           UsedBoneNames;                                     // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 UsedBoneIndices;                                   // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReferenceBoneIndex;                                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothingAssetCustomData*               CustomData;                                        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAsset">();
	}
	static class UClothingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAsset>();
	}
};
static_assert(alignof(UClothingAsset) == 0x000008, "Wrong alignment on UClothingAsset");
static_assert(sizeof(UClothingAsset) == 0x000170, "Wrong size on UClothingAsset");
static_assert(offsetof(UClothingAsset, PhysicsAsset) == 0x000058, "Member 'UClothingAsset::PhysicsAsset' has a wrong offset!");
static_assert(offsetof(UClothingAsset, ClothConfig) == 0x000060, "Member 'UClothingAsset::ClothConfig' has a wrong offset!");
static_assert(offsetof(UClothingAsset, LODData) == 0x000120, "Member 'UClothingAsset::LODData' has a wrong offset!");
static_assert(offsetof(UClothingAsset, LodMap) == 0x000130, "Member 'UClothingAsset::LodMap' has a wrong offset!");
static_assert(offsetof(UClothingAsset, UsedBoneNames) == 0x000140, "Member 'UClothingAsset::UsedBoneNames' has a wrong offset!");
static_assert(offsetof(UClothingAsset, UsedBoneIndices) == 0x000150, "Member 'UClothingAsset::UsedBoneIndices' has a wrong offset!");
static_assert(offsetof(UClothingAsset, ReferenceBoneIndex) == 0x000160, "Member 'UClothingAsset::ReferenceBoneIndex' has a wrong offset!");
static_assert(offsetof(UClothingAsset, CustomData) == 0x000168, "Member 'UClothingAsset::CustomData' has a wrong offset!");

// Class ClothingSystemRuntime.ClothingSimulationFactoryNv
// 0x0000 (0x0038 - 0x0038)
class UClothingSimulationFactoryNv final : public UClothingSimulationFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingSimulationFactoryNv">();
	}
	static class UClothingSimulationFactoryNv* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingSimulationFactoryNv>();
	}
};
static_assert(alignof(UClothingSimulationFactoryNv) == 0x000008, "Wrong alignment on UClothingSimulationFactoryNv");
static_assert(sizeof(UClothingSimulationFactoryNv) == 0x000038, "Wrong size on UClothingSimulationFactoryNv");

}

