#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothingSystemRuntimeInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ClothingSystemRuntimeInterface.ClothingAssetBase
// 0x0020 (0x0058 - 0x0038)
class UClothingAssetBase : public UObject
{
public:
	class FString                                 ImportedFilePath;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  AssetGuid;                                         // 0x0048(0x0010)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAssetBase">();
	}
	static class UClothingAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAssetBase>();
	}
};
static_assert(alignof(UClothingAssetBase) == 0x000008, "Wrong alignment on UClothingAssetBase");
static_assert(sizeof(UClothingAssetBase) == 0x000058, "Wrong size on UClothingAssetBase");
static_assert(offsetof(UClothingAssetBase, ImportedFilePath) == 0x000038, "Member 'UClothingAssetBase::ImportedFilePath' has a wrong offset!");
static_assert(offsetof(UClothingAssetBase, AssetGuid) == 0x000048, "Member 'UClothingAssetBase::AssetGuid' has a wrong offset!");

// Class ClothingSystemRuntimeInterface.ClothingSimulationFactory
// 0x0000 (0x0038 - 0x0038)
class UClothingSimulationFactory : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingSimulationFactory">();
	}
	static class UClothingSimulationFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingSimulationFactory>();
	}
};
static_assert(alignof(UClothingSimulationFactory) == 0x000008, "Wrong alignment on UClothingSimulationFactory");
static_assert(sizeof(UClothingSimulationFactory) == 0x000038, "Wrong size on UClothingSimulationFactory");

}

