#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Debug

#include "Basic.hpp"

#include "STRUCT_DebugArrow_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Common_Debug.Common_Debug_C
// 0x0278 (0x0618 - 0x03A0)
class ACommon_Debug_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(Transient, DuplicateTransient)
	bool                                          DebugDispTime;                                     // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugDispHelp;                                     // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LongPushFlag;                                      // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB[0x1];                                      // 0x03AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StatesDispCounter;                                 // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_in_ViewPort_SecurityCamera;                     // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputEvent                            Input;                                             // 0x03B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Message_Color;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackScheduledNPC*>              ScheduleNPC;                                       // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FSTRUCT_DebugArrow>             DebugArrow;                                        // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 DisplayID;                                         // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FName>                           DebugLoadLevels;                                   // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FTransform>                     AllNpcTransform;                                   // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          MapJumpEnable;                                     // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DisableDebugMapjumpForPerformanceTest;             // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MapStartDistance;                                  // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackMapStart*                          NearMapStart;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         MacroCommandArray;                                 // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           DbgLevelArray;                                     // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   LightingCheck;                                     // 0x0468(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   CSLevelname;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugTimeSkipSuperMode;                            // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FindStaticMesh;                                    // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x2];                                      // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_Index;                                           // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         L_Array;                                           // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         TempArray;                                         // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FString>                         ErrorStaticMeshCollision;                          // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           IgnoreCollisionPreset;                             // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         AllStaticMeshCollision;                            // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         PerformanceMapJump;                                // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 TempScenarioNum;                                   // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FindCsLevelName;                                   // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TempCSID;                                          // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_DebugActorClassList_C*              DebugActorClassListInst;                           // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CSEndFlag;                                         // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PafuPafuRandom;                                    // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          DebugDispAdvance;                                  // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CancelDispAdvance;                                 // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TempPafuPafu;                                      // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FSTRUCT_DebugArrow>             KesinDebugArrow;                                   // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FSTRUCT_DebugArrow>             AllDebugArrow;                                     // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         DebugLvdLogLine;                                   // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatineeActor*                          TitleCutscene;                                     // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugCutsceneControl_C*             BP_DebugCutsceneControl_C_1_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StreamingEdit_C*                    BP_StreamingEdit_132_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CutSceneMenu_Debug_C*               BP_CutSceneMenu_Debug_C_0_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugMapSelect_C*                   BP_DebugMapSelect_C_1_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Flag_Debug_C*                       BP_Flag_Debug_C_0_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugPlayerCoord_C*                 BP_DebugPlayerCoord_C_0_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugPlayerCoord_C*                 BP_DebugPlayerCoord_C_2_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugNpcSpawnAtPlayerPos_C*         BP_DebugNpcSpawnAtPlayerPos_C_2_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugScale_C*                       BP_DebugScale_C_1_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NpcChecker_C*                       BP_NpcChecker_36_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugNpcMenu_C*                     BP_DebugNpcMenu_70_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugMenuWeather_C*                 BP_DebugMenuWeather_C_2_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugMenuLoadingPerformance_C*      BP_DebugMenuLoadingPerformance_76_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugMenuEventBattle_C*             BP_DebugMenuEventBattle_82_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugMenuCoordinate_C*              BP_DebugMenuCoordinate_32_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugLightingCheckAssets_C*         BP_DebugLightingCheckAssets_54_ExecuteUbergraph_Common_Debug_RefProperty; // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugCutsceneSkipCut_C*             BP_DebugCutsceneSkipCut_C_1_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DebugAutoPlayer_C*                  BP_DebugAutoPlayer_14_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CutsceneChecker_C*                  BP_CutsceneChecker_76_ExecuteUbergraph_Common_Debug_RefProperty; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Common_Debug(int32 EntryPoint);
	void CustomEvent_0();
	void CustomEvent_1();
	void CustomEvent_2();
	void CustomEvent_3();
	void DisplayStates(const class FString& String, const struct FLinearColor& Color);
	void PlayMe();
	void HiddenMapStartIcon();
	void KesinArrow(bool Visible);
	void AddDebugMenuDeployChange();
	void MapJumpBeginPlay();
	void TextRenderVisible(bool Visible);
	void SetDebugWeather(EJackWorldWeather SetWeather);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetForcePLJump();
	void Skip2ndSetTimeProc();
	void SetMurabitoCoordinate();
	void DebugStabilizePose();
	void DebugMapJumpMenuFromPL_DebugStart();
	void DebugUso();
	void DebugSetControlledPlayer(EJackCharacter InType, const class FString& NoMapJump);
	void SetPafuPafuRandom(const class FString& Random);
	void S020AllMissionClear(const class FString& Flag);
