#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: D02_CS_A020_TitleMovie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JackGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass D02_CS_A020_TitleMovie.D02_CS_A020_TitleMovie_C
// 0x0020 (0x03C0 - 0x03A0)
class AD02_CS_A020_TitleMovie_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(Transient, DuplicateTransient)
	bool                                          PlayFromTitle;                                     // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OldPosition;                                       // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_OpeningMovieSubTitle_C*            Widget;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMatineeActor*                          A020TitleMovie_MatineeActor_ExecuteUbergraph_D02_CS_A020_TitleMovie_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_D02_CS_A020_TitleMovie(int32 EntryPoint);
	void CallCS_A_020_CS_TitleMovieFromTitle();
	void CallCS_A_020_CS_TitleMovie();
	void RemoveSubTitle();
	void CreateSubTitle();
	void ReceiveTick(float DeltaSeconds);
	void K2Node_MatineeController_127_Finished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"D02_CS_A020_TitleMovie_C">();
	}
	static class AD02_CS_A020_TitleMovie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AD02_CS_A020_TitleMovie_C>();
	}
};
static_assert(alignof(AD02_CS_A020_TitleMovie_C) == 0x000008, "Wrong alignment on AD02_CS_A020_TitleMovie_C");
static_assert(sizeof(AD02_CS_A020_TitleMovie_C) == 0x0003C0, "Wrong size on AD02_CS_A020_TitleMovie_C");
static_assert(offsetof(AD02_CS_A020_TitleMovie_C, UberGraphFrame) == 0x0003A0, "Member 'AD02_CS_A020_TitleMovie_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AD02_CS_A020_TitleMovie_C, PlayFromTitle) == 0x0003A8, "Member 'AD02_CS_A020_TitleMovie_C::PlayFromTitle' has a wrong offset!");
static_assert(offsetof(AD02_CS_A020_TitleMovie_C, OldPosition) == 0x0003AC, "Member 'AD02_CS_A020_TitleMovie_C::OldPosition' has a wrong offset!");
static_assert(offsetof(AD02_CS_A020_TitleMovie_C, Widget) == 0x0003B0, "Member 'AD02_CS_A020_TitleMovie_C::Widget' has a wrong offset!");
static_assert(offsetof(AD02_CS_A020_TitleMovie_C, A020TitleMovie_MatineeActor_ExecuteUbergraph_D02_CS_A020_TitleMovie_RefProperty) == 0x0003B8, "Member 'AD02_CS_A020_TitleMovie_C::A020TitleMovie_MatineeActor_ExecuteUbergraph_D02_CS_A020_TitleMovie_RefProperty' has a wrong offset!");

}

