#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Engine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Engine.Actor.AddComponent
// 0x0050 (0x0050 - 0x0000)
struct Actor_AddComponent final
{
public:
	class FName                                   TemplateName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualAttachment;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	const class UObject*                          ComponentTemplateContext;                          // 0x0040(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0048(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_AddComponent) == 0x000010, "Wrong alignment on Actor_AddComponent");
static_assert(sizeof(Actor_AddComponent) == 0x000050, "Wrong size on Actor_AddComponent");
static_assert(offsetof(Actor_AddComponent, TemplateName) == 0x000000, "Member 'Actor_AddComponent::TemplateName' has a wrong offset!");
static_assert(offsetof(Actor_AddComponent, bManualAttachment) == 0x000008, "Member 'Actor_AddComponent::bManualAttachment' has a wrong offset!");
static_assert(offsetof(Actor_AddComponent, RelativeTransform) == 0x000010, "Member 'Actor_AddComponent::RelativeTransform' has a wrong offset!");
static_assert(offsetof(Actor_AddComponent, ComponentTemplateContext) == 0x000040, "Member 'Actor_AddComponent::ComponentTemplateContext' has a wrong offset!");
static_assert(offsetof(Actor_AddComponent, ReturnValue) == 0x000048, "Member 'Actor_AddComponent::ReturnValue' has a wrong offset!");

// Function Engine.Actor.AddTickPrerequisiteActor
// 0x0008 (0x0008 - 0x0000)
struct Actor_AddTickPrerequisiteActor final
{
public:
	class AActor*                                 PrerequisiteActor;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_AddTickPrerequisiteActor) == 0x000008, "Wrong alignment on Actor_AddTickPrerequisiteActor");
static_assert(sizeof(Actor_AddTickPrerequisiteActor) == 0x000008, "Wrong size on Actor_AddTickPrerequisiteActor");
static_assert(offsetof(Actor_AddTickPrerequisiteActor, PrerequisiteActor) == 0x000000, "Member 'Actor_AddTickPrerequisiteActor::PrerequisiteActor' has a wrong offset!");

// Function Engine.Actor.AddTickPrerequisiteComponent
// 0x0008 (0x0008 - 0x0000)
struct Actor_AddTickPrerequisiteComponent final
{
public:
	class UActorComponent*                        PrerequisiteComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_AddTickPrerequisiteComponent) == 0x000008, "Wrong alignment on Actor_AddTickPrerequisiteComponent");
static_assert(sizeof(Actor_AddTickPrerequisiteComponent) == 0x000008, "Wrong size on Actor_AddTickPrerequisiteComponent");
static_assert(offsetof(Actor_AddTickPrerequisiteComponent, PrerequisiteComponent) == 0x000000, "Member 'Actor_AddTickPrerequisiteComponent::PrerequisiteComponent' has a wrong offset!");

// Function Engine.Actor.DetachRootComponentFromParent
// 0x0001 (0x0001 - 0x0000)
struct Actor_DetachRootComponentFromParent final
{
public:
	bool                                          bMaintainWorldPosition;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_DetachRootComponentFromParent) == 0x000001, "Wrong alignment on Actor_DetachRootComponentFromParent");
static_assert(sizeof(Actor_DetachRootComponentFromParent) == 0x000001, "Wrong size on Actor_DetachRootComponentFromParent");
static_assert(offsetof(Actor_DetachRootComponentFromParent, bMaintainWorldPosition) == 0x000000, "Member 'Actor_DetachRootComponentFromParent::bMaintainWorldPosition' has a wrong offset!");

// Function Engine.Actor.DisableInput
// 0x0008 (0x0008 - 0x0000)
struct Actor_DisableInput final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_DisableInput) == 0x000008, "Wrong alignment on Actor_DisableInput");
static_assert(sizeof(Actor_DisableInput) == 0x000008, "Wrong size on Actor_DisableInput");
static_assert(offsetof(Actor_DisableInput, PlayerController) == 0x000000, "Member 'Actor_DisableInput::PlayerController' has a wrong offset!");

// Function Engine.Actor.EnableInput
// 0x0008 (0x0008 - 0x0000)
struct Actor_EnableInput final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_EnableInput) == 0x000008, "Wrong alignment on Actor_EnableInput");
static_assert(sizeof(Actor_EnableInput) == 0x000008, "Wrong size on Actor_EnableInput");
static_assert(offsetof(Actor_EnableInput, PlayerController) == 0x000000, "Member 'Actor_EnableInput::PlayerController' has a wrong offset!");

// Function Engine.Actor.GetGameTimeSinceCreation
// 0x0004 (0x0004 - 0x0000)
struct Actor_GetGameTimeSinceCreation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_GetGameTimeSinceCreation) == 0x000004, "Wrong alignment on Actor_GetGameTimeSinceCreation");
static_assert(sizeof(Actor_GetGameTimeSinceCreation) == 0x000004, "Wrong size on Actor_GetGameTimeSinceCreation");
static_assert(offsetof(Actor_GetGameTimeSinceCreation, ReturnValue) == 0x000000, "Member 'Actor_GetGameTimeSinceCreation::ReturnValue' has a wrong offset!");

// Function Engine.Actor.GetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct Actor_GetTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_GetTickableWhenPaused) == 0x000001, "Wrong alignment on Actor_GetTickableWhenPaused");
static_assert(sizeof(Actor_GetTickableWhenPaused) == 0x000001, "Wrong size on Actor_GetTickableWhenPaused");
static_assert(offsetof(Actor_GetTickableWhenPaused, ReturnValue) == 0x000000, "Member 'Actor_GetTickableWhenPaused::ReturnValue' has a wrong offset!");

// Function Engine.Actor.K2_AddActorLocalOffset
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_AddActorLocalOffset final
{
public:
	struct FVector                                DeltaLocation;                                     // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AddActorLocalOffset) == 0x000008, "Wrong alignment on Actor_K2_AddActorLocalOffset");
static_assert(sizeof(Actor_K2_AddActorLocalOffset) == 0x0000A0, "Wrong size on Actor_K2_AddActorLocalOffset");
static_assert(offsetof(Actor_K2_AddActorLocalOffset, DeltaLocation) == 0x000000, "Member 'Actor_K2_AddActorLocalOffset::DeltaLocation' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalOffset, bSweep) == 0x00000C, "Member 'Actor_K2_AddActorLocalOffset::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalOffset, SweepHitResult) == 0x000010, "Member 'Actor_K2_AddActorLocalOffset::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalOffset, bTeleport) == 0x000098, "Member 'Actor_K2_AddActorLocalOffset::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_AddActorLocalRotation
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_AddActorLocalRotation final
{
public:
	struct FRotator                               DeltaRotation;                                     // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AddActorLocalRotation) == 0x000008, "Wrong alignment on Actor_K2_AddActorLocalRotation");
static_assert(sizeof(Actor_K2_AddActorLocalRotation) == 0x0000A0, "Wrong size on Actor_K2_AddActorLocalRotation");
static_assert(offsetof(Actor_K2_AddActorLocalRotation, DeltaRotation) == 0x000000, "Member 'Actor_K2_AddActorLocalRotation::DeltaRotation' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalRotation, bSweep) == 0x00000C, "Member 'Actor_K2_AddActorLocalRotation::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalRotation, SweepHitResult) == 0x000010, "Member 'Actor_K2_AddActorLocalRotation::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalRotation, bTeleport) == 0x000098, "Member 'Actor_K2_AddActorLocalRotation::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_AddActorLocalTransform
// 0x00D0 (0x00D0 - 0x0000)
struct Actor_K2_AddActorLocalTransform final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0038(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AddActorLocalTransform) == 0x000010, "Wrong alignment on Actor_K2_AddActorLocalTransform");
static_assert(sizeof(Actor_K2_AddActorLocalTransform) == 0x0000D0, "Wrong size on Actor_K2_AddActorLocalTransform");
static_assert(offsetof(Actor_K2_AddActorLocalTransform, NewTransform) == 0x000000, "Member 'Actor_K2_AddActorLocalTransform::NewTransform' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalTransform, bSweep) == 0x000030, "Member 'Actor_K2_AddActorLocalTransform::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalTransform, SweepHitResult) == 0x000038, "Member 'Actor_K2_AddActorLocalTransform::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorLocalTransform, bTeleport) == 0x0000C0, "Member 'Actor_K2_AddActorLocalTransform::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_AddActorWorldOffset
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_AddActorWorldOffset final
{
public:
	struct FVector                                DeltaLocation;                                     // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AddActorWorldOffset) == 0x000008, "Wrong alignment on Actor_K2_AddActorWorldOffset");
static_assert(sizeof(Actor_K2_AddActorWorldOffset) == 0x0000A0, "Wrong size on Actor_K2_AddActorWorldOffset");
static_assert(offsetof(Actor_K2_AddActorWorldOffset, DeltaLocation) == 0x000000, "Member 'Actor_K2_AddActorWorldOffset::DeltaLocation' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldOffset, bSweep) == 0x00000C, "Member 'Actor_K2_AddActorWorldOffset::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldOffset, SweepHitResult) == 0x000010, "Member 'Actor_K2_AddActorWorldOffset::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldOffset, bTeleport) == 0x000098, "Member 'Actor_K2_AddActorWorldOffset::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_AddActorWorldRotation
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_AddActorWorldRotation final
{
public:
	struct FRotator                               DeltaRotation;                                     // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AddActorWorldRotation) == 0x000008, "Wrong alignment on Actor_K2_AddActorWorldRotation");
static_assert(sizeof(Actor_K2_AddActorWorldRotation) == 0x0000A0, "Wrong size on Actor_K2_AddActorWorldRotation");
static_assert(offsetof(Actor_K2_AddActorWorldRotation, DeltaRotation) == 0x000000, "Member 'Actor_K2_AddActorWorldRotation::DeltaRotation' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldRotation, bSweep) == 0x00000C, "Member 'Actor_K2_AddActorWorldRotation::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldRotation, SweepHitResult) == 0x000010, "Member 'Actor_K2_AddActorWorldRotation::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldRotation, bTeleport) == 0x000098, "Member 'Actor_K2_AddActorWorldRotation::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_AddActorWorldTransform
// 0x00D0 (0x00D0 - 0x0000)
struct Actor_K2_AddActorWorldTransform final
{
public:
	struct FTransform                             DeltaTransform;                                    // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0038(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AddActorWorldTransform) == 0x000010, "Wrong alignment on Actor_K2_AddActorWorldTransform");
static_assert(sizeof(Actor_K2_AddActorWorldTransform) == 0x0000D0, "Wrong size on Actor_K2_AddActorWorldTransform");
static_assert(offsetof(Actor_K2_AddActorWorldTransform, DeltaTransform) == 0x000000, "Member 'Actor_K2_AddActorWorldTransform::DeltaTransform' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldTransform, bSweep) == 0x000030, "Member 'Actor_K2_AddActorWorldTransform::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldTransform, SweepHitResult) == 0x000038, "Member 'Actor_K2_AddActorWorldTransform::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_AddActorWorldTransform, bTeleport) == 0x0000C0, "Member 'Actor_K2_AddActorWorldTransform::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_AttachRootComponentTo
// 0x0018 (0x0018 - 0x0000)
struct Actor_K2_AttachRootComponentTo final
{
public:
	class USceneComponent*                        InParent;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InSocketName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachLocation                               AttachLocationType;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AttachRootComponentTo) == 0x000008, "Wrong alignment on Actor_K2_AttachRootComponentTo");
static_assert(sizeof(Actor_K2_AttachRootComponentTo) == 0x000018, "Wrong size on Actor_K2_AttachRootComponentTo");
static_assert(offsetof(Actor_K2_AttachRootComponentTo, InParent) == 0x000000, "Member 'Actor_K2_AttachRootComponentTo::InParent' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachRootComponentTo, InSocketName) == 0x000008, "Member 'Actor_K2_AttachRootComponentTo::InSocketName' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachRootComponentTo, AttachLocationType) == 0x000010, "Member 'Actor_K2_AttachRootComponentTo::AttachLocationType' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachRootComponentTo, bWeldSimulatedBodies) == 0x000011, "Member 'Actor_K2_AttachRootComponentTo::bWeldSimulatedBodies' has a wrong offset!");

// Function Engine.Actor.K2_AttachRootComponentToActor
// 0x0018 (0x0018 - 0x0000)
struct Actor_K2_AttachRootComponentToActor final
{
public:
	class AActor*                                 InParentActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InSocketName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachLocation                               AttachLocationType;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AttachRootComponentToActor) == 0x000008, "Wrong alignment on Actor_K2_AttachRootComponentToActor");
static_assert(sizeof(Actor_K2_AttachRootComponentToActor) == 0x000018, "Wrong size on Actor_K2_AttachRootComponentToActor");
static_assert(offsetof(Actor_K2_AttachRootComponentToActor, InParentActor) == 0x000000, "Member 'Actor_K2_AttachRootComponentToActor::InParentActor' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachRootComponentToActor, InSocketName) == 0x000008, "Member 'Actor_K2_AttachRootComponentToActor::InSocketName' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachRootComponentToActor, AttachLocationType) == 0x000010, "Member 'Actor_K2_AttachRootComponentToActor::AttachLocationType' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachRootComponentToActor, bWeldSimulatedBodies) == 0x000011, "Member 'Actor_K2_AttachRootComponentToActor::bWeldSimulatedBodies' has a wrong offset!");

// Function Engine.Actor.K2_AttachToActor
// 0x0018 (0x0018 - 0x0000)
struct Actor_K2_AttachToActor final
{
public:
	class AActor*                                 ParentActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x0013(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AttachToActor) == 0x000008, "Wrong alignment on Actor_K2_AttachToActor");
static_assert(sizeof(Actor_K2_AttachToActor) == 0x000018, "Wrong size on Actor_K2_AttachToActor");
static_assert(offsetof(Actor_K2_AttachToActor, ParentActor) == 0x000000, "Member 'Actor_K2_AttachToActor::ParentActor' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToActor, SocketName) == 0x000008, "Member 'Actor_K2_AttachToActor::SocketName' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToActor, LocationRule) == 0x000010, "Member 'Actor_K2_AttachToActor::LocationRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToActor, RotationRule) == 0x000011, "Member 'Actor_K2_AttachToActor::RotationRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToActor, ScaleRule) == 0x000012, "Member 'Actor_K2_AttachToActor::ScaleRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToActor, bWeldSimulatedBodies) == 0x000013, "Member 'Actor_K2_AttachToActor::bWeldSimulatedBodies' has a wrong offset!");

// Function Engine.Actor.K2_AttachToComponent
// 0x0018 (0x0018 - 0x0000)
struct Actor_K2_AttachToComponent final
{
public:
	class USceneComponent*                        Parent;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x0013(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_AttachToComponent) == 0x000008, "Wrong alignment on Actor_K2_AttachToComponent");
static_assert(sizeof(Actor_K2_AttachToComponent) == 0x000018, "Wrong size on Actor_K2_AttachToComponent");
static_assert(offsetof(Actor_K2_AttachToComponent, Parent) == 0x000000, "Member 'Actor_K2_AttachToComponent::Parent' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToComponent, SocketName) == 0x000008, "Member 'Actor_K2_AttachToComponent::SocketName' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToComponent, LocationRule) == 0x000010, "Member 'Actor_K2_AttachToComponent::LocationRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToComponent, RotationRule) == 0x000011, "Member 'Actor_K2_AttachToComponent::RotationRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToComponent, ScaleRule) == 0x000012, "Member 'Actor_K2_AttachToComponent::ScaleRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_AttachToComponent, bWeldSimulatedBodies) == 0x000013, "Member 'Actor_K2_AttachToComponent::bWeldSimulatedBodies' has a wrong offset!");

// Function Engine.Actor.K2_DestroyComponent
// 0x0008 (0x0008 - 0x0000)
struct Actor_K2_DestroyComponent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_K2_DestroyComponent) == 0x000008, "Wrong alignment on Actor_K2_DestroyComponent");
static_assert(sizeof(Actor_K2_DestroyComponent) == 0x000008, "Wrong size on Actor_K2_DestroyComponent");
static_assert(offsetof(Actor_K2_DestroyComponent, Component) == 0x000000, "Member 'Actor_K2_DestroyComponent::Component' has a wrong offset!");

// Function Engine.Actor.K2_DetachFromActor
// 0x0003 (0x0003 - 0x0000)
struct Actor_K2_DetachFromActor final
{
public:
	EDetachmentRule                               LocationRule;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               RotationRule;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               ScaleRule;                                         // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_K2_DetachFromActor) == 0x000001, "Wrong alignment on Actor_K2_DetachFromActor");
static_assert(sizeof(Actor_K2_DetachFromActor) == 0x000003, "Wrong size on Actor_K2_DetachFromActor");
static_assert(offsetof(Actor_K2_DetachFromActor, LocationRule) == 0x000000, "Member 'Actor_K2_DetachFromActor::LocationRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_DetachFromActor, RotationRule) == 0x000001, "Member 'Actor_K2_DetachFromActor::RotationRule' has a wrong offset!");
static_assert(offsetof(Actor_K2_DetachFromActor, ScaleRule) == 0x000002, "Member 'Actor_K2_DetachFromActor::ScaleRule' has a wrong offset!");

// Function Engine.Actor.K2_OnBecomeViewTarget
// 0x0008 (0x0008 - 0x0000)
struct Actor_K2_OnBecomeViewTarget final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_K2_OnBecomeViewTarget) == 0x000008, "Wrong alignment on Actor_K2_OnBecomeViewTarget");
static_assert(sizeof(Actor_K2_OnBecomeViewTarget) == 0x000008, "Wrong size on Actor_K2_OnBecomeViewTarget");
static_assert(offsetof(Actor_K2_OnBecomeViewTarget, PC) == 0x000000, "Member 'Actor_K2_OnBecomeViewTarget::PC' has a wrong offset!");

// Function Engine.Actor.K2_OnEndViewTarget
// 0x0008 (0x0008 - 0x0000)
struct Actor_K2_OnEndViewTarget final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_K2_OnEndViewTarget) == 0x000008, "Wrong alignment on Actor_K2_OnEndViewTarget");
static_assert(sizeof(Actor_K2_OnEndViewTarget) == 0x000008, "Wrong size on Actor_K2_OnEndViewTarget");
static_assert(offsetof(Actor_K2_OnEndViewTarget, PC) == 0x000000, "Member 'Actor_K2_OnEndViewTarget::PC' has a wrong offset!");

// Function Engine.Actor.K2_SetActorLocation
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_SetActorLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0099(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorLocation) == 0x000008, "Wrong alignment on Actor_K2_SetActorLocation");
static_assert(sizeof(Actor_K2_SetActorLocation) == 0x0000A0, "Wrong size on Actor_K2_SetActorLocation");
static_assert(offsetof(Actor_K2_SetActorLocation, NewLocation) == 0x000000, "Member 'Actor_K2_SetActorLocation::NewLocation' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocation, bSweep) == 0x00000C, "Member 'Actor_K2_SetActorLocation::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocation, SweepHitResult) == 0x000010, "Member 'Actor_K2_SetActorLocation::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocation, bTeleport) == 0x000098, "Member 'Actor_K2_SetActorLocation::bTeleport' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocation, ReturnValue) == 0x000099, "Member 'Actor_K2_SetActorLocation::ReturnValue' has a wrong offset!");

// Function Engine.Actor.K2_SetActorLocationAndRotation
// 0x00B0 (0x00B0 - 0x0000)
struct Actor_K2_SetActorLocationAndRotation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               NewRotation;                                       // 0x000C(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0020(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorLocationAndRotation) == 0x000008, "Wrong alignment on Actor_K2_SetActorLocationAndRotation");
static_assert(sizeof(Actor_K2_SetActorLocationAndRotation) == 0x0000B0, "Wrong size on Actor_K2_SetActorLocationAndRotation");
static_assert(offsetof(Actor_K2_SetActorLocationAndRotation, NewLocation) == 0x000000, "Member 'Actor_K2_SetActorLocationAndRotation::NewLocation' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocationAndRotation, NewRotation) == 0x00000C, "Member 'Actor_K2_SetActorLocationAndRotation::NewRotation' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocationAndRotation, bSweep) == 0x000018, "Member 'Actor_K2_SetActorLocationAndRotation::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocationAndRotation, SweepHitResult) == 0x000020, "Member 'Actor_K2_SetActorLocationAndRotation::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocationAndRotation, bTeleport) == 0x0000A8, "Member 'Actor_K2_SetActorLocationAndRotation::bTeleport' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorLocationAndRotation, ReturnValue) == 0x0000A9, "Member 'Actor_K2_SetActorLocationAndRotation::ReturnValue' has a wrong offset!");

// Function Engine.Actor.K2_SetActorRelativeLocation
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_SetActorRelativeLocation final
{
public:
	struct FVector                                NewRelativeLocation;                               // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorRelativeLocation) == 0x000008, "Wrong alignment on Actor_K2_SetActorRelativeLocation");
static_assert(sizeof(Actor_K2_SetActorRelativeLocation) == 0x0000A0, "Wrong size on Actor_K2_SetActorRelativeLocation");
static_assert(offsetof(Actor_K2_SetActorRelativeLocation, NewRelativeLocation) == 0x000000, "Member 'Actor_K2_SetActorRelativeLocation::NewRelativeLocation' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeLocation, bSweep) == 0x00000C, "Member 'Actor_K2_SetActorRelativeLocation::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeLocation, SweepHitResult) == 0x000010, "Member 'Actor_K2_SetActorRelativeLocation::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeLocation, bTeleport) == 0x000098, "Member 'Actor_K2_SetActorRelativeLocation::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_SetActorRelativeRotation
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_K2_SetActorRelativeRotation final
{
public:
	struct FRotator                               NewRelativeRotation;                               // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0010(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorRelativeRotation) == 0x000008, "Wrong alignment on Actor_K2_SetActorRelativeRotation");
static_assert(sizeof(Actor_K2_SetActorRelativeRotation) == 0x0000A0, "Wrong size on Actor_K2_SetActorRelativeRotation");
static_assert(offsetof(Actor_K2_SetActorRelativeRotation, NewRelativeRotation) == 0x000000, "Member 'Actor_K2_SetActorRelativeRotation::NewRelativeRotation' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeRotation, bSweep) == 0x00000C, "Member 'Actor_K2_SetActorRelativeRotation::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeRotation, SweepHitResult) == 0x000010, "Member 'Actor_K2_SetActorRelativeRotation::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeRotation, bTeleport) == 0x000098, "Member 'Actor_K2_SetActorRelativeRotation::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_SetActorRelativeTransform
// 0x00D0 (0x00D0 - 0x0000)
struct Actor_K2_SetActorRelativeTransform final
{
public:
	struct FTransform                             NewRelativeTransform;                              // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0038(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorRelativeTransform) == 0x000010, "Wrong alignment on Actor_K2_SetActorRelativeTransform");
static_assert(sizeof(Actor_K2_SetActorRelativeTransform) == 0x0000D0, "Wrong size on Actor_K2_SetActorRelativeTransform");
static_assert(offsetof(Actor_K2_SetActorRelativeTransform, NewRelativeTransform) == 0x000000, "Member 'Actor_K2_SetActorRelativeTransform::NewRelativeTransform' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeTransform, bSweep) == 0x000030, "Member 'Actor_K2_SetActorRelativeTransform::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeTransform, SweepHitResult) == 0x000038, "Member 'Actor_K2_SetActorRelativeTransform::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRelativeTransform, bTeleport) == 0x0000C0, "Member 'Actor_K2_SetActorRelativeTransform::bTeleport' has a wrong offset!");

// Function Engine.Actor.K2_SetActorRotation
// 0x0010 (0x0010 - 0x0000)
struct Actor_K2_SetActorRotation final
{
public:
	struct FRotator                               NewRotation;                                       // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bTeleportPhysics;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorRotation) == 0x000004, "Wrong alignment on Actor_K2_SetActorRotation");
static_assert(sizeof(Actor_K2_SetActorRotation) == 0x000010, "Wrong size on Actor_K2_SetActorRotation");
static_assert(offsetof(Actor_K2_SetActorRotation, NewRotation) == 0x000000, "Member 'Actor_K2_SetActorRotation::NewRotation' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRotation, bTeleportPhysics) == 0x00000C, "Member 'Actor_K2_SetActorRotation::bTeleportPhysics' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorRotation, ReturnValue) == 0x00000D, "Member 'Actor_K2_SetActorRotation::ReturnValue' has a wrong offset!");

// Function Engine.Actor.K2_SetActorTransform
// 0x00D0 (0x00D0 - 0x0000)
struct Actor_K2_SetActorTransform final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepHitResult;                                    // 0x0038(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00C1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0xE];                                       // 0x00C2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_SetActorTransform) == 0x000010, "Wrong alignment on Actor_K2_SetActorTransform");
static_assert(sizeof(Actor_K2_SetActorTransform) == 0x0000D0, "Wrong size on Actor_K2_SetActorTransform");
static_assert(offsetof(Actor_K2_SetActorTransform, NewTransform) == 0x000000, "Member 'Actor_K2_SetActorTransform::NewTransform' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorTransform, bSweep) == 0x000030, "Member 'Actor_K2_SetActorTransform::bSweep' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorTransform, SweepHitResult) == 0x000038, "Member 'Actor_K2_SetActorTransform::SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorTransform, bTeleport) == 0x0000C0, "Member 'Actor_K2_SetActorTransform::bTeleport' has a wrong offset!");
static_assert(offsetof(Actor_K2_SetActorTransform, ReturnValue) == 0x0000C1, "Member 'Actor_K2_SetActorTransform::ReturnValue' has a wrong offset!");

// Function Engine.Actor.K2_TeleportTo
// 0x001C (0x001C - 0x0000)
struct Actor_K2_TeleportTo final
{
public:
	struct FVector                                DestLocation;                                      // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DestRotation;                                      // 0x000C(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Actor_K2_TeleportTo) == 0x000004, "Wrong alignment on Actor_K2_TeleportTo");
static_assert(sizeof(Actor_K2_TeleportTo) == 0x00001C, "Wrong size on Actor_K2_TeleportTo");
static_assert(offsetof(Actor_K2_TeleportTo, DestLocation) == 0x000000, "Member 'Actor_K2_TeleportTo::DestLocation' has a wrong offset!");
static_assert(offsetof(Actor_K2_TeleportTo, DestRotation) == 0x00000C, "Member 'Actor_K2_TeleportTo::DestRotation' has a wrong offset!");
static_assert(offsetof(Actor_K2_TeleportTo, ReturnValue) == 0x000018, "Member 'Actor_K2_TeleportTo::ReturnValue' has a wrong offset!");

// Function Engine.Actor.MakeMIDForMaterial
// 0x0010 (0x0010 - 0x0000)
struct Actor_MakeMIDForMaterial final
{
public:
	class UMaterialInterface*                     Parent;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_MakeMIDForMaterial) == 0x000008, "Wrong alignment on Actor_MakeMIDForMaterial");
static_assert(sizeof(Actor_MakeMIDForMaterial) == 0x000010, "Wrong size on Actor_MakeMIDForMaterial");
static_assert(offsetof(Actor_MakeMIDForMaterial, Parent) == 0x000000, "Member 'Actor_MakeMIDForMaterial::Parent' has a wrong offset!");
static_assert(offsetof(Actor_MakeMIDForMaterial, ReturnValue) == 0x000008, "Member 'Actor_MakeMIDForMaterial::ReturnValue' has a wrong offset!");

// Function Engine.Actor.MakeNoise
// 0x0028 (0x0028 - 0x0000)
struct Actor_MakeNoise final
{
public:
	float                                         Loudness;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  NoiseInstigator;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NoiseLocation;                                     // 0x0010(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_MakeNoise) == 0x000008, "Wrong alignment on Actor_MakeNoise");
static_assert(sizeof(Actor_MakeNoise) == 0x000028, "Wrong size on Actor_MakeNoise");
static_assert(offsetof(Actor_MakeNoise, Loudness) == 0x000000, "Member 'Actor_MakeNoise::Loudness' has a wrong offset!");
static_assert(offsetof(Actor_MakeNoise, NoiseInstigator) == 0x000008, "Member 'Actor_MakeNoise::NoiseInstigator' has a wrong offset!");
static_assert(offsetof(Actor_MakeNoise, NoiseLocation) == 0x000010, "Member 'Actor_MakeNoise::NoiseLocation' has a wrong offset!");
static_assert(offsetof(Actor_MakeNoise, MaxRange) == 0x00001C, "Member 'Actor_MakeNoise::MaxRange' has a wrong offset!");
static_assert(offsetof(Actor_MakeNoise, Tag) == 0x000020, "Member 'Actor_MakeNoise::Tag' has a wrong offset!");

// Function Engine.Actor.PrestreamTextures
// 0x000C (0x000C - 0x0000)
struct Actor_PrestreamTextures final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStreaming;                                  // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CinematicTextureGroups;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_PrestreamTextures) == 0x000004, "Wrong alignment on Actor_PrestreamTextures");
static_assert(sizeof(Actor_PrestreamTextures) == 0x00000C, "Wrong size on Actor_PrestreamTextures");
static_assert(offsetof(Actor_PrestreamTextures, Seconds) == 0x000000, "Member 'Actor_PrestreamTextures::Seconds' has a wrong offset!");
static_assert(offsetof(Actor_PrestreamTextures, bEnableStreaming) == 0x000004, "Member 'Actor_PrestreamTextures::bEnableStreaming' has a wrong offset!");
static_assert(offsetof(Actor_PrestreamTextures, CinematicTextureGroups) == 0x000008, "Member 'Actor_PrestreamTextures::CinematicTextureGroups' has a wrong offset!");

// Function Engine.Actor.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Actor_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Actor_ReceiveActorBeginOverlap");
static_assert(sizeof(Actor_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Actor_ReceiveActorBeginOverlap");
static_assert(offsetof(Actor_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Actor_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function Engine.Actor.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct Actor_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on Actor_ReceiveActorEndOverlap");
static_assert(sizeof(Actor_ReceiveActorEndOverlap) == 0x000008, "Wrong size on Actor_ReceiveActorEndOverlap");
static_assert(offsetof(Actor_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'Actor_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function Engine.Actor.ReceiveActorOnClicked
// 0x0018 (0x0018 - 0x0000)
struct Actor_ReceiveActorOnClicked final
{
public:
	struct FKey                                   ButtonPressed;                                     // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_ReceiveActorOnClicked) == 0x000008, "Wrong alignment on Actor_ReceiveActorOnClicked");
static_assert(sizeof(Actor_ReceiveActorOnClicked) == 0x000018, "Wrong size on Actor_ReceiveActorOnClicked");
static_assert(offsetof(Actor_ReceiveActorOnClicked, ButtonPressed) == 0x000000, "Member 'Actor_ReceiveActorOnClicked::ButtonPressed' has a wrong offset!");

// Function Engine.Actor.ReceiveActorOnInputTouchBegin
// 0x0001 (0x0001 - 0x0000)
struct Actor_ReceiveActorOnInputTouchBegin final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actor_ReceiveActorOnInputTouchBegin) == 0x000001, "Wrong alignment on Actor_ReceiveActorOnInputTouchBegin");
static_assert(sizeof(Actor_ReceiveActorOnInputTouchBegin) == 0x000001, "Wrong size on Actor_ReceiveActorOnInputTouchBegin");
