#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImmediatePhysics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Enum ImmediatePhysics.ESimulationSpace
// NumValues: 0x0004
enum class ESimulationSpace : uint32
{
	ComponentSpace                           = 0,
	WorldSpace                               = 1,
	RootBoneSpace                            = 2,
	ESimulationSpace_MAX                     = 3,
};

// ScriptStruct ImmediatePhysics.AnimNode_RigidBody
// 0x01D0 (0x0240 - 0x0070)
struct FAnimNode_RigidBody final : public FAnimNode_SkeletalControlBase
{
public:
	class UPhysicsAsset*                          OverridePhysicsAsset;                              // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OverrideWorldGravity;                              // 0x0078(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalForce;                                     // 0x0084(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             OverlapChannel;                                    // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldGeometry;                              // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	ESimulationSpace                              SimulationSpace;                                   // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideWorldGravity;                             // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedBoundsScale;                                 // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bComponentSpaceSimulation;                         // 0x00A0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x19F];                                     // 0x00A1(0x019F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_RigidBody) == 0x000008, "Wrong alignment on FAnimNode_RigidBody");
static_assert(sizeof(FAnimNode_RigidBody) == 0x000240, "Wrong size on FAnimNode_RigidBody");
static_assert(offsetof(FAnimNode_RigidBody, OverridePhysicsAsset) == 0x000070, "Member 'FAnimNode_RigidBody::OverridePhysicsAsset' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, OverrideWorldGravity) == 0x000078, "Member 'FAnimNode_RigidBody::OverrideWorldGravity' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, ExternalForce) == 0x000084, "Member 'FAnimNode_RigidBody::ExternalForce' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, OverlapChannel) == 0x000090, "Member 'FAnimNode_RigidBody::OverlapChannel' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, bEnableWorldGeometry) == 0x000091, "Member 'FAnimNode_RigidBody::bEnableWorldGeometry' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, SimulationSpace) == 0x000094, "Member 'FAnimNode_RigidBody::SimulationSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, bOverrideWorldGravity) == 0x000098, "Member 'FAnimNode_RigidBody::bOverrideWorldGravity' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, CachedBoundsScale) == 0x00009C, "Member 'FAnimNode_RigidBody::CachedBoundsScale' has a wrong offset!");
static_assert(offsetof(FAnimNode_RigidBody, bComponentSpaceSimulation) == 0x0000A0, "Member 'FAnimNode_RigidBody::bComponentSpaceSimulation' has a wrong offset!");

}

