#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JackGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "SQEXSEAD_classes.hpp"
#include "SlateCore_structs.hpp"
#include "JackAnimNodeRuntime_structs.hpp"
#include "ApexDestruction_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "OSDKModule_classes.hpp"


namespace SDK
{

// Class JackGame.JackCharacter
// 0x0940 (0x10F0 - 0x07B0)
class AJackCharacter : public ACharacter
{
public:
	uint8                                         Pad_7B0[0x20];                                     // 0x07B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPenetrationAdjustmentConstrainPrevWalkableFloor;  // 0x07D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AutoNavigationAnimMontageName;                     // 0x07D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7E0[0x90];                                     // 0x07E0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CoordinateDependencyObjects;                       // 0x0870(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         NavAgentLocationOffsetHeight;                      // 0x0880(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCompleteAnimNodeBlendOnStabilizePose;             // 0x0884(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSkipSnapToGroundOnTeleport;                       // 0x0885(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_886[0x2];                                      // 0x0886(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PathArrivalRadius;                                 // 0x0888(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           AnimMontageTurnLeft;                               // 0x0890(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           AnimMontageTurnBackLeft;                           // 0x0898(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           AnimMontageTurnRight;                              // 0x08A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           AnimMontageTurnBackRight;                          // 0x08A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNpcEscape;                                      // 0x08B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B1[0x3];                                      // 0x08B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpeedOfNpcEscapeStart;                             // 0x08B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceOfNpcEscapeStart;                          // 0x08B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDontApplyCoordinate;                              // 0x08BC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8BD[0x3];                                      // 0x08BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_Coordinate                    CoordinateID;                                      // 0x08C0(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         CoordinateMeshesCachedMaxDrawDistance;             // 0x08D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D4[0x114];                                    // 0x08D4(0x0114)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackTimeComponent*                     TimeComponent;                                     // 0x09E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackMatineeControlComponent*           MatineeControlComponent;                           // 0x09F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackReservedEffectComponent*           ReservedEffectComponent;                           // 0x09F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackVehicleRiderComponent*             VehicleRiderComponent;                             // 0x0A00(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackTalkComponent*                     TalkComponent;                                     // 0x0A08(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackAnimNotifyComponent*               AnimNotifyComponent;                               // 0x0A10(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackMaterialCoordinatorComponent*      MaterialCoordinatorComponent;                      // 0x0A18(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJackInteractiveActorComponent*         CachedInteractiveActorComponent;                   // 0x0A20(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackInteractorComponent*               CachedInteractorComponent;                         // 0x0A28(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackRigidBodyComponent*                CachedRigidBodyComponent;                          // 0x0A30(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackLookAtComponent*                   CachedLookAtComponent;                             // 0x0A38(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackEyeLookAtComponent*                CachedEyeLookAtComponent;                          // 0x0A40(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackFootIKComponent*                   CachedFootIKComponent;                             // 0x0A48(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackFacialControlComponent*            CachedFacialControlComponent;                      // 0x0A50(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackLoadReductionComponent*            CachedLoadReductionComponent;                      // 0x0A58(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackPropsComponent*                    CachedPropsComponent;                              // 0x0A60(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackArmIKComponent*                    CachedArmIKComponent;                              // 0x0A68(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackGroundAffectComponent*             CachedGroundAffectComponent;                       // 0x0A70(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJackBattleAIComponent*                 CachedBattleAIComponent;                           // 0x0A78(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A80[0x10];                                     // 0x0A80(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UJackGameCharacter>      GameCharacter;                                     // 0x0A90(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A98[0x1A];                                     // 0x0A98(0x001A)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInRoom;                                           // 0x0AB2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AB3[0x7D];                                     // 0x0AB3(0x007D)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInBattle;                                       // 0x0B30(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRotateToDamagedDirection;                         // 0x0B31(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B32[0xE];                                      // 0x0B32(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AJackCharacter>          LockOnTargetCharacter;                             // 0x0B40(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLockOnTroop;                                      // 0x0B48(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B49[0x3];                                      // 0x0B49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LockOnLocation;                                    // 0x0B4C(0x000C)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B58[0x10];                                     // 0x0B58(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AimAttackSocketName;                               // 0x0B68(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B70[0x8];                                      // 0x0B70(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackRotationControl*                   RotationControl;                                   // 0x0B78(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B80[0x88];                                     // 0x0B80(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackParticleDict>              Particles;                                         // 0x0C08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackSoundDict>                 Sounds;                                            // 0x0C18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackProjectileClassDict>       ProjectileClasses;                                 // 0x0C28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackWeaponClassDict>           WeaponClasses;                                     // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackPropClassDict>             PropClasses;                                       // 0x0C48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackCameraAnimDict>            CameraAnims;                                       // 0x0C58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackCameraShakeDict>           CameraShakes;                                      // 0x0C68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackForceFeedbackDict>         ForceFeedbacks;                                    // 0x0C78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackCurveDict>                 Curves;                                            // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackMaterialParameterCollectionDict> MaterialParameterCollections;                      // 0x0C98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackCollideEffectDict>         CollideEffects;                                    // 0x0CA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackStaticMeshDict>            StaticMeshes;                                      // 0x0CB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackSkeletalMeshDict>          SkeletalMeshes;                                    // 0x0CC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackMaterialDict>              Materials;                                         // 0x0CD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJackTextureDict>               Textures;                                          // 0x0CE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FJackCharacterFootstepEffectContainer  FootstepEffectsContainer;                          // 0x0CF8(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FJackCharacterDamageEffectContainer    DamageEffectsContainer;                            // 0x0D08(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FJackCharacterCoordEffectContainer     CoordSoundsContainer;                              // 0x0D18(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D28[0x38];                                     // 0x0D28(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackStreamObjectsHolder*               DeferredLoadAssetsHolder;                          // 0x0D60(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTexture*>                       DeferredStreamingTextures;                         // 0x0D68(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          bWaitForFixupLooksUntilBecomeHighResolutionTextures; // 0x0D78(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D79[0x37];                                     // 0x0D79(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InjuryMinRate;                                     // 0x0DB0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InjuryMaxRate;                                     // 0x0DB4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UClass*>                         IgnoredAnimNotifyClasses;                          // 0x0DB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bMeshReceivesDecals;                               // 0x0DC8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeshPostProcessEdge;                              // 0x0DC9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DCA[0x12E];                                    // 0x0DCA(0x012E)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTeleportResetClothAndPhysics;                     // 0x0EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EF9[0x3];                                      // 0x0EF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayEnabledTeleportClothAndPhysics;               // 0x0EFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F00[0x8];                                      // 0x0F00(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SimulatePhysicsBoneNames;                          // 0x0F08(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   DefaultLookedAtSocketName;                         // 0x0F18(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F20[0x68];                                     // 0x0F20(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAnimSequenceBase*, struct FJackAnimCancelFrameInfo> CancelFrameInfos;                                  // 0x0F88(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FD8[0x4];                                      // 0x0FD8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ERootMotionMode                               BattleRootMotionMode;                              // 0x0FDC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FDD[0xD3];                                     // 0x0FDD(0x00D3)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMustBeAbleToCloseupWithCamera;                    // 0x10B0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDontCloseupWithCamera;                            // 0x10B1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayDebugInfoEnabled;                          // 0x10B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAttackCollision;                              // 0x10B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowClothCollisions;                              // 0x10B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10B5[0x2B];                                    // 0x10B5(0x002B)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEADAutoSeComponent*               AutoSeComponent;                                   // 0x10E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10E8[0x8];                                     // 0x10E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AbortLatentAction();
	void AsyncFixupLooks();
	void CompleteLookAtInterp();
	void DisableClothAndPhysics();
	void EnableClothAndPhysics();
	void EndBPControl();
	class UActorComponent* FindOrAddComponentByClass(TSubclassOf<class UActorComponent> ComponentClass);
	void FixupLooks();
	void ForceFullRecover();
	void GetBattleABPInfo(float InMovementRate, float* OutMovementRate, float* OutMovementRootMotionTranslationRate, EJackEquippedWeaponStyle* OutWeaponStyle, bool* OutWeaponEquipChange, bool* OutWeaponEquipChangeFlip, float* OutInjuryRate, bool* OutIsInBattle, bool* OutIsDefending, bool* OutIsEquippedBothHands);
	class UJackBattleAIComponent* GetBattleAIComponent();
	class AJackBattleCommandAI* GetBattleCommandAI();
	class AJackCharacter* GetCoffinActor();
	class UJackEquipmentControlComponent* GetJackEquipmentControlComponent();
	class UJackInteractiveActorComponent* GetJackInteractiveActorComponent();
	class UJackInteractorComponent* GetJackInteractorComponent();
	class UJackWeatherAffectComponent* GetJackWeatherAffectComponent();
	class AJackBattleSnowman* GetSnowmanActor();
	bool IsRecentlyRendered();
	void Latent_Animation(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class UAnimMontage* AnimMontage, int32 Minute, bool bWait);
	void Latent_MoveToActor(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AActor* Goal, float Speed, class UAnimMontage* AnimMontage);
	void Latent_MoveToLocation(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const struct FVector& Goal, float Speed, class UAnimMontage* AnimMontage);
	void Latent_SimpleNavigationTo(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const struct FVector& GoalLocation, const struct FRotator& GoalRotation, float Speed, float RotationSpeed, class UAnimMontage* AnimMontage);
	void Latent_TurnToActor(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AActor* Gaze, float Speed, float Allowance, class UAnimMontage* AnimMontage);
	void Latent_TurnToAngle(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, float Angle, float Speed, float Allowance, class UAnimMontage* AnimMontage);
	void Latent_TurnToLocation(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const struct FVector& Gaze, float Speed, float Allowance, class UAnimMontage* AnimMontage);
	void LookAtCharacter(class AJackCharacter* Character, class FName Socket);
	void LookAtEnd();
	void LookAtLocation(const struct FVector& Location);
	void OnBattleEndDelegate__DelegateSignature();
	void OnBattleStartDelegate__DelegateSignature();
	void OnCharacterCoordinateChanged();
	void OnFixupLooks();
	void OnPlayAnimMontageByKeyDelegate__DelegateSignature(class FName AnimMontageKey, class UAnimMontage* AnimMontage);
	void OnTeleported(bool bSucceeded);
	float PlayAnimMontageByKeyBP(class FName AnimMontageKey, float InPlayRate, class FName StartSectionName);
	void ResetCancelFrameControlCount();
	void SetActorBlockCollisonToOverlap(EJackCharacterIgnoreCollisionPurpose Purpose, bool bNewActorForceOverlapCollision);
	void SetActorIgnoreCollision(EJackCharacterIgnoreCollisionPurpose Purpose, bool bNewActorIgnoreCollision);
	void SetAnimDynamicsIdlingCount(int32 IdlingCount, bool bRequireResetDynamics);
	void SetAutoLookAtEnbaled(bool bEnabled);
	void SetAutonomicMovementDisabled(bool bDisabled, EJackCharacterControlChannel InChannel);
	void SetCharacterCoordinate(class FName InCoordinateID, EJackCharacterCoordinateLayer InCoordinateLayer, EJackCharacterCoordinateLoader LoaderType);
	void SetCollisionEnabledToBattlePawn(bool bEnabled);
	void SetDitherHiddenActor(EJackCharacterHiddenPurpose InPurpose, bool bNewHidden, class UCurveBase* Curve, float InRequiredSeconds, bool bIsParticleActiveChangeDisable);
	void SetHiddenControl(EJackCharacterHiddenPurpose Purpose, bool bNewHidden, bool bPreventCapsuleControl);
	void SetIgnoreLookAt(EJackCharacterLookAtPurpose Purpose, bool bIgnore);
	void SetInBattleForBunsin();
	void SetInRoom(bool bNewInRoom);
	void SetJumpDisabled(bool bDisabled, EJackCharacterControlChannel InChannel);
	void SetLookAtMobileRegion(float PitchUp, float PitchDown, float YawLeft, float YawRight);
	void SetLookAtSingleNode(bool bFlag, bool bRateToZeroIfNotLookAt);
	void SetLookAtTargetUpdateMoveOnly(bool bFlag);
	void SetMeshPostProcessEdge(bool bInPostProcessEdge);
	void SetMeshReceivesDecals(bool bInReceivesDecals);
	void SetMovementEnabled(bool bEnabled, EJackCharacterControlChannel InChannel);
	void SetOverrideLODInfo(EJackCharacterCoordinateLODInfo Type);
	void SetPause(EJackCharacterPausePurpose Purpose, bool bPause);
	void SetRootMotionMode(ERootMotionMode Mode, bool bConsumeRootMotion);
	void SimpleAutoNavigationTo(const struct FVector& InLocation, const struct FRotator& InRotation, float InSeconds, float InRotationSeconds);
	void SimpleAutoNavigationToWithSpeed(const struct FVector& InLocation, const struct FRotator& InRotation, float InSpeed);
	void SkipUpdateAnimation(float DeltaSeconds, bool bCallNotify);
	bool SnapToGround(EJackCharacterCollisionResponse CollisionResponseType);
	bool SnapToGroundLocationWithRotation(const struct FVector& Location, const struct FRotator& Rotation, float SearchDistance);
	void StabilizePose(bool bRequireResetDynamics);
	void StartBPControl();
	bool TeleportNoCollisionCheck(const struct FVector& DestLocation, const struct FRotator& DestRotation);

	class UAnimMontage* FindAnimMontage(const class FName InName, bool bWarnIfMissing) const;
	class UAnimMontage* FindAnimMontageChecked(const class FName InName) const;
	class UAnimMontage* FindAnimMontageWeaponStyle(const class FName InName, bool bWarnIfMissing) const;
	class UAnimMontage* FindAnimMontageWeaponStyleChecked(const class FName InName) const;
	class FName FindAnimMontageWeaponStyleName(const class FName InName) const;
	class AJackBattleCommandAI* FindBattleCommandAI(const class UClass* TargetClass) const;
	class UCameraAnim* FindCameraAnim(const class FName InName, bool bWarnIfMissing) const;
	class UCameraAnim* FindCameraAnimChecked(const class FName InName) const;
	TSubclassOf<class UCameraShake> FindCameraShake(const class FName InName, bool bWarnIfMissing) const;
	TSubclassOf<class UCameraShake> FindCameraShakeChecked(const class FName InName) const;
	TSubclassOf<class UJackCollideEffect> FindCollideEffect(const class FName InName, bool bWarnIfMissing) const;
	TSubclassOf<class UJackCollideEffect> FindCollideEffectChecked(const class FName InName) const;
	class UCurveBase* FindCurve(const class FName InName, bool bWarnIfMissing) const;
	class UCurveBase* FindCurveChecked(const class FName InName) const;
	class UForceFeedbackEffect* FindForceFeedback(const class FName InName, bool bWarnIfMissing) const;
	class UForceFeedbackEffect* FindForceFeedbackChecked(const class FName InName) const;
	class UMaterialInterface* FindMaterial(const class FName InName, bool bWarnIfMissing) const;
	class UMaterialInterface* FindMaterialChecked(const class FName InName) const;
	class UMaterialParameterCollection* FindMaterialParameterCollection(const class FName InName, bool bWarnIfMissing) const;
	class UMaterialParameterCollection* FindMaterialParameterCollectionChecked(const class FName InName) const;
	class UParticleSystem* FindParticle(const class FName InName, bool bWarnIfMissing) const;
	class UParticleSystem* FindParticleChecked(const class FName InName) const;
	TSubclassOf<class AJackProjectile> FindProjectileClass(const class FName InName, bool bWarnIfMissing) const;
	TSubclassOf<class AJackProjectile> FindProjectileClassChecked(const class FName InName) const;
	class USkeletalMesh* FindSkeletalMesh(const class FName InName, bool bWarnIfMissing) const;
	class USkeletalMesh* FindSkeletalMeshChecked(const class FName InName) const;
	class USoundBase* FindSound(const class FName InName, bool bWarnIfMissing) const;
	class USoundBase* FindSoundChecked(const class FName InName) const;
	class UStaticMesh* FindStaticMesh(const class FName InName, bool bWarnIfMissing) const;
	class UStaticMesh* FindStaticMeshChecked(const class FName InName) const;
	class UTexture* FindTexture(const class FName InName, bool bWarnIfMissing) const;
	class UTexture* FindTextureChecked(const class FName InName) const;
	TSubclassOf<class AJackWeaponBase> FindWeaponClass(const class FName InName, bool bWarnIfMissing) const;
	TSubclassOf<class AJackWeaponBase> FindWeaponClassChecked(const class FName InName) const;
	void GetActorBoundsWithoutMesh(struct FVector* OutOrigin, struct FVector* OutBoxExtent) const;
	float GetAdditiveAnimationRate() const;
	class FName GetAutoNavigationAnimMontageName() const;
	class FName GetCharacterCoordinate() const;
	class USkinnedMeshComponent* GetCoordinatePartsMeshComponent(EJackCharacterCoordinateParts PartsType) const;
	struct FVector GetDesiredMovementLocalDirection() const;
	EJackEquippedWeaponStyle GetEquippedWeaponStyle() const;
	class UJackArmIKComponent* GetJackArmIKComponent() const;
	class UJackFootIKComponent* GetJackFootIKComponent() const;
	class UJackPropsComponent* GetJackPropsComponent() const;
	float GetLookAtApplyRate() const;
	float GetLookAtApplySecondNodeRate() const;
	class UJackLookAtComponent* GetLookAtComponent() const;
	struct FVector GetLookAtInterpLocation() const;
	float GetMovementAnimationPlayRate() const;
	float GetMovementSpeedRate() const;
	TArray<class USkeletalMeshComponent*> GetOutlineSkeletalMeshComponents() const;
	struct FRotator GetRotationToDesired() const;
	float GetTurningAnimationPlayRate() const;
	bool IsBPControl() const;
	bool IsDead() const;
	bool IsDeclarationToUseMatinee() const;
	bool IsDefending() const;
	bool IsDitherHidden(EJackCharacterHiddenPurpose InPurpose) const;
	bool IsDitherHiddenAllPurpose() const;
	bool IsDitherRunning() const;
	bool IsEquippedBothHands() const;
	bool IsFloating() const;
	bool IsHiddenControl(EJackCharacterHiddenPurpose Purpose) const;
	bool IsInRoom() const;
	bool IsInTheAir() const;
	bool IsOpenWeapon() const;
	void StopAllMontageImmediately() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JackCharacter">();
	}
	static class AJackCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJackCharacter>();
	}
};
static_assert(alignof(AJackCharacter) == 0x000010, "Wrong alignment on AJackCharacter");
static_assert(sizeof(AJackCharacter) == 0x0010F0, "Wrong size on AJackCharacter");
static_assert(offsetof(AJackCharacter, bPenetrationAdjustmentConstrainPrevWalkableFloor) == 0x0007D0, "Member 'AJackCharacter::bPenetrationAdjustmentConstrainPrevWalkableFloor' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AutoNavigationAnimMontageName) == 0x0007D8, "Member 'AJackCharacter::AutoNavigationAnimMontageName' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CoordinateDependencyObjects) == 0x000870, "Member 'AJackCharacter::CoordinateDependencyObjects' has a wrong offset!");
static_assert(offsetof(AJackCharacter, NavAgentLocationOffsetHeight) == 0x000880, "Member 'AJackCharacter::NavAgentLocationOffsetHeight' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bCompleteAnimNodeBlendOnStabilizePose) == 0x000884, "Member 'AJackCharacter::bCompleteAnimNodeBlendOnStabilizePose' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bSkipSnapToGroundOnTeleport) == 0x000885, "Member 'AJackCharacter::bSkipSnapToGroundOnTeleport' has a wrong offset!");
static_assert(offsetof(AJackCharacter, PathArrivalRadius) == 0x000888, "Member 'AJackCharacter::PathArrivalRadius' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AnimMontageTurnLeft) == 0x000890, "Member 'AJackCharacter::AnimMontageTurnLeft' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AnimMontageTurnBackLeft) == 0x000898, "Member 'AJackCharacter::AnimMontageTurnBackLeft' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AnimMontageTurnRight) == 0x0008A0, "Member 'AJackCharacter::AnimMontageTurnRight' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AnimMontageTurnBackRight) == 0x0008A8, "Member 'AJackCharacter::AnimMontageTurnBackRight' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bIsNpcEscape) == 0x0008B0, "Member 'AJackCharacter::bIsNpcEscape' has a wrong offset!");
static_assert(offsetof(AJackCharacter, SpeedOfNpcEscapeStart) == 0x0008B4, "Member 'AJackCharacter::SpeedOfNpcEscapeStart' has a wrong offset!");
static_assert(offsetof(AJackCharacter, DistanceOfNpcEscapeStart) == 0x0008B8, "Member 'AJackCharacter::DistanceOfNpcEscapeStart' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bDontApplyCoordinate) == 0x0008BC, "Member 'AJackCharacter::bDontApplyCoordinate' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CoordinateID) == 0x0008C0, "Member 'AJackCharacter::CoordinateID' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CoordinateMeshesCachedMaxDrawDistance) == 0x0008D0, "Member 'AJackCharacter::CoordinateMeshesCachedMaxDrawDistance' has a wrong offset!");
static_assert(offsetof(AJackCharacter, TimeComponent) == 0x0009E8, "Member 'AJackCharacter::TimeComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, MatineeControlComponent) == 0x0009F0, "Member 'AJackCharacter::MatineeControlComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, ReservedEffectComponent) == 0x0009F8, "Member 'AJackCharacter::ReservedEffectComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, VehicleRiderComponent) == 0x000A00, "Member 'AJackCharacter::VehicleRiderComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, TalkComponent) == 0x000A08, "Member 'AJackCharacter::TalkComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AnimNotifyComponent) == 0x000A10, "Member 'AJackCharacter::AnimNotifyComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, MaterialCoordinatorComponent) == 0x000A18, "Member 'AJackCharacter::MaterialCoordinatorComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedInteractiveActorComponent) == 0x000A20, "Member 'AJackCharacter::CachedInteractiveActorComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedInteractorComponent) == 0x000A28, "Member 'AJackCharacter::CachedInteractorComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedRigidBodyComponent) == 0x000A30, "Member 'AJackCharacter::CachedRigidBodyComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedLookAtComponent) == 0x000A38, "Member 'AJackCharacter::CachedLookAtComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedEyeLookAtComponent) == 0x000A40, "Member 'AJackCharacter::CachedEyeLookAtComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedFootIKComponent) == 0x000A48, "Member 'AJackCharacter::CachedFootIKComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedFacialControlComponent) == 0x000A50, "Member 'AJackCharacter::CachedFacialControlComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedLoadReductionComponent) == 0x000A58, "Member 'AJackCharacter::CachedLoadReductionComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedPropsComponent) == 0x000A60, "Member 'AJackCharacter::CachedPropsComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedArmIKComponent) == 0x000A68, "Member 'AJackCharacter::CachedArmIKComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedGroundAffectComponent) == 0x000A70, "Member 'AJackCharacter::CachedGroundAffectComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CachedBattleAIComponent) == 0x000A78, "Member 'AJackCharacter::CachedBattleAIComponent' has a wrong offset!");
static_assert(offsetof(AJackCharacter, GameCharacter) == 0x000A90, "Member 'AJackCharacter::GameCharacter' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bInRoom) == 0x000AB2, "Member 'AJackCharacter::bInRoom' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bIsInBattle) == 0x000B30, "Member 'AJackCharacter::bIsInBattle' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bRotateToDamagedDirection) == 0x000B31, "Member 'AJackCharacter::bRotateToDamagedDirection' has a wrong offset!");
static_assert(offsetof(AJackCharacter, LockOnTargetCharacter) == 0x000B40, "Member 'AJackCharacter::LockOnTargetCharacter' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bLockOnTroop) == 0x000B48, "Member 'AJackCharacter::bLockOnTroop' has a wrong offset!");
static_assert(offsetof(AJackCharacter, LockOnLocation) == 0x000B4C, "Member 'AJackCharacter::LockOnLocation' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AimAttackSocketName) == 0x000B68, "Member 'AJackCharacter::AimAttackSocketName' has a wrong offset!");
static_assert(offsetof(AJackCharacter, RotationControl) == 0x000B78, "Member 'AJackCharacter::RotationControl' has a wrong offset!");
static_assert(offsetof(AJackCharacter, Particles) == 0x000C08, "Member 'AJackCharacter::Particles' has a wrong offset!");
static_assert(offsetof(AJackCharacter, Sounds) == 0x000C18, "Member 'AJackCharacter::Sounds' has a wrong offset!");
static_assert(offsetof(AJackCharacter, ProjectileClasses) == 0x000C28, "Member 'AJackCharacter::ProjectileClasses' has a wrong offset!");
static_assert(offsetof(AJackCharacter, WeaponClasses) == 0x000C38, "Member 'AJackCharacter::WeaponClasses' has a wrong offset!");
static_assert(offsetof(AJackCharacter, PropClasses) == 0x000C48, "Member 'AJackCharacter::PropClasses' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CameraAnims) == 0x000C58, "Member 'AJackCharacter::CameraAnims' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CameraShakes) == 0x000C68, "Member 'AJackCharacter::CameraShakes' has a wrong offset!");
static_assert(offsetof(AJackCharacter, ForceFeedbacks) == 0x000C78, "Member 'AJackCharacter::ForceFeedbacks' has a wrong offset!");
static_assert(offsetof(AJackCharacter, Curves) == 0x000C88, "Member 'AJackCharacter::Curves' has a wrong offset!");
static_assert(offsetof(AJackCharacter, MaterialParameterCollections) == 0x000C98, "Member 'AJackCharacter::MaterialParameterCollections' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CollideEffects) == 0x000CA8, "Member 'AJackCharacter::CollideEffects' has a wrong offset!");
static_assert(offsetof(AJackCharacter, StaticMeshes) == 0x000CB8, "Member 'AJackCharacter::StaticMeshes' has a wrong offset!");
static_assert(offsetof(AJackCharacter, SkeletalMeshes) == 0x000CC8, "Member 'AJackCharacter::SkeletalMeshes' has a wrong offset!");
static_assert(offsetof(AJackCharacter, Materials) == 0x000CD8, "Member 'AJackCharacter::Materials' has a wrong offset!");
static_assert(offsetof(AJackCharacter, Textures) == 0x000CE8, "Member 'AJackCharacter::Textures' has a wrong offset!");
static_assert(offsetof(AJackCharacter, FootstepEffectsContainer) == 0x000CF8, "Member 'AJackCharacter::FootstepEffectsContainer' has a wrong offset!");
static_assert(offsetof(AJackCharacter, DamageEffectsContainer) == 0x000D08, "Member 'AJackCharacter::DamageEffectsContainer' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CoordSoundsContainer) == 0x000D18, "Member 'AJackCharacter::CoordSoundsContainer' has a wrong offset!");
static_assert(offsetof(AJackCharacter, DeferredLoadAssetsHolder) == 0x000D60, "Member 'AJackCharacter::DeferredLoadAssetsHolder' has a wrong offset!");
static_assert(offsetof(AJackCharacter, DeferredStreamingTextures) == 0x000D68, "Member 'AJackCharacter::DeferredStreamingTextures' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bWaitForFixupLooksUntilBecomeHighResolutionTextures) == 0x000D78, "Member 'AJackCharacter::bWaitForFixupLooksUntilBecomeHighResolutionTextures' has a wrong offset!");
static_assert(offsetof(AJackCharacter, InjuryMinRate) == 0x000DB0, "Member 'AJackCharacter::InjuryMinRate' has a wrong offset!");
static_assert(offsetof(AJackCharacter, InjuryMaxRate) == 0x000DB4, "Member 'AJackCharacter::InjuryMaxRate' has a wrong offset!");
static_assert(offsetof(AJackCharacter, IgnoredAnimNotifyClasses) == 0x000DB8, "Member 'AJackCharacter::IgnoredAnimNotifyClasses' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bMeshReceivesDecals) == 0x000DC8, "Member 'AJackCharacter::bMeshReceivesDecals' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bMeshPostProcessEdge) == 0x000DC9, "Member 'AJackCharacter::bMeshPostProcessEdge' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bTeleportResetClothAndPhysics) == 0x000EF8, "Member 'AJackCharacter::bTeleportResetClothAndPhysics' has a wrong offset!");
static_assert(offsetof(AJackCharacter, DelayEnabledTeleportClothAndPhysics) == 0x000EFC, "Member 'AJackCharacter::DelayEnabledTeleportClothAndPhysics' has a wrong offset!");
static_assert(offsetof(AJackCharacter, SimulatePhysicsBoneNames) == 0x000F08, "Member 'AJackCharacter::SimulatePhysicsBoneNames' has a wrong offset!");
static_assert(offsetof(AJackCharacter, DefaultLookedAtSocketName) == 0x000F18, "Member 'AJackCharacter::DefaultLookedAtSocketName' has a wrong offset!");
static_assert(offsetof(AJackCharacter, CancelFrameInfos) == 0x000F88, "Member 'AJackCharacter::CancelFrameInfos' has a wrong offset!");
static_assert(offsetof(AJackCharacter, BattleRootMotionMode) == 0x000FDC, "Member 'AJackCharacter::BattleRootMotionMode' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bMustBeAbleToCloseupWithCamera) == 0x0010B0, "Member 'AJackCharacter::bMustBeAbleToCloseupWithCamera' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bDontCloseupWithCamera) == 0x0010B1, "Member 'AJackCharacter::bDontCloseupWithCamera' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bDisplayDebugInfoEnabled) == 0x0010B2, "Member 'AJackCharacter::bDisplayDebugInfoEnabled' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bShowAttackCollision) == 0x0010B3, "Member 'AJackCharacter::bShowAttackCollision' has a wrong offset!");
static_assert(offsetof(AJackCharacter, bShowClothCollisions) == 0x0010B4, "Member 'AJackCharacter::bShowClothCollisions' has a wrong offset!");
static_assert(offsetof(AJackCharacter, AutoSeComponent) == 0x0010E0, "Member 'AJackCharacter::AutoSeComponent' has a wrong offset!");

// Class JackGame.JackAnimDynamicsCharacter
// 0x0000 (0x10F0 - 0x10F0)
class AJackAnimDynamicsCharacter final : public AJackCharacter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JackAnimDynamicsCharacter">();
	}
	static class AJackAnimDynamicsCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJackAnimDynamicsCharacter>();
	}
};
static_assert(alignof(AJackAnimDynamicsCharacter) == 0x000010, "Wrong alignment on AJackAnimDynamicsCharacter");
static_assert(sizeof(AJackAnimDynamicsCharacter) == 0x0010F0, "Wrong size on AJackAnimDynamicsCharacter");

// Class JackGame.JackUMGWidgetBase
// 0x01A0 (0x0370 - 0x01D0)
class UJackUMGWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_1D0[0x20];                                     // 0x01D0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WidgetName;                                        // 0x01F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x01F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreIsVisible;                                  // 0x01F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x01FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFocusableWindow;                                // 0x01FB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsForceFocusable;                                 // 0x01FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsForceHilite;                                    // 0x01FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsShowHilite;                                     // 0x01FE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBindMenuKey;                                    // 0x01FF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsKeyEvent;                                       // 0x0200(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableInput;                                     // 0x0201(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExceptionCategory;                                // 0x0202(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFitCanvasPanelToParent;                           // 0x0203(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSkipCalcLocalPosition;                          // 0x0204(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIgnoreLoging;                                   // 0x0205(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIgnoreSafeAreaCheck;                            // 0x0206(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackUMGPresetAnim                            OpenPresetAnimOption;                              // 0x0207(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackUMGPresetAnim                            ClosePresetAnimOption;                             // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackUMGPresetAnim                            ShowPresetAnimOption;                              // 0x0209(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackUMGPresetAnim                            HidePresetAnimOption;                              // 0x020A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRoot;                                           // 0x020B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTopMenu;                                        // 0x020C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsForePage;                                       // 0x020D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIgnoreCancelKey;                                // 0x020E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableEnterKeyEventCalling;                       // 0x020F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCancelKeyEventCalling;                      // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultAdjustResize;                               // 0x0214(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LayoutOffset;                                      // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SnapOffset;                                        // 0x0220(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           RootPanelRef;                                      // 0x0230(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              DefaultPosition;                                   // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CurrentPosition;                                   // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Position;                                          // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Scale;                                             // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0258(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WidgetSize;                                        // 0x025C(0x0008)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              RootPosition;                                      // 0x0264(0x0008)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TextBaseColor;                                     // 0x026C(0x0010)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TextBorderColor;                                   // 0x027C(0x0010)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         JackOnWidgetBPActionDelegate;                      // 0x0290(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   JackOnWidgetNotificationDelegate;                  // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> JackOnWidgetKeyEventDelegate;                      // 0x02B0(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           OptimizePanel;                                     // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x60];                                     // 0x02D0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     ChildWidget;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
