#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JackAnimNodeRuntime

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum JackAnimNodeRuntime.EJackConvertedAxis
// NumValues: 0x0007
enum class EJackConvertedAxis : uint8
{
	PLUS_X                                   = 0,
	PLUS_Y                                   = 1,
	PLUS_Z                                   = 2,
	MINUS_X                                  = 3,
	MINUS_Y                                  = 4,
	MINUS_Z                                  = 5,
	EJackConvertedAxis_MAX                   = 6,
};

// Enum JackAnimNodeRuntime.EJackFacePoseEvaluator
// NumValues: 0x0003
enum class EJackFacePoseEvaluator : uint8
{
	Upper                                    = 0,
	Lower                                    = 1,
	MAX                                      = 2,
};

// Enum JackAnimNodeRuntime.EJackLookAtBasePose
// NumValues: 0x0005
enum class EJackLookAtBasePose : uint8
{
	Default                                  = 0,
	ReferencePose                            = 1,
	ReferencePoseWithKeepLocation            = 2,
	FowardVectorOffset                       = 3,
	EJackLookAtBasePose_MAX                  = 4,
};

// Enum JackAnimNodeRuntime.EJackOverrideUseConvertVelocityToExternalForce
// NumValues: 0x0004
enum class EJackOverrideUseConvertVelocityToExternalForce : uint8
{
	NotOverride                              = 0,
	ForceFalse                               = 1,
	ForceTrue                                = 2,
	EJackOverrideUseConvertVelocityToExternalForce_MAX = 3,
};

// Enum JackAnimNodeRuntime.EJackWindEffectDecayRate
// NumValues: 0x0004
enum class EJackWindEffectDecayRate : uint8
{
	NoDecay                                  = 0,
	Linear                                   = 1,
	Square                                   = 2,
	EJackWindEffectDecayRate_MAX             = 3,
};

// Enum JackAnimNodeRuntime.EJackAnimDynamicsSphericalLimitType
// NumValues: 0x0003
enum class EJackAnimDynamicsSphericalLimitType : uint8
{
	Inner                                    = 0,
	Outer                                    = 1,
	EJackAnimDynamicsSphericalLimitType_MAX  = 2,
};

// Enum JackAnimNodeRuntime.FJackAnimDynamicsEvaluateStatus
// NumValues: 0x0004
enum class EFJackAnimDynamicsEvaluateStatus : uint8
{
	Never                                    = 0,
	Pending                                  = 1,
	Ran                                      = 2,
	FJackAnimDynamicsEvaluateStatus_MAX      = 3,
};

// Enum JackAnimNodeRuntime.EJackAnimPhysSimSpaceType
// NumValues: 0x0006
enum class EJackAnimPhysSimSpaceType : uint8
{
	Component                                = 0,
	Actor                                    = 1,
	World                                    = 2,
	RootRelative                             = 3,
	BoneRelative                             = 4,
	EJackAnimPhysSimSpaceType_MAX            = 5,
};

// Enum JackAnimNodeRuntime.EJackAnimPhysLinearConstraintType
// NumValues: 0x0003
enum class EJackAnimPhysLinearConstraintType : uint8
{
	Free                                     = 0,
	Limited                                  = 1,
	EJackAnimPhysLinearConstraintType_MAX    = 2,
};

// Enum JackAnimNodeRuntime.EJackAnimPhysAngularConstraintType
// NumValues: 0x0003
enum class EJackAnimPhysAngularConstraintType : uint8
{
	Angular                                  = 0,
	Cone                                     = 1,
	EJackAnimPhysAngularConstraintType_MAX   = 2,
};

// Enum JackAnimNodeRuntime.EJackAnimExpressionType
// NumValues: 0x0007
enum class EJackAnimExpressionType : uint8
{
	MaxOrMinRot                              = 0,
	AverageRot                               = 1,
	TransSyncRot                             = 2,
	Lerp2BonesAndClamp                       = 3,
	RotCancel                                = 4,
	ModifyBone                               = 5,
	EJackAnimExpressionType_MAX              = 6,
};

// Enum JackAnimNodeRuntime.EJackGetTransformMode
// NumValues: 0x0003
enum class EJackGetTransformMode : uint8
{
	Default                                  = 0,
	Delta                                    = 1,
	EJackGetTransformMode_MAX                = 2,
};

// Enum JackAnimNodeRuntime.EJackDynamicBonePartsSlot
// NumValues: 0x0008
enum class EJackDynamicBonePartsSlot : uint8
{
	UPPER_BODY                               = 0,
	LOWER_BODY                               = 1,
	BODY_EXTRA                               = 2,
	HAIR                                     = 3,
	HAIR_EXTRA                               = 4,
	MANTLE                                   = 5,
	OTHER                                    = 6,
	MAX                                      = 7,
};

// Enum JackAnimNodeRuntime.EJackBoneAxis
// NumValues: 0x0004
enum class EJackBoneAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	EJackBoneAxis_MAX                        = 3,
};

// Enum JackAnimNodeRuntime.EJackNeedsToEvalDynamicsWeightCurve
// NumValues: 0x0004
enum class EJackNeedsToEvalDynamicsWeightCurve : uint8
{
	NotReflected                             = 0,
	NotNeedToEvalCurve                       = 1,
	NeedToEvalCurve                          = 2,
	EJackNeedsToEvalDynamicsWeightCurve_MAX  = 3,
};

// Enum JackAnimNodeRuntime.EJackMantleDynamicBoneState
// NumValues: 0x000D
enum class EJackMantleDynamicBoneState : uint8
{
	Default                                  = 0,
	Sim_CapeMantle                           = 1,
	Sim_MantleC                              = 2,
	Sim_MantleC_N013                         = 3,
	Sim_MantleB                              = 4,
	Sim_CapeMantle_N002                      = 5,
	Sim_MantleC_N002                         = 6,
	Sim_MantleC_N014                         = 7,
	Sim_MantleC_P004                         = 8,
	Sim_MantleC_P008                         = 9,
	Sim_MantleC_P007                         = 10,
	Sim_MantleC_P002                         = 11,
	EJackMantleDynamicBoneState_MAX          = 12,
};

// Enum JackAnimNodeRuntime.EJackHairDynamicBoneState
// NumValues: 0x0025
enum class EJackHairDynamicBoneState : uint8
{
	Default                                  = 0,
	Pose_P008Hair                            = 1,
	Pose_P004Hair                            = 2,
	Pose_N101Hair                            = 3,
	Pose_N001Hair                            = 4,
	Pose_P003Hair                            = 5,
	Sim_P004ShortHair                        = 6,
	Sim_ShortHairUpMidLow                    = 7,
	Sim_C_RearHairH                          = 8,
	Sim_C_RearHairA                          = 9,
	Sim_PlayerHair                           = 10,
	Sim_LR_RearHairA                         = 11,
	Pose_LR_RearHairD1                       = 12,
	Pose_C_RearHairB1                        = 13,
	Pose_LR_SideHairI1                       = 14,
	Pose_C_RearHairG1                        = 15,
	Pose_LR_SideHairJ1                       = 16,
	Pose_RearHairILL                         = 17,
	Pose_RearHairKPP                         = 18,
	Pose_SideHairF1                          = 19,
	Pose_C_RearHairL1                        = 20,
	Pose_LR_SideHairK1                       = 21,
	Pose_R_FrontHairE1                       = 22,
	Pose_ChestHairA1                         = 23,
	Pose_NeckHoodA1                          = 24,
	Pose_HeadVeilB1                          = 25,
	Pose_C_RearHairN1                        = 26,
	Pose_C_RearHairQ1                        = 27,
	Sim_BeardD1                              = 28,
	Pose_HeadVeilC1                          = 29,
	Pose_RearHairP1                          = 30,
	Sim_C_BeardB                             = 31,
	Sim_N104Hair                             = 32,
	Sim_C_HairTailA1                         = 33,
	Sim_C_HairTailB1                         = 34,
	Pose_LR_SideHairL1                       = 35,
	EJackHairDynamicBoneState_MAX            = 36,
};

// Enum JackAnimNodeRuntime.EJackLowerDynamicBoneState
// NumValues: 0x0034
enum class EJackLowerDynamicBoneState : uint8
{
	Default                                  = 0,
	RtEx_Skirt_Length1                       = 1,
	RtEx_Skirt_Length2                       = 2,
	RtEx_Skirt_Length3                       = 3,
	RtEx_Skirt_Length4                       = 4,
	RtEx_SBSkirt                             = 5,
	RtEx_FtSkirt_Length2                     = 6,
	RtEx_FtSkirt_Length3                     = 7,
	RtEx_FtSkirt_Length3_N008                = 8,
	RtEx_FtSkirt_Length3_N010                = 9,
	RtEx_FtSkirt_Length3_N013                = 10,
	RtEx_HipsArmor                           = 11,
	RtEx_HipsArmor_N001                      = 12,
	RtEx_HipsArmor_N004                      = 13,
	RtEx_SouthSkirtK1                        = 14,
	RtEx_P004Skirt                           = 15,
	RtEx_HrSkirtA                            = 16,
	Sim_KtAcce                               = 17,
	RtEx_HipsSideArmor                       = 18,
	RtEx_P001Skirt                           = 19,
	Sim_LR_LoinclothA1                       = 20,
	Sim_TailSkirtA1                          = 21,
	Sim_LR_NpcPantsI3                        = 22,
	RtEx_FBSkirtA1                           = 23,
	RtEx_NmSkirtB1                           = 24,
	RtEx_NmSkirtA1                           = 25,
	RtEx_SlideSkirt                          = 26,
	RtEx_FBSkirtB1                           = 27,
	RtEx_SouthSkirtQ1                        = 28,
	RtEx_NorthSkirtS1                        = 29,
	Sim_DancerSkirt                          = 30,
	RtEx_P002_Skirt                          = 31,
	RtEx_N008_SamaCoat                       = 32,
	RtEx_FtSkirt_Length2_N013                = 33,
	RtEx_SouthSkirtK1Long_P001               = 34,
	RtEx_HipsArmor_P001                      = 35,
	RtEx_SouthSkirtK1Short_P001              = 36,
	RtEx_HipsArmor_P004                      = 37,
	RtEx_SouthSkirtK1Short_P008              = 38,
	RtEx_HipsArmor_P008                      = 39,
	RtEx_FBSkirtA1_P006                      = 40,
	RtEx_RCSkirt_Length3                     = 41,
	RtEx_RCSkirt_Length4                     = 42,
	RtEx_SouthSkirtK1Long_P006               = 43,
	RtEx_NmSkirtD1                           = 44,
	RtEx_P002_DelayLegPants                  = 45,
	RtEx_BunnySkirt_P006                     = 46,
	RtEx_SwimSkirt_P006                      = 47,
	RtEx_PrinSkirt_P006                      = 48,
	RtEx_HipsArmor_P002                      = 49,
	RtEx_Bt_NimaSkirt                        = 50,
	EJackLowerDynamicBoneState_MAX           = 51,
};

// Enum JackAnimNodeRuntime.EJackUpperDynamicBoneState
// NumValues: 0x000A
enum class EJackUpperDynamicBoneState : uint8
{
	Default                                  = 0,
	Sim_CollarA                              = 1,
	Sim_RearHood                             = 2,
	RtEx_LR_ShoulderClothA1                  = 3,
	Sim_NPC_ParadeFar                        = 4,
	Sim_P001_ParadeFeather                   = 5,
	Sim_P005_ParadeFeatherBlack              = 6,
	Sim_CollarA_N008                         = 7,
	Sim_CollarE_P007                         = 8,
	EJackUpperDynamicBoneState_MAX           = 9,
};

// ScriptStruct JackAnimNodeRuntime.JackLookAtClamp
// 0x0020 (0x0020 - 0x0000)
struct FJackLookAtClamp final
{
public:
	float                                         YawLeft;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawRight;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchUp;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchDown;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawLeftRate;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawRightRate;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchUpRate;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchDownRate;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJackLookAtClamp) == 0x000004, "Wrong alignment on FJackLookAtClamp");
static_assert(sizeof(FJackLookAtClamp) == 0x000020, "Wrong size on FJackLookAtClamp");
static_assert(offsetof(FJackLookAtClamp, YawLeft) == 0x000000, "Member 'FJackLookAtClamp::YawLeft' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, YawRight) == 0x000004, "Member 'FJackLookAtClamp::YawRight' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, PitchUp) == 0x000008, "Member 'FJackLookAtClamp::PitchUp' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, PitchDown) == 0x00000C, "Member 'FJackLookAtClamp::PitchDown' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, YawLeftRate) == 0x000010, "Member 'FJackLookAtClamp::YawLeftRate' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, YawRightRate) == 0x000014, "Member 'FJackLookAtClamp::YawRightRate' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, PitchUpRate) == 0x000018, "Member 'FJackLookAtClamp::PitchUpRate' has a wrong offset!");
static_assert(offsetof(FJackLookAtClamp, PitchDownRate) == 0x00001C, "Member 'FJackLookAtClamp::PitchDownRate' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.AnimNode_JackLookAt
// 0x0100 (0x0170 - 0x0070)
struct alignas(0x10) FAnimNode_JackLookAt final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         BoneToModify;                                      // 0x0070(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LookAtBone;                                        // 0x0088(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LookAtLocation;                                    // 0x00A0(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxisOption                                   LookAtAxis;                                        // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLookAtClamp                       LookAtClamp;                                       // 0x00B0(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               LookAtOffset;                                      // 0x00D0(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RollControlRateByYawControl;                       // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackLookAtBasePose                           LookAtBasePose;                                    // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterpolationBlend                           InterpolationType;                                 // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpolationTime;                                 // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationTriggerThreashold;                    // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebug;                                      // 0x00EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x63];                                      // 0x00ED(0x0063)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         CalcLookAtBone;                                    // 0x0150(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	EAxisOption                                   CalcLookAtBoneAxis;                                // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_JackLookAt) == 0x000010, "Wrong alignment on FAnimNode_JackLookAt");
static_assert(sizeof(FAnimNode_JackLookAt) == 0x000170, "Wrong size on FAnimNode_JackLookAt");
static_assert(offsetof(FAnimNode_JackLookAt, BoneToModify) == 0x000070, "Member 'FAnimNode_JackLookAt::BoneToModify' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, LookAtBone) == 0x000088, "Member 'FAnimNode_JackLookAt::LookAtBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, LookAtLocation) == 0x0000A0, "Member 'FAnimNode_JackLookAt::LookAtLocation' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, LookAtAxis) == 0x0000AC, "Member 'FAnimNode_JackLookAt::LookAtAxis' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, LookAtClamp) == 0x0000B0, "Member 'FAnimNode_JackLookAt::LookAtClamp' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, LookAtOffset) == 0x0000D0, "Member 'FAnimNode_JackLookAt::LookAtOffset' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, RollControlRateByYawControl) == 0x0000DC, "Member 'FAnimNode_JackLookAt::RollControlRateByYawControl' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, LookAtBasePose) == 0x0000E0, "Member 'FAnimNode_JackLookAt::LookAtBasePose' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, InterpolationType) == 0x0000E1, "Member 'FAnimNode_JackLookAt::InterpolationType' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, InterpolationTime) == 0x0000E4, "Member 'FAnimNode_JackLookAt::InterpolationTime' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, InterpolationTriggerThreashold) == 0x0000E8, "Member 'FAnimNode_JackLookAt::InterpolationTriggerThreashold' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, bEnableDebug) == 0x0000EC, "Member 'FAnimNode_JackLookAt::bEnableDebug' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, CalcLookAtBone) == 0x000150, "Member 'FAnimNode_JackLookAt::CalcLookAtBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_JackLookAt, CalcLookAtBoneAxis) == 0x000168, "Member 'FAnimNode_JackLookAt::CalcLookAtBoneAxis' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.JackAnimDynamicsConstraintSetup
// 0x005C (0x005C - 0x0000)
struct FJackAnimDynamicsConstraintSetup final
{
public:
	EJackAnimPhysLinearConstraintType             LinearXLimitType;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackAnimPhysLinearConstraintType             LinearYLimitType;                                  // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackAnimPhysLinearConstraintType             LinearZLimitType;                                  // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LinearAxesMin;                                     // 0x0004(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearAxesMax;                                     // 0x0010(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackAnimPhysAngularConstraintType            AngularConstraintType;                             // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysTwistAxis                            TwistAxis;                                         // 0x001D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConeAngle;                                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularXAngle;                                     // 0x0024(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularYAngle;                                     // 0x0028(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularZAngle;                                     // 0x002C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularLimitsMin;                                  // 0x0030(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularLimitsMax;                                  // 0x003C(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimPhysTwistAxis                            AngularTargetAxis;                                 // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AngularTarget;                                     // 0x004C(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLinearFullyLocked;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJackAnimDynamicsConstraintSetup) == 0x000004, "Wrong alignment on FJackAnimDynamicsConstraintSetup");
static_assert(sizeof(FJackAnimDynamicsConstraintSetup) == 0x00005C, "Wrong size on FJackAnimDynamicsConstraintSetup");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, LinearXLimitType) == 0x000000, "Member 'FJackAnimDynamicsConstraintSetup::LinearXLimitType' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, LinearYLimitType) == 0x000001, "Member 'FJackAnimDynamicsConstraintSetup::LinearYLimitType' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, LinearZLimitType) == 0x000002, "Member 'FJackAnimDynamicsConstraintSetup::LinearZLimitType' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, LinearAxesMin) == 0x000004, "Member 'FJackAnimDynamicsConstraintSetup::LinearAxesMin' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, LinearAxesMax) == 0x000010, "Member 'FJackAnimDynamicsConstraintSetup::LinearAxesMax' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularConstraintType) == 0x00001C, "Member 'FJackAnimDynamicsConstraintSetup::AngularConstraintType' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, TwistAxis) == 0x00001D, "Member 'FJackAnimDynamicsConstraintSetup::TwistAxis' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, ConeAngle) == 0x000020, "Member 'FJackAnimDynamicsConstraintSetup::ConeAngle' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularXAngle) == 0x000024, "Member 'FJackAnimDynamicsConstraintSetup::AngularXAngle' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularYAngle) == 0x000028, "Member 'FJackAnimDynamicsConstraintSetup::AngularYAngle' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularZAngle) == 0x00002C, "Member 'FJackAnimDynamicsConstraintSetup::AngularZAngle' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularLimitsMin) == 0x000030, "Member 'FJackAnimDynamicsConstraintSetup::AngularLimitsMin' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularLimitsMax) == 0x00003C, "Member 'FJackAnimDynamicsConstraintSetup::AngularLimitsMax' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularTargetAxis) == 0x000048, "Member 'FJackAnimDynamicsConstraintSetup::AngularTargetAxis' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, AngularTarget) == 0x00004C, "Member 'FJackAnimDynamicsConstraintSetup::AngularTarget' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsConstraintSetup, bLinearFullyLocked) == 0x000058, "Member 'FJackAnimDynamicsConstraintSetup::bLinearFullyLocked' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.JackAnimDynamicsPlanarLimit
// 0x0060 (0x0060 - 0x0000)
struct FJackAnimDynamicsPlanarLimit final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DrivingBoneName;                                   // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             PlaneTransform;                                    // 0x0020(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseFinitePlane;                                   // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PlaneExtend;                                       // 0x0054(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipDrivingBoneValidation;                        // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJackAnimDynamicsPlanarLimit) == 0x000010, "Wrong alignment on FJackAnimDynamicsPlanarLimit");
static_assert(sizeof(FJackAnimDynamicsPlanarLimit) == 0x000060, "Wrong size on FJackAnimDynamicsPlanarLimit");
static_assert(offsetof(FJackAnimDynamicsPlanarLimit, DrivingBoneName) == 0x000018, "Member 'FJackAnimDynamicsPlanarLimit::DrivingBoneName' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsPlanarLimit, PlaneTransform) == 0x000020, "Member 'FJackAnimDynamicsPlanarLimit::PlaneTransform' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsPlanarLimit, bUseFinitePlane) == 0x000050, "Member 'FJackAnimDynamicsPlanarLimit::bUseFinitePlane' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsPlanarLimit, PlaneExtend) == 0x000054, "Member 'FJackAnimDynamicsPlanarLimit::PlaneExtend' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsPlanarLimit, bSkipDrivingBoneValidation) == 0x00005C, "Member 'FJackAnimDynamicsPlanarLimit::bSkipDrivingBoneValidation' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.JackAnimDynamicsSphericalLimit
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FJackAnimDynamicsSphericalLimit final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DrivingBoneName;                                   // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SphereLocalOffset;                                 // 0x0020(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LimitRadius;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackAnimDynamicsSphericalLimitType           LimitType;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipDrivingBoneValidation;                        // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJackAnimDynamicsSphericalLimit) == 0x000008, "Wrong alignment on FJackAnimDynamicsSphericalLimit");
static_assert(sizeof(FJackAnimDynamicsSphericalLimit) == 0x000038, "Wrong size on FJackAnimDynamicsSphericalLimit");
static_assert(offsetof(FJackAnimDynamicsSphericalLimit, DrivingBoneName) == 0x000018, "Member 'FJackAnimDynamicsSphericalLimit::DrivingBoneName' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsSphericalLimit, SphereLocalOffset) == 0x000020, "Member 'FJackAnimDynamicsSphericalLimit::SphereLocalOffset' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsSphericalLimit, LimitRadius) == 0x00002C, "Member 'FJackAnimDynamicsSphericalLimit::LimitRadius' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsSphericalLimit, LimitType) == 0x000030, "Member 'FJackAnimDynamicsSphericalLimit::LimitType' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsSphericalLimit, bSkipDrivingBoneValidation) == 0x000031, "Member 'FJackAnimDynamicsSphericalLimit::bSkipDrivingBoneValidation' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.JackAnimDynamicsProperties
// 0x02C8 (0x02C8 - 0x0000)
struct FJackAnimDynamicsProperties final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           MasterPose;                                        // 0x0008(0x0018)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   ExcludeMasterPose;                                 // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	EJackAnimPhysSimSpaceType                     SimulationSpace;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         RelativeSpaceBone;                                 // 0x0038(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bChain;                                            // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         BoundBone;                                         // 0x0058(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         ChainEnd;                                          // 0x0070(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtents;                                        // 0x0088(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalJointOffset;                                  // 0x0094(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScale;                                      // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableWind;                                       // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WindScale;                                         // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackWindEffectDecayRate                      WindEffectDecayRate;                               // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseWindEffectDecay;                           // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WindEffectMaxClamp;                                // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindEffectThreshold;                               // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVehicleFakeForce;                              // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseKeepBoneLength;                                // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideLinearDamping;                            // 0x00C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearDampingOverride;                             // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAngularDamping;                           // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngularDampingOverride;                            // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAngularBias;                              // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngularBiasOverride;                               // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0xC];                                       // 0x00DC(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackAnimDynamicsConstraintSetup       ConstraintSetup;                                   // 0x00E8(0x005C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUsePlanarLimit;                                   // 0x0144(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackAnimDynamicsPlanarLimit>   PlanarLimits;                                      // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseSphericalLimits;                               // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackAnimDynamicsSphericalLimit> SphericalLimits;                                   // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EAnimPhysCollisionType                        CollisionType;                                     // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SphereCollisionRadius;                             // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalForce;                                     // 0x0178(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBoneSpaceGravityMode;                          // 0x0184(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneSpaceGravityDirection;                         // 0x0188(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseConvertVelocityToExternalForce;                // 0x0194(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VelocityMulRatio;                                  // 0x0198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinClampVelocity;                                  // 0x019C(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxClampVelocity;                                  // 0x01A8(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackAnimPhysSimSpaceType                     ExternalForceSpace;                                // 0x01B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         ExternalForceRelativeBone;                         // 0x01B8(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ModifyGroupName;                                   // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E0[0xE8];                                     // 0x01E0(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJackAnimDynamicsProperties) == 0x000008, "Wrong alignment on FJackAnimDynamicsProperties");
static_assert(sizeof(FJackAnimDynamicsProperties) == 0x0002C8, "Wrong size on FJackAnimDynamicsProperties");
static_assert(offsetof(FJackAnimDynamicsProperties, MasterPose) == 0x000008, "Member 'FJackAnimDynamicsProperties::MasterPose' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ExcludeMasterPose) == 0x000020, "Member 'FJackAnimDynamicsProperties::ExcludeMasterPose' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, SimulationSpace) == 0x000030, "Member 'FJackAnimDynamicsProperties::SimulationSpace' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, RelativeSpaceBone) == 0x000038, "Member 'FJackAnimDynamicsProperties::RelativeSpaceBone' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bChain) == 0x000050, "Member 'FJackAnimDynamicsProperties::bChain' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, BoundBone) == 0x000058, "Member 'FJackAnimDynamicsProperties::BoundBone' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ChainEnd) == 0x000070, "Member 'FJackAnimDynamicsProperties::ChainEnd' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, BoxExtents) == 0x000088, "Member 'FJackAnimDynamicsProperties::BoxExtents' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, LocalJointOffset) == 0x000094, "Member 'FJackAnimDynamicsProperties::LocalJointOffset' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, GravityScale) == 0x0000A0, "Member 'FJackAnimDynamicsProperties::GravityScale' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bEnableWind) == 0x0000B0, "Member 'FJackAnimDynamicsProperties::bEnableWind' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, WindScale) == 0x0000B4, "Member 'FJackAnimDynamicsProperties::WindScale' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, WindEffectDecayRate) == 0x0000B8, "Member 'FJackAnimDynamicsProperties::WindEffectDecayRate' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bReverseWindEffectDecay) == 0x0000B9, "Member 'FJackAnimDynamicsProperties::bReverseWindEffectDecay' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, WindEffectMaxClamp) == 0x0000BC, "Member 'FJackAnimDynamicsProperties::WindEffectMaxClamp' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, WindEffectThreshold) == 0x0000C0, "Member 'FJackAnimDynamicsProperties::WindEffectThreshold' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bUseVehicleFakeForce) == 0x0000C4, "Member 'FJackAnimDynamicsProperties::bUseVehicleFakeForce' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bUseKeepBoneLength) == 0x0000C5, "Member 'FJackAnimDynamicsProperties::bUseKeepBoneLength' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bOverrideLinearDamping) == 0x0000C6, "Member 'FJackAnimDynamicsProperties::bOverrideLinearDamping' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, LinearDampingOverride) == 0x0000C8, "Member 'FJackAnimDynamicsProperties::LinearDampingOverride' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bOverrideAngularDamping) == 0x0000CC, "Member 'FJackAnimDynamicsProperties::bOverrideAngularDamping' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, AngularDampingOverride) == 0x0000D0, "Member 'FJackAnimDynamicsProperties::AngularDampingOverride' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bOverrideAngularBias) == 0x0000D4, "Member 'FJackAnimDynamicsProperties::bOverrideAngularBias' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, AngularBiasOverride) == 0x0000D8, "Member 'FJackAnimDynamicsProperties::AngularBiasOverride' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ConstraintSetup) == 0x0000E8, "Member 'FJackAnimDynamicsProperties::ConstraintSetup' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bUsePlanarLimit) == 0x000144, "Member 'FJackAnimDynamicsProperties::bUsePlanarLimit' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, PlanarLimits) == 0x000148, "Member 'FJackAnimDynamicsProperties::PlanarLimits' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bUseSphericalLimits) == 0x000158, "Member 'FJackAnimDynamicsProperties::bUseSphericalLimits' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, SphericalLimits) == 0x000160, "Member 'FJackAnimDynamicsProperties::SphericalLimits' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, CollisionType) == 0x000170, "Member 'FJackAnimDynamicsProperties::CollisionType' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, SphereCollisionRadius) == 0x000174, "Member 'FJackAnimDynamicsProperties::SphereCollisionRadius' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ExternalForce) == 0x000178, "Member 'FJackAnimDynamicsProperties::ExternalForce' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bUseBoneSpaceGravityMode) == 0x000184, "Member 'FJackAnimDynamicsProperties::bUseBoneSpaceGravityMode' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, BoneSpaceGravityDirection) == 0x000188, "Member 'FJackAnimDynamicsProperties::BoneSpaceGravityDirection' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, bUseConvertVelocityToExternalForce) == 0x000194, "Member 'FJackAnimDynamicsProperties::bUseConvertVelocityToExternalForce' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, VelocityMulRatio) == 0x000198, "Member 'FJackAnimDynamicsProperties::VelocityMulRatio' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, MinClampVelocity) == 0x00019C, "Member 'FJackAnimDynamicsProperties::MinClampVelocity' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, MaxClampVelocity) == 0x0001A8, "Member 'FJackAnimDynamicsProperties::MaxClampVelocity' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ExternalForceSpace) == 0x0001B4, "Member 'FJackAnimDynamicsProperties::ExternalForceSpace' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ExternalForceRelativeBone) == 0x0001B8, "Member 'FJackAnimDynamicsProperties::ExternalForceRelativeBone' has a wrong offset!");
static_assert(offsetof(FJackAnimDynamicsProperties, ModifyGroupName) == 0x0001D8, "Member 'FJackAnimDynamicsProperties::ModifyGroupName' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.JackAnimExp_DynamicBoneControlWeight
// 0x0008 (0x0008 - 0x0000)
struct FJackAnimExp_DynamicBoneControlWeight final
{
public:
	float                                         ExpressionDynamicControlWeight;                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimDynamicsDynamicControlWeight;                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJackAnimExp_DynamicBoneControlWeight) == 0x000004, "Wrong alignment on FJackAnimExp_DynamicBoneControlWeight");
static_assert(sizeof(FJackAnimExp_DynamicBoneControlWeight) == 0x000008, "Wrong size on FJackAnimExp_DynamicBoneControlWeight");
static_assert(offsetof(FJackAnimExp_DynamicBoneControlWeight, ExpressionDynamicControlWeight) == 0x000000, "Member 'FJackAnimExp_DynamicBoneControlWeight::ExpressionDynamicControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneControlWeight, AnimDynamicsDynamicControlWeight) == 0x000004, "Member 'FJackAnimExp_DynamicBoneControlWeight::AnimDynamicsDynamicControlWeight' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.JackAnimExp_DynamicBoneCacheState
// 0x00B8 (0x00B8 - 0x0000)
struct alignas(0x08) FJackAnimExp_DynamicBoneCacheState final
{
public:
	EJackUpperDynamicBoneState                    UpperState;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackLowerDynamicBoneState                    LowerState;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackHairDynamicBoneState                     HairState;                                         // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJackMantleDynamicBoneState                   MantleState;                                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  UpperDynamicBoneControlWeight;                     // 0x0004(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  LowerDynamicBoneControlWeight;                     // 0x000C(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  BodyExDynamicBoneControlWeight;                    // 0x0014(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  HairDynamicBoneControlWeight;                      // 0x001C(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  HairExDynamicBoneControlWeight;                    // 0x0024(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  MantleDynamicBoneControlWeight;                    // 0x002C(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FJackAnimExp_DynamicBoneControlWeight  OtherDynamicBoneControlWeight;                     // 0x0034(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x70];                                      // 0x003C(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsSkipDynamics;                                   // 0x00AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0xB];                                       // 0x00AD(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJackAnimExp_DynamicBoneCacheState) == 0x000008, "Wrong alignment on FJackAnimExp_DynamicBoneCacheState");
static_assert(sizeof(FJackAnimExp_DynamicBoneCacheState) == 0x0000B8, "Wrong size on FJackAnimExp_DynamicBoneCacheState");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, UpperState) == 0x000000, "Member 'FJackAnimExp_DynamicBoneCacheState::UpperState' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, LowerState) == 0x000001, "Member 'FJackAnimExp_DynamicBoneCacheState::LowerState' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, HairState) == 0x000002, "Member 'FJackAnimExp_DynamicBoneCacheState::HairState' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, MantleState) == 0x000003, "Member 'FJackAnimExp_DynamicBoneCacheState::MantleState' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, UpperDynamicBoneControlWeight) == 0x000004, "Member 'FJackAnimExp_DynamicBoneCacheState::UpperDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, LowerDynamicBoneControlWeight) == 0x00000C, "Member 'FJackAnimExp_DynamicBoneCacheState::LowerDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, BodyExDynamicBoneControlWeight) == 0x000014, "Member 'FJackAnimExp_DynamicBoneCacheState::BodyExDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, HairDynamicBoneControlWeight) == 0x00001C, "Member 'FJackAnimExp_DynamicBoneCacheState::HairDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, HairExDynamicBoneControlWeight) == 0x000024, "Member 'FJackAnimExp_DynamicBoneCacheState::HairExDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, MantleDynamicBoneControlWeight) == 0x00002C, "Member 'FJackAnimExp_DynamicBoneCacheState::MantleDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, OtherDynamicBoneControlWeight) == 0x000034, "Member 'FJackAnimExp_DynamicBoneCacheState::OtherDynamicBoneControlWeight' has a wrong offset!");
static_assert(offsetof(FJackAnimExp_DynamicBoneCacheState, bIsSkipDynamics) == 0x0000AC, "Member 'FJackAnimExp_DynamicBoneCacheState::bIsSkipDynamics' has a wrong offset!");

// ScriptStruct JackAnimNodeRuntime.AnimNode_JackAnimDynamics
// 0x02D8 (0x0348 - 0x0070)
struct FAnimNode_JackAnimDynamics final : public FAnimNode_SkeletalControlBase
{
public:
	class UDataTable*                             AnimDynamicsTable;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDynamicsTableMap;                              // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
