#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaCompositing

#include "Basic.hpp"

#include "MediaCompositing_structs.hpp"


namespace SDK::Params
{

// Function MediaCompositing.MediaPlaneComponent.SetMediaPlane
// 0x0038 (0x0038 - 0x0000)
struct MediaPlaneComponent_SetMediaPlane final
{
public:
	struct FMediaPlaneParameters                  Plane_0;                                           // 0x0000(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MediaPlaneComponent_SetMediaPlane) == 0x000008, "Wrong alignment on MediaPlaneComponent_SetMediaPlane");
static_assert(sizeof(MediaPlaneComponent_SetMediaPlane) == 0x000038, "Wrong size on MediaPlaneComponent_SetMediaPlane");
static_assert(offsetof(MediaPlaneComponent_SetMediaPlane, Plane_0) == 0x000000, "Member 'MediaPlaneComponent_SetMediaPlane::Plane_0' has a wrong offset!");

// Function MediaCompositing.MediaPlaneComponent.GetPlane
// 0x0038 (0x0038 - 0x0000)
struct MediaPlaneComponent_GetPlane final
{
public:
	struct FMediaPlaneParameters                  ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MediaPlaneComponent_GetPlane) == 0x000008, "Wrong alignment on MediaPlaneComponent_GetPlane");
static_assert(sizeof(MediaPlaneComponent_GetPlane) == 0x000038, "Wrong size on MediaPlaneComponent_GetPlane");
static_assert(offsetof(MediaPlaneComponent_GetPlane, ReturnValue) == 0x000000, "Member 'MediaPlaneComponent_GetPlane::ReturnValue' has a wrong offset!");

}

