#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Class MovieScene.MovieSceneSignedObject
// 0x0088 (0x00C0 - 0x0038)
class UMovieSceneSignedObject : public UObject
{
public:
	struct FGuid                                  Signature;                                         // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x78];                                      // 0x0048(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSignedObject">();
	}
	static class UMovieSceneSignedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSignedObject>();
	}
};
static_assert(alignof(UMovieSceneSignedObject) == 0x000008, "Wrong alignment on UMovieSceneSignedObject");
static_assert(sizeof(UMovieSceneSignedObject) == 0x0000C0, "Wrong size on UMovieSceneSignedObject");
static_assert(offsetof(UMovieSceneSignedObject, Signature) == 0x000038, "Member 'UMovieSceneSignedObject::Signature' has a wrong offset!");

// Class MovieScene.MovieScene
// 0x0080 (0x0140 - 0x00C0)
class UMovieScene final : public UMovieSceneSignedObject
{
public:
	TArray<struct FMovieSceneSpawnable>           Spawnables;                                        // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieScenePossessable>         Possessables;                                      // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneBinding>             ObjectBindings;                                    // 0x00E0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               MasterTracks;                                      // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMovieSceneTrack*                       CameraCutTrack;                                    // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFloatRange                            SelectionRange;                                    // 0x0108(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFloatRange                            PlaybackRange;                                     // 0x0118(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bForceFixedFrameIntervalPlayback;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedFrameInterval;                                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InTime;                                            // 0x0130(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OutTime;                                           // 0x0134(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartTime;                                         // 0x0138(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EndTime;                                           // 0x013C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene">();
	}
	static class UMovieScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene>();
	}
};
static_assert(alignof(UMovieScene) == 0x000008, "Wrong alignment on UMovieScene");
static_assert(sizeof(UMovieScene) == 0x000140, "Wrong size on UMovieScene");
static_assert(offsetof(UMovieScene, Spawnables) == 0x0000C0, "Member 'UMovieScene::Spawnables' has a wrong offset!");
static_assert(offsetof(UMovieScene, Possessables) == 0x0000D0, "Member 'UMovieScene::Possessables' has a wrong offset!");
static_assert(offsetof(UMovieScene, ObjectBindings) == 0x0000E0, "Member 'UMovieScene::ObjectBindings' has a wrong offset!");
static_assert(offsetof(UMovieScene, MasterTracks) == 0x0000F0, "Member 'UMovieScene::MasterTracks' has a wrong offset!");
static_assert(offsetof(UMovieScene, CameraCutTrack) == 0x000100, "Member 'UMovieScene::CameraCutTrack' has a wrong offset!");
static_assert(offsetof(UMovieScene, SelectionRange) == 0x000108, "Member 'UMovieScene::SelectionRange' has a wrong offset!");
static_assert(offsetof(UMovieScene, PlaybackRange) == 0x000118, "Member 'UMovieScene::PlaybackRange' has a wrong offset!");
static_assert(offsetof(UMovieScene, bForceFixedFrameIntervalPlayback) == 0x000128, "Member 'UMovieScene::bForceFixedFrameIntervalPlayback' has a wrong offset!");
static_assert(offsetof(UMovieScene, FixedFrameInterval) == 0x00012C, "Member 'UMovieScene::FixedFrameInterval' has a wrong offset!");
static_assert(offsetof(UMovieScene, InTime) == 0x000130, "Member 'UMovieScene::InTime' has a wrong offset!");
static_assert(offsetof(UMovieScene, OutTime) == 0x000134, "Member 'UMovieScene::OutTime' has a wrong offset!");
static_assert(offsetof(UMovieScene, StartTime) == 0x000138, "Member 'UMovieScene::StartTime' has a wrong offset!");
static_assert(offsetof(UMovieScene, EndTime) == 0x00013C, "Member 'UMovieScene::EndTime' has a wrong offset!");

// Class MovieScene.MovieSceneBindingOverrides
// 0x0070 (0x00A8 - 0x0038)
class UMovieSceneBindingOverrides final : public UObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieSceneBindingOverrideData> BindingData;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x58];                                      // 0x0050(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOverrides">();
	}
	static class UMovieSceneBindingOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingOverrides>();
	}
};
static_assert(alignof(UMovieSceneBindingOverrides) == 0x000008, "Wrong alignment on UMovieSceneBindingOverrides");
static_assert(sizeof(UMovieSceneBindingOverrides) == 0x0000A8, "Wrong size on UMovieSceneBindingOverrides");
static_assert(offsetof(UMovieSceneBindingOverrides, BindingData) == 0x000040, "Member 'UMovieSceneBindingOverrides::BindingData' has a wrong offset!");

// Class MovieScene.MovieSceneBindingOverridesInterface
// 0x0000 (0x0038 - 0x0038)
class IMovieSceneBindingOverridesInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOverridesInterface">();
	}
	static class IMovieSceneBindingOverridesInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOverridesInterface>();
	}
};
static_assert(alignof(IMovieSceneBindingOverridesInterface) == 0x000008, "Wrong alignment on IMovieSceneBindingOverridesInterface");
static_assert(sizeof(IMovieSceneBindingOverridesInterface) == 0x000038, "Wrong size on IMovieSceneBindingOverridesInterface");

// Class MovieScene.MovieSceneBindingOwnerInterface
// 0x0000 (0x0038 - 0x0038)
class IMovieSceneBindingOwnerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOwnerInterface">();
	}
	static class IMovieSceneBindingOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOwnerInterface>();
	}
};
static_assert(alignof(IMovieSceneBindingOwnerInterface) == 0x000008, "Wrong alignment on IMovieSceneBindingOwnerInterface");
static_assert(sizeof(IMovieSceneBindingOwnerInterface) == 0x000038, "Wrong size on IMovieSceneBindingOwnerInterface");

// Class MovieScene.MovieSceneBuiltInEasingFunction
// 0x0010 (0x0048 - 0x0038)
class UMovieSceneBuiltInEasingFunction final : public UObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneBuiltInEasing                      Type;                                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBuiltInEasingFunction">();
	}
	static class UMovieSceneBuiltInEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBuiltInEasingFunction>();
	}
};
static_assert(alignof(UMovieSceneBuiltInEasingFunction) == 0x000008, "Wrong alignment on UMovieSceneBuiltInEasingFunction");
static_assert(sizeof(UMovieSceneBuiltInEasingFunction) == 0x000048, "Wrong size on UMovieSceneBuiltInEasingFunction");
static_assert(offsetof(UMovieSceneBuiltInEasingFunction, Type) == 0x000040, "Member 'UMovieSceneBuiltInEasingFunction::Type' has a wrong offset!");

// Class MovieScene.MovieSceneEasingExternalCurve
// 0x0010 (0x0048 - 0x0038)
class UMovieSceneEasingExternalCurve final : public UObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEasingExternalCurve">();
	}
	static class UMovieSceneEasingExternalCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEasingExternalCurve>();
	}
};
static_assert(alignof(UMovieSceneEasingExternalCurve) == 0x000008, "Wrong alignment on UMovieSceneEasingExternalCurve");
static_assert(sizeof(UMovieSceneEasingExternalCurve) == 0x000048, "Wrong size on UMovieSceneEasingExternalCurve");
static_assert(offsetof(UMovieSceneEasingExternalCurve, Curve) == 0x000040, "Member 'UMovieSceneEasingExternalCurve::Curve' has a wrong offset!");

// Class MovieScene.MovieSceneEasingFunction
// 0x0000 (0x0038 - 0x0038)
class IMovieSceneEasingFunction final : public IInterface
{
public:
	float OnEvaluate(float Interp) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEasingFunction">();
	}
	static class IMovieSceneEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEasingFunction>();
	}
};
static_assert(alignof(IMovieSceneEasingFunction) == 0x000008, "Wrong alignment on IMovieSceneEasingFunction");
static_assert(sizeof(IMovieSceneEasingFunction) == 0x000038, "Wrong size on IMovieSceneEasingFunction");

// Class MovieScene.MovieSceneFolder
// 0x0048 (0x0080 - 0x0038)
class UMovieSceneFolder final : public UObject
{
public:
	class FName                                   FolderName;                                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneFolder*>              ChildFolders;                                      // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               ChildMasterTracks;                                 // 0x0050(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ChildObjectBindingStrings;                         // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFolder">();
	}
	static class UMovieSceneFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFolder>();
	}
};
static_assert(alignof(UMovieSceneFolder) == 0x000008, "Wrong alignment on UMovieSceneFolder");
static_assert(sizeof(UMovieSceneFolder) == 0x000080, "Wrong size on UMovieSceneFolder");
static_assert(offsetof(UMovieSceneFolder, FolderName) == 0x000038, "Member 'UMovieSceneFolder::FolderName' has a wrong offset!");
static_assert(offsetof(UMovieSceneFolder, ChildFolders) == 0x000040, "Member 'UMovieSceneFolder::ChildFolders' has a wrong offset!");
static_assert(offsetof(UMovieSceneFolder, ChildMasterTracks) == 0x000050, "Member 'UMovieSceneFolder::ChildMasterTracks' has a wrong offset!");
static_assert(offsetof(UMovieSceneFolder, ChildObjectBindingStrings) == 0x000060, "Member 'UMovieSceneFolder::ChildObjectBindingStrings' has a wrong offset!");

// Class MovieScene.MovieSceneTrack
// 0x0008 (0x00C8 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x08) UMovieSceneTrack : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneTrackEvalOptions            EvalOptions;                                       // 0x00C0(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrack">();
	}
	static class UMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrack>();
	}
};
#pragma pack(pop)
static_assert(alignof(UMovieSceneTrack) == 0x000008, "Wrong alignment on UMovieSceneTrack");
static_assert(sizeof(UMovieSceneTrack) == 0x0000C8, "Wrong size on UMovieSceneTrack");
static_assert(offsetof(UMovieSceneTrack, EvalOptions) == 0x0000C0, "Member 'UMovieSceneTrack::EvalOptions' has a wrong offset!");

// Class MovieScene.MovieSceneNameableTrack
// 0x0000 (0x00C8 - 0x00C8)
#pragma pack(push, 0x1)
class alignas(0x08) UMovieSceneNameableTrack : public UMovieSceneTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNameableTrack">();
	}
	static class UMovieSceneNameableTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNameableTrack>();
	}
};
#pragma pack(pop)
static_assert(alignof(UMovieSceneNameableTrack) == 0x000008, "Wrong alignment on UMovieSceneNameableTrack");
static_assert(sizeof(UMovieSceneNameableTrack) == 0x0000C8, "Wrong size on UMovieSceneNameableTrack");

// Class MovieScene.MovieSceneSection
// 0x0060 (0x0120 - 0x00C0)
class UMovieSceneSection : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneSectionEvalOptions          EvalOptions;                                       // 0x00C0(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEasingSettings              Easing;                                            // 0x00C8(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EndTime;                                           // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RowIndex;                                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OverlapPriority;                                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsActive : 1;                                     // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsLocked : 1;                                     // 0x0110(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsInfinite : 1;                                   // 0x0110(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PrerollTime;                                       // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PostrollTime;                                      // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FOptionalMovieSceneBlendType           BlendType;                                         // 0x011C(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSection">();
	}
	static class UMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSection>();
	}
};
static_assert(alignof(UMovieSceneSection) == 0x000008, "Wrong alignment on UMovieSceneSection");
static_assert(sizeof(UMovieSceneSection) == 0x000120, "Wrong size on UMovieSceneSection");
static_assert(offsetof(UMovieSceneSection, EvalOptions) == 0x0000C0, "Member 'UMovieSceneSection::EvalOptions' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, Easing) == 0x0000C8, "Member 'UMovieSceneSection::Easing' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, StartTime) == 0x000100, "Member 'UMovieSceneSection::StartTime' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, EndTime) == 0x000104, "Member 'UMovieSceneSection::EndTime' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, RowIndex) == 0x000108, "Member 'UMovieSceneSection::RowIndex' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, OverlapPriority) == 0x00010C, "Member 'UMovieSceneSection::OverlapPriority' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, PrerollTime) == 0x000114, "Member 'UMovieSceneSection::PrerollTime' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, PostrollTime) == 0x000118, "Member 'UMovieSceneSection::PostrollTime' has a wrong offset!");
static_assert(offsetof(UMovieSceneSection, BlendType) == 0x00011C, "Member 'UMovieSceneSection::BlendType' has a wrong offset!");

// Class MovieScene.MovieSceneSegmentCompilerTestTrack
// 0x0018 (0x00E0 - 0x00C8)
class UMovieSceneSegmentCompilerTestTrack final : public UMovieSceneTrack
{
public:
	bool                                          bHighPassFilter;                                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             SectionArray;                                      // 0x00D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSegmentCompilerTestTrack">();
	}
	static class UMovieSceneSegmentCompilerTestTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSegmentCompilerTestTrack>();
	}
};
static_assert(alignof(UMovieSceneSegmentCompilerTestTrack) == 0x000008, "Wrong alignment on UMovieSceneSegmentCompilerTestTrack");
static_assert(sizeof(UMovieSceneSegmentCompilerTestTrack) == 0x0000E0, "Wrong size on UMovieSceneSegmentCompilerTestTrack");
static_assert(offsetof(UMovieSceneSegmentCompilerTestTrack, bHighPassFilter) == 0x0000C8, "Member 'UMovieSceneSegmentCompilerTestTrack::bHighPassFilter' has a wrong offset!");
static_assert(offsetof(UMovieSceneSegmentCompilerTestTrack, SectionArray) == 0x0000D0, "Member 'UMovieSceneSegmentCompilerTestTrack::SectionArray' has a wrong offset!");

// Class MovieScene.MovieSceneSegmentCompilerTestSection
// 0x0000 (0x0120 - 0x0120)
class UMovieSceneSegmentCompilerTestSection final : public UMovieSceneSection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSegmentCompilerTestSection">();
	}
	static class UMovieSceneSegmentCompilerTestSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSegmentCompilerTestSection>();
	}
};
static_assert(alignof(UMovieSceneSegmentCompilerTestSection) == 0x000008, "Wrong alignment on UMovieSceneSegmentCompilerTestSection");
static_assert(sizeof(UMovieSceneSegmentCompilerTestSection) == 0x000120, "Wrong size on UMovieSceneSegmentCompilerTestSection");

// Class MovieScene.MovieSceneSequence
// 0x0280 (0x0340 - 0x00C0)
class UMovieSceneSequence : public UMovieSceneSignedObject
{
public:
	struct FCachedMovieSceneEvaluationTemplate    EvaluationTemplate;                                // 0x00C0(0x0220)(NativeAccessSpecifierPublic)
	struct FMovieSceneTrackCompilationParams      TemplateParameters;                                // 0x02E0(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UObject*, struct FCachedMovieSceneEvaluationTemplate> InstancedSubSequenceEvaluationTemplates;           // 0x02E8(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bParentContextsAreSignificant;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequence">();
	}
	static class UMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequence>();
	}
};
static_assert(alignof(UMovieSceneSequence) == 0x000008, "Wrong alignment on UMovieSceneSequence");
static_assert(sizeof(UMovieSceneSequence) == 0x000340, "Wrong size on UMovieSceneSequence");
static_assert(offsetof(UMovieSceneSequence, EvaluationTemplate) == 0x0000C0, "Member 'UMovieSceneSequence::EvaluationTemplate' has a wrong offset!");
static_assert(offsetof(UMovieSceneSequence, TemplateParameters) == 0x0002E0, "Member 'UMovieSceneSequence::TemplateParameters' has a wrong offset!");
static_assert(offsetof(UMovieSceneSequence, InstancedSubSequenceEvaluationTemplates) == 0x0002E8, "Member 'UMovieSceneSequence::InstancedSubSequenceEvaluationTemplates' has a wrong offset!");
static_assert(offsetof(UMovieSceneSequence, bParentContextsAreSignificant) == 0x000338, "Member 'UMovieSceneSequence::bParentContextsAreSignificant' has a wrong offset!");

// Class MovieScene.MovieSceneSequencePlayer
// 0x07C8 (0x0800 - 0x0038)
class UMovieSceneSequencePlayer : public UObject
{
public:
	uint8                                         Pad_38[0x348];                                     // 0x0038(0x0348)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnPlay;                                            // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnPlayReverse;                                     // 0x0390(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnStop;                                            // 0x03A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnPause;                                           // 0x03B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFinished;                                        // 0x03C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EMovieScenePlayerStatus                       Status;                                            // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bReversePlayback : 1;                              // 0x03D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPendingFirstUpdate : 1;                           // 0x03D4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_3D5[0xB];                                      // 0x03D5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    Sequence;                                          // 0x03E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeCursorPosition;                                // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartTime;                                         // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentNumLoops;                                   // 0x03F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x10];                                     // 0x03F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x0408(0x0028)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x3D0];                                    // 0x0430(0x03D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangePlaybackDirection();
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	void GoToEndAndStop();
	void JumpToPosition(float NewPlaybackPosition);
	void Pause();
	void Play();
	void PlayLooping(int32 NumLoops);
	void PlayReverse();
	void Scrub();
	void SetPlaybackPosition(float NewPlaybackPosition);
	void SetPlaybackRange(const float NewStartTime, const float NewEndTime);
	void SetPlayRate(float PlayRate);
	void StartPlayingNextTick();
	void Stop();

	float GetLength() const;
	float GetPlaybackEnd() const;
	float GetPlaybackPosition() const;
	float GetPlaybackStart() const;
	float GetPlayRate() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequencePlayer">();
	}
	static class UMovieSceneSequencePlayer* GetDefaultObj()
	{
