#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MRMesh

#include "Basic.hpp"

#include "MRMesh_structs.hpp"


namespace SDK::Params
{

// Function MRMesh.MeshReconstructorBase.ConnectMRMesh
// 0x0010 (0x0010 - 0x0000)
struct MeshReconstructorBase_ConnectMRMesh final
{
public:
	class UMRMeshComponent*                       Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMRMeshConfiguration                   ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MeshReconstructorBase_ConnectMRMesh) == 0x000008, "Wrong alignment on MeshReconstructorBase_ConnectMRMesh");
static_assert(sizeof(MeshReconstructorBase_ConnectMRMesh) == 0x000010, "Wrong size on MeshReconstructorBase_ConnectMRMesh");
static_assert(offsetof(MeshReconstructorBase_ConnectMRMesh, Mesh) == 0x000000, "Member 'MeshReconstructorBase_ConnectMRMesh::Mesh' has a wrong offset!");
static_assert(offsetof(MeshReconstructorBase_ConnectMRMesh, ReturnValue) == 0x000008, "Member 'MeshReconstructorBase_ConnectMRMesh::ReturnValue' has a wrong offset!");

// Function MRMesh.MeshReconstructorBase.IsReconstructionPaused
// 0x0001 (0x0001 - 0x0000)
struct MeshReconstructorBase_IsReconstructionPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshReconstructorBase_IsReconstructionPaused) == 0x000001, "Wrong alignment on MeshReconstructorBase_IsReconstructionPaused");
static_assert(sizeof(MeshReconstructorBase_IsReconstructionPaused) == 0x000001, "Wrong size on MeshReconstructorBase_IsReconstructionPaused");
static_assert(offsetof(MeshReconstructorBase_IsReconstructionPaused, ReturnValue) == 0x000000, "Member 'MeshReconstructorBase_IsReconstructionPaused::ReturnValue' has a wrong offset!");

// Function MRMesh.MeshReconstructorBase.IsReconstructionStarted
// 0x0001 (0x0001 - 0x0000)
struct MeshReconstructorBase_IsReconstructionStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshReconstructorBase_IsReconstructionStarted) == 0x000001, "Wrong alignment on MeshReconstructorBase_IsReconstructionStarted");
static_assert(sizeof(MeshReconstructorBase_IsReconstructionStarted) == 0x000001, "Wrong size on MeshReconstructorBase_IsReconstructionStarted");
static_assert(offsetof(MeshReconstructorBase_IsReconstructionStarted, ReturnValue) == 0x000000, "Member 'MeshReconstructorBase_IsReconstructionStarted::ReturnValue' has a wrong offset!");

// Function MRMesh.MRMeshComponent.ConnectReconstructor
// 0x0008 (0x0008 - 0x0000)
struct MRMeshComponent_ConnectReconstructor final
{
public:
	class UMeshReconstructorBase*                 Reconstructor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MRMeshComponent_ConnectReconstructor) == 0x000008, "Wrong alignment on MRMeshComponent_ConnectReconstructor");
static_assert(sizeof(MRMeshComponent_ConnectReconstructor) == 0x000008, "Wrong size on MRMeshComponent_ConnectReconstructor");
static_assert(offsetof(MRMeshComponent_ConnectReconstructor, Reconstructor) == 0x000000, "Member 'MRMeshComponent_ConnectReconstructor::Reconstructor' has a wrong offset!");

// Function MRMesh.MRMeshComponent.GetReconstructor
// 0x0008 (0x0008 - 0x0000)
struct MRMeshComponent_GetReconstructor final
{
public:
	class UMeshReconstructorBase*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MRMeshComponent_GetReconstructor) == 0x000008, "Wrong alignment on MRMeshComponent_GetReconstructor");
static_assert(sizeof(MRMeshComponent_GetReconstructor) == 0x000008, "Wrong size on MRMeshComponent_GetReconstructor");
static_assert(offsetof(MRMeshComponent_GetReconstructor, ReturnValue) == 0x000000, "Member 'MRMeshComponent_GetReconstructor::ReturnValue' has a wrong offset!");

}

