#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemSteam

#include "Basic.hpp"

#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemSteam.SteamNetConnection
// 0x0008 (0x33698 - 0x33690)
class USteamNetConnection final : public UIpConnection
{
public:
	bool                                          bIsPassthrough;                                    // 0x33690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33691[0x7];                                    // 0x33691(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamNetConnection">();
	}
	static class USteamNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamNetConnection>();
	}
};
static_assert(alignof(USteamNetConnection) == 0x000008, "Wrong alignment on USteamNetConnection");
static_assert(sizeof(USteamNetConnection) == 0x033698, "Wrong size on USteamNetConnection");
static_assert(offsetof(USteamNetConnection, bIsPassthrough) == 0x033690, "Member 'USteamNetConnection::bIsPassthrough' has a wrong offset!");

// Class OnlineSubsystemSteam.SteamNetDriver
// 0x0018 (0x04B0 - 0x0498)
class USteamNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_498[0x18];                                     // 0x0498(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamNetDriver">();
	}
	static class USteamNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamNetDriver>();
	}
};
static_assert(alignof(USteamNetDriver) == 0x000008, "Wrong alignment on USteamNetDriver");
static_assert(sizeof(USteamNetDriver) == 0x0004B0, "Wrong size on USteamNetDriver");

}

