#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OSDKModule

#include "Basic.hpp"

#include "OSDKModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OSDKModule.OSDKFutureObject.Await
// 0x0028 (0x0028 - 0x0000)
struct OSDKFutureObject_Await final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOSDKFutureFinishResult                       FinishResult;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKFutureObject_Await) == 0x000008, "Wrong alignment on OSDKFutureObject_Await");
static_assert(sizeof(OSDKFutureObject_Await) == 0x000028, "Wrong size on OSDKFutureObject_Await");
static_assert(offsetof(OSDKFutureObject_Await, WorldContextObject) == 0x000000, "Member 'OSDKFutureObject_Await::WorldContextObject' has a wrong offset!");
static_assert(offsetof(OSDKFutureObject_Await, FinishResult) == 0x000008, "Member 'OSDKFutureObject_Await::FinishResult' has a wrong offset!");
static_assert(offsetof(OSDKFutureObject_Await, LatentInfo) == 0x000010, "Member 'OSDKFutureObject_Await::LatentInfo' has a wrong offset!");

// Function OSDKModule.OSDKFutureObject.GetStatus
// 0x0001 (0x0001 - 0x0000)
struct OSDKFutureObject_GetStatus final
{
public:
	EOSDKFutureStatus                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKFutureObject_GetStatus) == 0x000001, "Wrong alignment on OSDKFutureObject_GetStatus");
static_assert(sizeof(OSDKFutureObject_GetStatus) == 0x000001, "Wrong size on OSDKFutureObject_GetStatus");
static_assert(offsetof(OSDKFutureObject_GetStatus, ReturnValue) == 0x000000, "Member 'OSDKFutureObject_GetStatus::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.BPRefreshAuthentication
// 0x0008 (0x0008 - 0x0000)
struct OSDKWebServiceClient_BPRefreshAuthentication final
{
public:
	class UOSDKFutureObject*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_BPRefreshAuthentication) == 0x000008, "Wrong alignment on OSDKWebServiceClient_BPRefreshAuthentication");
static_assert(sizeof(OSDKWebServiceClient_BPRefreshAuthentication) == 0x000008, "Wrong size on OSDKWebServiceClient_BPRefreshAuthentication");
static_assert(offsetof(OSDKWebServiceClient_BPRefreshAuthentication, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_BPRefreshAuthentication::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetAndResetStatsInfo
// 0x0008 (0x0008 - 0x0000)
struct OSDKWebServiceClient_GetAndResetStatsInfo final
{
public:
	class UOSDKStatsInfo*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetAndResetStatsInfo) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetAndResetStatsInfo");
static_assert(sizeof(OSDKWebServiceClient_GetAndResetStatsInfo) == 0x000008, "Wrong size on OSDKWebServiceClient_GetAndResetStatsInfo");
static_assert(offsetof(OSDKWebServiceClient_GetAndResetStatsInfo, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetAndResetStatsInfo::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetFeatureNames
// 0x0060 (0x0060 - 0x0000)
struct OSDKWebServiceClient_GetFeatureNames final
{
public:
	class FString                                 FeatureName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           OutFeatureNames;                                   // 0x0010(0x0050)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetFeatureNames) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetFeatureNames");
static_assert(sizeof(OSDKWebServiceClient_GetFeatureNames) == 0x000060, "Wrong size on OSDKWebServiceClient_GetFeatureNames");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureNames, FeatureName) == 0x000000, "Member 'OSDKWebServiceClient_GetFeatureNames::FeatureName' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureNames, OutFeatureNames) == 0x000010, "Member 'OSDKWebServiceClient_GetFeatureNames::OutFeatureNames' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetFeatureSetting
// 0x0030 (0x0030 - 0x0000)
struct OSDKWebServiceClient_GetFeatureSetting final
{
public:
	class FString                                 FeatureName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SettingName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetFeatureSetting) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetFeatureSetting");
static_assert(sizeof(OSDKWebServiceClient_GetFeatureSetting) == 0x000030, "Wrong size on OSDKWebServiceClient_GetFeatureSetting");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureSetting, FeatureName) == 0x000000, "Member 'OSDKWebServiceClient_GetFeatureSetting::FeatureName' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureSetting, SettingName) == 0x000010, "Member 'OSDKWebServiceClient_GetFeatureSetting::SettingName' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureSetting, ReturnValue) == 0x000020, "Member 'OSDKWebServiceClient_GetFeatureSetting::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetFeatureSettings
// 0x0060 (0x0060 - 0x0000)
struct OSDKWebServiceClient_GetFeatureSettings final
{
public:
	class FString                                 FeatureName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            OutSettings;                                       // 0x0010(0x0050)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetFeatureSettings) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetFeatureSettings");
static_assert(sizeof(OSDKWebServiceClient_GetFeatureSettings) == 0x000060, "Wrong size on OSDKWebServiceClient_GetFeatureSettings");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureSettings, FeatureName) == 0x000000, "Member 'OSDKWebServiceClient_GetFeatureSettings::FeatureName' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_GetFeatureSettings, OutSettings) == 0x000010, "Member 'OSDKWebServiceClient_GetFeatureSettings::OutSettings' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetHTTPClient
// 0x0001 (0x0001 - 0x0000)
struct OSDKWebServiceClient_GetHTTPClient final
{
public:
	struct FOSDKHTTPClient                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetHTTPClient) == 0x000001, "Wrong alignment on OSDKWebServiceClient_GetHTTPClient");
static_assert(sizeof(OSDKWebServiceClient_GetHTTPClient) == 0x000001, "Wrong size on OSDKWebServiceClient_GetHTTPClient");
static_assert(offsetof(OSDKWebServiceClient_GetHTTPClient, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetHTTPClient::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetPrimaryProfileId
// 0x0028 (0x0028 - 0x0000)
struct OSDKWebServiceClient_GetPrimaryProfileId final
{
public:
	struct FOSDKProfileId                         ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetPrimaryProfileId) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetPrimaryProfileId");
static_assert(sizeof(OSDKWebServiceClient_GetPrimaryProfileId) == 0x000028, "Wrong size on OSDKWebServiceClient_GetPrimaryProfileId");
static_assert(offsetof(OSDKWebServiceClient_GetPrimaryProfileId, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetPrimaryProfileId::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetSecondaryProfileId
// 0x0038 (0x0038 - 0x0000)
struct OSDKWebServiceClient_GetSecondaryProfileId final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSDKProfileId                         ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetSecondaryProfileId) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetSecondaryProfileId");
static_assert(sizeof(OSDKWebServiceClient_GetSecondaryProfileId) == 0x000038, "Wrong size on OSDKWebServiceClient_GetSecondaryProfileId");
static_assert(offsetof(OSDKWebServiceClient_GetSecondaryProfileId, Name_0) == 0x000000, "Member 'OSDKWebServiceClient_GetSecondaryProfileId::Name_0' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_GetSecondaryProfileId, ReturnValue) == 0x000010, "Member 'OSDKWebServiceClient_GetSecondaryProfileId::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetUserConsentsToSendingMetrics
// 0x0001 (0x0001 - 0x0000)
struct OSDKWebServiceClient_GetUserConsentsToSendingMetrics final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetUserConsentsToSendingMetrics) == 0x000001, "Wrong alignment on OSDKWebServiceClient_GetUserConsentsToSendingMetrics");
static_assert(sizeof(OSDKWebServiceClient_GetUserConsentsToSendingMetrics) == 0x000001, "Wrong size on OSDKWebServiceClient_GetUserConsentsToSendingMetrics");
static_assert(offsetof(OSDKWebServiceClient_GetUserConsentsToSendingMetrics, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetUserConsentsToSendingMetrics::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.SetDefaultHeader
// 0x0020 (0x0020 - 0x0000)
struct OSDKWebServiceClient_SetDefaultHeader final
{
public:
	class FString                                 HeaderName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeaderValue;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_SetDefaultHeader) == 0x000008, "Wrong alignment on OSDKWebServiceClient_SetDefaultHeader");
static_assert(sizeof(OSDKWebServiceClient_SetDefaultHeader) == 0x000020, "Wrong size on OSDKWebServiceClient_SetDefaultHeader");
static_assert(offsetof(OSDKWebServiceClient_SetDefaultHeader, HeaderName) == 0x000000, "Member 'OSDKWebServiceClient_SetDefaultHeader::HeaderName' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_SetDefaultHeader, HeaderValue) == 0x000010, "Member 'OSDKWebServiceClient_SetDefaultHeader::HeaderValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.SetUserConsentsToSendingMetrics
// 0x0002 (0x0002 - 0x0000)
struct OSDKWebServiceClient_SetUserConsentsToSendingMetrics final
{
public:
	bool                                          OptIn;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EmitConsentMetric;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_SetUserConsentsToSendingMetrics) == 0x000001, "Wrong alignment on OSDKWebServiceClient_SetUserConsentsToSendingMetrics");
static_assert(sizeof(OSDKWebServiceClient_SetUserConsentsToSendingMetrics) == 0x000002, "Wrong size on OSDKWebServiceClient_SetUserConsentsToSendingMetrics");
static_assert(offsetof(OSDKWebServiceClient_SetUserConsentsToSendingMetrics, OptIn) == 0x000000, "Member 'OSDKWebServiceClient_SetUserConsentsToSendingMetrics::OptIn' has a wrong offset!");
static_assert(offsetof(OSDKWebServiceClient_SetUserConsentsToSendingMetrics, EmitConsentMetric) == 0x000001, "Member 'OSDKWebServiceClient_SetUserConsentsToSendingMetrics::EmitConsentMetric' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.SetUserLanguage
// 0x0010 (0x0010 - 0x0000)
struct OSDKWebServiceClient_SetUserLanguage final
{
public:
	class FString                                 LanguageCode;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_SetUserLanguage) == 0x000008, "Wrong alignment on OSDKWebServiceClient_SetUserLanguage");
static_assert(sizeof(OSDKWebServiceClient_SetUserLanguage) == 0x000010, "Wrong size on OSDKWebServiceClient_SetUserLanguage");
static_assert(offsetof(OSDKWebServiceClient_SetUserLanguage, LanguageCode) == 0x000000, "Member 'OSDKWebServiceClient_SetUserLanguage::LanguageCode' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetClientInfo
// 0x00C8 (0x00C8 - 0x0000)
struct OSDKWebServiceClient_GetClientInfo final
{
public:
	struct FOSDKClientInfo                        ReturnValue;                                       // 0x0000(0x00C8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetClientInfo) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetClientInfo");
static_assert(sizeof(OSDKWebServiceClient_GetClientInfo) == 0x0000C8, "Wrong size on OSDKWebServiceClient_GetClientInfo");
static_assert(offsetof(OSDKWebServiceClient_GetClientInfo, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetClientInfo::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetServerInfo
// 0x0048 (0x0048 - 0x0000)
struct OSDKWebServiceClient_GetServerInfo final
{
public:
	struct FOSDKServerInfo                        ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetServerInfo) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetServerInfo");
static_assert(sizeof(OSDKWebServiceClient_GetServerInfo) == 0x000048, "Wrong size on OSDKWebServiceClient_GetServerInfo");
static_assert(offsetof(OSDKWebServiceClient_GetServerInfo, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetServerInfo::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetStatsInfo
// 0x0008 (0x0008 - 0x0000)
struct OSDKWebServiceClient_GetStatsInfo final
{
public:
	class UOSDKStatsInfo*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetStatsInfo) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetStatsInfo");
static_assert(sizeof(OSDKWebServiceClient_GetStatsInfo) == 0x000008, "Wrong size on OSDKWebServiceClient_GetStatsInfo");
static_assert(offsetof(OSDKWebServiceClient_GetStatsInfo, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetStatsInfo::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.GetUserInfo
// 0x0050 (0x0050 - 0x0000)
struct OSDKWebServiceClient_GetUserInfo final
{
public:
	struct FOSDKUserInfo                          ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_GetUserInfo) == 0x000008, "Wrong alignment on OSDKWebServiceClient_GetUserInfo");
static_assert(sizeof(OSDKWebServiceClient_GetUserInfo) == 0x000050, "Wrong size on OSDKWebServiceClient_GetUserInfo");
static_assert(offsetof(OSDKWebServiceClient_GetUserInfo, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_GetUserInfo::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKWebServiceClient.IsAuthenticated
// 0x0001 (0x0001 - 0x0000)
struct OSDKWebServiceClient_IsAuthenticated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKWebServiceClient_IsAuthenticated) == 0x000001, "Wrong alignment on OSDKWebServiceClient_IsAuthenticated");
static_assert(sizeof(OSDKWebServiceClient_IsAuthenticated) == 0x000001, "Wrong size on OSDKWebServiceClient_IsAuthenticated");
static_assert(offsetof(OSDKWebServiceClient_IsAuthenticated, ReturnValue) == 0x000000, "Member 'OSDKWebServiceClient_IsAuthenticated::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDK.BeginNewGameSession
// 0x0001 (0x0001 - 0x0000)
struct OSDK_BeginNewGameSession final
{
public:
	bool                                          bSimulationRunning;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDK_BeginNewGameSession) == 0x000001, "Wrong alignment on OSDK_BeginNewGameSession");
static_assert(sizeof(OSDK_BeginNewGameSession) == 0x000001, "Wrong size on OSDK_BeginNewGameSession");
static_assert(offsetof(OSDK_BeginNewGameSession, bSimulationRunning) == 0x000000, "Member 'OSDK_BeginNewGameSession::bSimulationRunning' has a wrong offset!");

// Function OSDKModule.OSDK.CreateWebServiceClientWithUserId
// 0x0078 (0x0078 - 0x0000)
struct OSDK_CreateWebServiceClientWithUserId final
{
public:
	struct FOSDKUserId                            UserId;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSDKClientConfig                      ClientConfig;                                      // 0x0020(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UOSDKWebServiceClient*                  ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDK_CreateWebServiceClientWithUserId) == 0x000008, "Wrong alignment on OSDK_CreateWebServiceClientWithUserId");
static_assert(sizeof(OSDK_CreateWebServiceClientWithUserId) == 0x000078, "Wrong size on OSDK_CreateWebServiceClientWithUserId");
static_assert(offsetof(OSDK_CreateWebServiceClientWithUserId, UserId) == 0x000000, "Member 'OSDK_CreateWebServiceClientWithUserId::UserId' has a wrong offset!");
static_assert(offsetof(OSDK_CreateWebServiceClientWithUserId, ClientConfig) == 0x000020, "Member 'OSDK_CreateWebServiceClientWithUserId::ClientConfig' has a wrong offset!");
static_assert(offsetof(OSDK_CreateWebServiceClientWithUserId, ReturnValue) == 0x000070, "Member 'OSDK_CreateWebServiceClientWithUserId::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDK.CreateWebServiceClientWithUserInfo
// 0x00A8 (0x00A8 - 0x0000)
struct OSDK_CreateWebServiceClientWithUserInfo final
{
public:
	struct FOSDKUserInfo                          UserInfo;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSDKClientConfig                      ClientConfig;                                      // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UOSDKWebServiceClient*                  ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDK_CreateWebServiceClientWithUserInfo) == 0x000008, "Wrong alignment on OSDK_CreateWebServiceClientWithUserInfo");
static_assert(sizeof(OSDK_CreateWebServiceClientWithUserInfo) == 0x0000A8, "Wrong size on OSDK_CreateWebServiceClientWithUserInfo");
static_assert(offsetof(OSDK_CreateWebServiceClientWithUserInfo, UserInfo) == 0x000000, "Member 'OSDK_CreateWebServiceClientWithUserInfo::UserInfo' has a wrong offset!");
static_assert(offsetof(OSDK_CreateWebServiceClientWithUserInfo, ClientConfig) == 0x000050, "Member 'OSDK_CreateWebServiceClientWithUserInfo::ClientConfig' has a wrong offset!");
static_assert(offsetof(OSDK_CreateWebServiceClientWithUserInfo, ReturnValue) == 0x0000A0, "Member 'OSDK_CreateWebServiceClientWithUserInfo::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDK.GetHardwareName
// 0x0010 (0x0010 - 0x0000)
struct OSDK_GetHardwareName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDK_GetHardwareName) == 0x000008, "Wrong alignment on OSDK_GetHardwareName");
static_assert(sizeof(OSDK_GetHardwareName) == 0x000010, "Wrong size on OSDK_GetHardwareName");
static_assert(offsetof(OSDK_GetHardwareName, ReturnValue) == 0x000000, "Member 'OSDK_GetHardwareName::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDK.GetSessionId
// 0x0010 (0x0010 - 0x0000)
struct OSDK_GetSessionId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDK_GetSessionId) == 0x000008, "Wrong alignment on OSDK_GetSessionId");
static_assert(sizeof(OSDK_GetSessionId) == 0x000010, "Wrong size on OSDK_GetSessionId");
static_assert(offsetof(OSDK_GetSessionId, ReturnValue) == 0x000000, "Member 'OSDK_GetSessionId::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDK.IsNetworkAvailable
// 0x0001 (0x0001 - 0x0000)
struct OSDK_IsNetworkAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDK_IsNetworkAvailable) == 0x000001, "Wrong alignment on OSDK_IsNetworkAvailable");
static_assert(sizeof(OSDK_IsNetworkAvailable) == 0x000001, "Wrong size on OSDK_IsNetworkAvailable");
static_assert(offsetof(OSDK_IsNetworkAvailable, ReturnValue) == 0x000000, "Member 'OSDK_IsNetworkAvailable::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKMembershipAccountClient.SetWebServiceClient
// 0x0010 (0x0010 - 0x0000)
struct OSDKMembershipAccountClient_SetWebServiceClient final
{
public:
	class UOSDKWebServiceClient*                  WebServiceClient;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOSDKMembershipAccountClient*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKMembershipAccountClient_SetWebServiceClient) == 0x000008, "Wrong alignment on OSDKMembershipAccountClient_SetWebServiceClient");
static_assert(sizeof(OSDKMembershipAccountClient_SetWebServiceClient) == 0x000010, "Wrong size on OSDKMembershipAccountClient_SetWebServiceClient");
static_assert(offsetof(OSDKMembershipAccountClient_SetWebServiceClient, WebServiceClient) == 0x000000, "Member 'OSDKMembershipAccountClient_SetWebServiceClient::WebServiceClient' has a wrong offset!");
static_assert(offsetof(OSDKMembershipAccountClient_SetWebServiceClient, ReturnValue) == 0x000008, "Member 'OSDKMembershipAccountClient_SetWebServiceClient::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKMetricsClient.SetWebServiceClient
// 0x0010 (0x0010 - 0x0000)
struct OSDKMetricsClient_SetWebServiceClient final
{
public:
	class UOSDKWebServiceClient*                  WebServiceClient;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOSDKMetricsClient*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKMetricsClient_SetWebServiceClient) == 0x000008, "Wrong alignment on OSDKMetricsClient_SetWebServiceClient");
static_assert(sizeof(OSDKMetricsClient_SetWebServiceClient) == 0x000010, "Wrong size on OSDKMetricsClient_SetWebServiceClient");
static_assert(offsetof(OSDKMetricsClient_SetWebServiceClient, WebServiceClient) == 0x000000, "Member 'OSDKMetricsClient_SetWebServiceClient::WebServiceClient' has a wrong offset!");
static_assert(offsetof(OSDKMetricsClient_SetWebServiceClient, ReturnValue) == 0x000008, "Member 'OSDKMetricsClient_SetWebServiceClient::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKPlayerItemsClient.SetWebServiceClient
// 0x0010 (0x0010 - 0x0000)
struct OSDKPlayerItemsClient_SetWebServiceClient final
{
public:
	class UOSDKWebServiceClient*                  WebServiceClient;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOSDKPlayerItemsClient*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKPlayerItemsClient_SetWebServiceClient) == 0x000008, "Wrong alignment on OSDKPlayerItemsClient_SetWebServiceClient");
static_assert(sizeof(OSDKPlayerItemsClient_SetWebServiceClient) == 0x000010, "Wrong size on OSDKPlayerItemsClient_SetWebServiceClient");
static_assert(offsetof(OSDKPlayerItemsClient_SetWebServiceClient, WebServiceClient) == 0x000000, "Member 'OSDKPlayerItemsClient_SetWebServiceClient::WebServiceClient' has a wrong offset!");
static_assert(offsetof(OSDKPlayerItemsClient_SetWebServiceClient, ReturnValue) == 0x000008, "Member 'OSDKPlayerItemsClient_SetWebServiceClient::ReturnValue' has a wrong offset!");

// Function OSDKModule.OSDKPlayerStatsClient.SetWebServiceClient
// 0x0010 (0x0010 - 0x0000)
struct OSDKPlayerStatsClient_SetWebServiceClient final
{
public:
	class UOSDKWebServiceClient*                  WebServiceClient;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOSDKPlayerStatsClient*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKPlayerStatsClient_SetWebServiceClient) == 0x000008, "Wrong alignment on OSDKPlayerStatsClient_SetWebServiceClient");
static_assert(sizeof(OSDKPlayerStatsClient_SetWebServiceClient) == 0x000010, "Wrong size on OSDKPlayerStatsClient_SetWebServiceClient");
static_assert(offsetof(OSDKPlayerStatsClient_SetWebServiceClient, WebServiceClient) == 0x000000, "Member 'OSDKPlayerStatsClient_SetWebServiceClient::WebServiceClient' has a wrong offset!");
static_assert(offsetof(OSDKPlayerStatsClient_SetWebServiceClient, ReturnValue) == 0x000008, "Member 'OSDKPlayerStatsClient_SetWebServiceClient::ReturnValue' has a wrong offset!");

}

