#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQEXSEAD

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SQEXSEAD_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SQEXSEAD.SQEXSEADSound
// 0x0388 (0x0620 - 0x0298)
class USQEXSEADSound : public USoundWave
{
public:
	bool                                          bUseKohrogiAttenuation;                            // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEADSoundBank*                     ReferenceBank;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundIndex;                                        // 0x02A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideStopFadeTime;                             // 0x02AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StopFadeTime;                                      // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUISound;                                        // 0x02B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PauseFadeTime;                                     // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAudioVolumeAttenuation;                     // 0x02BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSEADTracingOcclusion;                       // 0x02BD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             SEADOcclusionTraceChannel;                         // 0x02BE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BF[0x361];                                    // 0x02BF(0x0361)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSound">();
	}
	static class USQEXSEADSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSound>();
	}
};
static_assert(alignof(USQEXSEADSound) == 0x000008, "Wrong alignment on USQEXSEADSound");
static_assert(sizeof(USQEXSEADSound) == 0x000620, "Wrong size on USQEXSEADSound");
static_assert(offsetof(USQEXSEADSound, bUseKohrogiAttenuation) == 0x000298, "Member 'USQEXSEADSound::bUseKohrogiAttenuation' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, ReferenceBank) == 0x0002A0, "Member 'USQEXSEADSound::ReferenceBank' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, SoundIndex) == 0x0002A8, "Member 'USQEXSEADSound::SoundIndex' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bOverrideStopFadeTime) == 0x0002AC, "Member 'USQEXSEADSound::bOverrideStopFadeTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, StopFadeTime) == 0x0002B0, "Member 'USQEXSEADSound::StopFadeTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bIsUISound) == 0x0002B4, "Member 'USQEXSEADSound::bIsUISound' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, PauseFadeTime) == 0x0002B8, "Member 'USQEXSEADSound::PauseFadeTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bIgnoreAudioVolumeAttenuation) == 0x0002BC, "Member 'USQEXSEADSound::bIgnoreAudioVolumeAttenuation' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, bEnableSEADTracingOcclusion) == 0x0002BD, "Member 'USQEXSEADSound::bEnableSEADTracingOcclusion' has a wrong offset!");
static_assert(offsetof(USQEXSEADSound, SEADOcclusionTraceChannel) == 0x0002BE, "Member 'USQEXSEADSound::SEADOcclusionTraceChannel' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADInterpTrackSound
// 0x0030 (0x00E0 - 0x00B0)
class USQEXSEADInterpTrackSound : public UInterpTrackVectorBase
{
public:
	uint8                                         bTreatAsNonWorldSound : 1;                         // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSQEXSEADSoundTrackKey>         Sounds;                                            // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bPlayOnReverse : 1;                                // 0x00C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bContinueSoundOnMatineeEnd : 1;                    // 0x00C8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSuppressSubtitles : 1;                            // 0x00C8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTreatAsDialogue : 1;                              // 0x00C8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAttach : 1;                                       // 0x00C8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachGroupName;                                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADInterpTrackSound">();
	}
	static class USQEXSEADInterpTrackSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADInterpTrackSound>();
	}
};
static_assert(alignof(USQEXSEADInterpTrackSound) == 0x000008, "Wrong alignment on USQEXSEADInterpTrackSound");
static_assert(sizeof(USQEXSEADInterpTrackSound) == 0x0000E0, "Wrong size on USQEXSEADInterpTrackSound");
static_assert(offsetof(USQEXSEADInterpTrackSound, Sounds) == 0x0000B8, "Member 'USQEXSEADInterpTrackSound::Sounds' has a wrong offset!");
static_assert(offsetof(USQEXSEADInterpTrackSound, AttachGroupName) == 0x0000D0, "Member 'USQEXSEADInterpTrackSound::AttachGroupName' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADVolumeComponent
// 0x0010 (0x02F0 - 0x02E0)
class USQEXSEADVolumeComponent final : public USceneComponent
{
public:
	struct FSQEXSEADVolumeInfo                    VolumeInfo;                                        // 0x02E0(0x0001)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0xF];                                      // 0x02E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADVolumeComponent">();
	}
	static class USQEXSEADVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADVolumeComponent>();
	}
};
static_assert(alignof(USQEXSEADVolumeComponent) == 0x000008, "Wrong alignment on USQEXSEADVolumeComponent");
static_assert(sizeof(USQEXSEADVolumeComponent) == 0x0002F0, "Wrong size on USQEXSEADVolumeComponent");
static_assert(offsetof(USQEXSEADVolumeComponent, VolumeInfo) == 0x0002E0, "Member 'USQEXSEADVolumeComponent::VolumeInfo' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponentCallback
// 0x0000 (0x0038 - 0x0038)
class USQEXSEADAutoSeComponentCallback : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentCallback">();
	}
	static class USQEXSEADAutoSeComponentCallback* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentCallback>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentCallback) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentCallback");
static_assert(sizeof(USQEXSEADAutoSeComponentCallback) == 0x000038, "Wrong size on USQEXSEADAutoSeComponentCallback");

// Class SQEXSEAD.SQEXSEADSurfaceAssetReferenceTable
// 0x0010 (0x0050 - 0x0040)
class USQEXSEADSurfaceAssetReferenceTable final : public UDataAsset
{
public:
	struct FSQEXSEADSurfaceAssetReferenceTableData TableData;                                         // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADSurfaceAssetReferenceTable">();
	}
	static class USQEXSEADSurfaceAssetReferenceTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADSurfaceAssetReferenceTable>();
	}
};
static_assert(alignof(USQEXSEADSurfaceAssetReferenceTable) == 0x000008, "Wrong alignment on USQEXSEADSurfaceAssetReferenceTable");
static_assert(sizeof(USQEXSEADSurfaceAssetReferenceTable) == 0x000050, "Wrong size on USQEXSEADSurfaceAssetReferenceTable");
static_assert(offsetof(USQEXSEADSurfaceAssetReferenceTable, TableData) == 0x000040, "Member 'USQEXSEADSurfaceAssetReferenceTable::TableData' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponentCallbackDefault
// 0x0060 (0x0098 - 0x0038)
class USQEXSEADAutoSeComponentCallbackDefault : public USQEXSEADAutoSeComponentCallback
{
public:
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentCallbackDefault">();
	}
	static class USQEXSEADAutoSeComponentCallbackDefault* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentCallbackDefault>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentCallbackDefault) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentCallbackDefault");
static_assert(sizeof(USQEXSEADAutoSeComponentCallbackDefault) == 0x000098, "Wrong size on USQEXSEADAutoSeComponentCallbackDefault");

// Class SQEXSEAD.SQEXSEADAnimNotifyState_ChangeAutoSeEnable
// 0x0058 (0x0098 - 0x0040)
class USQEXSEADAnimNotifyState_ChangeAutoSeEnable final : public UAnimNotifyState
{
public:
	uint8                                         bEnableSetting : 1;                                // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	ESQEXSEADChangeAutoSeEnableNotifyEndBehavior  NotifyEndBehavior;                                 // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableContinuousDisabling : 1;                    // 0x0042(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_43[0x55];                                      // 0x0043(0x0055)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotifyState_ChangeAutoSeEnable">();
	}
	static class USQEXSEADAnimNotifyState_ChangeAutoSeEnable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotifyState_ChangeAutoSeEnable>();
	}
};
static_assert(alignof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable) == 0x000008, "Wrong alignment on USQEXSEADAnimNotifyState_ChangeAutoSeEnable");
static_assert(sizeof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable) == 0x000098, "Wrong size on USQEXSEADAnimNotifyState_ChangeAutoSeEnable");
static_assert(offsetof(USQEXSEADAnimNotifyState_ChangeAutoSeEnable, NotifyEndBehavior) == 0x000041, "Member 'USQEXSEADAnimNotifyState_ChangeAutoSeEnable::NotifyEndBehavior' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADLayoutSound
// 0x0008 (0x03A0 - 0x0398)
class ASQEXSEADLayoutSound final : public AActor
{
public:
	class USQEXSEADLayoutComponent*               LayoutComponent;                                   // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADLayoutSound">();
	}
	static class ASQEXSEADLayoutSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASQEXSEADLayoutSound>();
	}
};
static_assert(alignof(ASQEXSEADLayoutSound) == 0x000008, "Wrong alignment on ASQEXSEADLayoutSound");
static_assert(sizeof(ASQEXSEADLayoutSound) == 0x0003A0, "Wrong size on ASQEXSEADLayoutSound");
static_assert(offsetof(ASQEXSEADLayoutSound, LayoutComponent) == 0x000398, "Member 'ASQEXSEADLayoutSound::LayoutComponent' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADInterpTrackInstSound
// 0x0028 (0x0060 - 0x0038)
class USQEXSEADInterpTrackInstSound : public UInterpTrackInst
{
public:
	float                                         LastUpdatePosition;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        PlayAudioComp;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AttachTargetActor;                                 // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADInterpTrackInstSound">();
	}
	static class USQEXSEADInterpTrackInstSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADInterpTrackInstSound>();
	}
};
static_assert(alignof(USQEXSEADInterpTrackInstSound) == 0x000008, "Wrong alignment on USQEXSEADInterpTrackInstSound");
static_assert(sizeof(USQEXSEADInterpTrackInstSound) == 0x000060, "Wrong size on USQEXSEADInterpTrackInstSound");
static_assert(offsetof(USQEXSEADInterpTrackInstSound, LastUpdatePosition) == 0x000038, "Member 'USQEXSEADInterpTrackInstSound::LastUpdatePosition' has a wrong offset!");
static_assert(offsetof(USQEXSEADInterpTrackInstSound, PlayAudioComp) == 0x000040, "Member 'USQEXSEADInterpTrackInstSound::PlayAudioComp' has a wrong offset!");
static_assert(offsetof(USQEXSEADInterpTrackInstSound, AttachTargetActor) == 0x000048, "Member 'USQEXSEADInterpTrackInstSound::AttachTargetActor' has a wrong offset!");

// Class SQEXSEAD.SQEXKlangBinary
// 0x0010 (0x0050 - 0x0040)
class USQEXKlangBinary final : public UDataAsset
{
public:
	TArray<uint8>                                 DataArray;                                         // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXKlangBinary">();
	}
	static class USQEXKlangBinary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXKlangBinary>();
	}
};
static_assert(alignof(USQEXKlangBinary) == 0x000008, "Wrong alignment on USQEXKlangBinary");
static_assert(sizeof(USQEXKlangBinary) == 0x000050, "Wrong size on USQEXKlangBinary");
static_assert(offsetof(USQEXKlangBinary, DataArray) == 0x000040, "Member 'USQEXKlangBinary::DataArray' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotify_PlayAutoSe
// 0x0028 (0x0070 - 0x0048)
class USQEXSEADAnimNotify_PlayAutoSe final : public UAnimNotify
{
public:
	struct FSQEXSEADAnimNotifyPlayAutoSeParams    PlaySettings;                                      // 0x0048(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotify_PlayAutoSe">();
	}
	static class USQEXSEADAnimNotify_PlayAutoSe* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotify_PlayAutoSe>();
	}
};
static_assert(alignof(USQEXSEADAnimNotify_PlayAutoSe) == 0x000008, "Wrong alignment on USQEXSEADAnimNotify_PlayAutoSe");
static_assert(sizeof(USQEXSEADAnimNotify_PlayAutoSe) == 0x000070, "Wrong size on USQEXSEADAnimNotify_PlayAutoSe");
static_assert(offsetof(USQEXSEADAnimNotify_PlayAutoSe, PlaySettings) == 0x000048, "Member 'USQEXSEADAnimNotify_PlayAutoSe::PlaySettings' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotifyState_PlayAutoSe
// 0x0080 (0x00C0 - 0x0040)
class USQEXSEADAnimNotifyState_PlayAutoSe final : public UAnimNotifyState
{
public:
	struct FSQEXSEADAnimNotifyPlayAutoSeParams    PlaySettings;                                      // 0x0040(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FadeOutDuration;                                   // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x54];                                      // 0x006C(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotifyState_PlayAutoSe">();
	}
	static class USQEXSEADAnimNotifyState_PlayAutoSe* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotifyState_PlayAutoSe>();
	}
};
static_assert(alignof(USQEXSEADAnimNotifyState_PlayAutoSe) == 0x000008, "Wrong alignment on USQEXSEADAnimNotifyState_PlayAutoSe");
static_assert(sizeof(USQEXSEADAnimNotifyState_PlayAutoSe) == 0x0000C0, "Wrong size on USQEXSEADAnimNotifyState_PlayAutoSe");
static_assert(offsetof(USQEXSEADAnimNotifyState_PlayAutoSe, PlaySettings) == 0x000040, "Member 'USQEXSEADAnimNotifyState_PlayAutoSe::PlaySettings' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_PlayAutoSe, FadeOutDuration) == 0x000068, "Member 'USQEXSEADAnimNotifyState_PlayAutoSe::FadeOutDuration' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotify_PlaySound
// 0x0030 (0x0078 - 0x0048)
class USQEXSEADAnimNotify_PlaySound final : public UAnimNotify
{
public:
	class USoundBase*                             Sound;                                             // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundIndex;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInDuration;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFollow : 1;                                       // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachPointName;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPlayInGame : 1;                                   // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPlayInCutScene : 1;                               // 0x0070(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotify_PlaySound">();
	}
	static class USQEXSEADAnimNotify_PlaySound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotify_PlaySound>();
	}
};
static_assert(alignof(USQEXSEADAnimNotify_PlaySound) == 0x000008, "Wrong alignment on USQEXSEADAnimNotify_PlaySound");
static_assert(sizeof(USQEXSEADAnimNotify_PlaySound) == 0x000078, "Wrong size on USQEXSEADAnimNotify_PlaySound");
static_assert(offsetof(USQEXSEADAnimNotify_PlaySound, Sound) == 0x000048, "Member 'USQEXSEADAnimNotify_PlaySound::Sound' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotify_PlaySound, SoundIndex) == 0x000050, "Member 'USQEXSEADAnimNotify_PlaySound::SoundIndex' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotify_PlaySound, VolumeMultiplier) == 0x000054, "Member 'USQEXSEADAnimNotify_PlaySound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotify_PlaySound, PitchMultiplier) == 0x000058, "Member 'USQEXSEADAnimNotify_PlaySound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotify_PlaySound, FadeInDuration) == 0x00005C, "Member 'USQEXSEADAnimNotify_PlaySound::FadeInDuration' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotify_PlaySound, AttachPointName) == 0x000068, "Member 'USQEXSEADAnimNotify_PlaySound::AttachPointName' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAnimNotifyState_AttachSound
// 0x0098 (0x00D8 - 0x0040)
class USQEXSEADAnimNotifyState_AttachSound final : public UAnimNotifyState
{
public:
	class USoundBase*                             Sound;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundIndex;                                        // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartWaitTime;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInDuration;                                    // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutDuration;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFollow : 1;                                       // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachPointName;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             LoopEndSound;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopEndSoundVolumeMultiplier;                      // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopEndSoundPitchMultiplier;                       // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPlayInGame : 1;                                   // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPlayInCutScene : 1;                               // 0x0080(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_81[0x57];                                      // 0x0081(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAnimNotifyState_AttachSound">();
	}
	static class USQEXSEADAnimNotifyState_AttachSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAnimNotifyState_AttachSound>();
	}
};
static_assert(alignof(USQEXSEADAnimNotifyState_AttachSound) == 0x000008, "Wrong alignment on USQEXSEADAnimNotifyState_AttachSound");
static_assert(sizeof(USQEXSEADAnimNotifyState_AttachSound) == 0x0000D8, "Wrong size on USQEXSEADAnimNotifyState_AttachSound");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, Sound) == 0x000040, "Member 'USQEXSEADAnimNotifyState_AttachSound::Sound' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, SoundIndex) == 0x000048, "Member 'USQEXSEADAnimNotifyState_AttachSound::SoundIndex' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, VolumeMultiplier) == 0x00004C, "Member 'USQEXSEADAnimNotifyState_AttachSound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, PitchMultiplier) == 0x000050, "Member 'USQEXSEADAnimNotifyState_AttachSound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, StartWaitTime) == 0x000054, "Member 'USQEXSEADAnimNotifyState_AttachSound::StartWaitTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, FadeInDuration) == 0x000058, "Member 'USQEXSEADAnimNotifyState_AttachSound::FadeInDuration' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, FadeOutDuration) == 0x00005C, "Member 'USQEXSEADAnimNotifyState_AttachSound::FadeOutDuration' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, AttachPointName) == 0x000068, "Member 'USQEXSEADAnimNotifyState_AttachSound::AttachPointName' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, LoopEndSound) == 0x000070, "Member 'USQEXSEADAnimNotifyState_AttachSound::LoopEndSound' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, LoopEndSoundVolumeMultiplier) == 0x000078, "Member 'USQEXSEADAnimNotifyState_AttachSound::LoopEndSoundVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(USQEXSEADAnimNotifyState_AttachSound, LoopEndSoundPitchMultiplier) == 0x00007C, "Member 'USQEXSEADAnimNotifyState_AttachSound::LoopEndSoundPitchMultiplier' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAssetHolder
// 0x0010 (0x0048 - 0x0038)
class USQEXSEADAssetHolder final : public UObject
{
public:
	TArray<class UObject*>                        HoldAssets;                                        // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAssetHolder">();
	}
	static class USQEXSEADAssetHolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAssetHolder>();
	}
};
static_assert(alignof(USQEXSEADAssetHolder) == 0x000008, "Wrong alignment on USQEXSEADAssetHolder");
static_assert(sizeof(USQEXSEADAssetHolder) == 0x000048, "Wrong size on USQEXSEADAssetHolder");
static_assert(offsetof(USQEXSEADAssetHolder, HoldAssets) == 0x000038, "Member 'USQEXSEADAssetHolder::HoldAssets' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAttachSeComponent
// 0x0030 (0x0158 - 0x0128)
class USQEXSEADAttachSeComponent final : public UActorComponent
{
public:
	class USoundBase*                             SoundAsset;                                        // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0134(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFollow : 1;                                       // 0x0138(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachPointName;                                   // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        MyAudioComponent;                                  // 0x0148(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshComponent*                         MyMeshComponent;                                   // 0x0150(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAttachSeComponent">();
	}
	static class USQEXSEADAttachSeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAttachSeComponent>();
	}
};
static_assert(alignof(USQEXSEADAttachSeComponent) == 0x000008, "Wrong alignment on USQEXSEADAttachSeComponent");
static_assert(sizeof(USQEXSEADAttachSeComponent) == 0x000158, "Wrong size on USQEXSEADAttachSeComponent");
static_assert(offsetof(USQEXSEADAttachSeComponent, SoundAsset) == 0x000128, "Member 'USQEXSEADAttachSeComponent::SoundAsset' has a wrong offset!");
static_assert(offsetof(USQEXSEADAttachSeComponent, FadeInTime) == 0x000130, "Member 'USQEXSEADAttachSeComponent::FadeInTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADAttachSeComponent, FadeOutTime) == 0x000134, "Member 'USQEXSEADAttachSeComponent::FadeOutTime' has a wrong offset!");
static_assert(offsetof(USQEXSEADAttachSeComponent, AttachPointName) == 0x000140, "Member 'USQEXSEADAttachSeComponent::AttachPointName' has a wrong offset!");
static_assert(offsetof(USQEXSEADAttachSeComponent, MyAudioComponent) == 0x000148, "Member 'USQEXSEADAttachSeComponent::MyAudioComponent' has a wrong offset!");
static_assert(offsetof(USQEXSEADAttachSeComponent, MyMeshComponent) == 0x000150, "Member 'USQEXSEADAttachSeComponent::MyMeshComponent' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAudioComponent
// 0x0010 (0x0750 - 0x0740)
class USQEXSEADAudioComponent : public UAudioComponent
{
public:
	uint8                                         Pad_740[0x10];                                     // 0x0740(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAudioComponent">();
	}
	static class USQEXSEADAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAudioComponent>();
	}
};
static_assert(alignof(USQEXSEADAudioComponent) == 0x000008, "Wrong alignment on USQEXSEADAudioComponent");
static_assert(sizeof(USQEXSEADAudioComponent) == 0x000750, "Wrong size on USQEXSEADAudioComponent");

// Class SQEXSEAD.SQEXSEADAudioVolume
// 0x0088 (0x0458 - 0x03D0)
class ASQEXSEADAudioVolume final : public AVolume
{
public:
	class USQEXSEADVolumeComponent*               VolumeComponent;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnabled : 1;                                      // 0x03D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EffectPresetNumber;                                // 0x03DC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectFadeTime;                                    // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionVolume;                                 // 0x03E4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionLPF;                                    // 0x03E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InternalObstructionVolume;                         // 0x03EC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InternalObstructionLPF;                            // 0x03F0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionFadeTime;                               // 0x03F4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverbFadeTime;                                    // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseObstructionParamsSeparatePriority : 1;         // 0x0400(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionParamsSeparatePriority;                 // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     AudioVolumeSounds;                                 // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SoundFadeInTime;                                   // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundFadeInCurveNumber;                            // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoundFadeoutTime;                                  // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundFadeOutCurveNumber;                           // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupingID;                                        // 0x0428(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASQEXSEADAudioVolume*>           GroupedAudioVolumes;                               // 0x0430(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      OverridingAttenuationSettings;                     // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x10];                                     // 0x0448(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAudioVolume">();
	}
	static class ASQEXSEADAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASQEXSEADAudioVolume>();
	}
};
static_assert(alignof(ASQEXSEADAudioVolume) == 0x000008, "Wrong alignment on ASQEXSEADAudioVolume");
static_assert(sizeof(ASQEXSEADAudioVolume) == 0x000458, "Wrong size on ASQEXSEADAudioVolume");
static_assert(offsetof(ASQEXSEADAudioVolume, VolumeComponent) == 0x0003D0, "Member 'ASQEXSEADAudioVolume::VolumeComponent' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, EffectPresetNumber) == 0x0003DC, "Member 'ASQEXSEADAudioVolume::EffectPresetNumber' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, EffectFadeTime) == 0x0003E0, "Member 'ASQEXSEADAudioVolume::EffectFadeTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionVolume) == 0x0003E4, "Member 'ASQEXSEADAudioVolume::ObstructionVolume' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionLPF) == 0x0003E8, "Member 'ASQEXSEADAudioVolume::ObstructionLPF' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, InternalObstructionVolume) == 0x0003EC, "Member 'ASQEXSEADAudioVolume::InternalObstructionVolume' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, InternalObstructionLPF) == 0x0003F0, "Member 'ASQEXSEADAudioVolume::InternalObstructionLPF' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionFadeTime) == 0x0003F4, "Member 'ASQEXSEADAudioVolume::ObstructionFadeTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ReverbFadeTime) == 0x0003F8, "Member 'ASQEXSEADAudioVolume::ReverbFadeTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, Priority) == 0x0003FC, "Member 'ASQEXSEADAudioVolume::Priority' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, ObstructionParamsSeparatePriority) == 0x000404, "Member 'ASQEXSEADAudioVolume::ObstructionParamsSeparatePriority' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, AudioVolumeSounds) == 0x000408, "Member 'ASQEXSEADAudioVolume::AudioVolumeSounds' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeInTime) == 0x000418, "Member 'ASQEXSEADAudioVolume::SoundFadeInTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeInCurveNumber) == 0x00041C, "Member 'ASQEXSEADAudioVolume::SoundFadeInCurveNumber' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeoutTime) == 0x000420, "Member 'ASQEXSEADAudioVolume::SoundFadeoutTime' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, SoundFadeOutCurveNumber) == 0x000424, "Member 'ASQEXSEADAudioVolume::SoundFadeOutCurveNumber' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, GroupingID) == 0x000428, "Member 'ASQEXSEADAudioVolume::GroupingID' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, GroupedAudioVolumes) == 0x000430, "Member 'ASQEXSEADAudioVolume::GroupedAudioVolumes' has a wrong offset!");
static_assert(offsetof(ASQEXSEADAudioVolume, OverridingAttenuationSettings) == 0x000440, "Member 'ASQEXSEADAudioVolume::OverridingAttenuationSettings' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponentAssetTable
// 0x0C30 (0x0C70 - 0x0040)
class USQEXSEADAutoSeComponentAssetTable final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeComponentAssetTablePerSurface PerSurfaceInfos[0x3F];                             // 0x0040(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FSQEXSEADAutoSeComponentAssetTableNonSurface NonSurfaceInfos;                                   // 0x0C10(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FSQEXSEADSurfaceAssetReferenceTableData AuxSurfaceAssetTable;                              // 0x0C60(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentAssetTable">();
	}
	static class USQEXSEADAutoSeComponentAssetTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentAssetTable>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentAssetTable) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentAssetTable");
static_assert(sizeof(USQEXSEADAutoSeComponentAssetTable) == 0x000C70, "Wrong size on USQEXSEADAutoSeComponentAssetTable");
static_assert(offsetof(USQEXSEADAutoSeComponentAssetTable, PerSurfaceInfos) == 0x000040, "Member 'USQEXSEADAutoSeComponentAssetTable::PerSurfaceInfos' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponentAssetTable, NonSurfaceInfos) == 0x000C10, "Member 'USQEXSEADAutoSeComponentAssetTable::NonSurfaceInfos' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponentAssetTable, AuxSurfaceAssetTable) == 0x000C60, "Member 'USQEXSEADAutoSeComponentAssetTable::AuxSurfaceAssetTable' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponentSetting
// 0x0058 (0x0098 - 0x0040)
class USQEXSEADAutoSeComponentSetting final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeComponentInitParams     InitParams;                                        // 0x0040(0x0058)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponentSetting">();
	}
	static class USQEXSEADAutoSeComponentSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponentSetting>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponentSetting) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponentSetting");
static_assert(sizeof(USQEXSEADAutoSeComponentSetting) == 0x000098, "Wrong size on USQEXSEADAutoSeComponentSetting");
static_assert(offsetof(USQEXSEADAutoSeComponentSetting, InitParams) == 0x000040, "Member 'USQEXSEADAutoSeComponentSetting::InitParams' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeDetectionSetting
// 0x0080 (0x00C0 - 0x0040)
class USQEXSEADAutoSeDetectionSetting final : public UDataAsset
{
public:
	struct FSQEXSEADAutoSeAnalyzerSetting         AnalyzerSetting;                                   // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseAnalyzerSettingForMotionOnlyMode;              // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQEXSEADAutoSeAnalyzerSetting         AnalyzerSettingForMotionOnlyMode;                  // 0x005C(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSQEXSEADAutoSeDetectorSettingFootStep DetectorSettingFootStep;                           // 0x0074(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSQEXSEADAutoSeDetectorSettingRustle   DetectorSettingRustle;                             // 0x0084(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSQEXSEADAutoSeDetectorSettingSwing    DetectorSettingSwing;                              // 0x00AC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeDetectionSetting">();
	}
	static class USQEXSEADAutoSeDetectionSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeDetectionSetting>();
	}
};
static_assert(alignof(USQEXSEADAutoSeDetectionSetting) == 0x000008, "Wrong alignment on USQEXSEADAutoSeDetectionSetting");
static_assert(sizeof(USQEXSEADAutoSeDetectionSetting) == 0x0000C0, "Wrong size on USQEXSEADAutoSeDetectionSetting");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, AnalyzerSetting) == 0x000040, "Member 'USQEXSEADAutoSeDetectionSetting::AnalyzerSetting' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, bUseAnalyzerSettingForMotionOnlyMode) == 0x000058, "Member 'USQEXSEADAutoSeDetectionSetting::bUseAnalyzerSettingForMotionOnlyMode' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, AnalyzerSettingForMotionOnlyMode) == 0x00005C, "Member 'USQEXSEADAutoSeDetectionSetting::AnalyzerSettingForMotionOnlyMode' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, DetectorSettingFootStep) == 0x000074, "Member 'USQEXSEADAutoSeDetectionSetting::DetectorSettingFootStep' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, DetectorSettingRustle) == 0x000084, "Member 'USQEXSEADAutoSeDetectionSetting::DetectorSettingRustle' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeDetectionSetting, DetectorSettingSwing) == 0x0000AC, "Member 'USQEXSEADAutoSeDetectionSetting::DetectorSettingSwing' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADAutoSeComponent
// 0x00A8 (0x01D0 - 0x0128)
class USQEXSEADAutoSeComponent final : public UActorComponent
{
public:
	class USQEXSEADAutoSeComponentCallback*       AutoSeCallback;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeComponentSetting*        SettingData;                                       // 0x0130(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeComponentAssetTable*     AssetTable;                                        // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQEXSEADAutoSeDetectionSetting*        DetectionSetting;                                  // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CachedMeshReference;                               // 0x0150(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPawnMovementComponent*                 CachedMovementComponent;                           // 0x0158(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x70];                                     // 0x0160(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADAutoSeComponent">();
	}
	static class USQEXSEADAutoSeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADAutoSeComponent>();
	}
};
static_assert(alignof(USQEXSEADAutoSeComponent) == 0x000008, "Wrong alignment on USQEXSEADAutoSeComponent");
static_assert(sizeof(USQEXSEADAutoSeComponent) == 0x0001D0, "Wrong size on USQEXSEADAutoSeComponent");
static_assert(offsetof(USQEXSEADAutoSeComponent, AutoSeCallback) == 0x000128, "Member 'USQEXSEADAutoSeComponent::AutoSeCallback' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, SettingData) == 0x000130, "Member 'USQEXSEADAutoSeComponent::SettingData' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, AssetTable) == 0x000138, "Member 'USQEXSEADAutoSeComponent::AssetTable' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, DetectionSetting) == 0x000140, "Member 'USQEXSEADAutoSeComponent::DetectionSetting' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, CachedMeshReference) == 0x000150, "Member 'USQEXSEADAutoSeComponent::CachedMeshReference' has a wrong offset!");
static_assert(offsetof(USQEXSEADAutoSeComponent, CachedMovementComponent) == 0x000158, "Member 'USQEXSEADAutoSeComponent::CachedMovementComponent' has a wrong offset!");

// Class SQEXSEAD.SQEXSEAD_BGM
// 0x0028 (0x0060 - 0x0038)
class USQEXSEAD_BGM final : public UObject
{
public:
	class USQEXSEADSound*                         Sound_;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEAD_BGM">();
	}
	static class USQEXSEAD_BGM* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEAD_BGM>();
	}
};
static_assert(alignof(USQEXSEAD_BGM) == 0x000008, "Wrong alignment on USQEXSEAD_BGM");
static_assert(sizeof(USQEXSEAD_BGM) == 0x000060, "Wrong size on USQEXSEAD_BGM");
static_assert(offsetof(USQEXSEAD_BGM, Sound_) == 0x000038, "Member 'USQEXSEAD_BGM::Sound_' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADBGMManager
// 0x0110 (0x0148 - 0x0038)
class USQEXSEADBGMManager final : public UObject
{
public:
	TArray<class USQEXSEADBGMSlot*>               Slots_;                                            // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class USQEXSEADBGMSlotController*>     Controllers_;                                      // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0xE0];                                      // 0x0058(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSQEXSEAD_BGMSlotSetting>       SlotSettings_;                                     // 0x0138(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADBGMManager">();
	}
	static class USQEXSEADBGMManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADBGMManager>();
	}
};
static_assert(alignof(USQEXSEADBGMManager) == 0x000008, "Wrong alignment on USQEXSEADBGMManager");
static_assert(sizeof(USQEXSEADBGMManager) == 0x000148, "Wrong size on USQEXSEADBGMManager");
static_assert(offsetof(USQEXSEADBGMManager, Slots_) == 0x000038, "Member 'USQEXSEADBGMManager::Slots_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMManager, Controllers_) == 0x000048, "Member 'USQEXSEADBGMManager::Controllers_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMManager, SlotSettings_) == 0x000138, "Member 'USQEXSEADBGMManager::SlotSettings_' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADBGMSlot
// 0x0068 (0x00A0 - 0x0038)
class USQEXSEADBGMSlot final : public UObject
{
public:
	ESQEXSEAD_BGMState                            State;                                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x37];                                      // 0x0039(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQEXSEAD_BGMOptions                   DefaultOptions_;                                   // 0x0070(0x001C)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEXSEAD_BGM*                          BGM_;                                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USQEXSEAD_BGM*                          PrevBGM_;                                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SQEXSEADBGMSlot">();
	}
	static class USQEXSEADBGMSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQEXSEADBGMSlot>();
	}
};
static_assert(alignof(USQEXSEADBGMSlot) == 0x000008, "Wrong alignment on USQEXSEADBGMSlot");
static_assert(sizeof(USQEXSEADBGMSlot) == 0x0000A0, "Wrong size on USQEXSEADBGMSlot");
static_assert(offsetof(USQEXSEADBGMSlot, State) == 0x000038, "Member 'USQEXSEADBGMSlot::State' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMSlot, DefaultOptions_) == 0x000070, "Member 'USQEXSEADBGMSlot::DefaultOptions_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMSlot, BGM_) == 0x000090, "Member 'USQEXSEADBGMSlot::BGM_' has a wrong offset!");
static_assert(offsetof(USQEXSEADBGMSlot, PrevBGM_) == 0x000098, "Member 'USQEXSEADBGMSlot::PrevBGM_' has a wrong offset!");

// Class SQEXSEAD.SQEXSEADBGMSlotController
// 0x0008 (0x0040 - 0x0038)
class USQEXSEADBGMSlotController final : public UObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsPlaying();
	void Play();
	void Reset();
	void Set(class USoundBase* Sound);
	void SetMode(int32 Index_0);
