#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DT_CharaLookByMaps

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct STRUCT_DT_CharaLookByMaps.STRUCT_DT_CharaLookByMaps
// 0x000C (0x000C - 0x0000)
struct FSTRUCT_DT_CharaLookByMaps final
{
public:
	float                                         BaseColorScale_4_4D752C764B845DAE355CAFB6E49ECD2D; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseColorSaturation_7_42644514431320040689E094649A9366; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AOScale_8_5960C9E74EBC45CC5272B18859439A15;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_DT_CharaLookByMaps) == 0x000004, "Wrong alignment on FSTRUCT_DT_CharaLookByMaps");
static_assert(sizeof(FSTRUCT_DT_CharaLookByMaps) == 0x00000C, "Wrong size on FSTRUCT_DT_CharaLookByMaps");
static_assert(offsetof(FSTRUCT_DT_CharaLookByMaps, BaseColorScale_4_4D752C764B845DAE355CAFB6E49ECD2D) == 0x000000, "Member 'FSTRUCT_DT_CharaLookByMaps::BaseColorScale_4_4D752C764B845DAE355CAFB6E49ECD2D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_CharaLookByMaps, BaseColorSaturation_7_42644514431320040689E094649A9366) == 0x000004, "Member 'FSTRUCT_DT_CharaLookByMaps::BaseColorSaturation_7_42644514431320040689E094649A9366' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_CharaLookByMaps, AOScale_8_5960C9E74EBC45CC5272B18859439A15) == 0x000008, "Member 'FSTRUCT_DT_CharaLookByMaps::AOScale_8_5960C9E74EBC45CC5272B18859439A15' has a wrong offset!");

}

