#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_NpcMoveParam

#include "Basic.hpp"

#include "STRUCT_TalkParamCustom_structs.hpp"
#include "STRUCT_NpcLookatParam_structs.hpp"


namespace SDK
{

// ScriptStruct STRUCT_NpcMoveParam.STRUCT_NpcMoveParam
// 0x0060 (0x0060 - 0x0000)
struct FSTRUCT_NpcMoveParam final
{
public:
	TArray<class AActor*>                         MoveTarget_3_C0E0BB5944801C8A46CDE48F8F7BE1DD;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSTRUCT_TalkParamCustom                MoveTalk_15_A0B4CB3B404EF29324D7EFA77C3F62C1;      // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MoveAnim_6_6AAD6F164826FCB9F34C4C934C7B3EE9;       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeed_12_3B2349B54FBBDFA22ECC57A3703A6D02;     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_NpcLookatParam                 LookatParam_26_C356FA224CB0FD5260F5DEB804AB88D2;   // 0x0048(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_NpcMoveParam) == 0x000008, "Wrong alignment on FSTRUCT_NpcMoveParam");
static_assert(sizeof(FSTRUCT_NpcMoveParam) == 0x000060, "Wrong size on FSTRUCT_NpcMoveParam");
static_assert(offsetof(FSTRUCT_NpcMoveParam, MoveTarget_3_C0E0BB5944801C8A46CDE48F8F7BE1DD) == 0x000000, "Member 'FSTRUCT_NpcMoveParam::MoveTarget_3_C0E0BB5944801C8A46CDE48F8F7BE1DD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_NpcMoveParam, MoveTalk_15_A0B4CB3B404EF29324D7EFA77C3F62C1) == 0x000010, "Member 'FSTRUCT_NpcMoveParam::MoveTalk_15_A0B4CB3B404EF29324D7EFA77C3F62C1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_NpcMoveParam, MoveAnim_6_6AAD6F164826FCB9F34C4C934C7B3EE9) == 0x000038, "Member 'FSTRUCT_NpcMoveParam::MoveAnim_6_6AAD6F164826FCB9F34C4C934C7B3EE9' has a wrong offset!");
static_assert(offsetof(FSTRUCT_NpcMoveParam, MoveSpeed_12_3B2349B54FBBDFA22ECC57A3703A6D02) == 0x000040, "Member 'FSTRUCT_NpcMoveParam::MoveSpeed_12_3B2349B54FBBDFA22ECC57A3703A6D02' has a wrong offset!");
static_assert(offsetof(FSTRUCT_NpcMoveParam, LookatParam_26_C356FA224CB0FD5260F5DEB804AB88D2) == 0x000048, "Member 'FSTRUCT_NpcMoveParam::LookatParam_26_C356FA224CB0FD5260F5DEB804AB88D2' has a wrong offset!");

}

