#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DebugArrow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DebugArrow.STRUCT_DebugArrow
// 0x0040 (0x0040 - 0x0000)
struct FSTRUCT_DebugArrow final
{
public:
	struct FVector                                LineStart_4_9D64D1C64B204C721D30F890F9DFEC34;      // 0x0000(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LineEnd_5_71A2A4784A9D5AF16F2551A1C92DCB54;        // 0x000C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ArrowSize_8_94396FCA4D8084AB89B635954ECB87E8;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LineColor_11_AD8192F04F35873D049EA489462137C2;     // 0x001C(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayID_14_2E9A7AC5402AFCB0588B0A9CAE73D8F5;     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_DebugArrow) == 0x000008, "Wrong alignment on FSTRUCT_DebugArrow");
static_assert(sizeof(FSTRUCT_DebugArrow) == 0x000040, "Wrong size on FSTRUCT_DebugArrow");
static_assert(offsetof(FSTRUCT_DebugArrow, LineStart_4_9D64D1C64B204C721D30F890F9DFEC34) == 0x000000, "Member 'FSTRUCT_DebugArrow::LineStart_4_9D64D1C64B204C721D30F890F9DFEC34' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DebugArrow, LineEnd_5_71A2A4784A9D5AF16F2551A1C92DCB54) == 0x00000C, "Member 'FSTRUCT_DebugArrow::LineEnd_5_71A2A4784A9D5AF16F2551A1C92DCB54' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DebugArrow, ArrowSize_8_94396FCA4D8084AB89B635954ECB87E8) == 0x000018, "Member 'FSTRUCT_DebugArrow::ArrowSize_8_94396FCA4D8084AB89B635954ECB87E8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DebugArrow, LineColor_11_AD8192F04F35873D049EA489462137C2) == 0x00001C, "Member 'FSTRUCT_DebugArrow::LineColor_11_AD8192F04F35873D049EA489462137C2' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DebugArrow, DisplayID_14_2E9A7AC5402AFCB0588B0A9CAE73D8F5) == 0x000030, "Member 'FSTRUCT_DebugArrow::DisplayID_14_2E9A7AC5402AFCB0588B0A9CAE73D8F5' has a wrong offset!");

}

