#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_TalkParamCustom

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK
{

// ScriptStruct STRUCT_TalkParamCustom.STRUCT_TalkParamCustom
// 0x0028 (0x0028 - 0x0000)
struct FSTRUCT_TalkParamCustom final
{
public:
	EJackNPCTalkGazeMode                          GazeMode_2_3F1A2B664D8A2FD4716932A7FD535160;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseCommonTalkCamera_4_A1A65FC94DCD8A30E50C6A82E24F7D83; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SquenceEventName_7_C0FA082D427A02736141E78C63F34C23; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FukidasiID_11_DB66E70E46F89930280A0FB988F4D06E;    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FukidasiOnceOnly_12_51E959514AA5CB265E0D2F83D76FD812; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSTRUCT_TalkParamCustom) == 0x000008, "Wrong alignment on FSTRUCT_TalkParamCustom");
static_assert(sizeof(FSTRUCT_TalkParamCustom) == 0x000028, "Wrong size on FSTRUCT_TalkParamCustom");
static_assert(offsetof(FSTRUCT_TalkParamCustom, GazeMode_2_3F1A2B664D8A2FD4716932A7FD535160) == 0x000000, "Member 'FSTRUCT_TalkParamCustom::GazeMode_2_3F1A2B664D8A2FD4716932A7FD535160' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TalkParamCustom, UseCommonTalkCamera_4_A1A65FC94DCD8A30E50C6A82E24F7D83) == 0x000001, "Member 'FSTRUCT_TalkParamCustom::UseCommonTalkCamera_4_A1A65FC94DCD8A30E50C6A82E24F7D83' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TalkParamCustom, SquenceEventName_7_C0FA082D427A02736141E78C63F34C23) == 0x000008, "Member 'FSTRUCT_TalkParamCustom::SquenceEventName_7_C0FA082D427A02736141E78C63F34C23' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TalkParamCustom, FukidasiID_11_DB66E70E46F89930280A0FB988F4D06E) == 0x000010, "Member 'FSTRUCT_TalkParamCustom::FukidasiID_11_DB66E70E46F89930280A0FB988F4D06E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TalkParamCustom, FukidasiOnceOnly_12_51E959514AA5CB265E0D2F83D76FD812) == 0x000020, "Member 'FSTRUCT_TalkParamCustom::FukidasiOnceOnly_12_51E959514AA5CB265E0D2F83D76FD812' has a wrong offset!");

}

