#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MoveAndAnimParam

#include "Basic.hpp"

#include "STRUCT_NpcLookatParam_structs.hpp"
#include "STRUCT_NpcMoveParam_structs.hpp"
#include "STRUCT_TalkParamCustom_structs.hpp"


namespace SDK
{

// ScriptStruct STRUCT_MoveAndAnimParam.STRUCT_MoveAndAnimParam
// 0x00C0 (0x00C0 - 0x0000)
struct FSTRUCT_MoveAndAnimParam final
{
public:
	struct FSTRUCT_NpcMoveParam                   MoveParam_2_45EE6CF94A0C2BD0E88DDAAD9C7FA904;      // 0x0000(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Angle_11_212D8BFA448847078F77CEB78465913D;         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           PlayAnim_21_663C052E431B55AD2E245CBC0A047751;      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Minute_20_91622F104653B22226683BA0AD36EE31;        // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           EndAnim_8_82162FAA493FCBC3AC2E1BBE96E4AFCE;        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_TalkParamCustom                AnimTalkParam_14_FEDFD37646C07409E14D0892D8A82307; // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSTRUCT_NpcLookatParam                 AnimLookatParam_17_C0287073482ED233708550B71F58D680; // 0x00A8(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_MoveAndAnimParam) == 0x000008, "Wrong alignment on FSTRUCT_MoveAndAnimParam");
static_assert(sizeof(FSTRUCT_MoveAndAnimParam) == 0x0000C0, "Wrong size on FSTRUCT_MoveAndAnimParam");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, MoveParam_2_45EE6CF94A0C2BD0E88DDAAD9C7FA904) == 0x000000, "Member 'FSTRUCT_MoveAndAnimParam::MoveParam_2_45EE6CF94A0C2BD0E88DDAAD9C7FA904' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, Angle_11_212D8BFA448847078F77CEB78465913D) == 0x000060, "Member 'FSTRUCT_MoveAndAnimParam::Angle_11_212D8BFA448847078F77CEB78465913D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, PlayAnim_21_663C052E431B55AD2E245CBC0A047751) == 0x000068, "Member 'FSTRUCT_MoveAndAnimParam::PlayAnim_21_663C052E431B55AD2E245CBC0A047751' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, Minute_20_91622F104653B22226683BA0AD36EE31) == 0x000070, "Member 'FSTRUCT_MoveAndAnimParam::Minute_20_91622F104653B22226683BA0AD36EE31' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, EndAnim_8_82162FAA493FCBC3AC2E1BBE96E4AFCE) == 0x000078, "Member 'FSTRUCT_MoveAndAnimParam::EndAnim_8_82162FAA493FCBC3AC2E1BBE96E4AFCE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, AnimTalkParam_14_FEDFD37646C07409E14D0892D8A82307) == 0x000080, "Member 'FSTRUCT_MoveAndAnimParam::AnimTalkParam_14_FEDFD37646C07409E14D0892D8A82307' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveAndAnimParam, AnimLookatParam_17_C0287073482ED233708550B71F58D680) == 0x0000A8, "Member 'FSTRUCT_MoveAndAnimParam::AnimLookatParam_17_C0287073482ED233708550B71F58D680' has a wrong offset!");

}

