#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_TimeChangeFogParam

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct STRUCT_TimeChangeFogParam.STRUCT_TimeChangeFogParam
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_TimeChangeFogParam final
{
public:
	class UClass*                                 FogClass_3_16040ADA474694661D4DD7AF8FC87E53;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZOffset_12_4AE7CDA84A5A5FC06E077D98DD831A10;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthEdgeDistance_9_B1AB1D474DC345CA1DF6FB872D2A0655; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightFalloffOffset_17_743576784802BC5F239C118E3D494260; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistanceOffset_19_1F98F7B344818DC06FAA8E9994801CFC; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_TimeChangeFogParam) == 0x000008, "Wrong alignment on FSTRUCT_TimeChangeFogParam");
static_assert(sizeof(FSTRUCT_TimeChangeFogParam) == 0x000018, "Wrong size on FSTRUCT_TimeChangeFogParam");
static_assert(offsetof(FSTRUCT_TimeChangeFogParam, FogClass_3_16040ADA474694661D4DD7AF8FC87E53) == 0x000000, "Member 'FSTRUCT_TimeChangeFogParam::FogClass_3_16040ADA474694661D4DD7AF8FC87E53' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TimeChangeFogParam, ZOffset_12_4AE7CDA84A5A5FC06E077D98DD831A10) == 0x000008, "Member 'FSTRUCT_TimeChangeFogParam::ZOffset_12_4AE7CDA84A5A5FC06E077D98DD831A10' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TimeChangeFogParam, DepthEdgeDistance_9_B1AB1D474DC345CA1DF6FB872D2A0655) == 0x00000C, "Member 'FSTRUCT_TimeChangeFogParam::DepthEdgeDistance_9_B1AB1D474DC345CA1DF6FB872D2A0655' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TimeChangeFogParam, HeightFalloffOffset_17_743576784802BC5F239C118E3D494260) == 0x000010, "Member 'FSTRUCT_TimeChangeFogParam::HeightFalloffOffset_17_743576784802BC5F239C118E3D494260' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TimeChangeFogParam, StartDistanceOffset_19_1F98F7B344818DC06FAA8E9994801CFC) == 0x000014, "Member 'FSTRUCT_TimeChangeFogParam::StartDistanceOffset_19_1F98F7B344818DC06FAA8E9994801CFC' has a wrong offset!");

}

