#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DT_AutoCameraCollision

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct STRUCT_DT_AutoCameraCollision.STRUCT_DT_AutoCameraCollision
// 0x0010 (0x0010 - 0x0000)
struct FSTRUCT_DT_AutoCameraCollision final
{
public:
	float                                         Radius_8_6E7F123F43E47FDAC97F7D96B1128B36;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XOffset_12_C4BD7A8F45888D8A75B47F9DEFA81B9B;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YOffset_13_2BCFAF374A63EEB24FDCFAAAF0E6E439;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZOffset_5_07F964524F4A951976768281726B43BC;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_DT_AutoCameraCollision) == 0x000004, "Wrong alignment on FSTRUCT_DT_AutoCameraCollision");
static_assert(sizeof(FSTRUCT_DT_AutoCameraCollision) == 0x000010, "Wrong size on FSTRUCT_DT_AutoCameraCollision");
static_assert(offsetof(FSTRUCT_DT_AutoCameraCollision, Radius_8_6E7F123F43E47FDAC97F7D96B1128B36) == 0x000000, "Member 'FSTRUCT_DT_AutoCameraCollision::Radius_8_6E7F123F43E47FDAC97F7D96B1128B36' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_AutoCameraCollision, XOffset_12_C4BD7A8F45888D8A75B47F9DEFA81B9B) == 0x000004, "Member 'FSTRUCT_DT_AutoCameraCollision::XOffset_12_C4BD7A8F45888D8A75B47F9DEFA81B9B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_AutoCameraCollision, YOffset_13_2BCFAF374A63EEB24FDCFAAAF0E6E439) == 0x000008, "Member 'FSTRUCT_DT_AutoCameraCollision::YOffset_13_2BCFAF374A63EEB24FDCFAAAF0E6E439' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_AutoCameraCollision, ZOffset_5_07F964524F4A951976768281726B43BC) == 0x00000C, "Member 'FSTRUCT_DT_AutoCameraCollision::ZOffset_5_07F964524F4A951976768281726B43BC' has a wrong offset!");

}

