#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_NpcLookatParam

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct STRUCT_NpcLookatParam.STRUCT_NpcLookatParam
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_NpcLookatParam final
{
public:
	class AActor*                                 LookatTarget_2_083DEC1649DBFC78866A728AEFE684B0;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LookatSocket_6_2090FB184D0D02EF3DB392B72DD3EAE6;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SingleNode_8_143D202343CAA9DC1D3FD4B0CCB62F64;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSTRUCT_NpcLookatParam) == 0x000008, "Wrong alignment on FSTRUCT_NpcLookatParam");
static_assert(sizeof(FSTRUCT_NpcLookatParam) == 0x000018, "Wrong size on FSTRUCT_NpcLookatParam");
static_assert(offsetof(FSTRUCT_NpcLookatParam, LookatTarget_2_083DEC1649DBFC78866A728AEFE684B0) == 0x000000, "Member 'FSTRUCT_NpcLookatParam::LookatTarget_2_083DEC1649DBFC78866A728AEFE684B0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_NpcLookatParam, LookatSocket_6_2090FB184D0D02EF3DB392B72DD3EAE6) == 0x000008, "Member 'FSTRUCT_NpcLookatParam::LookatSocket_6_2090FB184D0D02EF3DB392B72DD3EAE6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_NpcLookatParam, SingleNode_8_143D202343CAA9DC1D3FD4B0CCB62F64) == 0x000010, "Member 'FSTRUCT_NpcLookatParam::SingleNode_8_143D202343CAA9DC1D3FD4B0CCB62F64' has a wrong offset!");

}

