#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DT_DebugNpcSetting

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DT_DebugNpcSetting.STRUCT_DT_DebugNpcSetting
// 0x0028 (0x0028 - 0x0000)
struct FSTRUCT_DT_DebugNpcSetting final
{
public:
	TSoftClassPtr<class UClass>                   Body_15_B77EDCAE483E967B4B18DD81A3E615EC;          // 0x0000(0x0018)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	class FName                                   Coordinate_8_A76FC3594F10498985131D824627315D;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LOD_11_3F5D7CFD414C58881F8EBDBE1A2F6A05;           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_DT_DebugNpcSetting) == 0x000008, "Wrong alignment on FSTRUCT_DT_DebugNpcSetting");
static_assert(sizeof(FSTRUCT_DT_DebugNpcSetting) == 0x000028, "Wrong size on FSTRUCT_DT_DebugNpcSetting");
static_assert(offsetof(FSTRUCT_DT_DebugNpcSetting, Body_15_B77EDCAE483E967B4B18DD81A3E615EC) == 0x000000, "Member 'FSTRUCT_DT_DebugNpcSetting::Body_15_B77EDCAE483E967B4B18DD81A3E615EC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_DebugNpcSetting, Coordinate_8_A76FC3594F10498985131D824627315D) == 0x000018, "Member 'FSTRUCT_DT_DebugNpcSetting::Coordinate_8_A76FC3594F10498985131D824627315D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_DebugNpcSetting, LOD_11_3F5D7CFD414C58881F8EBDBE1A2F6A05) == 0x000020, "Member 'FSTRUCT_DT_DebugNpcSetting::LOD_11_3F5D7CFD414C58881F8EBDBE1A2F6A05' has a wrong offset!");

}

