#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MaxOrMinRot

#include "Basic.hpp"

#include "ENUM_RotAxis_structs.hpp"
#include "ENUM_CoordinateMeshSlot_structs.hpp"


namespace SDK
{

// ScriptStruct STRUCT_MaxOrMinRot.STRUCT_MaxOrMinRot
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FSTRUCT_MaxOrMinRot final
{
public:
	class FName                                   TargetBone_14_98C043F0454F59B87855F8AC7AED388F;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneA_2_7B6EE9B34EAE42E8911DB2A9B960779E;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneB_4_35E48D4F432B6F540E6A86A3FB89A0E0;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         X1_7_AECB1DB34BB20976FDE6B788F435CCA6;             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y1_9_594C13A0418A97395EDACE960B2093DB;             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z1_11_4E9FB5554BECC2B55C288DBB6A4AD491;            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClampByPositiveRange_17_CDFAE96D4F8662DC2BE04FAD90E62CCE; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_RotAxis                                  SelectClampAxis_20_74AF19984479BD332C7C5D9DF86C7495; // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExceptionClampRot_23_3C18BBEF47E685CFECBB37BFAB82E54E; // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENUM_CoordinateMeshSlot                       PartsSlot_27_8303BF3B4CBDA85D024EA0B2CF22D1CC;     // 0x0027(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_MaxOrMinRot) == 0x000008, "Wrong alignment on FSTRUCT_MaxOrMinRot");
static_assert(sizeof(FSTRUCT_MaxOrMinRot) == 0x000028, "Wrong size on FSTRUCT_MaxOrMinRot");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, TargetBone_14_98C043F0454F59B87855F8AC7AED388F) == 0x000000, "Member 'FSTRUCT_MaxOrMinRot::TargetBone_14_98C043F0454F59B87855F8AC7AED388F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, BoneA_2_7B6EE9B34EAE42E8911DB2A9B960779E) == 0x000008, "Member 'FSTRUCT_MaxOrMinRot::BoneA_2_7B6EE9B34EAE42E8911DB2A9B960779E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, BoneB_4_35E48D4F432B6F540E6A86A3FB89A0E0) == 0x000010, "Member 'FSTRUCT_MaxOrMinRot::BoneB_4_35E48D4F432B6F540E6A86A3FB89A0E0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, X1_7_AECB1DB34BB20976FDE6B788F435CCA6) == 0x000018, "Member 'FSTRUCT_MaxOrMinRot::X1_7_AECB1DB34BB20976FDE6B788F435CCA6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, Y1_9_594C13A0418A97395EDACE960B2093DB) == 0x00001C, "Member 'FSTRUCT_MaxOrMinRot::Y1_9_594C13A0418A97395EDACE960B2093DB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, Z1_11_4E9FB5554BECC2B55C288DBB6A4AD491) == 0x000020, "Member 'FSTRUCT_MaxOrMinRot::Z1_11_4E9FB5554BECC2B55C288DBB6A4AD491' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, ClampByPositiveRange_17_CDFAE96D4F8662DC2BE04FAD90E62CCE) == 0x000024, "Member 'FSTRUCT_MaxOrMinRot::ClampByPositiveRange_17_CDFAE96D4F8662DC2BE04FAD90E62CCE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, SelectClampAxis_20_74AF19984479BD332C7C5D9DF86C7495) == 0x000025, "Member 'FSTRUCT_MaxOrMinRot::SelectClampAxis_20_74AF19984479BD332C7C5D9DF86C7495' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, bExceptionClampRot_23_3C18BBEF47E685CFECBB37BFAB82E54E) == 0x000026, "Member 'FSTRUCT_MaxOrMinRot::bExceptionClampRot_23_3C18BBEF47E685CFECBB37BFAB82E54E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MaxOrMinRot, PartsSlot_27_8303BF3B4CBDA85D024EA0B2CF22D1CC) == 0x000027, "Member 'FSTRUCT_MaxOrMinRot::PartsSlot_27_8303BF3B4CBDA85D024EA0B2CF22D1CC' has a wrong offset!");

}

