#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_SkyParam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct STRUCT_SkyParam.STRUCT_SkyParam
// 0x0108 (0x0108 - 0x0000)
struct FSTRUCT_SkyParam final
{
public:
	TArray<struct FLinearColor>                   ZenithColor_3_F8BFB74C4BB031098E401F930D106614;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   MiddleColor_5_0CD399E04971A43A7A4800B0698E980E;    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   HorizonColor_7_B50BD38E49D2E07D856D0BA5F65DE43F;   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   OverallColor_9_D46CEAF54BB39FDCB7C37387D352FC12;   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   DirectionalLightColor_11_8DC1D8884A880B48DD421EA4A7C10B91; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   SunColor_13_FAF787E444FED8244179C19412D84F37;      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   CloudColor_15_4CC7DF334B0DC66424761DA54A68F275;    // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   CloudColorShadow_17_55291DE94B9297B453C6E98CABA92845; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 DirectionalLightBrightness_21_3AFF3EBE42A2EEE49E555A99337CBCC2; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 HorizonFalloff_23_83B27F8F4A78863F26C829BD6C9BA6BF; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 MiddleFalloff_25_EDC8C61C4481CE143D5A0B81639123D6; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         CloudOpacity_28_A03DCD6248D05D265677AD8FC35599D7;  // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MoonLightColor_31_9E4C24BE42309C991EE20E82E8EAD7E7; // 0x00B4(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonLightBrightness_34_EC4533DB4ED2FE8618326185E9DA052F; // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   TaijuColorPlaneBright_44_428C00554961E3C92FAB038722B667DF; // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   TaijuColorPlaneShadow_42_8D251A5E469B899BECECD896C74B584B; // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   MajouColorPlaneBright_46_8CC23F484374760D3F89CF8177897915; // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   MajouColorPlaneShadow_48_6BB7DF994A216290AF09E78F8A2D1706; // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_SkyParam) == 0x000008, "Wrong alignment on FSTRUCT_SkyParam");
static_assert(sizeof(FSTRUCT_SkyParam) == 0x000108, "Wrong size on FSTRUCT_SkyParam");
static_assert(offsetof(FSTRUCT_SkyParam, ZenithColor_3_F8BFB74C4BB031098E401F930D106614) == 0x000000, "Member 'FSTRUCT_SkyParam::ZenithColor_3_F8BFB74C4BB031098E401F930D106614' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, MiddleColor_5_0CD399E04971A43A7A4800B0698E980E) == 0x000010, "Member 'FSTRUCT_SkyParam::MiddleColor_5_0CD399E04971A43A7A4800B0698E980E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, HorizonColor_7_B50BD38E49D2E07D856D0BA5F65DE43F) == 0x000020, "Member 'FSTRUCT_SkyParam::HorizonColor_7_B50BD38E49D2E07D856D0BA5F65DE43F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, OverallColor_9_D46CEAF54BB39FDCB7C37387D352FC12) == 0x000030, "Member 'FSTRUCT_SkyParam::OverallColor_9_D46CEAF54BB39FDCB7C37387D352FC12' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, DirectionalLightColor_11_8DC1D8884A880B48DD421EA4A7C10B91) == 0x000040, "Member 'FSTRUCT_SkyParam::DirectionalLightColor_11_8DC1D8884A880B48DD421EA4A7C10B91' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, SunColor_13_FAF787E444FED8244179C19412D84F37) == 0x000050, "Member 'FSTRUCT_SkyParam::SunColor_13_FAF787E444FED8244179C19412D84F37' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, CloudColor_15_4CC7DF334B0DC66424761DA54A68F275) == 0x000060, "Member 'FSTRUCT_SkyParam::CloudColor_15_4CC7DF334B0DC66424761DA54A68F275' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, CloudColorShadow_17_55291DE94B9297B453C6E98CABA92845) == 0x000070, "Member 'FSTRUCT_SkyParam::CloudColorShadow_17_55291DE94B9297B453C6E98CABA92845' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, DirectionalLightBrightness_21_3AFF3EBE42A2EEE49E555A99337CBCC2) == 0x000080, "Member 'FSTRUCT_SkyParam::DirectionalLightBrightness_21_3AFF3EBE42A2EEE49E555A99337CBCC2' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, HorizonFalloff_23_83B27F8F4A78863F26C829BD6C9BA6BF) == 0x000090, "Member 'FSTRUCT_SkyParam::HorizonFalloff_23_83B27F8F4A78863F26C829BD6C9BA6BF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, MiddleFalloff_25_EDC8C61C4481CE143D5A0B81639123D6) == 0x0000A0, "Member 'FSTRUCT_SkyParam::MiddleFalloff_25_EDC8C61C4481CE143D5A0B81639123D6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, CloudOpacity_28_A03DCD6248D05D265677AD8FC35599D7) == 0x0000B0, "Member 'FSTRUCT_SkyParam::CloudOpacity_28_A03DCD6248D05D265677AD8FC35599D7' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, MoonLightColor_31_9E4C24BE42309C991EE20E82E8EAD7E7) == 0x0000B4, "Member 'FSTRUCT_SkyParam::MoonLightColor_31_9E4C24BE42309C991EE20E82E8EAD7E7' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, MoonLightBrightness_34_EC4533DB4ED2FE8618326185E9DA052F) == 0x0000C4, "Member 'FSTRUCT_SkyParam::MoonLightBrightness_34_EC4533DB4ED2FE8618326185E9DA052F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, TaijuColorPlaneBright_44_428C00554961E3C92FAB038722B667DF) == 0x0000C8, "Member 'FSTRUCT_SkyParam::TaijuColorPlaneBright_44_428C00554961E3C92FAB038722B667DF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, TaijuColorPlaneShadow_42_8D251A5E469B899BECECD896C74B584B) == 0x0000D8, "Member 'FSTRUCT_SkyParam::TaijuColorPlaneShadow_42_8D251A5E469B899BECECD896C74B584B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, MajouColorPlaneBright_46_8CC23F484374760D3F89CF8177897915) == 0x0000E8, "Member 'FSTRUCT_SkyParam::MajouColorPlaneBright_46_8CC23F484374760D3F89CF8177897915' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SkyParam, MajouColorPlaneShadow_48_6BB7DF994A216290AF09E78F8A2D1706) == 0x0000F8, "Member 'FSTRUCT_SkyParam::MajouColorPlaneShadow_48_6BB7DF994A216290AF09E78F8A2D1706' has a wrong offset!");

}

