#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_BattleAnimations

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct STRUCT_BattleAnimations.STRUCT_BattleAnimations
// 0x0070 (0x0070 - 0x0000)
struct FSTRUCT_BattleAnimations final
{
public:
	class UAnimSequence*                          OpenWp_7_3740654747D074D5F92D58A790A9F220;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          CloseWp_9_EF92D48A42FCECACF0FAA1BCC2D2A10F;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            IdleToRun_2_F809729A4E8571D039D6F89AC120F80D;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            GuardIdleToRun_36_AFDA43534A9B4F4FF366BB81D260E91D; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            SGuardIdleToRun_35_F7E92D5E4408CE330FA3D7B4C7FE426C; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            DyIdleToRun_19_BE61679449780C4DA5C8E3A2BE6139FD;   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            DyGuardIdleToRun_33_D88AE4C04B51BDBFE7C9E1A3B57CDB40; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            DySGuardIdleToRun_34_13D4C4734A04D69265B92F8076AEB646; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Guard_St_47_DAA1983444D7A602EF9B3384E65E888F;      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Guard_Lp_26_3D04B712442C3A7768BDB1902EA122EC;      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          SGuard_St_48_0A9E19594010628F1BC5C197C4188ACD;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          SGuard_Lp_28_B8147C574AFAAADFC37AF194DB3E01DB;     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          DyGuard_Lp_30_B6D857674CCB02600CFEB6978EC5EC14;    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          DySGuard_Lp_32_F76010624D29CBD7623F55B266C55D7C;   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_BattleAnimations) == 0x000008, "Wrong alignment on FSTRUCT_BattleAnimations");
static_assert(sizeof(FSTRUCT_BattleAnimations) == 0x000070, "Wrong size on FSTRUCT_BattleAnimations");
static_assert(offsetof(FSTRUCT_BattleAnimations, OpenWp_7_3740654747D074D5F92D58A790A9F220) == 0x000000, "Member 'FSTRUCT_BattleAnimations::OpenWp_7_3740654747D074D5F92D58A790A9F220' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, CloseWp_9_EF92D48A42FCECACF0FAA1BCC2D2A10F) == 0x000008, "Member 'FSTRUCT_BattleAnimations::CloseWp_9_EF92D48A42FCECACF0FAA1BCC2D2A10F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, IdleToRun_2_F809729A4E8571D039D6F89AC120F80D) == 0x000010, "Member 'FSTRUCT_BattleAnimations::IdleToRun_2_F809729A4E8571D039D6F89AC120F80D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, GuardIdleToRun_36_AFDA43534A9B4F4FF366BB81D260E91D) == 0x000018, "Member 'FSTRUCT_BattleAnimations::GuardIdleToRun_36_AFDA43534A9B4F4FF366BB81D260E91D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, SGuardIdleToRun_35_F7E92D5E4408CE330FA3D7B4C7FE426C) == 0x000020, "Member 'FSTRUCT_BattleAnimations::SGuardIdleToRun_35_F7E92D5E4408CE330FA3D7B4C7FE426C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, DyIdleToRun_19_BE61679449780C4DA5C8E3A2BE6139FD) == 0x000028, "Member 'FSTRUCT_BattleAnimations::DyIdleToRun_19_BE61679449780C4DA5C8E3A2BE6139FD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, DyGuardIdleToRun_33_D88AE4C04B51BDBFE7C9E1A3B57CDB40) == 0x000030, "Member 'FSTRUCT_BattleAnimations::DyGuardIdleToRun_33_D88AE4C04B51BDBFE7C9E1A3B57CDB40' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, DySGuardIdleToRun_34_13D4C4734A04D69265B92F8076AEB646) == 0x000038, "Member 'FSTRUCT_BattleAnimations::DySGuardIdleToRun_34_13D4C4734A04D69265B92F8076AEB646' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, Guard_St_47_DAA1983444D7A602EF9B3384E65E888F) == 0x000040, "Member 'FSTRUCT_BattleAnimations::Guard_St_47_DAA1983444D7A602EF9B3384E65E888F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, Guard_Lp_26_3D04B712442C3A7768BDB1902EA122EC) == 0x000048, "Member 'FSTRUCT_BattleAnimations::Guard_Lp_26_3D04B712442C3A7768BDB1902EA122EC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, SGuard_St_48_0A9E19594010628F1BC5C197C4188ACD) == 0x000050, "Member 'FSTRUCT_BattleAnimations::SGuard_St_48_0A9E19594010628F1BC5C197C4188ACD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, SGuard_Lp_28_B8147C574AFAAADFC37AF194DB3E01DB) == 0x000058, "Member 'FSTRUCT_BattleAnimations::SGuard_Lp_28_B8147C574AFAAADFC37AF194DB3E01DB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, DyGuard_Lp_30_B6D857674CCB02600CFEB6978EC5EC14) == 0x000060, "Member 'FSTRUCT_BattleAnimations::DyGuard_Lp_30_B6D857674CCB02600CFEB6978EC5EC14' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BattleAnimations, DySGuard_Lp_32_F76010624D29CBD7623F55B266C55D7C) == 0x000068, "Member 'FSTRUCT_BattleAnimations::DySGuard_Lp_32_F76010624D29CBD7623F55B266C55D7C' has a wrong offset!");

}

