#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_SoftBoneChainSettings

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct STRUCT_SoftBoneChainSettings.STRUCT_SoftBoneChainSettings
// 0x0010 (0x0010 - 0x0000)
struct FSTRUCT_SoftBoneChainSettings final
{
public:
	float                                         GravityScale_2_B5058B9144840A9EFA84CA97C12CDC55;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness_4_BC135FF14961DFFE00537DA4688E610B;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRatio_6_5DC702A44650893543ED2EB5A110EC8B;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha_8_F58863F8426F0E2C42B11BBA571928B1;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSTRUCT_SoftBoneChainSettings) == 0x000004, "Wrong alignment on FSTRUCT_SoftBoneChainSettings");
static_assert(sizeof(FSTRUCT_SoftBoneChainSettings) == 0x000010, "Wrong size on FSTRUCT_SoftBoneChainSettings");
static_assert(offsetof(FSTRUCT_SoftBoneChainSettings, GravityScale_2_B5058B9144840A9EFA84CA97C12CDC55) == 0x000000, "Member 'FSTRUCT_SoftBoneChainSettings::GravityScale_2_B5058B9144840A9EFA84CA97C12CDC55' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SoftBoneChainSettings, Stiffness_4_BC135FF14961DFFE00537DA4688E610B) == 0x000004, "Member 'FSTRUCT_SoftBoneChainSettings::Stiffness_4_BC135FF14961DFFE00537DA4688E610B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SoftBoneChainSettings, DampingRatio_6_5DC702A44650893543ED2EB5A110EC8B) == 0x000008, "Member 'FSTRUCT_SoftBoneChainSettings::DampingRatio_6_5DC702A44650893543ED2EB5A110EC8B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SoftBoneChainSettings, Alpha_8_F58863F8426F0E2C42B11BBA571928B1) == 0x00000C, "Member 'FSTRUCT_SoftBoneChainSettings::Alpha_8_F58863F8426F0E2C42B11BBA571928B1' has a wrong offset!");

}

