#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DT_DebugAutoPlay

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DT_DebugAutoPlay.STRUCT_DT_DebugAutoPlay
// 0x0040 (0x0040 - 0x0000)
struct FSTRUCT_DT_DebugAutoPlay final
{
public:
	class FString                                 Command_2_C3A1E7F34389F31F91C8B98E3818B35E;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value1_6_74ACF48E437FB91B6189F6A6FE143440;         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value2_7_F9C6B1484E2B742C87495EA79F6A40FB;         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value3_8_D388A0AF4E753F4C522EB082147DC19A;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_DT_DebugAutoPlay) == 0x000008, "Wrong alignment on FSTRUCT_DT_DebugAutoPlay");
static_assert(sizeof(FSTRUCT_DT_DebugAutoPlay) == 0x000040, "Wrong size on FSTRUCT_DT_DebugAutoPlay");
static_assert(offsetof(FSTRUCT_DT_DebugAutoPlay, Command_2_C3A1E7F34389F31F91C8B98E3818B35E) == 0x000000, "Member 'FSTRUCT_DT_DebugAutoPlay::Command_2_C3A1E7F34389F31F91C8B98E3818B35E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_DebugAutoPlay, Value1_6_74ACF48E437FB91B6189F6A6FE143440) == 0x000010, "Member 'FSTRUCT_DT_DebugAutoPlay::Value1_6_74ACF48E437FB91B6189F6A6FE143440' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_DebugAutoPlay, Value2_7_F9C6B1484E2B742C87495EA79F6A40FB) == 0x000020, "Member 'FSTRUCT_DT_DebugAutoPlay::Value2_7_F9C6B1484E2B742C87495EA79F6A40FB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DT_DebugAutoPlay, Value3_8_D388A0AF4E753F4C522EB082147DC19A) == 0x000030, "Member 'FSTRUCT_DT_DebugAutoPlay::Value3_8_D388A0AF4E753F4C522EB082147DC19A' has a wrong offset!");

}

