#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_Item_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C
// 0x0078 (0x0448 - 0x03D0)
class UWBP_Menu_Shop_Item_002_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Equipment_s_000;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBasePanel;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIconPanel;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OsyareStarsPanel;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_705;                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_708;                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSellMode;                                        // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UnitTextId;                                        // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHideStack;                                       // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PossessionAmount;                                  // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStackCount;                                      // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSellNG;                                          // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoadUniqueId;                                      // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoaddedIconTexture;                              // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             OsyareStarsTextureRef;                             // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern(int32 EntryPoint);
	void Destruct();
	void ASyncLoadTextureDelegate(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo);
	void Construct();
	void DrawItemBase(class UJackUMGItemData* InItemData);
	void SetUnitTextId(class FName InUnitTextId);
	void CancelLoadTexture();
	void SetPossessionAmount(int32 InPossessionAmount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Shop_Item_002_modern_C">();
	}
	static class UWBP_Menu_Shop_Item_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Shop_Item_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Shop_Item_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Shop_Item_002_modern_C");
static_assert(sizeof(UWBP_Menu_Shop_Item_002_modern_C) == 0x000448, "Wrong size on UWBP_Menu_Shop_Item_002_modern_C");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Shop_Item_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, CaptionPanel) == 0x0003D8, "Member 'UWBP_Menu_Shop_Item_002_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, Equipment_s_000) == 0x0003E0, "Member 'UWBP_Menu_Shop_Item_002_modern_C::Equipment_s_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, ItemBasePanel) == 0x0003E8, "Member 'UWBP_Menu_Shop_Item_002_modern_C::ItemBasePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, ItemIconPanel) == 0x0003F0, "Member 'UWBP_Menu_Shop_Item_002_modern_C::ItemIconPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, OsyareStarsPanel) == 0x0003F8, "Member 'UWBP_Menu_Shop_Item_002_modern_C::OsyareStarsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, WBP_Menu_Parts_024_C_705) == 0x000400, "Member 'UWBP_Menu_Shop_Item_002_modern_C::WBP_Menu_Parts_024_C_705' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, WBP_Menu_Parts_024_C_708) == 0x000408, "Member 'UWBP_Menu_Shop_Item_002_modern_C::WBP_Menu_Parts_024_C_708' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, ItemSyousaiRef) == 0x000410, "Member 'UWBP_Menu_Shop_Item_002_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, IsSellMode) == 0x000418, "Member 'UWBP_Menu_Shop_Item_002_modern_C::IsSellMode' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, UnitTextId) == 0x000420, "Member 'UWBP_Menu_Shop_Item_002_modern_C::UnitTextId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, IsHideStack) == 0x000428, "Member 'UWBP_Menu_Shop_Item_002_modern_C::IsHideStack' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, PossessionAmount) == 0x00042C, "Member 'UWBP_Menu_Shop_Item_002_modern_C::PossessionAmount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, IsStackCount) == 0x000430, "Member 'UWBP_Menu_Shop_Item_002_modern_C::IsStackCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, IsSellNG) == 0x000431, "Member 'UWBP_Menu_Shop_Item_002_modern_C::IsSellNG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, LoadUniqueId) == 0x000434, "Member 'UWBP_Menu_Shop_Item_002_modern_C::LoadUniqueId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, IsLoaddedIconTexture) == 0x000438, "Member 'UWBP_Menu_Shop_Item_002_modern_C::IsLoaddedIconTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_Item_002_modern_C, OsyareStarsTextureRef) == 0x000440, "Member 'UWBP_Menu_Shop_Item_002_modern_C::OsyareStarsTextureRef' has a wrong offset!");

}

