#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_012_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_List_012_modern.WBP_Menu_WorldMap_List_012_modern_C.FocusItemEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature final
{
public:
	class UJackUMGAccessorSaveDataInRura*         RuraData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature, RuraData) == 0x000000, "Member 'WBP_Menu_WorldMap_List_012_modern_C_FocusItemEvent__DelegateSignature::RuraData' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_012_modern.WBP_Menu_WorldMap_List_012_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_000_modern_C*        K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetParentMapVolumeID_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_000_modern_C*        K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern2; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_PoppedWidget;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_CurrentActiveWidget;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern");
static_assert(sizeof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern) == 0x000090, "Wrong size on WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000040, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern) == 0x000048, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_GetParentMapVolumeID_ReturnValue) == 0x000058, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_GetParentMapVolumeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x000060, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000068, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern2) == 0x000070, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, K2Node_DynamicCast_bSuccess2) == 0x000078, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_PopMenu_PoppedWidget) == 0x000080, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_PopMenu_PoppedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern, CallFunc_PopMenu_CurrentActiveWidget) == 0x000088, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_012_modern::CallFunc_PopMenu_CurrentActiveWidget' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_012_modern.WBP_Menu_WorldMap_List_012_modern_C.WidgetBActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_List_012_modern_C_WidgetBActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_012_modern.WBP_Menu_WorldMap_List_012_modern_C.SetParamSetumei
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRuraEmpty;                                       // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei");
static_assert(sizeof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei) == 0x000028, "Wrong size on WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, ItemIndex) == 0x000000, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, IsEmpty) == 0x000004, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, IsRuraEmpty) == 0x000005, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::IsRuraEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei, CallFunc_GetRuraData_ReturnValue) == 0x000020, "Member 'WBP_Menu_WorldMap_List_012_modern_C_SetParamSetumei::CallFunc_GetRuraData_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_012_modern.WBP_Menu_WorldMap_List_012_modern_C.UpdateNeighborMapList
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList final
{
public:
	class FName                                   MapVolumeID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PrevMapVolumeID_0;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFoundCurrentMap;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUIMapManager*                      CallFunc_GetUIMapManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGNeighborMapInfo*>        CallFunc_GetNeighborMapInfoList_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGNeighborMapInfo*                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList");
static_assert(sizeof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList) == 0x000078, "Wrong size on WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, MapVolumeID) == 0x000000, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::MapVolumeID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, PrevMapVolumeID_0) == 0x000008, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::PrevMapVolumeID_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, bFoundCurrentMap) == 0x000010, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::bFoundCurrentMap' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, Temp_name_Variable) == 0x000018, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, Temp_bool_Variable) == 0x000029, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_GetUIMapManager_ReturnValue) == 0x000030, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_GetUIMapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, K2Node_Select_Default) == 0x000038, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_GetNeighborMapInfoList_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_GetNeighborMapInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00005C, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Array_Length_ReturnValue2) == 0x000064, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000069, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList, CallFunc_Array_Length_ReturnValue3) == 0x000070, "Member 'WBP_Menu_WorldMap_List_012_modern_C_UpdateNeighborMapList::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_012_modern.WBP_Menu_WorldMap_List_012_modern_C.ItemListControlHandler
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_GetItemId_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetItemId_ReturnValue2;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_000_modern_C*        K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_WorldMap_000_modern_C*        K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGNeighborMapInfo*                K2Node_DynamicCast_AsJack_UMGNeighbor_Map_Info;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler");
static_assert(sizeof(WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler) == 0x000090, "Wrong size on WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler, Selection) == 0x000000, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler::Selection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler, Item) == 0x000008, "Member 'WBP_Menu_WorldMap_List_012_modern_C_ItemListControlHandler::Item' has a wrong offset!");
