#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_068_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_068_modern.WBP_Menu_Parts_068_modern_C.ExecuteUbergraph_WBP_Menu_Parts_068_modern
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGTuyosaRenkeiCharacterData      K2Node_CustomEvent_Data;                           // 0x0010(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharNameFromType_ReturnValue;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0090(0x0018)()
	bool                                          Temp_bool_Variable4;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x00C0(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern");
static_assert(sizeof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern) == 0x0000D8, "Wrong size on WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_bool_Variable2) == 0x000007, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable3) == 0x000008, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable4) == 0x000009, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_bool_Variable3) == 0x00000A, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable5) == 0x00000B, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable6) == 0x00000C, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable7) == 0x00000D, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, K2Node_CustomEvent_Data) == 0x000010, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000059, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, K2Node_Select_Default) == 0x00005A, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, K2Node_Select2_Default) == 0x00005B, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_Not_PreBool_ReturnValue) == 0x00005C, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000068, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, K2Node_Select3_Default) == 0x000070, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_GetCharNameFromType_ReturnValue) == 0x000078, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_GetCharNameFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000088, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x000090, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_bool_Variable4) == 0x0000A8, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, Temp_byte_Variable8) == 0x0000A9, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, K2Node_Select4_Default) == 0x0000AA, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_GetText_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern, CallFunc_Conv_StringToText_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Parts_068_modern_C_ExecuteUbergraph_WBP_Menu_Parts_068_modern::CallFunc_Conv_StringToText_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Parts_068_modern.WBP_Menu_Parts_068_modern_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_068_modern_C_SetData final
{
public:
	struct FJackUMGTuyosaRenkeiCharacterData      Data;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_068_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_068_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_068_modern_C_SetData) == 0x000028, "Wrong size on WBP_Menu_Parts_068_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_068_modern_C_SetData, Data) == 0x000000, "Member 'WBP_Menu_Parts_068_modern_C_SetData::Data' has a wrong offset!");

}

