#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_007_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_007_modern.WBP_Hud_Status_007_modern_C
// 0x0058 (0x04A0 - 0x0448)
class UWBP_Hud_Status_007_modern_C final : public UJackUMGHpMpBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           RootPanel;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StatusListPanel;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_0;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_1;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_2;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_3;                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_4;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_5;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_6;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_004_modern_C*           WBP_Hud_Status_004_7;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_007_modern(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_007_modern_C">();
	}
	static class UWBP_Hud_Status_007_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_007_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_007_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_007_modern_C");
static_assert(sizeof(UWBP_Hud_Status_007_modern_C) == 0x0004A0, "Wrong size on UWBP_Hud_Status_007_modern_C");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, UberGraphFrame) == 0x000448, "Member 'UWBP_Hud_Status_007_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, RootPanel) == 0x000450, "Member 'UWBP_Hud_Status_007_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, StatusListPanel) == 0x000458, "Member 'UWBP_Hud_Status_007_modern_C::StatusListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_0) == 0x000460, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_1) == 0x000468, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_2) == 0x000470, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_3) == 0x000478, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_4) == 0x000480, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_4' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_5) == 0x000488, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_5' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_6) == 0x000490, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_6' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_007_modern_C, WBP_Hud_Status_004_7) == 0x000498, "Member 'UWBP_Hud_Status_007_modern_C::WBP_Hud_Status_004_7' has a wrong offset!");

}

