#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Window_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C
// 0x00B0 (0x04E8 - 0x0438)
class UWBP_Menu_Namae_Window_001_modern_C final : public UJackUMGWebBrowser
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Icon_Button;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Button_01;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         OptionPanel;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PrivacyPolicyPanel;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Option;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPrivacyPolicy;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_0;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_0;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1;                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_41;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern;                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern_C_0;                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   NewVar_0;                                          // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewVar_1;                                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SaveDataCheckFlag;                                 // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FailedSavedata;                                    // 0x04DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             PreLoadBGM;                                        // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern(int32 EntryPoint);
	void ExecuteSaveDataCheck(TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender, EJackUMGSaveDataCheckPoint CheckPoint);
	void OnFinishSaveDataCheck_Erase(EJackUMGSaveDataCheckResult Result);
	void ExecuteSaveDataCheckResult(TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender, EJackUMGSaveDataCheckPoint CheckPoint, EJackSaveLoadResult CheckRusult);
	void OnDisplayMessageFromSaveDataCheck(EJackUMGSaveDataCheckPoint CheckPoint);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void OnFinishSaveDataCheck_NewData(EJackUMGSaveDataCheckResult Result);
	void OnFinishSaveDataCheck_Load(EJackUMGSaveDataCheckResult Result);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void CustomEvent_0(EJackKeys InKeyType, bool bIsPressed);
	void OnFinishSaveDataCheck(EJackUMGSaveDataCheckPoint CheckPoint, EJackUMGSaveDataCheckResult Result);
	void InitialList();
	void SetTextColorMakeBoukennosyo();
	void SetVisibilityOption(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Namae_Window_001_modern_C">();
	}
	static class UWBP_Menu_Namae_Window_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Namae_Window_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Namae_Window_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Namae_Window_001_modern_C");
static_assert(sizeof(UWBP_Menu_Namae_Window_001_modern_C) == 0x0004E8, "Wrong size on UWBP_Menu_Namae_Window_001_modern_C");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, UberGraphFrame) == 0x000438, "Member 'UWBP_Menu_Namae_Window_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, Icon_Button) == 0x000440, "Member 'UWBP_Menu_Namae_Window_001_modern_C::Icon_Button' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, Icon_Button_01) == 0x000448, "Member 'UWBP_Menu_Namae_Window_001_modern_C::Icon_Button_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, InvalidationBox_0) == 0x000450, "Member 'UWBP_Menu_Namae_Window_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, ItemListPanel) == 0x000458, "Member 'UWBP_Menu_Namae_Window_001_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, OptionPanel) == 0x000460, "Member 'UWBP_Menu_Namae_Window_001_modern_C::OptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, PrivacyPolicyPanel) == 0x000468, "Member 'UWBP_Menu_Namae_Window_001_modern_C::PrivacyPolicyPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, RootPanel) == 0x000470, "Member 'UWBP_Menu_Namae_Window_001_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, Text_Option) == 0x000478, "Member 'UWBP_Menu_Namae_Window_001_modern_C::Text_Option' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, TextPrivacyPolicy) == 0x000480, "Member 'UWBP_Menu_Namae_Window_001_modern_C::TextPrivacyPolicy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000) == 0x000488, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000_0) == 0x000490, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000_C_0) == 0x000498, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000_C_1) == 0x0004A0, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000_C_41) == 0x0004A8, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000_C_41' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000_modern) == 0x0004B0, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000_modern' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WBP_Menu_Parts_000_modern_C_0) == 0x0004B8, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WBP_Menu_Parts_000_modern_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, WindowFrame) == 0x0004C0, "Member 'UWBP_Menu_Namae_Window_001_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, NewVar_0) == 0x0004C8, "Member 'UWBP_Menu_Namae_Window_001_modern_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, NewVar_1) == 0x0004D0, "Member 'UWBP_Menu_Namae_Window_001_modern_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, SaveDataCheckFlag) == 0x0004D8, "Member 'UWBP_Menu_Namae_Window_001_modern_C::SaveDataCheckFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, FailedSavedata) == 0x0004DC, "Member 'UWBP_Menu_Namae_Window_001_modern_C::FailedSavedata' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Window_001_modern_C, PreLoadBGM) == 0x0004E0, "Member 'UWBP_Menu_Namae_Window_001_modern_C::PreLoadBGM' has a wrong offset!");

}

