#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_Setumei_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_Setumei_001_modern.WBP_Menu_WorldMap_Setumei_001_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Description;                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bValidQuestData;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackQuestReward                       K2Node_CustomEvent_QuestRewardData;                // 0x0038(0x0020)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackTextMacroReplaceManager*           CallFunc_GetTextMacroReplaceManager_ReturnValue;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MacroReplaceBP_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern");
static_assert(sizeof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern) == 0x000078, "Wrong size on WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, Temp_bool_Variable) == 0x000018, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, Temp_byte_Variable) == 0x000019, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, Temp_byte_Variable2) == 0x00001A, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, K2Node_CustomEvent_Description) == 0x000020, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, K2Node_CustomEvent_bValidQuestData) == 0x000030, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::K2Node_CustomEvent_bValidQuestData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, K2Node_CustomEvent_QuestRewardData) == 0x000038, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::K2Node_CustomEvent_QuestRewardData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, K2Node_Select_Default) == 0x000058, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, CallFunc_GetTextMacroReplaceManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::CallFunc_GetTextMacroReplaceManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern, CallFunc_MacroReplaceBP_ReturnValue) == 0x000068, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Setumei_001_modern::CallFunc_MacroReplaceBP_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_Setumei_001_modern.WBP_Menu_WorldMap_Setumei_001_modern_C.SetData
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_WorldMap_Setumei_001_modern_C_SetData final
{
public:
	class FString                                 Description;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bValidQuestData;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackQuestReward                       QuestRewardData;                                   // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Setumei_001_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Setumei_001_modern_C_SetData");
static_assert(sizeof(WBP_Menu_WorldMap_Setumei_001_modern_C_SetData) == 0x000038, "Wrong size on WBP_Menu_WorldMap_Setumei_001_modern_C_SetData");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_SetData, Description) == 0x000000, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_SetData::Description' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_SetData, bValidQuestData) == 0x000010, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_SetData::bValidQuestData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Setumei_001_modern_C_SetData, QuestRewardData) == 0x000018, "Member 'WBP_Menu_WorldMap_Setumei_001_modern_C_SetData::QuestRewardData' has a wrong offset!");

}

