#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_059_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C
// 0x0040 (0x0400 - 0x03C0)
class UWBP_Menu_Parts_059_modern_C final : public UJackUMGPageController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Down_Arrow;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Arrow_Image_Disable;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num_L;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num_R;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Arrow_Image_Disable;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Slash;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Up_Arrow;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_059_modern(int32 EntryPoint);
	void SetArrowEnable(bool bIsEnableLeft, bool bIsEnableRight);
	void SetArrowVisible(bool bIsVisibleLeft, bool bIsVisibleRight);
	void PlayArrowAnimAtInputValue(int32 Input);
	void PlayArrowAnimation(bool bIsRight);
	void Construct();
	void CustomEvent_0(class FName EventTag);
	void SetNumber(int32 Numerator, int32 Denominator);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_059_modern_C">();
	}
	static class UWBP_Menu_Parts_059_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_059_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_059_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_059_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_059_modern_C) == 0x000400, "Wrong size on UWBP_Menu_Parts_059_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, UberGraphFrame) == 0x0003C0, "Member 'UWBP_Menu_Parts_059_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, Down_Arrow) == 0x0003C8, "Member 'UWBP_Menu_Parts_059_modern_C::Down_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, L_Arrow_Image_Disable) == 0x0003D0, "Member 'UWBP_Menu_Parts_059_modern_C::L_Arrow_Image_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, Num_L) == 0x0003D8, "Member 'UWBP_Menu_Parts_059_modern_C::Num_L' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, Num_R) == 0x0003E0, "Member 'UWBP_Menu_Parts_059_modern_C::Num_R' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, R_Arrow_Image_Disable) == 0x0003E8, "Member 'UWBP_Menu_Parts_059_modern_C::R_Arrow_Image_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, Slash) == 0x0003F0, "Member 'UWBP_Menu_Parts_059_modern_C::Slash' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_059_modern_C, Up_Arrow) == 0x0003F8, "Member 'UWBP_Menu_Parts_059_modern_C::Up_Arrow' has a wrong offset!");

}

