#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_003_Steam

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_List_003_Steam.WBP_Menu_Sakusen_List_003_Steam_C.ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam
// 0x0140 (0x0140 - 0x0000)
struct WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue8;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue2;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue3;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue9;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam) == 0x000140, "Wrong size on WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_CustomEvent_EventName) == 0x000028, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_CustomEvent_InItemBase) == 0x000030, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000038, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_SwitchName3_CmpSuccess) == 0x000041, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000058, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000060, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000068, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x000070, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue8) == 0x000078, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGManager_ReturnValue) == 0x000080, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, Temp_struct_Variable) == 0x000088, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000098, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_WaitMessageEndFromBP_Result) == 0x0000A0, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_IsOpenSerifuWindow_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_IsOpenSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_IsOpenSerifuWindow_ReturnValue2) == 0x0000B1, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_IsOpenSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGManager_ReturnValue2) == 0x0000C0, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGManager_ReturnValue3) == 0x0000C8, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0000E1, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGManager_ReturnValue4) == 0x0000E8, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, Temp_struct_Variable2) == 0x0000F0, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue3) == 0x000100, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000108, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000110, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_WaitMessageEndFromBP_Result2) == 0x000118, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_AddUMGMenuWidget_ReturnValue9) == 0x000120, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_AddUMGMenuWidget_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, CallFunc_GetUMGManager_ReturnValue5) == 0x000128, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000130, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_003_Steam.WBP_Menu_Sakusen_List_003_Steam_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_003_Steam.WBP_Menu_Sakusen_List_003_Steam_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_Steam_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

}

