#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_070_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_070_modern.WBP_Menu_Parts_070_modern_C
// 0x0048 (0x0418 - 0x03D0)
class UWBP_Menu_Parts_070_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Stop;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glow_Loop;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_Name;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_069_modern_C*           Parts069_Icon;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_090_modern_C*      PartsText090_Level;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slot_Select;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackGameCharacter*                     GameCharacterData;                                 // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_070_modern(int32 EntryPoint);
	void SetSelectedFlag(bool bSelected);
	void SetOnCursorFlag(bool bIsOnCursor);
	void SetData(class UJackGameCharacter* GameCharacter);
	void Construct();
	void SetButton(EJackKeys InKeyType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_070_modern_C">();
	}
	static class UWBP_Menu_Parts_070_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_070_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_070_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_070_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_070_modern_C) == 0x000418, "Wrong size on UWBP_Menu_Parts_070_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_070_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, Stop) == 0x0003D8, "Member 'UWBP_Menu_Parts_070_modern_C::Stop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, Glow_Loop) == 0x0003E0, "Member 'UWBP_Menu_Parts_070_modern_C::Glow_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, Glow) == 0x0003E8, "Member 'UWBP_Menu_Parts_070_modern_C::Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, Parts000_Name) == 0x0003F0, "Member 'UWBP_Menu_Parts_070_modern_C::Parts000_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, Parts069_Icon) == 0x0003F8, "Member 'UWBP_Menu_Parts_070_modern_C::Parts069_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, PartsText090_Level) == 0x000400, "Member 'UWBP_Menu_Parts_070_modern_C::PartsText090_Level' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, Slot_Select) == 0x000408, "Member 'UWBP_Menu_Parts_070_modern_C::Slot_Select' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_070_modern_C, GameCharacterData) == 0x000410, "Member 'UWBP_Menu_Parts_070_modern_C::GameCharacterData' has a wrong offset!");

}

