#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_Command_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern
// 0x0308 (0x0308 - 0x0000)
struct WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetKougekiUIActionInfo_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue9;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue10;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue2;            // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue11;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue8;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_013_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue3;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue4;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array4;                           // 0x01C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array5;                           // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array6;                           // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_Select_Default;                             // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array7;                           // 0x0208(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_Select2_Default;                            // 0x0218(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue12;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumonListAtGameCharacter_ReturnValue;   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue13;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOpenRenkei_ReturnValue;                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           K2Node_Select3_Default;                            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue14;          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetTokugiListAtGameCharacter_ReturnValue; // 0x0278(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue2;           // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountInBag_ReturnValue;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue15;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue3;            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x02C0(0x0048)()
};
static_assert(alignof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern");
static_assert(sizeof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern) == 0x000308, "Wrong size on WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_VerifyDataTableRowName_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_VerifyDataTableRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000030, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000038, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000048, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_VerifyDataTableRowName_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_VerifyDataTableRowName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetSoundSet_ReturnValue) == 0x000060, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000080, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CustomEvent_InKeyType) == 0x000088, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CustomEvent_bIsPressed) == 0x000089, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00008A, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array) == 0x000090, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array2) == 0x0000A0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CustomEvent_EventTag) == 0x0000B0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_SwitchName_CmpSuccess) == 0x0000C0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetKougekiUIActionInfo_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetKougekiUIActionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x0000D8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x0000E0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x0000E8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x0000F0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue7) == 0x0000F8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue8) == 0x000100, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue9) == 0x000108, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x000110, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000114, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue10) == 0x000118, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_CharTypeToBagType_ReturnValue) == 0x000120, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_CharTypeToBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetCharacterType_ReturnValue2) == 0x000121, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetCharacterType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CustomEvent_EventName) == 0x000128, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CustomEvent_InItemBase) == 0x000130, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000138, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000140, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000141, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000148, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000150, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000158, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000160, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x000168, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x000170, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array3) == 0x000178, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue11) == 0x000188, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, Temp_bool_Variable) == 0x000190, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue8) == 0x000198, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern) == 0x0001A0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A9, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, Temp_bool_Variable2) == 0x0001AA, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_VerifyDataTableRowName_ReturnValue3) == 0x0001B0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_VerifyDataTableRowName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_VerifyDataTableRowName_ReturnValue4) == 0x0001B8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_VerifyDataTableRowName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetGameFlagBool_ReturnValue2) == 0x0001C1, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_BooleanAND_ReturnValue) == 0x0001C2, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_BooleanAND_ReturnValue2) == 0x0001C3, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array4) == 0x0001C8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array5) == 0x0001D8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array6) == 0x0001E8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_Select_Default) == 0x0001F8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_MakeArray_Array7) == 0x000208, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_MakeArray_Array7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_Select2_Default) == 0x000218, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue12) == 0x000228, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000230, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_IsJumonListAtGameCharacter_ReturnValue) == 0x000238, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_IsJumonListAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue13) == 0x000240, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, Temp_bool_Variable3) == 0x000248, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_CanOpenRenkei_ReturnValue) == 0x000249, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_CanOpenRenkei_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_Select3_Default) == 0x000250, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000258, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue14) == 0x000268, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000270, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetTokugiListAtGameCharacter_ReturnValue) == 0x000278, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetTokugiListAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000288, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000290, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_CharTypeToBagType_ReturnValue2) == 0x000294, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_CharTypeToBagType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000295, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_CountInBag_ReturnValue) == 0x000298, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_CountInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x00029C, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x0002A0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetAccessorBattle_ReturnValue15) == 0x0002A8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetAccessorBattle_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetCharacterType_ReturnValue3) == 0x0002B0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetCharacterType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x0002B8, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x0002C0, "Member 'WBP_Menu_Battle_Command_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_Command_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_Command_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_Command_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_Command_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_Command_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_Command_000_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.WidgetKeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate");
static_assert(sizeof(WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_Command_000_modern_C_WidgetKeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.SetBattleCommandCursorSave
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave final
{
public:
	class UJackUMGItemBase*                       InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemId_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave");
static_assert(sizeof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave) == 0x000028, "Wrong size on WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave, InputPin) == 0x000000, "Member 'WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave::InputPin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave, CallFunc_GetAccessorBattle_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave, CallFunc_GetItemId_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave::CallFunc_GetItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave, CallFunc_GetCharacterType_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_Command_000_modern_C_SetBattleCommandCursorSave::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.GetBattleCommandCursorSave
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGCursorSaveTarget               CallFunc_GetCursorSave_ReturnValue;                // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave");
static_assert(sizeof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave) == 0x000050, "Wrong size on WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, Temp_bool_Variable) == 0x000008, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, Temp_name_Variable) == 0x000010, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, CallFunc_GetAccessorBattle_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, CallFunc_GetCharacterType_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, CallFunc_GetCursorSave_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::CallFunc_GetCursorSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave, K2Node_Select_Default) == 0x000048, "Member 'WBP_Menu_Battle_Command_000_modern_C_GetBattleCommandCursorSave::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C.UpdateTokugijumonCommand
// 0x0018 (0x0018 - 0x0000)
