#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tutorial_Window_002_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tutorial_Window_002_modern.WBP_Menu_Tutorial_Window_002_modern_C.ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CheckCategoryNumber_Number;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0070(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0098(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern");
static_assert(sizeof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern) == 0x0000F8, "Wrong size on WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_CustomEvent_EventName) == 0x000028, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_CustomEvent_InItemBase) == 0x000030, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_CustomEvent_EventTag) == 0x000038, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_CheckCategoryNumber_Number) == 0x000044, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_CheckCategoryNumber_Number' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000049, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000060, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000068, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000070, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000098, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_002_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_002_modern.WBP_Menu_Tutorial_Window_002_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_002_modern.WBP_Menu_Tutorial_Window_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_002_modern.WBP_Menu_Tutorial_Window_002_modern_C.CheckCategoryNumber
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber final
{
public:
	class FName                                   InCategory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber");
static_assert(sizeof(WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber) == 0x000018, "Wrong size on WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber, InCategory) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber::InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber, Number) == 0x000008, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber::Number' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber, K2Node_SwitchName_CmpSuccess) == 0x00000C, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000010, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_CheckCategoryNumber::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_002_modern.WBP_Menu_Tutorial_Window_002_modern_C.MenuSelectCheck
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck final
{
public:
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTaughtTabiNoKokoroe_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenFusigiKaji_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck");
static_assert(sizeof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck) == 0x000030, "Wrong size on WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_GetAccessorCommon_ReturnValue) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_IsTaughtTabiNoKokoroe_ReturnValue) == 0x000010, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_IsTaughtTabiNoKokoroe_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_MakeVector2D_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000020, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck, CallFunc_IsOpenFusigiKaji_ReturnValue) == 0x000028, "Member 'WBP_Menu_Tutorial_Window_002_modern_C_MenuSelectCheck::CallFunc_IsOpenFusigiKaji_ReturnValue' has a wrong offset!");

}

