#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_034

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_034.WBP_Menu_Title_BG_034_C
// 0x0060 (0x03D0 - 0x0370)
class UWBP_Menu_Title_BG_034_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_031_C*               WBP_Menu_Title_BG_031_0;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_031_C*               WBP_Menu_Title_BG_031_1;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_031_C*               WBP_Menu_Title_BG_031_2;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_032_C*               WBP_Menu_Title_BG_032_0;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_032_C*               WBP_Menu_Title_BG_032_1;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_032_C*               WBP_Menu_Title_BG_032_2;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_033_C*               WBP_Menu_Title_BG_033_0;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_033_C*               WBP_Menu_Title_BG_033_1;                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_033_C*               WBP_Menu_Title_BG_033_2;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Title_BG_034(int32 EntryPoint);
	void PlayAnim034(float Duration);
	void Construct();
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_034_C">();
	}
	static class UWBP_Menu_Title_BG_034_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_034_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_034_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_034_C");
static_assert(sizeof(UWBP_Menu_Title_BG_034_C) == 0x0003D0, "Wrong size on UWBP_Menu_Title_BG_034_C");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_034_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_BG_034_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, RootPanel) == 0x000380, "Member 'UWBP_Menu_Title_BG_034_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_031_0) == 0x000388, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_031_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_031_1) == 0x000390, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_031_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_031_2) == 0x000398, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_031_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_032_0) == 0x0003A0, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_032_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_032_1) == 0x0003A8, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_032_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_032_2) == 0x0003B0, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_032_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_033_0) == 0x0003B8, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_033_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_033_1) == 0x0003C0, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_033_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_034_C, WBP_Menu_Title_BG_033_2) == 0x0003C8, "Member 'UWBP_Menu_Title_BG_034_C::WBP_Menu_Title_BG_033_2' has a wrong offset!");

}

