#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMemberDataInTuyosa*     K2Node_CustomEvent_TuyosaData;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class UJackUMGSoubiList*                      K2Node_CustomEvent_Data;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_001_modern_C*>   K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     K2Node_CustomEvent_Data2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrialLevelLimit_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDisplayExp_ReturnValue;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextFromTextId_ReturnValue;            // 0x0068(0x0018)()
	class FText                                   CallFunc_GetTextFromTextId_ReturnValue2;           // 0x0080(0x0018)()
	class FText                                   CallFunc_GetTextFromTextId_ReturnValue3;           // 0x0098(0x0018)()
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackCharacterSystem*                   CallFunc_GetJackCharacterSystem_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingExpToNextLevel_ReturnValue;   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGSoubiData                      CallFunc_GetSoubiDataRefFromIndex_ReturnValue;     // 0x00F0(0x0070)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern) == 0x0001A0, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CustomEvent_TuyosaData) == 0x000010, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CustomEvent_TuyosaData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CustomEvent_Data) == 0x000030, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CustomEvent_Data2) == 0x000050, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CustomEvent_Data2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_IsTrialLevelLimit_ReturnValue) == 0x000058, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_IsTrialLevelLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetDisplayExp_ReturnValue) == 0x00005C, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetDisplayExp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000060, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetTextFromTextId_ReturnValue) == 0x000068, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetTextFromTextId_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetTextFromTextId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetTextFromTextId_ReturnValue3) == 0x000098, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetTextFromTextId_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CustomEvent_EventTag) == 0x0000B0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_SwitchName_CmpSuccess) == 0x0000B8, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CustomEvent_EventName) == 0x0000C0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CustomEvent_InItemBase) == 0x0000C8, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000D0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetJackCharacterSystem_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetJackCharacterSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetRemainingExpToNextLevel_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetRemainingExpToNextLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, Temp_int_Array_Index_Variable) == 0x0000E4, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetSoubiDataRefFromIndex_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetSoubiDataRefFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000170, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000178, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000180, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000190, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.SetSoubiListData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData final
{
public:
	class UJackUMGSoubiList*                      Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData, Data) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_SetSoubiListData::Data' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_SetData final
{
public:
	class UJackUMGAccessorMemberDataInTuyosa*     TuyosaData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_SetData, TuyosaData) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_SetData::TuyosaData' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.SetGameCharacterData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData final
{
public:
	class UJackGameCharacter*                     Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData, Data) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_SetGameCharacterData::Data' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.OnWidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_OnWidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.UpdateParamText
// 0x0100 (0x0100 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText final
{
public:
	class UJackGameCharacter*                     GameCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ParamTextIdList;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FName                                   WorkTextId;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WorkParamText;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNitouryuu_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGSouthpaw_IsSouthpaw;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_Select3_Default;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText) == 0x000100, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, GameCharacter) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::GameCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, ParamTextIdList) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::ParamTextIdList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, WorkTextId) == 0x000018, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::WorkTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, WorkParamText) == 0x000020, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::WorkParamText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_bool_Variable) == 0x000030, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_IsNitouryuu_ReturnValue) == 0x000031, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_IsNitouryuu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_GetCharacterType_ReturnValue) == 0x000032, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_IsUMGSouthpaw_IsSouthpaw) == 0x000033, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_IsUMGSouthpaw_IsSouthpaw' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_name_Variable) == 0x000038, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_name_Variable2) == 0x000048, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_bool_Variable2) == 0x000050, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, K2Node_Select_Default) == 0x000058, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_name_Variable3) == 0x000060, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_name_Variable4) == 0x000068, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_bool_Variable3) == 0x000070, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, K2Node_Select2_Default) == 0x000078, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_name_Variable5) == 0x000080, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, K2Node_Select3_Default) == 0x000098, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, Temp_int_Variable) == 0x0000A0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, K2Node_SwitchInteger_CmpSuccess) == 0x0000A4, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A5, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_GetText_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000F0, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C.UpdateValueText
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText final
{
public:
	class UJackGameCharacter*                     GameCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ParamValueList;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FString                                 WorkValueText;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKougekiryoku_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNitouryuu_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMiryoku_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKiyousa_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSubayasa_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinomamori_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTikara_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKaifukuMaryoku_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKougekiMaryoku_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSyubiryoku_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKougekiryoku_ReturnValue2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxMP_ReturnValue;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxHP_ReturnValue;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText");
static_assert(sizeof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText) == 0x0000D8, "Wrong size on WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText, GameCharacter) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText::GameCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText, ParamValueList) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText::ParamValueList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText, WorkValueText) == 0x000018, "Member 'WBP_Menu_Tuyosa_List_000_modern_C_UpdateValueText::WorkValueText' has a wrong offset!");
