#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_019

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_019.WBP_Menu_Parts_019_C
// 0x0020 (0x03F0 - 0x03D0)
class UWBP_Menu_Parts_019_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonImagePanel;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_019(int32 EntryPoint);
	void Destruct();
	void AnimInit();
	void PlayPushAnimation();
	void CustomEvent_0(const struct FJackUMGItemContainer& ItemContainer);
	void Construct();
	void SetButtonAndCaption(EJackKeys InKeyType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_019_C">();
	}
	static class UWBP_Menu_Parts_019_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_019_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_019_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_019_C");
static_assert(sizeof(UWBP_Menu_Parts_019_C) == 0x0003F0, "Wrong size on UWBP_Menu_Parts_019_C");
static_assert(offsetof(UWBP_Menu_Parts_019_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_019_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_019_C, Init) == 0x0003D8, "Member 'UWBP_Menu_Parts_019_C::Init' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_019_C, Push) == 0x0003E0, "Member 'UWBP_Menu_Parts_019_C::Push' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_019_C, ButtonImagePanel) == 0x0003E8, "Member 'UWBP_Menu_Parts_019_C::ButtonImagePanel' has a wrong offset!");

}

