#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_HP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_HP.WBP_Hud_Status_HP_C
// 0x0080 (0x0548 - 0x04C8)
class UWBP_Hud_Status_HP_C final : public UJackUMGHudStatusBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           Gauge;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Bar;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Base;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Damage;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge_Shine;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_Damage_Bar;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Guage_Damage_Panel;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Guage_Panel;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Guage_Shine_Panel;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Number_List;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Unit;                                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_Suuji3_C*               WBP_Hud_Status_Suuji3;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bInit;                                             // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Pos;                                               // 0x053C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_HP(int32 EntryPoint);
	void InitValueHudStatusHp(int32 Now, int32 Max, EJackUMGTextColorSet ColorType);
	void Construct();
	void ValueChangeDelegate_Event(int32 Index_0, int32 ColorNum);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_HP_C">();
	}
	static class UWBP_Hud_Status_HP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_HP_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_HP_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_HP_C");
static_assert(sizeof(UWBP_Hud_Status_HP_C) == 0x000548, "Wrong size on UWBP_Hud_Status_HP_C");
static_assert(offsetof(UWBP_Hud_Status_HP_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Hud_Status_HP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Gauge) == 0x0004D0, "Member 'UWBP_Hud_Status_HP_C::Gauge' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Gauge_Bar) == 0x0004D8, "Member 'UWBP_Hud_Status_HP_C::Gauge_Bar' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Gauge_Base) == 0x0004E0, "Member 'UWBP_Hud_Status_HP_C::Gauge_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Gauge_Damage) == 0x0004E8, "Member 'UWBP_Hud_Status_HP_C::Gauge_Damage' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Gauge_Shine) == 0x0004F0, "Member 'UWBP_Hud_Status_HP_C::Gauge_Shine' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Guage_Damage_Bar) == 0x0004F8, "Member 'UWBP_Hud_Status_HP_C::Guage_Damage_Bar' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Guage_Damage_Panel) == 0x000500, "Member 'UWBP_Hud_Status_HP_C::Guage_Damage_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Guage_Panel) == 0x000508, "Member 'UWBP_Hud_Status_HP_C::Guage_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Guage_Shine_Panel) == 0x000510, "Member 'UWBP_Hud_Status_HP_C::Guage_Shine_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Number_List) == 0x000518, "Member 'UWBP_Hud_Status_HP_C::Number_List' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, RootPanel) == 0x000520, "Member 'UWBP_Hud_Status_HP_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Unit) == 0x000528, "Member 'UWBP_Hud_Status_HP_C::Unit' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, WBP_Hud_Status_Suuji3) == 0x000530, "Member 'UWBP_Hud_Status_HP_C::WBP_Hud_Status_Suuji3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, bInit) == 0x000538, "Member 'UWBP_Hud_Status_HP_C::bInit' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_HP_C, Pos) == 0x00053C, "Member 'UWBP_Hud_Status_HP_C::Pos' has a wrong offset!");

}

