#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_069_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C
// 0x0078 (0x0448 - 0x03D0)
class UWBP_Menu_Parts_069_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Set_2;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set;                                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Stop;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glow_Loop;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_Add_P001_000;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_P001_000;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow_Set;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NumberText;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slot_Bg;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slot_Frame;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slot_Select;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EJackCharacter                                CharacterType;                                     // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BattleIndex;                                       // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MemberIndex;                                       // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_069_modern(int32 EntryPoint);
	void PlayAnimOfSetCharacter(bool bExchange);
	void SetSelectedFlag(bool bSelected);
	void SetCharacterType(EJackCharacter CharacterType_0);
	void SetOnCursorFlag(bool bIsOnCursor);
	void SetData(EJackCharacter Character, int32 BattleIndex_0, int32 MemberIndex_0);
	void Construct();
	void SetButton(EJackKeys InKeyType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_069_modern_C">();
	}
	static class UWBP_Menu_Parts_069_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_069_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_069_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_069_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_069_modern_C) == 0x000448, "Wrong size on UWBP_Menu_Parts_069_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_069_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Set_2) == 0x0003D8, "Member 'UWBP_Menu_Parts_069_modern_C::Set_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Set) == 0x0003E0, "Member 'UWBP_Menu_Parts_069_modern_C::Set' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Stop) == 0x0003E8, "Member 'UWBP_Menu_Parts_069_modern_C::Stop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Glow_Loop) == 0x0003F0, "Member 'UWBP_Menu_Parts_069_modern_C::Glow_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Face_Add_P001_000) == 0x0003F8, "Member 'UWBP_Menu_Parts_069_modern_C::Face_Add_P001_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Face_P001_000) == 0x000400, "Member 'UWBP_Menu_Parts_069_modern_C::Face_P001_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Glow) == 0x000408, "Member 'UWBP_Menu_Parts_069_modern_C::Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Glow_Set) == 0x000410, "Member 'UWBP_Menu_Parts_069_modern_C::Glow_Set' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, NumberText) == 0x000418, "Member 'UWBP_Menu_Parts_069_modern_C::NumberText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Slot_Bg) == 0x000420, "Member 'UWBP_Menu_Parts_069_modern_C::Slot_Bg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Slot_Frame) == 0x000428, "Member 'UWBP_Menu_Parts_069_modern_C::Slot_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, Slot_Select) == 0x000430, "Member 'UWBP_Menu_Parts_069_modern_C::Slot_Select' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, CharacterType) == 0x000438, "Member 'UWBP_Menu_Parts_069_modern_C::CharacterType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, BattleIndex) == 0x00043C, "Member 'UWBP_Menu_Parts_069_modern_C::BattleIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_069_modern_C, MemberIndex) == 0x000440, "Member 'UWBP_Menu_Parts_069_modern_C::MemberIndex' has a wrong offset!");

}

