#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Buff_001

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.SetOddEffectId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_Buff_001_C_SetOddEffectId final
{
public:
	class FName                                   InOddEffectId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSlideValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debuff;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIconFromOddEffectId_IsDebuff;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_SetOddEffectId) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_SetOddEffectId");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_SetOddEffectId) == 0x000010, "Wrong size on WBP_Menu_Parts_Buff_001_C_SetOddEffectId");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetOddEffectId, InOddEffectId) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_SetOddEffectId::InOddEffectId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetOddEffectId, InSlideValue) == 0x000008, "Member 'WBP_Menu_Parts_Buff_001_C_SetOddEffectId::InSlideValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetOddEffectId, Debuff) == 0x00000C, "Member 'WBP_Menu_Parts_Buff_001_C_SetOddEffectId::Debuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetOddEffectId, CallFunc_SetIconFromOddEffectId_IsDebuff) == 0x00000D, "Member 'WBP_Menu_Parts_Buff_001_C_SetOddEffectId::CallFunc_SetIconFromOddEffectId_IsDebuff' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.UpdateDraw
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_UpdateDraw final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_UpdateDraw) == 0x000004, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_UpdateDraw");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_UpdateDraw) == 0x000004, "Wrong size on WBP_Menu_Parts_Buff_001_C_UpdateDraw");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_UpdateDraw, InDeltaTime) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_UpdateDraw::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.InitOddEffectWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget final
{
public:
	class UImage*                                 TexturePanelRef_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 InSlidePanelRef;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTexturePanel_0;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget) == 0x000018, "Wrong size on WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget, TexturePanelRef_0) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget::TexturePanelRef_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget, InSlidePanelRef) == 0x000008, "Member 'WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget::InSlidePanelRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget, bIsTexturePanel_0) == 0x000010, "Member 'WBP_Menu_Parts_Buff_001_C_InitOddEffectWidget::bIsTexturePanel_0' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.ShowDokuIcon
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_Buff_001_C_ShowDokuIcon final
{
public:
	bool                                          bIsDoku;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_ShowDokuIcon");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon) == 0x000028, "Wrong size on WBP_Menu_Parts_Buff_001_C_ShowDokuIcon");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon, bIsDoku) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_ShowDokuIcon::bIsDoku' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon, Temp_bool_Variable) == 0x000001, "Member 'WBP_Menu_Parts_Buff_001_C_ShowDokuIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Parts_Buff_001_C_ShowDokuIcon::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon, Temp_name_Variable2) == 0x000010, "Member 'WBP_Menu_Parts_Buff_001_C_ShowDokuIcon::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon, K2Node_Select_Default) == 0x000018, "Member 'WBP_Menu_Parts_Buff_001_C_ShowDokuIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_ShowDokuIcon, CallFunc_SetOddEffectId_Debuff) == 0x000020, "Member 'WBP_Menu_Parts_Buff_001_C_ShowDokuIcon::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.SetIconFromOddEffectId
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId final
{
public:
	class FName                                   InOddEffectId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebuff;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableOddEffect                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x00D0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIconFromOddEffectStatusId_IsDebuff;    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIconFromOddEffectStatusId_IsDebuff2;   // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId) == 0x0000E8, "Wrong size on WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, InOddEffectId) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::InOddEffectId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, IsDebuff) == 0x000008, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::IsDebuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, CallFunc_NotEqual_NameName_ReturnValue) == 0x000009, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, Temp_byte_Variable) == 0x00000A, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, Temp_bool_Variable) == 0x00000B, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, K2Node_Select_Default) == 0x0000E1, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, CallFunc_SetIconFromOddEffectStatusId_IsDebuff) == 0x0000E2, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::CallFunc_SetIconFromOddEffectStatusId_IsDebuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId, CallFunc_SetIconFromOddEffectStatusId_IsDebuff2) == 0x0000E3, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectId::CallFunc_SetIconFromOddEffectStatusId_IsDebuff2' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.SetIconFromOddEffectStatusId
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId final
{
public:
	class FName                                   InOffEffectStatusId;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebuff;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDataTableOddEffectStatus          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x00A8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SyncLoadTexture_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId) == 0x0000D0, "Wrong size on WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, InOffEffectStatusId) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::InOffEffectStatusId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, IsDebuff) == 0x000008, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::IsDebuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000B9, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000BA, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_BooleanOR_ReturnValue) == 0x0000BB, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_Not_PreBool_ReturnValue) == 0x0000BC, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_GetUMGManager_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId, CallFunc_SyncLoadTexture_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Parts_Buff_001_C_SetIconFromOddEffectStatusId::CallFunc_SyncLoadTexture_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.SetSlideValue
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_SetSlideValue final
{
public:
	int32                                         InSlideValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_SetSlideValue) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_SetSlideValue");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_SetSlideValue) == 0x000030, "Wrong size on WBP_Menu_Parts_Buff_001_C_SetSlideValue");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, InSlideValue) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::InSlideValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, Temp_byte_Variable2) == 0x000015, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, Temp_bool_Variable) == 0x000016, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001D, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_SetSlideValue, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_Menu_Parts_Buff_001_C_SetSlideValue::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.IsSetOddEffect
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_IsSetOddEffect final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_IsSetOddEffect) == 0x000001, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_IsSetOddEffect");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_IsSetOddEffect) == 0x000001, "Wrong size on WBP_Menu_Parts_Buff_001_C_IsSetOddEffect");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_IsSetOddEffect, NewParam) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_IsSetOddEffect::NewParam' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C.GetVisibirityOddEffect
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect final
{
public:
	ESlateVisibility                              NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect) == 0x000001, "Wrong alignment on WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect");
static_assert(sizeof(WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect) == 0x000004, "Wrong size on WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect, NewParam) == 0x000000, "Member 'WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect, Temp_bool_Variable) == 0x000001, "Member 'WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect, Temp_byte_Variable) == 0x000002, "Member 'WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect, K2Node_Select_Default) == 0x000003, "Member 'WBP_Menu_Parts_Buff_001_C_GetVisibirityOddEffect::K2Node_Select_Default' has a wrong offset!");

}

