#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_002_modern.WBP_Menu_Battle_List_002_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_002_modern
// 0x0508 (0x0508 - 0x0000)
struct WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetTokugiListAtGameCharacter_ReturnValue; // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetNumPage_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiNotAvailableReason                 Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable4;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_GetItemDataFromSelected_ReturnValue;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackActionDatabase*                    CallFunc_GetActionDatabase_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackActionData                        CallFunc_GetActionData_ReturnValue;                // 0x0150(0x00B0)(NoDestructor)
	struct FJackDataTableActionDamage             CallFunc_GetDTActionDamageRow_ReturnValue;         // 0x0200(0x0058)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0270(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x02B8(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   Temp_name_Variable6;                               // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue9;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue2;            // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGCursorSaveTarget               CallFunc_GetCursorSave_ReturnValue;                // 0x02F8(0x0010)(NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_001_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Battle_List_005_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_005_Modern; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue;       // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnOddEffectStatus_ReturnValue;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue10;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue2;      // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue11;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0378(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackGameCharacter*                     CallFunc_GetNearTargetCharacter_ReturnValue;       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue12;          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_013_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetFirstTargetCharacter_ReturnValue;      // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue3;           // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x03C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue13;          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue14;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x03E8(0x0048)()
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue15;          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiNotAvailableReason                 CallFunc_GetTokugiNotAvailableReason_NotAvailableReason; // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTokugiNotAvailableReason_OutActionId;  // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTokugiNotAvailableReason_OutNeedEquippedWeaponStyleTextId; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0458(0x0048)()
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x04A0(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x04E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_Select_Default;                             // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern");
static_assert(sizeof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern) == 0x000508, "Wrong size on WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_CustomEvent_EventName) == 0x000018, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_CustomEvent_InItemBase) == 0x000020, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_Array_Length_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000060, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_Divide_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetTokugiListAtGameCharacter_ReturnValue) == 0x000078, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetTokugiListAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetNumPage_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetNumPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x000098, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000A8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x0000B0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_name_Variable) == 0x0000B8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x0000C8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000D0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000D8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorCommon_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetGold_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_name_Variable2) == 0x0000F0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_CustomEvent_EventTag) == 0x000100, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_name_Variable3) == 0x000108, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_SwitchName3_CmpSuccess) == 0x000110, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x000118, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_MakeLiteralName_ReturnValue) == 0x000120, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_byte_Variable) == 0x000128, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_name_Variable4) == 0x000130, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetItemDataFromSelected_ReturnValue) == 0x000138, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetItemDataFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000140, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetActionDatabase_ReturnValue) == 0x000148, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetActionDatabase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetActionData_ReturnValue) == 0x000150, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetActionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetDTActionDamageRow_ReturnValue) == 0x000200, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetDTActionDamageRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_FTrunc_ReturnValue) == 0x000258, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x00025C, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue7) == 0x000260, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_name_Variable5) == 0x000268, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000270, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_MakeArray_Array) == 0x0002B8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_name_Variable6) == 0x0002C8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue8) == 0x0002D0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0002D8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue9) == 0x0002E0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetCharacterType_ReturnValue) == 0x0002E8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetCharacterType_ReturnValue2) == 0x0002E9, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetCharacterType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0002F0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetCursorSave_ReturnValue) == 0x0002F8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetCursorSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000308, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000310, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern) == 0x000318, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_DynamicCast_bSuccess) == 0x000320, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_005_Modern) == 0x000328, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_005_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_DynamicCast_bSuccess2) == 0x000330, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_VerifyDataTableRowName_ReturnValue) == 0x000338, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_VerifyDataTableRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_IsOnOddEffectStatus_ReturnValue) == 0x000340, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_IsOnOddEffectStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue10) == 0x000348, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_VerifyDataTableRowName_ReturnValue2) == 0x000350, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_VerifyDataTableRowName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000358, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x00035C, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000360, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue11) == 0x000370, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_struct_Variable) == 0x000378, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetNearTargetCharacter_ReturnValue) == 0x000388, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetNearTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue12) == 0x000390, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x000398, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x0003A0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern) == 0x0003A8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_DynamicCast_bSuccess3) == 0x0003B0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetFirstTargetCharacter_ReturnValue) == 0x0003B8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetFirstTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_BattleCommandMenu_ReturnValue3) == 0x0003C0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_BattleCommandMenu_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, Temp_struct_Variable2) == 0x0003C8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue13) == 0x0003D8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue14) == 0x0003E0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2) == 0x0003E8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue15) == 0x000430, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x000438, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetTokugiNotAvailableReason_NotAvailableReason) == 0x000440, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetTokugiNotAvailableReason_NotAvailableReason' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetTokugiNotAvailableReason_OutActionId) == 0x000448, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetTokugiNotAvailableReason_OutActionId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetTokugiNotAvailableReason_OutNeedEquippedWeaponStyleTextId) == 0x000450, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetTokugiNotAvailableReason_OutNeedEquippedWeaponStyleTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000458, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0004A0, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_MakeArray_Array2) == 0x0004E8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, K2Node_Select_Default) == 0x0004F8, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x000500, "Member 'WBP_Menu_Battle_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_002_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");

// Function WBP_Menu_Battle_List_002_modern.WBP_Menu_Battle_List_002_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_002_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_002_modern.WBP_Menu_Battle_List_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_002_modern.WBP_Menu_Battle_List_002_modern_C.SetParamSetumei
// 0x0140 (0x0140 - 0x0000)
struct WBP_Menu_Battle_List_002_modern_C_SetParamSetumei final
{
public:
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   SetumeiWindow;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackActionDatabase*                    CallFunc_GetActionDatabase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetActionDescriptionString_OutDescriptiont; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleCassterMP_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackActionData                        CallFunc_GetActionData_ReturnValue;                // 0x0030(0x00B0)(NoDestructor)
	struct FJackDataTableActionDamage             CallFunc_GetDTActionDamageRow_ReturnValue;         // 0x00E0(0x0058)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_002_modern_C_SetParamSetumei");
static_assert(sizeof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei) == 0x000140, "Wrong size on WBP_Menu_Battle_List_002_modern_C_SetParamSetumei");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, SetumeiWindow) == 0x000000, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::SetumeiWindow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_GetActionDatabase_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_GetActionDatabase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_GetAccessorBattle_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_GetActionDescriptionString_OutDescriptiont) == 0x000018, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_GetActionDescriptionString_OutDescriptiont' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_GetBattleCassterMP_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_GetBattleCassterMP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, K2Node_SwitchName_CmpSuccess) == 0x00002C, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_GetActionData_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_GetActionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_GetDTActionDamageRow_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_GetDTActionDamageRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_SetParamSetumei, CallFunc_FTrunc_ReturnValue) == 0x000138, "Member 'WBP_Menu_Battle_List_002_modern_C_SetParamSetumei::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_002_modern.WBP_Menu_Battle_List_002_modern_C.OpenSetimeiWindow
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow");
static_assert(sizeof(WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow) == 0x000028, "Wrong size on WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_002_modern_C_OpenSetimeiWindow::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
