#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Photo_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C
// 0x00F0 (0x0520 - 0x0430)
class UWBP_Menu_Photo_000_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           Alignment;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Background;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_2;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_00;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_01;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_02;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_03;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_04;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_05;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_067_modern_C*           WBP_Menu_Parts_067;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         InversH;                                           // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InversV;                                           // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       SelectedItemBase;                                  // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AutoMove;                                          // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraSpeed;                                       // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewVar_0;                                          // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     SnapSave;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_062_modern_C*>   MenuPartsList;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsRelocate;                                        // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeSeconds;                                       // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CharaList;                                         // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         InitValue;                                         // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Photo_000_modern(int32 EntryPoint);
	void PhotoModeBPDelegate_Event_0(EJackPhotoModeEvent EventType);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void Construct();
	void WidgetBPActionDelegate(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void IsCharacterHiddenFromItemData(class UJackUMGItemData* NewParam1, bool* NewParam);
	void IsCharacterHiddenFromCharacterType(EJackCharacter NewParam1, bool* NewParam);
	void HideHUD(bool bIsHide);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Photo_000_modern_C">();
	}
	static class UWBP_Menu_Photo_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Photo_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Photo_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Photo_000_modern_C");
static_assert(sizeof(UWBP_Menu_Photo_000_modern_C) == 0x000520, "Wrong size on UWBP_Menu_Photo_000_modern_C");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Photo_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, Alignment) == 0x000438, "Member 'UWBP_Menu_Photo_000_modern_C::Alignment' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, Background) == 0x000440, "Member 'UWBP_Menu_Photo_000_modern_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, ItemList) == 0x000448, "Member 'UWBP_Menu_Photo_000_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, Line_1) == 0x000450, "Member 'UWBP_Menu_Photo_000_modern_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, Line_2) == 0x000458, "Member 'UWBP_Menu_Photo_000_modern_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, Line_3) == 0x000460, "Member 'UWBP_Menu_Photo_000_modern_C::Line_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, RootPanel) == 0x000468, "Member 'UWBP_Menu_Photo_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_000) == 0x000470, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_000_C_2) == 0x000478, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_000_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_000_C_114) == 0x000480, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_062_00) == 0x000488, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_062_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_062_01) == 0x000490, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_062_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_062_02) == 0x000498, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_062_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_062_03) == 0x0004A0, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_062_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_062_04) == 0x0004A8, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_062_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_062_05) == 0x0004B0, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_062_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, WBP_Menu_Parts_067) == 0x0004B8, "Member 'UWBP_Menu_Photo_000_modern_C::WBP_Menu_Parts_067' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, Window) == 0x0004C0, "Member 'UWBP_Menu_Photo_000_modern_C::Window' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, InversH) == 0x0004C8, "Member 'UWBP_Menu_Photo_000_modern_C::InversH' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, InversV) == 0x0004CC, "Member 'UWBP_Menu_Photo_000_modern_C::InversV' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, SelectedItemBase) == 0x0004D0, "Member 'UWBP_Menu_Photo_000_modern_C::SelectedItemBase' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, AutoMove) == 0x0004D8, "Member 'UWBP_Menu_Photo_000_modern_C::AutoMove' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, CameraSpeed) == 0x0004DC, "Member 'UWBP_Menu_Photo_000_modern_C::CameraSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, NewVar_0) == 0x0004E0, "Member 'UWBP_Menu_Photo_000_modern_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, SnapSave) == 0x0004E8, "Member 'UWBP_Menu_Photo_000_modern_C::SnapSave' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, MenuPartsList) == 0x0004F0, "Member 'UWBP_Menu_Photo_000_modern_C::MenuPartsList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, IsRelocate) == 0x000500, "Member 'UWBP_Menu_Photo_000_modern_C::IsRelocate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, FadeSeconds) == 0x000504, "Member 'UWBP_Menu_Photo_000_modern_C::FadeSeconds' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, CharaList) == 0x000508, "Member 'UWBP_Menu_Photo_000_modern_C::CharaList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Photo_000_modern_C, InitValue) == 0x000518, "Member 'UWBP_Menu_Photo_000_modern_C::InitValue' has a wrong offset!");

}

