#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_079_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Menu_Parts_QuestRewardBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_079_modern.WBP_Menu_Parts_079_modern_C
// 0x0048 (0x0458 - 0x0410)
class UWBP_Menu_Parts_079_modern_C final : public UWBP_Menu_Parts_QuestRewardBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Menu_Parts_079_modern_C;        // 0x0410(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 CategoryIcon;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GoldIcon;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MedalIcon;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PowerUpIcon;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemCount;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemInfo;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Reward;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Tani;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Parts_079_modern(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_079_modern_C">();
	}
	static class UWBP_Menu_Parts_079_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_079_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_079_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_079_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_079_modern_C) == 0x000458, "Wrong size on UWBP_Menu_Parts_079_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, UberGraphFrame_WBP_Menu_Parts_079_modern_C) == 0x000410, "Member 'UWBP_Menu_Parts_079_modern_C::UberGraphFrame_WBP_Menu_Parts_079_modern_C' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, CategoryIcon) == 0x000418, "Member 'UWBP_Menu_Parts_079_modern_C::CategoryIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, GoldIcon) == 0x000420, "Member 'UWBP_Menu_Parts_079_modern_C::GoldIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, MedalIcon) == 0x000428, "Member 'UWBP_Menu_Parts_079_modern_C::MedalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, PowerUpIcon) == 0x000430, "Member 'UWBP_Menu_Parts_079_modern_C::PowerUpIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, Text_ItemCount) == 0x000438, "Member 'UWBP_Menu_Parts_079_modern_C::Text_ItemCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, Text_ItemInfo) == 0x000440, "Member 'UWBP_Menu_Parts_079_modern_C::Text_ItemInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, Text_Reward) == 0x000448, "Member 'UWBP_Menu_Parts_079_modern_C::Text_Reward' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_079_modern_C, Text_Tani) == 0x000450, "Member 'UWBP_Menu_Parts_079_modern_C::Text_Tani' has a wrong offset!");

}

