#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_Button_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern
// 0x0098 (0x0098 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_UpdateMapSymbolVisibleButtonStatus_Button; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoukenGuideVisible_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackWorldMapState>                    K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_UpdateBoukenGuideVisibleButtonStatus_Button; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestsWorldMapStates_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackWorldMapState>                    K2Node_MakeArray_Array2;                           // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_TestsWorldMapStates_ReturnValue2;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern) == 0x000098, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, CallFunc_UpdateMapSymbolVisibleButtonStatus_Button) == 0x000050, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::CallFunc_UpdateMapSymbolVisibleButtonStatus_Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, CallFunc_GetBoukenGuideVisible_ReturnValue) == 0x000058, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::CallFunc_GetBoukenGuideVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, CallFunc_UpdateBoukenGuideVisibleButtonStatus_Button) == 0x000070, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::CallFunc_UpdateBoukenGuideVisibleButtonStatus_Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, CallFunc_TestsWorldMapStates_ReturnValue) == 0x000078, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::CallFunc_TestsWorldMapStates_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, K2Node_MakeArray_Array2) == 0x000080, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern, CallFunc_TestsWorldMapStates_ReturnValue2) == 0x000090, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_003_modern::CallFunc_TestsWorldMapStates_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_Tick");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_Tick");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.SetButtonAndCaption
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption) == 0x000010, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption, InKeyType) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption, InTxetId) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_SetButtonAndCaption::InTxetId' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.UpdateButtonItem
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem final
{
public:
	class UWBP_Menu_Parts_008_modern_C*           TargetButton;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAcquiredRura_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem) == 0x000038, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, TargetButton) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::TargetButton' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_IsAcquiredRura_ReturnValue) == 0x000014, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_IsAcquiredRura_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000028, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_NotEqual_NameName_ReturnValue) == 0x000029, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.SetupButtonItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem final
{
public:
	bool                                          ButtonNum1SheetVisible;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ButtonNum3SheetVisible;                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_008_modern_C*>   K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem) == 0x000020, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem, ButtonNum1SheetVisible) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem::ButtonNum1SheetVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem, ButtonNum3SheetVisible) == 0x000001, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem::ButtonNum3SheetVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem, CallFunc_IsSeaOrSkyMap_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_SetupButtonItem::CallFunc_IsSeaOrSkyMap_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.MapSymbolVisibleChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged final
{
public:
	class UObject*                                Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Payload;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_UpdateMapSymbolVisibleButtonStatus_Button; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMapDelegateButtonPayload*       K2Node_DynamicCast_AsJack_UMGMap_Delegate_Button_Payload; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged) == 0x000030, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged, Sender) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged, bVisible) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged, Payload) == 0x000010, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged::Payload' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged, CallFunc_UpdateMapSymbolVisibleButtonStatus_Button) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged::CallFunc_UpdateMapSymbolVisibleButtonStatus_Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged, K2Node_DynamicCast_AsJack_UMGMap_Delegate_Button_Payload) == 0x000020, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged::K2Node_DynamicCast_AsJack_UMGMap_Delegate_Button_Payload' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_MapSymbolVisibleChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.FindButtonItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem final
{
public:
	class FName                                   ButtonTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           FoundButton;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem) == 0x000030, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, ButtonTag) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::ButtonTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, FoundButton) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::FoundButton' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000029, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_FindButtonItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.BindHandler
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_Button_003_modern_C_BindHandler final
{
public:
	bool                                          bUnbind;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Sender, bool bValue, class UObject* Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, bool bValue, class UObject* Payload)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_BindHandler) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_BindHandler");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_BindHandler) == 0x000028, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_BindHandler");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BindHandler, bUnbind) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BindHandler::bUnbind' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BindHandler, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BindHandler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BindHandler, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BindHandler::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.BoukenGuideVisibleChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged final
{
public:
	class UObject*                                Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Payload;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_UpdateBoukenGuideVisibleButtonStatus_Button; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged) == 0x000020, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged, Sender) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged, bVisible) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged, Payload) == 0x000010, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged::Payload' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged, CallFunc_UpdateBoukenGuideVisibleButtonStatus_Button) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_BoukenGuideVisibleChanged::CallFunc_UpdateBoukenGuideVisibleButtonStatus_Button' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.UpdateMapSymbolVisibleButtonStatus
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_008_modern_C*           Button;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_FindButtonItem_FoundButton;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus) == 0x000020, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus, bVisible) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus, Button) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus::Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus, CallFunc_FindButtonItem_FoundButton) == 0x000010, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus::CallFunc_FindButtonItem_FoundButton' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateMapSymbolVisibleButtonStatus::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.UpdateBoukenGuideVisibleButtonStatus
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_008_modern_C*           Button;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           CallFunc_FindButtonItem_FoundButton;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus) == 0x000020, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus, bVisible) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus, Button) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus::Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus, CallFunc_FindButtonItem_FoundButton) == 0x000010, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus::CallFunc_FindButtonItem_FoundButton' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateBoukenGuideVisibleButtonStatus::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_003_modern.WBP_Menu_WorldMap_Button_003_modern_C.UpdateButtonItemForSeaSkyMap
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap final
{
public:
	bool                                          CallFunc_TestsWorldMapState_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap");
static_assert(sizeof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap) == 0x000002, "Wrong size on WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap");
static_assert(offsetof(WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap, CallFunc_TestsWorldMapState_ReturnValue) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_003_modern_C_UpdateButtonItemForSeaSkyMap::CallFunc_TestsWorldMapState_ReturnValue' has a wrong offset!");
