#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Nakama_Button_000_modern

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Nakama_Button_000_modern.WBP_Hud_Nakama_Button_000_modern_C.ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern) == 0x000004, "Wrong alignment on WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern");
static_assert(sizeof(WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern) == 0x000048, "Wrong size on WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern");
static_assert(offsetof(WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern, CallFunc_IsOpenSerifuWindow_ReturnValue) == 0x000044, "Member 'WBP_Hud_Nakama_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Nakama_Button_000_modern::CallFunc_IsOpenSerifuWindow_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Nakama_Button_000_modern.WBP_Hud_Nakama_Button_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Nakama_Button_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Nakama_Button_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Hud_Nakama_Button_000_modern_C_Tick");
static_assert(sizeof(WBP_Hud_Nakama_Button_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Hud_Nakama_Button_000_modern_C_Tick");
static_assert(offsetof(WBP_Hud_Nakama_Button_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Hud_Nakama_Button_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Nakama_Button_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Hud_Nakama_Button_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

}

