#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tokugi_Piece_000

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000
// 0x0160 (0x0160 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPanelPieceState                    Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPieceAnim                          Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackTokugiPieceAnim                          Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPieceAnim                          Temp_byte_Variable4;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Position2;                            // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Position;                             // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_BgScroll2;                            // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_TokugiPanel_Item_C> K2Node_Event_CancelEventListener;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                K2Node_Event_CharacterType;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_TokugiPanel_Item_C> K2Node_Event_Listener;                             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            K2Node_Event_Sender;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Arg2;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_Arg;                                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGTokugiPanelData*                K2Node_Event_PanelData;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_ItemData;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGTokugiPanelAnimData            K2Node_Event_AnimData;                             // 0x0088(0x0040)()
	class FName                                   K2Node_Event_Message;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Pos;                            // 0x00D0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGTokugiPanelData*                K2Node_CustomEvent_Data;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Position;                       // 0x00E0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Scale;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_BgScroll;                       // 0x00EC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00F4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00FC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0104(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x010C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPieceAnim                          Temp_byte_Variable5;                               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0118(0x001C)(NoDestructor)
	float                                         K2Node_Event_DisplayScale;                         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_BgScroll;                             // 0x0138(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPieceAnim                          Temp_byte_Variable6;                               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPieceAnim                          K2Node_Select_Default;                             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPanelAnimCategory                  K2Node_CustomEvent_AnimCategory;                   // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackTokugiPieceAnim                          K2Node_Select2_Default;                            // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000) == 0x000160, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_bool_Variable) == 0x000006, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_byte_Variable3) == 0x000007, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_byte_Variable4) == 0x000008, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Position2) == 0x000018, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Position2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Position) == 0x000020, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Position' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Scale) == 0x000028, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_BgScroll2) == 0x00002C, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_BgScroll2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_CancelEventListener) == 0x000038, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_CancelEventListener' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_CharacterType) == 0x000048, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_CharacterType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Listener) == 0x000050, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Listener' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Sender) == 0x000060, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Arg2) == 0x000068, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Arg2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Arg) == 0x000070, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Arg' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_PanelData) == 0x000078, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_PanelData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_ItemData) == 0x000080, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_AnimData) == 0x000088, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_AnimData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_Message) == 0x0000C8, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_CustomEvent_Pos) == 0x0000D0, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_CustomEvent_Pos' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_CustomEvent_Data) == 0x0000D8, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_CustomEvent_Position) == 0x0000E0, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_CustomEvent_Position' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_CustomEvent_Scale) == 0x0000E8, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_CustomEvent_Scale' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_CustomEvent_BgScroll) == 0x0000EC, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_CustomEvent_BgScroll' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000F4, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000FC, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000104, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_MakeVector2D_ReturnValue) == 0x00010C, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_byte_Variable5) == 0x000114, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_MakeStruct_WidgetTransform) == 0x000118, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_DisplayScale) == 0x000134, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_DisplayScale' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Event_BgScroll) == 0x000138, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Event_BgScroll' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_MakeArray_Array) == 0x000140, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_Array_Get_Item) == 0x000150, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, Temp_byte_Variable6) == 0x000158, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Select_Default) == 0x000159, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_CustomEvent_AnimCategory) == 0x00015A, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_CustomEvent_AnimCategory' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00015B, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000, K2Node_Select2_Default) == 0x00015C, "Member 'WBP_Menu_Tokugi_Piece_000_C_ExecuteUbergraph_WBP_Menu_Tokugi_Piece_000::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.AnimClose
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_AnimClose final
{
public:
	EJackTokugiPanelAnimCategory                  AnimCategory;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_AnimClose) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_AnimClose");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_AnimClose) == 0x000001, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_AnimClose");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_AnimClose, AnimCategory) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_AnimClose::AnimCategory' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetBackGroundScroll
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll final
{
public:
	struct FVector2D                              BgScroll_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll, BgScroll_0) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetBackGroundScroll::BgScroll_0' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetDisplayScale
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale final
{
public:
	float                                         DisplayScale;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale) == 0x000004, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale, DisplayScale) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetDisplayScale::DisplayScale' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetPosAndScale
// 0x0014 (0x0014 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale final
{
public:
	struct FVector2D                              Position_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BgScroll_0;                                        // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale) == 0x000014, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale, Position_0) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale::Position_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale, Scale_0) == 0x000008, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale::Scale_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale, BgScroll_0) == 0x00000C, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetPosAndScale::BgScroll_0' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetData final
{
public:
	class UJackUMGTokugiPanelData*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetData");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetData");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetData, Data) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetData::Data' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetPosition
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetPosition final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetPosition) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetPosition");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetPosition) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetPosition");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetPosition, Pos) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetPosition::Pos' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SendTokugiPanelMessage
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage final
{
public:
	class FName                                   Message;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage, Message) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SendTokugiPanelMessage::Message' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.PlayAnimData
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_PlayAnimData final
{
public:
	struct FJackUMGTokugiPanelAnimData            AnimData;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimData) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_PlayAnimData");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimData) == 0x000040, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_PlayAnimData");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimData, AnimData) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_PlayAnimData::AnimData' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetCharacterItemData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData final
{
public:
	class UJackUMGItemData*                       ItemData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData, ItemData) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetCharacterItemData::ItemData' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetPanelData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetPanelData final
{
public:
	class UJackUMGTokugiPanelData*                PanelData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetPanelData) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetPanelData");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetPanelData) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetPanelData");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetPanelData, PanelData) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetPanelData::PanelData' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.PlayAnimationNameArg
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg final
{
public:
	class FName                                   Arg;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg, Arg) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_PlayAnimationNameArg::Arg' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.PlayAnimationIntArg
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg final
{
public:
	int32                                         Arg;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg) == 0x000004, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg, Arg) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_PlayAnimationIntArg::Arg' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.OnEndAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_OnEndAnim final
{
public:
	class UUserWidget*                            Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_OnEndAnim) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_OnEndAnim");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_OnEndAnim) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_OnEndAnim");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_OnEndAnim, Sender) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_OnEndAnim::Sender' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetEndAnimEventListener
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener final
{
public:
	TScriptInterface<class IBP_IF_TokugiPanel_Item_C> Listener;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener) == 0x000010, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener, Listener) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetEndAnimEventListener::Listener' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetBattleResultMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode final
{
public:
	EJackCharacter                                CharacterType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode) == 0x000001, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode, CharacterType) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetBattleResultMode::CharacterType' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetCancelEventListener
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener final
{
public:
	TScriptInterface<class IBP_IF_TokugiPanel_Item_C> CancelEventListener;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener) == 0x000010, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener, CancelEventListener) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetCancelEventListener::CancelEventListener' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetDisplayData
// 0x0014 (0x0014 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetDisplayData final
{
public:
	struct FVector2D                              Position_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BgScroll_0;                                        // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayData) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetDisplayData");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayData) == 0x000014, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetDisplayData");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayData, Position_0) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetDisplayData::Position_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayData, Scale_0) == 0x000008, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetDisplayData::Scale_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetDisplayData, BgScroll_0) == 0x00000C, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetDisplayData::BgScroll_0' has a wrong offset!");

// Function WBP_Menu_Tokugi_Piece_000.WBP_Menu_Tokugi_Piece_000_C.SetDrawPos
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Piece_000_C_SetDrawPos final
{
public:
	struct FVector2D                              Position_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Piece_000_C_SetDrawPos) == 0x000004, "Wrong alignment on WBP_Menu_Tokugi_Piece_000_C_SetDrawPos");
static_assert(sizeof(WBP_Menu_Tokugi_Piece_000_C_SetDrawPos) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Piece_000_C_SetDrawPos");
static_assert(offsetof(WBP_Menu_Tokugi_Piece_000_C_SetDrawPos, Position_0) == 0x000000, "Member 'WBP_Menu_Tokugi_Piece_000_C_SetDrawPos::Position_0' has a wrong offset!");

}

