#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_004_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tuyosa_List_004_modern.WBP_Menu_Tuyosa_List_004_modern_C.PageControllKeyEvent__DelegateSignature
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature final
{
public:
	bool                                          bIsRemove;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNextPage;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPrevPage;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000003, "Wrong size on WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature, bIsRemove) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature::bIsRemove' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature, bNextPage) == 0x000001, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature::bNextPage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature, bPrevPage) == 0x000002, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_PageControllKeyEvent__DelegateSignature::bPrevPage' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_004_modern.WBP_Menu_Tuyosa_List_004_modern_C.ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern
// 0x0098 (0x0098 - 0x0000)
struct WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMemberDataInTuyosa*     K2Node_CustomEvent_TuyosaData;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PageMoveInput;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item2;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item3;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern");
static_assert(sizeof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern) == 0x000098, "Wrong size on WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CustomEvent_InKeyType) == 0x000018, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CustomEvent_bIsPressed) == 0x000019, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CustomEvent_EventTag) == 0x000020, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CustomEvent_TuyosaData) == 0x000030, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CustomEvent_TuyosaData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CustomEvent_PageMoveInput) == 0x000038, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CustomEvent_PageMoveInput' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Array_Length_ReturnValue2) == 0x000060, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Array_Get_Item2) == 0x000068, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Array_Get_Item3) == 0x000070, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Array_Length_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000088, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_004_modern.WBP_Menu_Tuyosa_List_004_modern_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tuyosa_List_004_modern_C_SetData final
{
public:
	class UJackUMGAccessorMemberDataInTuyosa*     TuyosaData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageMoveInput;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_004_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_004_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Tuyosa_List_004_modern_C_SetData) == 0x000010, "Wrong size on WBP_Menu_Tuyosa_List_004_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_SetData, TuyosaData) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_SetData::TuyosaData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_SetData, PageMoveInput) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_SetData::PageMoveInput' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_004_modern.WBP_Menu_Tuyosa_List_004_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_004_modern.WBP_Menu_Tuyosa_List_004_modern_C.OnKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent");
static_assert(sizeof(WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Tuyosa_List_004_modern_C_OnKeyEvent::bIsPressed' has a wrong offset!");

}

