#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Quantity_001_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern
// 0x0058 (0x0058 - 0x0000)
struct WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern) == 0x000058, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_CustomEvent_InEventTag) == 0x000038, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000040, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_CustomEvent_InObject) == 0x000048, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000051, "Member 'WBP_Menu_Common_Quantity_001_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_001_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.DefaultNotificationDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate) == 0x000018, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate, InEventTag) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate, InObject) == 0x000010, "Member 'WBP_Menu_Common_Quantity_001_modern_C_DefaultNotificationDelegate::InObject' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.SetupQuantity
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity final
{
public:
	class FName                                   InCaptionTextId;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InUnitTextId;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InInitValue;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMin;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMax;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity) == 0x000020, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity, InCaptionTextId) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity::InCaptionTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity, InUnitTextId) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity, InInitValue) == 0x000010, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity::InInitValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity, InMin) == 0x000014, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity::InMin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity, InMax) == 0x000018, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupQuantity::InMax' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.SetupCaptionQuantity1
// 0x0060 (0x0060 - 0x0000)
struct WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1 final
{
public:
	class FName                                   InCaptionTextId;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InUnitTextId;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0020(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue2;    // 0x0048(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1) == 0x000060, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, InCaptionTextId) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::InCaptionTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, InUnitTextId) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, CallFunc_NotEqual_NameName_ReturnValue) == 0x000018, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, CallFunc_GetUMGManager_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1, CallFunc_GetUMGMenuTextFromTextId_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity1::CallFunc_GetUMGMenuTextFromTextId_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.SetupCaptionQuantity2
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2 final
{
public:
	class FName                                   InWindowCaptionId;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InInputUnitId;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InResultCaptionId;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InResultUnitId;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0030(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue2;    // 0x0058(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue3;    // 0x0078(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2) == 0x000090, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, InWindowCaptionId) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::InWindowCaptionId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, InInputUnitId) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::InInputUnitId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, InResultCaptionId) == 0x000010, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::InResultCaptionId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, InResultUnitId) == 0x000018, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::InResultUnitId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_NotEqual_NameName_ReturnValue) == 0x000028, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000030, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_NotEqual_NameName_ReturnValue3) == 0x000049, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_NotEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_GetUMGManager_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_GetUMGMenuTextFromTextId_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_GetUMGMenuTextFromTextId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_GetUMGManager_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2, CallFunc_GetUMGMenuTextFromTextId_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity2::CallFunc_GetUMGMenuTextFromTextId_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.SetupCaptionQuantity3
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3 final
{
public:
	class FName                                   InWindowCaptionId;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InInputUnitId;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InResultCaptionId;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InResultUnitId;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0030(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue2;    // 0x0058(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue3;    // 0x0078(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3) == 0x000090, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, InWindowCaptionId) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::InWindowCaptionId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, InInputUnitId) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::InInputUnitId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, InResultCaptionId) == 0x000010, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::InResultCaptionId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, InResultUnitId) == 0x000018, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::InResultUnitId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_NotEqual_NameName_ReturnValue) == 0x000028, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000030, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_NotEqual_NameName_ReturnValue3) == 0x000049, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_NotEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_GetUMGManager_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_GetUMGMenuTextFromTextId_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_GetUMGMenuTextFromTextId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_GetUMGManager_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3, CallFunc_GetUMGMenuTextFromTextId_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity3::CallFunc_GetUMGMenuTextFromTextId_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_001_modern.WBP_Menu_Common_Quantity_001_modern_C.SetupCaptionQuantity
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity final
{
public:
	int32                                         InWindowType;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InWindowCaptionId;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InInputUnitId;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InResultCaptionId;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InResultUnitId;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity");
static_assert(sizeof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity) == 0x000030, "Wrong size on WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity, InWindowType) == 0x000000, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity::InWindowType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity, InWindowCaptionId) == 0x000008, "Member 'WBP_Menu_Common_Quantity_001_modern_C_SetupCaptionQuantity::InWindowCaptionId' has a wrong offset!");
