#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_072_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_072_modern.WBP_Menu_Parts_072_modern_C
// 0x0038 (0x0408 - 0x03D0)
class UWBP_Menu_Parts_072_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           TextPanel;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextBlockList;                                     // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UImage*>                         ImageList;                                         // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         MaxLine;                                           // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_072_modern(int32 EntryPoint);
	void Construct();
	void SetCaptionData(const class FString& Caption);
	void SetData(class FName TextID_0);
	void SetTopPosition(float Position_0);
	void SetPartsList(TArray<class UTextBlock*>& InTextBlockList, TArray<class UImage*>& InImageList);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_072_modern_C">();
	}
	static class UWBP_Menu_Parts_072_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_072_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_072_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_072_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_072_modern_C) == 0x000408, "Wrong size on UWBP_Menu_Parts_072_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_072_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_072_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_072_modern_C, TextPanel) == 0x0003D8, "Member 'UWBP_Menu_Parts_072_modern_C::TextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_072_modern_C, TextBlockList) == 0x0003E0, "Member 'UWBP_Menu_Parts_072_modern_C::TextBlockList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_072_modern_C, ImageList) == 0x0003F0, "Member 'UWBP_Menu_Parts_072_modern_C::ImageList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_072_modern_C, MaxLine) == 0x000400, "Member 'UWBP_Menu_Parts_072_modern_C::MaxLine' has a wrong offset!");

}

