#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Buff_000

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_Buff_000.WBP_Menu_Parts_Buff_000_C.ExecuteUbergraph_WBP_Menu_Parts_Buff_000
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000) == 0x000004, "Wrong alignment on WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000");
static_assert(sizeof(WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000) == 0x000048, "Wrong size on WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000");
static_assert(offsetof(WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000, CallFunc_SetOddEffectId_Debuff) == 0x000044, "Member 'WBP_Menu_Parts_Buff_000_C_ExecuteUbergraph_WBP_Menu_Parts_Buff_000::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");

// Function WBP_Menu_Parts_Buff_000.WBP_Menu_Parts_Buff_000_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Parts_Buff_000_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Buff_000_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Parts_Buff_000_C_Tick");
static_assert(sizeof(WBP_Menu_Parts_Buff_000_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Parts_Buff_000_C_Tick");
static_assert(offsetof(WBP_Menu_Parts_Buff_000_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Parts_Buff_000_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Buff_000_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Parts_Buff_000_C_Tick::InDeltaTime' has a wrong offset!");

}

