#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_Item_010_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_Item_010_modern.WBP_Menu_Battle_Item_010_modern_C.ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern");
static_assert(sizeof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern) == 0x000048, "Wrong size on WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, K2Node_Event_InItemData) == 0x000008, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_GetValidValue_ReturnValue) == 0x000021, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_BagTypeToCharType_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_BagTypeToCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern, K2Node_Select_Default) == 0x000040, "Member 'WBP_Menu_Battle_Item_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_010_modern::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Battle_Item_010_modern.WBP_Menu_Battle_Item_010_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Battle_Item_010_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Item_010_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Item_010_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Battle_Item_010_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Battle_Item_010_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Battle_Item_010_modern_C_DrawItemBase::InItemData' has a wrong offset!");

// Function WBP_Menu_Battle_Item_010_modern.WBP_Menu_Battle_Item_010_modern_C.SetPriceMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Battle_Item_010_modern_C_SetPriceMode final
{
public:
	bool                                          IsPriceMode_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_Item_010_modern_C_SetPriceMode) == 0x000001, "Wrong alignment on WBP_Menu_Battle_Item_010_modern_C_SetPriceMode");
static_assert(sizeof(WBP_Menu_Battle_Item_010_modern_C_SetPriceMode) == 0x000001, "Wrong size on WBP_Menu_Battle_Item_010_modern_C_SetPriceMode");
static_assert(offsetof(WBP_Menu_Battle_Item_010_modern_C_SetPriceMode, IsPriceMode_0) == 0x000000, "Member 'WBP_Menu_Battle_Item_010_modern_C_SetPriceMode::IsPriceMode_0' has a wrong offset!");

}

