#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_MonsterZukan_Window_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKilledMonsterInList_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Senreki_MonsterZukan_Window_004_modern_C* K2Node_DynamicCast_AsWBP_Menu_Senreki_Monster_Zukan_Window_004_Modern; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OutMonsterIndex;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutMonsterIndex)>        K2Node_CreateDelegate_OutputDelegate3;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue2;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue4;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern) == 0x0000F8, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000040, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000050, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_IsKilledMonsterInList_ReturnValue) == 0x000060, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_IsKilledMonsterInList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000068, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_DynamicCast_AsWBP_Menu_Senreki_Monster_Zukan_Window_004_Modern) == 0x000070, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_DynamicCast_AsWBP_Menu_Senreki_Monster_Zukan_Window_004_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CustomEvent_OutMonsterIndex) == 0x00007C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CustomEvent_OutMonsterIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CustomEvent_InKeyType) == 0x000080, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CustomEvent_bIsPressed) == 0x000081, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000082, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetAccessorSenreki_ReturnValue3) == 0x000088, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetAccessorSenreki_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000090, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetSenrekiSortMode_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetSenrekiSortMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000A8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_Divide_IntInt_ReturnValue) == 0x0000B4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0000C0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000D0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CustomEvent_EventName) == 0x0000D8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_CustomEvent_InItemBase) == 0x0000E0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, CallFunc_GetAccessorSenreki_ReturnValue4) == 0x0000E8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::CallFunc_GetAccessorSenreki_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000F0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_003_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.WidgetKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_WidgetKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.CustomEvent_1
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1 final
{
public:
	int32                                         OutMonsterIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1) == 0x000004, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1, OutMonsterIndex) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_1::OutMonsterIndex' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.ChangeSort
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort final
{
public:
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_SetSenrekiSortMode_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSenrekiSortMode                       CallFunc_SetSenrekiSortMode_ReturnValue2;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort) == 0x000010, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort, CallFunc_SetSenrekiSortMode_ReturnValue) == 0x000009, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort::CallFunc_SetSenrekiSortMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort, CallFunc_SetSenrekiSortMode_ReturnValue2) == 0x00000B, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_ChangeSort::CallFunc_SetSenrekiSortMode_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_003_modern.WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C.SetSortButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton final
{
public:
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton) == 0x000010, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_003_modern_C_SetSortButton::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
