#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Saving_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Saving_002_modern.WBP_Hud_Saving_002_modern_C
// 0x0038 (0x03A8 - 0x0370)
class UWBP_Hud_Saving_002_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEnd;                                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Hud_Saving_002_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Saving_002_modern_C">();
	}
	static class UWBP_Hud_Saving_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Saving_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Saving_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Saving_002_modern_C");
static_assert(sizeof(UWBP_Hud_Saving_002_modern_C) == 0x0003A8, "Wrong size on UWBP_Hud_Saving_002_modern_C");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Saving_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, Out) == 0x000378, "Member 'UWBP_Hud_Saving_002_modern_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, Loop) == 0x000380, "Member 'UWBP_Hud_Saving_002_modern_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, In) == 0x000388, "Member 'UWBP_Hud_Saving_002_modern_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, Icon) == 0x000390, "Member 'UWBP_Hud_Saving_002_modern_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, TextPanel) == 0x000398, "Member 'UWBP_Hud_Saving_002_modern_C::TextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Saving_002_modern_C, bEnd) == 0x0003A0, "Member 'UWBP_Hud_Saving_002_modern_C::bEnd' has a wrong offset!");

}

