#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Message_SentakuBase

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Message_SentakuBase.WBP_Menu_Message_SentakuBase_C.ExecuteUbergraph_WBP_Menu_Message_SentakuBase
// 0x0088 (0x0088 - 0x0000)
struct WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDebugInvisible_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue2;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebugInvisible_ReturnValue2;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase) == 0x000008, "Wrong alignment on WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase");
static_assert(sizeof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase) == 0x000088, "Wrong size on WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, EntryPoint) == 0x000000, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000010, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_IsDebugInvisible_ReturnValue) == 0x000028, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_IsDebugInvisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_GetUMGManager_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_GetSerifuWindowController_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_GetSerifuWindowController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_IsDebugInvisible_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_IsDebugInvisible_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_CustomEvent_InKeyType) == 0x000051, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_CustomEvent_bIsPressed) == 0x000052, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_MakeLiteralName_ReturnValue) == 0x000058, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_CustomEvent_EventTag) == 0x000068, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, K2Node_SwitchName_CmpSuccess) == 0x000070, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_GetUMGManager_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase, CallFunc_GetSoundSet_ReturnValue) == 0x000080, "Member 'WBP_Menu_Message_SentakuBase_C_ExecuteUbergraph_WBP_Menu_Message_SentakuBase::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Message_SentakuBase.WBP_Menu_Message_SentakuBase_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Message_SentakuBase_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Message_SentakuBase.WBP_Menu_Message_SentakuBase_C.OnWidgetKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent");
static_assert(sizeof(WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Message_SentakuBase_C_OnWidgetKeyEvent::bIsPressed' has a wrong offset!");

}

