#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI3d_Kazi_Success

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI3d_Kazi_Success.WBP_UI3d_Kazi_Success_C.ExecuteUbergraph_WBP_UI3d_Kazi_Success
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGFukidasiWindowController*       CallFunc_GetFukidasiWindowController_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMG3DWidgetData*                   K2Node_CustomEvent_Data;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGFusigiKaziEffectData*           K2Node_DynamicCast_AsJack_UMGFusigi_Kazi_Effect_Data; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item2;                          // 0x0080(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item3;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetPreloadedTextureByItemId_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemPopIconTexture_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item4;                          // 0x00A4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success) == 0x000008, "Wrong alignment on WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success");
static_assert(sizeof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success) == 0x0000B0, "Wrong size on WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, EntryPoint) == 0x000000, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_GetFukidasiWindowController_ReturnValue) == 0x000018, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_GetFukidasiWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_GetAccessorItem_ReturnValue) == 0x000028, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, Temp_bool_Variable) == 0x000030, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, K2Node_CustomEvent_Data) == 0x000038, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, K2Node_DynamicCast_AsJack_UMGFusigi_Kazi_Effect_Data) == 0x000040, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::K2Node_DynamicCast_AsJack_UMGFusigi_Kazi_Effect_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Percent_IntInt_ReturnValue) == 0x000050, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Array_Length_ReturnValue2) == 0x000068, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Array_Get_Item2) == 0x000080, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Array_Get_Item3) == 0x000088, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_GetPreloadedTextureByItemId_ReturnValue) == 0x000090, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_GetPreloadedTextureByItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_GetItemPopIconTexture_ReturnValue) == 0x000098, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_GetItemPopIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Less_IntInt_ReturnValue2) == 0x0000A1, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, CallFunc_Array_Get_Item4) == 0x0000A4, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, Temp_byte_Variable) == 0x0000AC, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, Temp_byte_Variable2) == 0x0000AD, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success, K2Node_Select_Default) == 0x0000AE, "Member 'WBP_UI3d_Kazi_Success_C_ExecuteUbergraph_WBP_UI3d_Kazi_Success::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI3d_Kazi_Success.WBP_UI3d_Kazi_Success_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI3d_Kazi_Success_C_SetData final
{
public:
	class UJackUMG3DWidgetData*                   Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI3d_Kazi_Success_C_SetData) == 0x000008, "Wrong alignment on WBP_UI3d_Kazi_Success_C_SetData");
static_assert(sizeof(WBP_UI3d_Kazi_Success_C_SetData) == 0x000008, "Wrong size on WBP_UI3d_Kazi_Success_C_SetData");
static_assert(offsetof(WBP_UI3d_Kazi_Success_C_SetData, Data) == 0x000000, "Member 'WBP_UI3d_Kazi_Success_C_SetData::Data' has a wrong offset!");

}

