#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_MiniMap_Button_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_MiniMap_Button_000_modern.WBP_Hud_MiniMap_Button_000_modern_C.ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern
// 0x0070 (0x0070 - 0x0000)
struct WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMapHelpDisableColor_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUMGPresetColor_ReturnValue;            // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUMGPresetColor_ReturnValue2;           // 0x0040(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern) == 0x000008, "Wrong alignment on WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern");
static_assert(sizeof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern) == 0x000070, "Wrong size on WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_IsMapHelpDisableColor_ReturnValue) == 0x000010, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_IsMapHelpDisableColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000028, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_GetUMGPresetColor_ReturnValue) == 0x000030, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_GetUMGPresetColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_GetUMGPresetColor_ReturnValue2) == 0x000040, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_GetUMGPresetColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, K2Node_CustomEvent_EventTag) == 0x000050, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000058, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000068, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_MiniMap_Button_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");

// Function WBP_Hud_MiniMap_Button_000_modern.WBP_Hud_MiniMap_Button_000_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Hud_MiniMap_Button_000_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

}

