#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_109_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_109_modern.WBP_Menu_Dougu_Syousai_109_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern
// 0x0268 (0x0268 - 0x0000)
struct WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_InItemSyousaiRef;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemQualityInfo*                CallFunc_GetItemQualityInfo_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_057_modern_C*           CallFunc_Array_Get_Item2;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_057_modern_C*           CallFunc_Array_Get_Item3;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_057_modern_C*           CallFunc_Array_Get_Item4;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_057_modern_C*           CallFunc_Array_Get_Item5;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item6;                          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemQualityParams              CallFunc_Array_Get_Item7;                          // 0x0138(0x0038)()
	class FText                                   CallFunc_Array_Get_Item8;                          // 0x0170(0x0018)()
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item9;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemQualityData                CallFunc_Array_Get_Item10;                         // 0x0190(0x0018)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemQualityData                CallFunc_Array_Get_Item11;                         // 0x01B0(0x0018)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_007_modern_C*           CallFunc_Array_Get_Item12;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_057_modern_C*           CallFunc_Array_Get_Item13;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_057_modern_C*           CallFunc_Array_Get_Item14;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue11;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue8;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue9;                 // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable5;                                // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue10;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item15;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue10;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable6;                                // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue11;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item16;                         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue11;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_007_modern_C*>   K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array2;                           // 0x0248(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array3;                           // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern) == 0x000268, "Wrong size on WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Variable2) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Variable3) == 0x000014, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x00001C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue4) == 0x000024, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Array_Index_Variable2) == 0x00002C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Loop_Counter_Variable2) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue5) == 0x000034, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Array_Index_Variable3) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Loop_Counter_Variable3) == 0x00003C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue6) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Array_Index_Variable4) == 0x000044, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Variable4) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue7) == 0x00004C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Loop_Counter_Variable4) == 0x000050, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_CustomEvent_InEventTag) == 0x000058, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000060, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_CustomEvent_InObject) == 0x000068, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue8) == 0x000070, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000078, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_SwitchName_CmpSuccess) == 0x000081, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_CustomEvent_InItemSyousaiRef) == 0x000088, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_CustomEvent_InItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000090, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_GetItemQualityInfo_ReturnValue) == 0x000098, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_GetItemQualityInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Loop_Counter_Variable5) == 0x0000A0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue9) == 0x0000A4, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000AC, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item2) == 0x0000B8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item3) == 0x0000C8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue4) == 0x0000D0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0000D4, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item4) == 0x0000D8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item5) == 0x0000E0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue5) == 0x0000F8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue3) == 0x0000FC, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item6) == 0x000100, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue6) == 0x000128, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue4) == 0x00012C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Array_Index_Variable5) == 0x000130, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item7) == 0x000138, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item8) == 0x000170, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item9) == 0x000188, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item10) == 0x000190, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue7) == 0x0001A8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item11) == 0x0001B0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue5) == 0x0001C8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue8) == 0x0001CC, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001D0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue6) == 0x0001D1, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue9) == 0x0001D4, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue7) == 0x0001D8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item12) == 0x0001E0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item13) == 0x0001E8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item14) == 0x0001F0, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue10) == 0x0001F8, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Length_ReturnValue11) == 0x0001FC, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Length_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue8) == 0x000200, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue9) == 0x000201, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Variable5) == 0x000204, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue10) == 0x000208, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00020C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item15) == 0x000210, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue10) == 0x000218, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, Temp_int_Variable6) == 0x00021C, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Add_IntInt_ReturnValue11) == 0x000220, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Add_IntInt_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Array_Get_Item16) == 0x000228, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Array_Get_Item16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, CallFunc_Less_IntInt_ReturnValue11) == 0x000230, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::CallFunc_Less_IntInt_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_MakeArray_Array) == 0x000238, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_MakeArray_Array2) == 0x000248, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern, K2Node_MakeArray_Array3) == 0x000258, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_109_modern::K2Node_MakeArray_Array3' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_109_modern.WBP_Menu_Dougu_Syousai_109_modern_C.DispItemFromSyousaiRef
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef final
{
public:
	class UJackUMGItemSyousai*                    InItemSyousaiRef;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong size on WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef, InItemSyousaiRef) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_DispItemFromSyousaiRef::InItemSyousaiRef' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_109_modern.WBP_Menu_Dougu_Syousai_109_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_109_modern.WBP_Menu_Dougu_Syousai_109_modern_C.GetParamsPanelList
// 0x0088 (0x0088 - 0x0000)
struct WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array2;                           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array3;                           // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array4;                           // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array5;                           // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array6;                           // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array7;                           // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_057_modern_C*>   K2Node_MakeArray_Array8;                           // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList) == 0x000088, "Wrong size on WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList, Selection) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList::Selection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_Menu_Dougu_Syousai_109_modern_C_GetParamsPanelList::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
