#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Icon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.ExecuteUbergraph_WBP_Hud_Status_Icon
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_Icon_Plate_C*           CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_Icon3_C*                CallFunc_Array_Get_Item2;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibirityOddEffect_NewParam;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue4;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Status_Icon_Plate_C*           CallFunc_Array_Get_Item3;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_Icon3_C*                CallFunc_Array_Get_Item4;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibirityOddEffect_NewParam2;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackUMGOddEffectStatus>        K2Node_Event_OddEffectList2;                       // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackUMGOddEffectStatus>        K2Node_Event_OddEffectList;                        // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackUMGOddEffectStatus                CallFunc_Array_Get_Item5;                          // 0x00F0(0x0018)(NoDestructor)
	struct FJackUMGOddEffectStatus                CallFunc_Array_Get_Item6;                          // 0x0108(0x0018)(NoDestructor)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOddEffectId_Debuff2;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue5;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue6;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetJoutaiijouIconAlpha_ReturnValue;       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGOddEffectStatus                CallFunc_Array_Get_Item7;                          // 0x0148(0x0018)(NoDestructor)
	struct FJackUMGOddEffectStatus                CallFunc_Array_Get_Item8;                          // 0x0160(0x0018)(NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetJoutaiijouIconAlpha_ReturnValue2;      // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_Icon3_C*                CallFunc_Array_Get_Item9;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue7;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue8;             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_Icon3_C*                CallFunc_Array_Get_Item10;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon) == 0x000008, "Wrong alignment on WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon");
static_assert(sizeof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon) == 0x0001B0, "Wrong size on WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue2) == 0x000010, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, K2Node_Event_MyGeometry) == 0x000014, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000060, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Loop_Counter_Variable2) == 0x000064, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Loop_Counter_Variable3) == 0x000068, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Add_IntInt_ReturnValue2) == 0x00006C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Add_IntInt_ReturnValue3) == 0x000070, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Array_Index_Variable2) == 0x000074, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Array_Index_Variable3) == 0x000078, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Loop_Counter_Variable4) == 0x00007C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue3) == 0x000080, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item2) == 0x000098, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_GetVisibirityOddEffect_NewParam) == 0x0000A0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_GetVisibirityOddEffect_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Add_IntInt_ReturnValue4) == 0x0000A4, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, Temp_int_Array_Index_Variable4) == 0x0000A8, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue4) == 0x0000AC, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item3) == 0x0000B0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x0000B8, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_BooleanAND_ReturnValue2) == 0x0000B9, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item4) == 0x0000C0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_GetVisibirityOddEffect_NewParam2) == 0x0000C8, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_GetVisibirityOddEffect_NewParam2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, K2Node_Event_OddEffectList2) == 0x0000D0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::K2Node_Event_OddEffectList2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, K2Node_Event_OddEffectList) == 0x0000E0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::K2Node_Event_OddEffectList' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item5) == 0x0000F0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item6) == 0x000108, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_SetOddEffectId_Debuff) == 0x000120, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_SetOddEffectId_Debuff2) == 0x000121, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_SetOddEffectId_Debuff2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue2) == 0x000124, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue3) == 0x000128, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Less_IntInt_ReturnValue) == 0x00012C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue5) == 0x000130, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue4) == 0x000134, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue5) == 0x000138, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Less_IntInt_ReturnValue2) == 0x00013C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue6) == 0x000140, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_GetJoutaiijouIconAlpha_ReturnValue) == 0x000144, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_GetJoutaiijouIconAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item7) == 0x000148, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item8) == 0x000160, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000178, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000179, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue6) == 0x00017C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue7) == 0x000180, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Less_IntInt_ReturnValue3) == 0x000184, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Less_IntInt_ReturnValue4) == 0x000185, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_GetJoutaiijouIconAlpha_ReturnValue2) == 0x000188, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_GetJoutaiijouIconAlpha_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item9) == 0x000190, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Length_ReturnValue8) == 0x000198, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Length_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue7) == 0x00019C, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Subtract_IntInt_ReturnValue8) == 0x0001A0, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Subtract_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon, CallFunc_Array_Get_Item10) == 0x0001A8, "Member 'WBP_Hud_Status_Icon_C_ExecuteUbergraph_WBP_Hud_Status_Icon::CallFunc_Array_Get_Item10' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.SetBadJoutaiIjouList
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList final
{
public:
	TArray<struct FJackUMGOddEffectStatus>        OddEffectList;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList) == 0x000008, "Wrong alignment on WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList");
static_assert(sizeof(WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList) == 0x000010, "Wrong size on WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList, OddEffectList) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_SetBadJoutaiIjouList::OddEffectList' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.SetGoodJoutaiIjouList
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList final
{
public:
	TArray<struct FJackUMGOddEffectStatus>        OddEffectList;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList) == 0x000008, "Wrong alignment on WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList");
static_assert(sizeof(WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList) == 0x000010, "Wrong size on WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList, OddEffectList) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_SetGoodJoutaiIjouList::OddEffectList' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Status_Icon_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_Tick) == 0x000004, "Wrong alignment on WBP_Hud_Status_Icon_C_Tick");
static_assert(sizeof(WBP_Hud_Status_Icon_C_Tick) == 0x000040, "Wrong size on WBP_Hud_Status_Icon_C_Tick");
static_assert(offsetof(WBP_Hud_Status_Icon_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Hud_Status_Icon_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Status_Icon_C_SetVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_SetVisible) == 0x000001, "Wrong alignment on WBP_Hud_Status_Icon_C_SetVisible");
static_assert(sizeof(WBP_Hud_Status_Icon_C_SetVisible) == 0x000001, "Wrong size on WBP_Hud_Status_Icon_C_SetVisible");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetVisible, Visible) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_SetVisible::Visible' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.SetOffsetVissible
// 0x0014 (0x0014 - 0x0000)
struct WBP_Hud_Status_Icon_C_SetOffsetVissible final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         XOff;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_SetOffsetVissible) == 0x000004, "Wrong alignment on WBP_Hud_Status_Icon_C_SetOffsetVissible");
static_assert(sizeof(WBP_Hud_Status_Icon_C_SetOffsetVissible) == 0x000014, "Wrong size on WBP_Hud_Status_Icon_C_SetOffsetVissible");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetOffsetVissible, Offset) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_SetOffsetVissible::Offset' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetOffsetVissible, XOff) == 0x000004, "Member 'WBP_Hud_Status_Icon_C_SetOffsetVissible::XOff' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetOffsetVissible, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_Hud_Status_Icon_C_SetOffsetVissible::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_SetOffsetVissible, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Status_Icon_C_SetOffsetVissible::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.ArrayInitialize
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Status_Icon_C_ArrayInitialize final
{
public:
	TArray<class UWBP_Hud_Status_Icon_Plate_C*>   K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Hud_Status_Icon3_C*>        K2Node_MakeArray_Array2;                           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Hud_Status_Icon_Plate_C*>   K2Node_MakeArray_Array3;                           // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Hud_Status_Icon3_C*>        K2Node_MakeArray_Array4;                           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_ArrayInitialize) == 0x000008, "Wrong alignment on WBP_Hud_Status_Icon_C_ArrayInitialize");
static_assert(sizeof(WBP_Hud_Status_Icon_C_ArrayInitialize) == 0x000040, "Wrong size on WBP_Hud_Status_Icon_C_ArrayInitialize");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ArrayInitialize, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_ArrayInitialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ArrayInitialize, K2Node_MakeArray_Array2) == 0x000010, "Member 'WBP_Hud_Status_Icon_C_ArrayInitialize::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ArrayInitialize, K2Node_MakeArray_Array3) == 0x000020, "Member 'WBP_Hud_Status_Icon_C_ArrayInitialize::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_ArrayInitialize, K2Node_MakeArray_Array4) == 0x000030, "Member 'WBP_Hud_Status_Icon_C_ArrayInitialize::K2Node_MakeArray_Array4' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.HiddenBuff
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Status_Icon_C_HiddenBuff final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Status_Icon3_C*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_Icon_Plate_C*           CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_HiddenBuff) == 0x000008, "Wrong alignment on WBP_Hud_Status_Icon_C_HiddenBuff");
static_assert(sizeof(WBP_Hud_Status_Icon_C_HiddenBuff) == 0x000040, "Wrong size on WBP_Hud_Status_Icon_C_HiddenBuff");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, Temp_int_Array_Index_Variable2) == 0x00000C, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, Temp_int_Loop_Counter_Variable2) == 0x000020, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Array_Get_Item2) == 0x000028, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Add_IntInt_ReturnValue2) == 0x000030, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Array_Length_ReturnValue2) == 0x000034, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenBuff, CallFunc_Less_IntInt_ReturnValue2) == 0x000038, "Member 'WBP_Hud_Status_Icon_C_HiddenBuff::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function WBP_Hud_Status_Icon.WBP_Hud_Status_Icon_C.HiddenDebuff
// 0x0038 (0x0038 - 0x0000)
struct WBP_Hud_Status_Icon_C_HiddenDebuff final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Status_Icon_Plate_C*           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Status_Icon3_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Icon_C_HiddenDebuff) == 0x000008, "Wrong alignment on WBP_Hud_Status_Icon_C_HiddenDebuff");
static_assert(sizeof(WBP_Hud_Status_Icon_C_HiddenDebuff) == 0x000038, "Wrong size on WBP_Hud_Status_Icon_C_HiddenDebuff");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenDebuff, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Hud_Status_Icon_C_HiddenDebuff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenDebuff, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Hud_Status_Icon_C_HiddenDebuff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Icon_C_HiddenDebuff, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Hud_Status_Icon_C_HiddenDebuff::Temp_int_Array_Index_Variable' has a wrong offset!");
