#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_044

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_044.WBP_Menu_Parts_044_C
// 0x0028 (0x03B0 - 0x0388)
class UWBP_Menu_Parts_044_C final : public UJackUMGScrollController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BarImage;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              BarBaseSize;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BarContentsSize;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_044(int32 EntryPoint);
	void BPActionDelegate(class FName EventTag);
	void Construct();
	void SetupScrollBar();
	void UpdateScrollBar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_044_C">();
	}
	static class UWBP_Menu_Parts_044_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_044_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_044_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_044_C");
static_assert(sizeof(UWBP_Menu_Parts_044_C) == 0x0003B0, "Wrong size on UWBP_Menu_Parts_044_C");
static_assert(offsetof(UWBP_Menu_Parts_044_C, UberGraphFrame) == 0x000388, "Member 'UWBP_Menu_Parts_044_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_044_C, BarImage) == 0x000390, "Member 'UWBP_Menu_Parts_044_C::BarImage' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_044_C, RootPanel) == 0x000398, "Member 'UWBP_Menu_Parts_044_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_044_C, BarBaseSize) == 0x0003A0, "Member 'UWBP_Menu_Parts_044_C::BarBaseSize' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_044_C, BarContentsSize) == 0x0003A8, "Member 'UWBP_Menu_Parts_044_C::BarContentsSize' has a wrong offset!");

}

