#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Arasuzi_Text_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Arasuzi_Text_000_modern.WBP_Menu_Arasuzi_Text_000_modern_C
// 0x0210 (0x03E0 - 0x01D0)
class UWBP_Menu_Arasuzi_Text_000_modern_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       blink_marker;                                      // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x01E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x01F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PageMarkerImage;                                   // 0x01F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_10;                                         // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_11;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_12;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_13;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_14;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_15;                                         // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_16;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_17;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_18;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_19;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_00;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_01;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_02;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_03;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_04;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_05;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_06;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_07;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_08;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Shadow_09;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_10;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_11;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_12;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_13;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_14;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_15;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_16;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_17;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_18;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_19;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_00;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_01;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_02;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_03;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_04;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_05;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_06;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_07;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_08;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_09;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextDummy;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PosY;                                              // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     ShadowLabelList;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UTextBlock*>                     TextLabelList;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         TextList;                                          // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Timer;                                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Transparent;                                       // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TargetText;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TargetShadow;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFadeIn;                                           // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFadeOut;                                          // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  TextAppliedFlagList;                               // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 TextLengthList;                                    // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 TextApplyCountList;                                // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bApplyCompleted;                                   // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Arasuzi_Text_000_modern(int32 EntryPoint);
	void PlayBlinkMarkerAnim();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetText(const class FString& Text);
	void PlayInAnim();
	void ResetAnim();
	void StopBlinkMarker();
	void SetTextAlpha(class UTextBlock* Text, class UTextBlock* Shadow, float Alpha);
	void MyPrintString(const class FString& InString, bool bPageMarker);
	void SetTextIndex(int32 TextIndex);
	void UpdateTextPosition(const class FString& SourceString);
	void SetTextList(const TArray<class FString>& TextList_0);
	void PlayOutAnim();
	void SkipAnimation(const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Arasuzi_Text_000_modern_C">();
	}
	static class UWBP_Menu_Arasuzi_Text_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Arasuzi_Text_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Arasuzi_Text_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Arasuzi_Text_000_modern_C");
static_assert(sizeof(UWBP_Menu_Arasuzi_Text_000_modern_C) == 0x0003E0, "Wrong size on UWBP_Menu_Arasuzi_Text_000_modern_C");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Default) == 0x0001D8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, blink_marker) == 0x0001E0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::blink_marker' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Out) == 0x0001E8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, In) == 0x0001F0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, PageMarkerImage) == 0x0001F8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::PageMarkerImage' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, RootPanel) == 0x000200, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_10) == 0x000208, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_11) == 0x000210, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_12) == 0x000218, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_12' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_13) == 0x000220, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_14) == 0x000228, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_15) == 0x000230, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_16) == 0x000238, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_16' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_17) == 0x000240, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_17' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_18) == 0x000248, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_19) == 0x000250, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_00) == 0x000258, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_01) == 0x000260, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_02) == 0x000268, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_03) == 0x000270, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_04) == 0x000278, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_05) == 0x000280, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_06) == 0x000288, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_07) == 0x000290, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_08) == 0x000298, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Shadow_09) == 0x0002A0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Shadow_09' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_10) == 0x0002A8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_11) == 0x0002B0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_12) == 0x0002B8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_12' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_13) == 0x0002C0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_14) == 0x0002C8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_15) == 0x0002D0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_16) == 0x0002D8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_16' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_17) == 0x0002E0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_17' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_18) == 0x0002E8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_19) == 0x0002F0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_00) == 0x0002F8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_01) == 0x000300, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_02) == 0x000308, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_03) == 0x000310, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_04) == 0x000318, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_05) == 0x000320, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_06) == 0x000328, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_07) == 0x000330, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_08) == 0x000338, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Text_09) == 0x000340, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Text_09' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TextDummy) == 0x000348, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TextDummy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, PosY) == 0x000350, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::PosY' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, ShadowLabelList) == 0x000358, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::ShadowLabelList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TextLabelList) == 0x000368, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TextLabelList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TextList) == 0x000378, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TextList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Timer) == 0x000388, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, Transparent) == 0x00038C, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::Transparent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TargetText) == 0x000390, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TargetText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TargetShadow) == 0x000398, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TargetShadow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, bFadeIn) == 0x0003A0, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::bFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, bFadeOut) == 0x0003A1, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::bFadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TextAppliedFlagList) == 0x0003A8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TextAppliedFlagList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TextLengthList) == 0x0003B8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TextLengthList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, TextApplyCountList) == 0x0003C8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::TextApplyCountList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Text_000_modern_C, bApplyCompleted) == 0x0003D8, "Member 'UWBP_Menu_Arasuzi_Text_000_modern_C::bApplyCompleted' has a wrong offset!");

}

