#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_MonsterZukan_Window_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Senreki_MonsterZukan_Window_002_modern.WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C
// 0x00E8 (0x04E8 - 0x0400)
class UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MonsterCategory000;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MonsterCategoryList;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_5;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_6;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_7;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_8;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_18;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_19;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_20;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_21;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_22;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_23;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_28;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_29;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           WBP_Menu_Parts_006;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           WBP_Menu_Parts_007_C_8;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_8;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           WBP_Menu_Parts_037_C_426;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EJackCharacter                                SelectedCharType;                                  // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CharSoubiData;                                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiList*                      SoubiList;                                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiState*                     SoubiState;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharacterName;                                     // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsShowTokugi;                                      // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TempCount;                                         // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackMonsterRace                              MonsterRace;                                       // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TempCountAll;                                      // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern(int32 EntryPoint);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void CustomEvent_0(class FName EventTag);
	void SelectCategory();
	void SetMonsterList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C">();
	}
	static class UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C");
static_assert(sizeof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C) == 0x0004E8, "Wrong size on UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, ItemList) == 0x000410, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, MonsterCategory000) == 0x000418, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::MonsterCategory000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, MonsterCategoryList) == 0x000420, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::MonsterCategoryList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_5) == 0x000428, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_6) == 0x000430, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_7) == 0x000438, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_8) == 0x000440, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_18) == 0x000448, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_19) == 0x000450, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_20) == 0x000458, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_20' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_21) == 0x000460, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_21' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_22) == 0x000468, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_22' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_23) == 0x000470, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_23' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_28) == 0x000478, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_28' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_000_C_29) == 0x000480, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_000_C_29' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_006) == 0x000488, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_007_C_8) == 0x000490, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_007_C_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_024_C_8) == 0x000498, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_024_C_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, WBP_Menu_Parts_037_C_426) == 0x0004A0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::WBP_Menu_Parts_037_C_426' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, SelectedCharType) == 0x0004A8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::SelectedCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, CharSoubiData) == 0x0004B0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::CharSoubiData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, SoubiList) == 0x0004B8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::SoubiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, SoubiState) == 0x0004C0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::SoubiState' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, CharacterName) == 0x0004C8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, IsShowTokugi) == 0x0004D8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::IsShowTokugi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, TempCount) == 0x0004DC, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::TempCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, MonsterRace) == 0x0004E0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::MonsterRace' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C, TempCountAll) == 0x0004E4, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_002_modern_C::TempCountAll' has a wrong offset!");

}

