#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_050

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_050.WBP_Menu_Title_BG_050_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_Menu_Title_BG_050_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           RootPanel;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title_Bg_050_Panel;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleRoot;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_051_C*               WBP_Menu_Title_BG_051;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Title_BG_050(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_050_C">();
	}
	static class UWBP_Menu_Title_BG_050_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_050_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_050_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_050_C");
static_assert(sizeof(UWBP_Menu_Title_BG_050_C) == 0x000398, "Wrong size on UWBP_Menu_Title_BG_050_C");
static_assert(offsetof(UWBP_Menu_Title_BG_050_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_050_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_050_C, RootPanel) == 0x000378, "Member 'UWBP_Menu_Title_BG_050_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_050_C, Title_Bg_050_Panel) == 0x000380, "Member 'UWBP_Menu_Title_BG_050_C::Title_Bg_050_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_050_C, TitleRoot) == 0x000388, "Member 'UWBP_Menu_Title_BG_050_C::TitleRoot' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_050_C, WBP_Menu_Title_BG_051) == 0x000390, "Member 'UWBP_Menu_Title_BG_050_C::WBP_Menu_Title_BG_051' has a wrong offset!");

}

