#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C
// 0x00E0 (0x0510 - 0x0430)
class UWBP_Menu_Battle_List_001_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_0;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_2;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1105;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_044_C*                  WBP_Menu_Parts_044;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumData;                                           // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPageItem;                                       // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BarPanel;                                          // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBattleMenuCommand                     BattleActionType;                                  // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionID;                                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_ActionCursor_All_000_C*        TargetCursorRef;                                   // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     SelectedEnemy;                                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsClosed;                                         // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectTargetIndex;                                 // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     BattleTarget;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   UIActionInfoRef;                                   // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               DebugList;                                         // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   RenkeiID;                                          // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  CommonSetumeiWindowRef;                            // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   JumonSetumeiWindowRef;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           RenkeiAliveCheckLis;                               // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   MessageID;                                         // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_001_modern(int32 EntryPoint);
	void KeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void BPActionDelegate(class FName EventTag);
	void SetupJumonAction();
	void SetupTokugiAction(class FName InTokugiActionId);
	void SetupRenkeiAction(class FName InRenkeiId, const class FText& InRenkeiName);
	void InitCursorIndex();
	void SetupDouguAction(class UJackUMGUIActionInfo* UIActionInfoRef_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_001_modern_C">();
	}
	static class UWBP_Menu_Battle_List_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_001_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_001_modern_C) == 0x000510, "Wrong size on UWBP_Menu_Battle_List_001_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Battle_List_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Battle_List_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_Battle_List_001_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WBP_Menu_Parts_000) == 0x000448, "Member 'UWBP_Menu_Battle_List_001_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WBP_Menu_Parts_000_C_0) == 0x000450, "Member 'UWBP_Menu_Battle_List_001_modern_C::WBP_Menu_Parts_000_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WBP_Menu_Parts_000_C_1) == 0x000458, "Member 'UWBP_Menu_Battle_List_001_modern_C::WBP_Menu_Parts_000_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WBP_Menu_Parts_000_C_2) == 0x000460, "Member 'UWBP_Menu_Battle_List_001_modern_C::WBP_Menu_Parts_000_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WBP_Menu_Parts_000_C_1105) == 0x000468, "Member 'UWBP_Menu_Battle_List_001_modern_C::WBP_Menu_Parts_000_C_1105' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WBP_Menu_Parts_044) == 0x000470, "Member 'UWBP_Menu_Battle_List_001_modern_C::WBP_Menu_Parts_044' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WindowFrame) == 0x000478, "Member 'UWBP_Menu_Battle_List_001_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, WindowLine) == 0x000480, "Member 'UWBP_Menu_Battle_List_001_modern_C::WindowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, NumData) == 0x000488, "Member 'UWBP_Menu_Battle_List_001_modern_C::NumData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, NumPageItem) == 0x00048C, "Member 'UWBP_Menu_Battle_List_001_modern_C::NumPageItem' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, BarPanel) == 0x000490, "Member 'UWBP_Menu_Battle_List_001_modern_C::BarPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, BattleActionType) == 0x000498, "Member 'UWBP_Menu_Battle_List_001_modern_C::BattleActionType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, ActionID) == 0x0004A0, "Member 'UWBP_Menu_Battle_List_001_modern_C::ActionID' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, TargetCursorRef) == 0x0004A8, "Member 'UWBP_Menu_Battle_List_001_modern_C::TargetCursorRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, SelectedEnemy) == 0x0004B0, "Member 'UWBP_Menu_Battle_List_001_modern_C::SelectedEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, bIsClosed) == 0x0004B8, "Member 'UWBP_Menu_Battle_List_001_modern_C::bIsClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, SelectTargetIndex) == 0x0004BC, "Member 'UWBP_Menu_Battle_List_001_modern_C::SelectTargetIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, BattleTarget) == 0x0004C0, "Member 'UWBP_Menu_Battle_List_001_modern_C::BattleTarget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, UIActionInfoRef) == 0x0004C8, "Member 'UWBP_Menu_Battle_List_001_modern_C::UIActionInfoRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, DebugList) == 0x0004D0, "Member 'UWBP_Menu_Battle_List_001_modern_C::DebugList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, RenkeiID) == 0x0004E0, "Member 'UWBP_Menu_Battle_List_001_modern_C::RenkeiID' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, CommonSetumeiWindowRef) == 0x0004E8, "Member 'UWBP_Menu_Battle_List_001_modern_C::CommonSetumeiWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, JumonSetumeiWindowRef) == 0x0004F0, "Member 'UWBP_Menu_Battle_List_001_modern_C::JumonSetumeiWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, RenkeiAliveCheckLis) == 0x0004F8, "Member 'UWBP_Menu_Battle_List_001_modern_C::RenkeiAliveCheckLis' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_001_modern_C, MessageID) == 0x000508, "Member 'UWBP_Menu_Battle_List_001_modern_C::MessageID' has a wrong offset!");

}

