#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI3d_Kazi_Material

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI3d_Kazi_Material.WBP_UI3d_Kazi_Material_C
// 0x0078 (0x0248 - 0x01D0)
class UWBP_UI3d_Kazi_Material_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       MoveToGoal_Even;                                   // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MoveToGoal_Odd;                                    // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage_0;                                       // 0x01E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage_1;                                       // 0x01F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage_2;                                       // 0x01F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage_3;                                       // 0x0200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage_4;                                       // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         ItemImageList;                                     // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector2D>                      ItemPositionList_Odd;                              // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector2D>                      ItemPositionList_Even;                             // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          OddFlag;                                           // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI3d_Kazi_Material(int32 EntryPoint);
	void Construct();
	void SetData(class UJackUMG3DWidgetData* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI3d_Kazi_Material_C">();
	}
	static class UWBP_UI3d_Kazi_Material_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI3d_Kazi_Material_C>();
	}
};
static_assert(alignof(UWBP_UI3d_Kazi_Material_C) == 0x000008, "Wrong alignment on UWBP_UI3d_Kazi_Material_C");
static_assert(sizeof(UWBP_UI3d_Kazi_Material_C) == 0x000248, "Wrong size on UWBP_UI3d_Kazi_Material_C");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_UI3d_Kazi_Material_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, MoveToGoal_Even) == 0x0001D8, "Member 'UWBP_UI3d_Kazi_Material_C::MoveToGoal_Even' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, MoveToGoal_Odd) == 0x0001E0, "Member 'UWBP_UI3d_Kazi_Material_C::MoveToGoal_Odd' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemImage_0) == 0x0001E8, "Member 'UWBP_UI3d_Kazi_Material_C::ItemImage_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemImage_1) == 0x0001F0, "Member 'UWBP_UI3d_Kazi_Material_C::ItemImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemImage_2) == 0x0001F8, "Member 'UWBP_UI3d_Kazi_Material_C::ItemImage_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemImage_3) == 0x000200, "Member 'UWBP_UI3d_Kazi_Material_C::ItemImage_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemImage_4) == 0x000208, "Member 'UWBP_UI3d_Kazi_Material_C::ItemImage_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemImageList) == 0x000210, "Member 'UWBP_UI3d_Kazi_Material_C::ItemImageList' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemPositionList_Odd) == 0x000220, "Member 'UWBP_UI3d_Kazi_Material_C::ItemPositionList_Odd' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, ItemPositionList_Even) == 0x000230, "Member 'UWBP_UI3d_Kazi_Material_C::ItemPositionList_Even' has a wrong offset!");
static_assert(offsetof(UWBP_UI3d_Kazi_Material_C, OddFlag) == 0x000240, "Member 'UWBP_UI3d_Kazi_Material_C::OddFlag' has a wrong offset!");

}

