#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Mode_Select_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern
// 0x0180 (0x0180 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackModeType                                 Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackModeType                                 Temp_byte_Variable2;                               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackModeType                                 K2Node_Select_Default;                             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00DC(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackModeChangeManager*                 CallFunc_GetModeChangeManager_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReady2D3DMovie_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGModeSelectGotoState                   CallFunc_GetModeSelectGotoState_ReturnValue;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTrial_ReturnValue2;                     // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern) == 0x000180, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_struct_Variable) == 0x000018, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_bool_Variable) == 0x000048, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_byte_Variable) == 0x000049, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_byte_Variable2) == 0x00004A, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_struct_Variable2) == 0x000050, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_struct_Variable3) == 0x000060, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000070, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000080, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x000088, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_EventTag) == 0x000090, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000098, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_InKeyType) == 0x000099, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_bIsPressed) == 0x00009A, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00009B, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_IsOpenSerifuWindow_ReturnValue) == 0x00009C, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_IsOpenSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_EventName) == 0x0000A0, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_InItemBase) == 0x0000A8, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000B0, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_Sender) == 0x0000B8, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_CurrentTextID) == 0x0000C0, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x0000C8, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000D8, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_Select_Default) == 0x0000D9, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_Event_MyGeometry) == 0x0000DC, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_Event_InDeltaTime) == 0x000118, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_GetModeChangeManager_ReturnValue) == 0x000120, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_GetModeChangeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_IsReady2D3DMovie_ReturnValue) == 0x000128, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_IsReady2D3DMovie_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000130, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000140, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000148, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000150, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_GetModeSelectGotoState_ReturnValue) == 0x000158, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_GetModeSelectGotoState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x000159, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_IsTrial_ReturnValue) == 0x00015A, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_IsTrial_ReturnValue2) == 0x00015B, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_IsTrial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, Temp_struct_Variable4) == 0x000160, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x000170, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern, CallFunc_WaitMessageEndFromBP_Result3) == 0x000178, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_000_modern::CallFunc_WaitMessageEndFromBP_Result3' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.SelectYN
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN) == 0x000018, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_SelectYN::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.OnItemControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl) == 0x000010, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl, EventName) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_OnItemControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.KeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_KeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.GotoTheNextMenu
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu final
{
public:
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu) == 0x000018, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000010, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_GotoTheNextMenu::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_000_modern.WBP_Menu_Namae_Mode_Select_000_modern_C.GotoThePreviousMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Namae_Input_000_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Namae_Input_000_Modern; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu) == 0x000028, "Wrong size on WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Mode_Select_000_modern_C_GotoThePreviousMenu::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
