#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_002_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_List_002_modern.WBP_Menu_WorldMap_List_002_modern_C.FocusItemEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature final
{
public:
	class UWBP_Menu_WorldMap_List_002_modern_C*   Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveDataInRura*         RuraData;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature, Sender) == 0x000000, "Member 'WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature, RuraData) == 0x000008, "Member 'WBP_Menu_WorldMap_List_002_modern_C_FocusItemEvent__DelegateSignature::RuraData' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_002_modern.WBP_Menu_WorldMap_List_002_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern
// 0x0180 (0x0180 - 0x0000)
struct WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue2;        // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetRuraList_ReturnValue;                  // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue3;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetParamSetumei_IsEmpty;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item2;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue2;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_Menu_Jumon_Setumei_001_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_001_Modern; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountRuraList_ReturnValue;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_PoppedWidget;                     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_CurrentActiveWidget;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_List_010_modern_C*   K2Node_DynamicCast_AsWBP_Menu_World_Map_List_010_Modern; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern");
static_assert(sizeof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern) == 0x000180, "Wrong size on WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000004, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, Temp_struct_Variable) == 0x000010, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Add_Vector2DVector2D_ReturnValue2) == 0x000020, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Add_Vector2DVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000028, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, Temp_struct_Variable2) == 0x000030, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000040, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000050, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Array_Length_ReturnValue2) == 0x000058, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetRuraList_ReturnValue) == 0x000060, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetRuraList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_CustomEvent_EventTag) == 0x000070, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000088, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_CustomEvent_EventName) == 0x000090, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_CustomEvent_InItemBase) == 0x000098, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetDataIndex_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetDataIndex_ReturnValue2) == 0x0000A4, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetDataIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetDataIndex_ReturnValue3) == 0x0000A8, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetDataIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_SetParamSetumei_IsEmpty) == 0x0000B8, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_SetParamSetumei_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetRuraData_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetRuraData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000C8, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetSelectedCharType_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetSelectedCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Array_Get_Item2) == 0x0000F0, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000F8, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetRuraData_ReturnValue2) == 0x000100, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetRuraData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000108, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000110, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_001_Modern) == 0x000120, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_001_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000130, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_CountRuraList_ReturnValue) == 0x000138, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_CountRuraList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x00013C, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000140, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000148, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x000150, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000158, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_PopMenu_PoppedWidget) == 0x000160, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_PopMenu_PoppedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, CallFunc_PopMenu_CurrentActiveWidget) == 0x000168, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::CallFunc_PopMenu_CurrentActiveWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_DynamicCast_AsWBP_Menu_World_Map_List_010_Modern) == 0x000170, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_DynamicCast_AsWBP_Menu_World_Map_List_010_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern, K2Node_DynamicCast_bSuccess2) == 0x000178, "Member 'WBP_Menu_WorldMap_List_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_002_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_002_modern.WBP_Menu_WorldMap_List_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_WorldMap_List_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_002_modern.WBP_Menu_WorldMap_List_002_modern_C.WidgetBActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_List_002_modern_C_WidgetBActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_002_modern.WBP_Menu_WorldMap_List_002_modern_C.SetParamSetumei
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRuraEmpty;                                       // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei");
static_assert(sizeof(WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei) == 0x000028, "Wrong size on WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei, ItemIndex) == 0x000000, "Member 'WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei, IsEmpty) == 0x000004, "Member 'WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei::IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei, IsRuraEmpty) == 0x000005, "Member 'WBP_Menu_WorldMap_List_002_modern_C_SetParamSetumei::IsRuraEmpty' has a wrong offset!");
