#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Casino_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Casino_001_modern.WBP_Menu_Casino_001_modern_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_Menu_Casino_001_modern_C final : public UJackUMGCasinoCoinBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Icon_CasinoCoin;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Medal;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_40;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_090_modern_C*      WBP_Menu_Parts_Text_090;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Casino_001_modern(int32 EntryPoint);
	void Construct();
	void JackOnWidgetNotificationDelegate_Event_0(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void SetCasinoCoin(int32 InCasinoCoin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Casino_001_modern_C">();
	}
	static class UWBP_Menu_Casino_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Casino_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Casino_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Casino_001_modern_C");
static_assert(sizeof(UWBP_Menu_Casino_001_modern_C) == 0x000398, "Wrong size on UWBP_Menu_Casino_001_modern_C");
static_assert(offsetof(UWBP_Menu_Casino_001_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Casino_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_001_modern_C, Icon_CasinoCoin) == 0x000378, "Member 'UWBP_Menu_Casino_001_modern_C::Icon_CasinoCoin' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_001_modern_C, Icon_Medal) == 0x000380, "Member 'UWBP_Menu_Casino_001_modern_C::Icon_Medal' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_001_modern_C, WBP_Menu_Parts_024_C_40) == 0x000388, "Member 'UWBP_Menu_Casino_001_modern_C::WBP_Menu_Parts_024_C_40' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_001_modern_C, WBP_Menu_Parts_Text_090) == 0x000390, "Member 'UWBP_Menu_Casino_001_modern_C::WBP_Menu_Parts_Text_090' has a wrong offset!");

}

