#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_075_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.ExecuteUbergraph_WBP_Menu_Parts_075_modern
// 0x0298 (0x0298 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGTuyosaRenkeiData*               K2Node_CustomEvent_RenkeiData;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable3;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable4;                               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable5;                               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable6;                               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBackgroundColor                       Temp_byte_Variable7;                               // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable8;                               // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable9;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable10;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBackgroundColor                       Temp_byte_Variable11;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable12;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable13;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable14;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable15;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable16;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable17;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0078(0x0050)()
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGTuyosaRenkeiData*               K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select2_Default;                            // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F7[0x1];                                       // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGSoubiData                      K2Node_CustomEvent_Data;                           // 0x00F8(0x0070)()
	EJackUMGBackgroundColor                       K2Node_CustomEvent_BgType;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select3_Default;                            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select4_Default;                            // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select5_Default;                            // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x01A0(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select6_Default;                            // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select7_Default;                            // 0x01C0(0x0018)()
	class FText                                   K2Node_CustomEvent_CaptionText;                    // 0x01D8(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_IconTexture;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_InColorType;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select8_Default;                            // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_ItemSyousaiData;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable18;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x0220(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x0230(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array4;                           // 0x0248(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable19;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue4;                      // 0x0260(0x0018)()
	class FText                                   K2Node_Select9_Default;                            // 0x0278(0x0018)()
	bool                                          Temp_bool_Variable7;                               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select10_Default;                           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern) == 0x000298, "Wrong size on WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_RenkeiData) == 0x000008, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_RenkeiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable) == 0x000010, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable2) == 0x000030, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable) == 0x000031, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable2) == 0x000032, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable3) == 0x000033, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable3) == 0x000034, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable4) == 0x000035, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_int_Variable) == 0x000038, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable5) == 0x00003C, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable6) == 0x00003D, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable7) == 0x00003E, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable8) == 0x00003F, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable9) == 0x000040, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable10) == 0x000041, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable11) == 0x000042, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable12) == 0x000043, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable13) == 0x000044, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable14) == 0x000045, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable15) == 0x000046, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable4) == 0x000047, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable16) == 0x000048, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable17) == 0x000049, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_MakeArray_Array2) == 0x000060, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select_Default) == 0x000070, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable5) == 0x000071, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_ItemContainer) == 0x000078, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_EventTag) == 0x0000C8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_SwitchName_CmpSuccess) == 0x0000D0, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data) == 0x0000D8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x0000E8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_DynamicCast_bSuccess2) == 0x0000F0, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000F1, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select2_Default) == 0x0000F2, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000F3, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_GetValidValue_ReturnValue) == 0x0000F4, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0000F5, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000F6, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_Data) == 0x0000F8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_BgType) == 0x000168, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_BgType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000170, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select3_Default) == 0x000180, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select4_Default) == 0x000181, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select5_Default) == 0x000182, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Format_ReturnValue) == 0x000188, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Format_ReturnValue2) == 0x0001A0, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001B8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0001B9, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0001BA, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select6_Default) == 0x0001BB, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select7_Default) == 0x0001C0, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_CaptionText) == 0x0001D8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_CaptionText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_IconTexture) == 0x0001F0, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_InColorType) == 0x0001F8, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_InColorType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_IsValid_ReturnValue) == 0x0001F9, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select8_Default) == 0x0001FA, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select8_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000200, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_CustomEvent_ItemSyousaiData) == 0x000210, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_CustomEvent_ItemSyousaiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable18) == 0x000218, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable6) == 0x000219, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_MakeArray_Array3) == 0x000220, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Format_ReturnValue3) == 0x000230, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Format_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_MakeArray_Array4) == 0x000248, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_byte_Variable19) == 0x000258, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, CallFunc_Format_ReturnValue4) == 0x000260, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::CallFunc_Format_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select9_Default) == 0x000278, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select9_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, Temp_bool_Variable7) == 0x000290, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern, K2Node_Select10_Default) == 0x000291, "Member 'WBP_Menu_Parts_075_modern_C_ExecuteUbergraph_WBP_Menu_Parts_075_modern::K2Node_Select10_Default' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.SetRenkeiData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_SetRenkeiData final
{
public:
	class UJackUMGTuyosaRenkeiData*               RenkeiData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_SetRenkeiData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_SetRenkeiData");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_SetRenkeiData) == 0x000008, "Wrong size on WBP_Menu_Parts_075_modern_C_SetRenkeiData");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetRenkeiData, RenkeiData) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_SetRenkeiData::RenkeiData' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.SetItemSyousaiData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_SetItemSyousaiData final
{
public:
	class UJackUMGItemSyousai*                    ItemSyousaiData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_SetItemSyousaiData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_SetItemSyousaiData");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_SetItemSyousaiData) == 0x000008, "Wrong size on WBP_Menu_Parts_075_modern_C_SetItemSyousaiData");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetItemSyousaiData, ItemSyousaiData) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_SetItemSyousaiData::ItemSyousaiData' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_SetData final
{
public:
	class FText                                   CaptionText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             IconTexture;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          InColorType;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_SetData) == 0x000028, "Wrong size on WBP_Menu_Parts_075_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetData, CaptionText_0) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_SetData::CaptionText_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetData, IconTexture) == 0x000018, "Member 'WBP_Menu_Parts_075_modern_C_SetData::IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetData, InColorType) == 0x000020, "Member 'WBP_Menu_Parts_075_modern_C_SetData::InColorType' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.SetSoubiData
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_SetSoubiData final
{
public:
	struct FJackUMGSoubiData                      Data;                                              // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	EJackUMGBackgroundColor                       BgType;                                            // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_SetSoubiData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_SetSoubiData");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_SetSoubiData) == 0x000078, "Wrong size on WBP_Menu_Parts_075_modern_C_SetSoubiData");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetSoubiData, Data) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_SetSoubiData::Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetSoubiData, BgType) == 0x000070, "Member 'WBP_Menu_Parts_075_modern_C_SetSoubiData::BgType' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_075_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_075_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_075_modern.WBP_Menu_Parts_075_modern_C.SetCharacterSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_075_modern_C_SetCharacterSpacing final
{
public:
	float                                         InCharacterSpacing;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_075_modern_C_SetCharacterSpacing) == 0x000004, "Wrong alignment on WBP_Menu_Parts_075_modern_C_SetCharacterSpacing");
static_assert(sizeof(WBP_Menu_Parts_075_modern_C_SetCharacterSpacing) == 0x000004, "Wrong size on WBP_Menu_Parts_075_modern_C_SetCharacterSpacing");
static_assert(offsetof(WBP_Menu_Parts_075_modern_C_SetCharacterSpacing, InCharacterSpacing) == 0x000000, "Member 'WBP_Menu_Parts_075_modern_C_SetCharacterSpacing::InCharacterSpacing' has a wrong offset!");

}

