#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_Fusigikazi_Window_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CallFunc_SelectCategoryList_CategoryList;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0078(0x0018)()
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorFusigiKazi*             CallFunc_GetAccessorFusigiKazi_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKaziGamePlayNum_Retry_ReturnValue;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorFusigiKazi*             CallFunc_GetAccessorFusigiKazi_ReturnValue2;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSuccessNum_Normal_ReturnValue;         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue2;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern) == 0x0000C0, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_CustomEvent_EventTag) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_SelectCategoryList_CategoryList) == 0x000020, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_SelectCategoryList_CategoryList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000030, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_CustomEvent_EventName) == 0x000058, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_CustomEvent_InItemBase) == 0x000060, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000078, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000090, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetAccessorFusigiKazi_ReturnValue) == 0x000098, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetAccessorFusigiKazi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetKaziGamePlayNum_Retry_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetKaziGamePlayNum_Retry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetAccessorFusigiKazi_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetAccessorFusigiKazi_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_Clamp_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_GetSuccessNum_Normal_ReturnValue) == 0x0000B4, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_GetSuccessNum_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern, CallFunc_Clamp_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_001_modern::CallFunc_Clamp_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.SelectCategoryList
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList final
{
public:
	class UCanvasPanel*                           CategoryList_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSenreki_ItemCategory                     CallFunc_GetSelectedItemCategory_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList) == 0x000020, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList, CategoryList_0) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList::CategoryList_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList, CallFunc_GetSelectedItemCategory_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList::CallFunc_GetSelectedItemCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SelectCategoryList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.SetCategoryNumber
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Category;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Classification                      CallFunc_GetSelectedClassification_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSenreki_ItemCategory                     CallFunc_GetSelectedItemCategory_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSenreki_ItemCategory                     CallFunc_GetSelectedItemCategory_ReturnValue2;     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRecipeNumber_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRecipeNumber_ReturnValue2;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber) == 0x000040, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, Number) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::Number' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, Category) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::Category' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetUMGManager_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetSelectedClassification_ReturnValue) == 0x000030, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetSelectedClassification_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetSelectedItemCategory_ReturnValue) == 0x000031, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetSelectedItemCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetSelectedItemCategory_ReturnValue2) == 0x000032, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetSelectedItemCategory_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetRecipeNumber_ReturnValue) == 0x000034, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetRecipeNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber, CallFunc_GetRecipeNumber_ReturnValue2) == 0x00003C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetCategoryNumber::CallFunc_GetRecipeNumber_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.SetTextToClassification
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification final
{
public:
	class FName                                   InTextId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification) == 0x000040, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, InTextId) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::InTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, CallFunc_GetUMGManager_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, CallFunc_GetUMGManager_ReturnValue3) == 0x000030, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification, CallFunc_GetAccessorSenreki_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextToClassification::CallFunc_GetAccessorSenreki_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.SetTextColorBuki
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki final
{
public:
	int32                                         Ax;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Claw;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Whip;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Spear;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Staff;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stick;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Boomerang;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Dagger;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DSword;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sword;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Buki;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue5;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue6;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue7;              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue8;              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue9;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue10;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue11;             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue3;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue4;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue5;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue6;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue7;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue8;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue9;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue10;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue11;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki) == 0x000070, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Ax) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Ax' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Claw) == 0x000004, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Claw' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Whip) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Whip' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Spear) == 0x00000C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Spear' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Staff) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Staff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Stick) == 0x000014, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Stick' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Boomerang) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Boomerang' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Dagger) == 0x00001C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Dagger' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, DSword) == 0x000020, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::DSword' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Sword) == 0x000024, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Sword' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, Buki) == 0x000028, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::Buki' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue2) == 0x00002D, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue3) == 0x00002E, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue4) == 0x00002F, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue5) == 0x000030, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue6) == 0x000031, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue7) == 0x000032, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue8) == 0x000033, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue9) == 0x000034, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue10) == 0x000035, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_Greater_IntInt_ReturnValue11) == 0x000036, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_Greater_IntInt_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue) == 0x000040, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue2) == 0x000044, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue3) == 0x000048, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue4) == 0x00004C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue5) == 0x000050, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue6) == 0x000054, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue7) == 0x000058, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue8) == 0x00005C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue9) == 0x000060, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue10) == 0x000064, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki, CallFunc_GetRecipeNumber_ReturnValue11) == 0x000068, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBuki::CallFunc_GetRecipeNumber_ReturnValue11' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.SetTextColorBougu
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu final
{
public:
	int32                                         Robe;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Armor;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Clothes;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Helmet;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hat;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LargeShield;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shield;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Bougu;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue5;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue6;              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue7;              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue8;              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue2;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue3;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue4;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue5;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue6;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue7;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue8;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu) == 0x000050, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Robe) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Robe' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Armor) == 0x000004, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Armor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Clothes) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Clothes' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Helmet) == 0x00000C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Helmet' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Hat) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Hat' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, LargeShield) == 0x000014, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::LargeShield' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Shield) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Shield' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, Bougu) == 0x00001C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::Bougu' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue2) == 0x000021, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue3) == 0x000022, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue4) == 0x000023, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue5) == 0x000024, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue6) == 0x000025, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue7) == 0x000026, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_Greater_IntInt_ReturnValue8) == 0x000027, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_Greater_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue) == 0x000030, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue2) == 0x000034, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue4) == 0x00003C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue5) == 0x000040, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue6) == 0x000044, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue7) == 0x000048, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu, CallFunc_GetRecipeNumber_ReturnValue8) == 0x00004C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorBougu::CallFunc_GetRecipeNumber_ReturnValue8' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_001_modern.WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C.SetTextColorAccessory
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_001_modern_C_SetTextColorAccessory final
{
public:
	int32                                         Etc;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shoes;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Finger;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hand;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Arm;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Neck;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Face;                                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Accessory;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
