#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Button_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Button_000_modern.WBP_Hud_Button_000_modern_C.ExecuteUbergraph_WBP_Hud_Button_000_modern
// 0x0020 (0x0020 - 0x0000)
struct WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_GameFlagDataScenario          K2Node_MakeStruct_JackLDT_GameFlagDataScenario;    // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_GetScenarioFlag_Flag;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleSimpleCameraMode_ReturnValue;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern) == 0x000008, "Wrong alignment on WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern");
static_assert(sizeof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern) == 0x000020, "Wrong size on WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, K2Node_MakeStruct_JackLDT_GameFlagDataScenario) == 0x000008, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::K2Node_MakeStruct_JackLDT_GameFlagDataScenario' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, CallFunc_GetScenarioFlag_Flag) == 0x000018, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::CallFunc_GetScenarioFlag_Flag' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, CallFunc_IsBattleSimpleCameraMode_ReturnValue) == 0x000019, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::CallFunc_IsBattleSimpleCameraMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern, K2Node_Select_Default) == 0x00001B, "Member 'WBP_Hud_Button_000_modern_C_ExecuteUbergraph_WBP_Hud_Button_000_modern::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Hud_Button_000_modern.WBP_Hud_Button_000_modern_C.SetMukouColor
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Button_000_modern_C_SetMukouColor final
{
public:
	bool                                          bIsXButton;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDirectionButton;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGPresetColor                           Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGPresetColor                           Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGPresetColor                           Temp_byte_Variable3;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGPresetColor                           Temp_byte_Variable4;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGPresetColor                           K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGPresetColor                           K2Node_Select2_Default;                            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUMGPresetColor_ReturnValue;            // 0x0020(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUMGPresetColor_ReturnValue2;           // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Button_000_modern_C_SetMukouColor) == 0x000008, "Wrong alignment on WBP_Hud_Button_000_modern_C_SetMukouColor");
static_assert(sizeof(WBP_Hud_Button_000_modern_C_SetMukouColor) == 0x000040, "Wrong size on WBP_Hud_Button_000_modern_C_SetMukouColor");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, bIsXButton) == 0x000000, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::bIsXButton' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, bIsDirectionButton) == 0x000001, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::bIsDirectionButton' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, Temp_byte_Variable) == 0x000002, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, Temp_byte_Variable2) == 0x000003, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, Temp_bool_Variable) == 0x000004, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, Temp_byte_Variable3) == 0x000005, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, Temp_byte_Variable4) == 0x000006, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, Temp_bool_Variable2) == 0x000007, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, K2Node_Select_Default) == 0x000008, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, K2Node_Select2_Default) == 0x000009, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, CallFunc_GetUMGManager_ReturnValue2) == 0x000018, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, CallFunc_GetUMGPresetColor_ReturnValue) == 0x000020, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::CallFunc_GetUMGPresetColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Button_000_modern_C_SetMukouColor, CallFunc_GetUMGPresetColor_ReturnValue2) == 0x000030, "Member 'WBP_Hud_Button_000_modern_C_SetMukouColor::CallFunc_GetUMGPresetColor_ReturnValue2' has a wrong offset!");

}

