#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_007_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_List_007_modern.WBP_Menu_WorldMap_List_007_modern_C.FocusItemEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature final
{
public:
	class UJackUMGAccessorSaveDataInRura*         RuraData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature, RuraData) == 0x000000, "Member 'WBP_Menu_WorldMap_List_007_modern_C_FocusItemEvent__DelegateSignature::RuraData' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_007_modern.WBP_Menu_WorldMap_List_007_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 OutMonsterIndex)>        K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetWorldMapMonsterList_ReturnValue;       // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_PoppedWidget;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_CurrentActiveWidget;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKilledMonsterInList_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Senreki_MonsterZukan_Window_004_modern_C* K2Node_DynamicCast_AsWBP_Menu_Senreki_Monster_Zukan_Window_004_Modern; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OutMonsterIndex;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern");
static_assert(sizeof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern) == 0x0000E0, "Wrong size on WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000030, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_SwitchName_CmpSuccess) == 0x000038, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetWorldMapMonsterList_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetWorldMapMonsterList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_PopMenu_PoppedWidget) == 0x000058, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_PopMenu_PoppedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_PopMenu_CurrentActiveWidget) == 0x000060, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_PopMenu_CurrentActiveWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_Array_Length_ReturnValue2) == 0x00006C, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CustomEvent_EventName) == 0x000078, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CustomEvent_InItemBase) == 0x000080, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000088, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_SwitchName2_CmpSuccess) == 0x000090, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000098, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x0000B0, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_IsKilledMonsterInList_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_IsKilledMonsterInList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_DynamicCast_AsWBP_Menu_Senreki_Monster_Zukan_Window_004_Modern) == 0x0000D0, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_DynamicCast_AsWBP_Menu_Senreki_Monster_Zukan_Window_004_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern, K2Node_CustomEvent_OutMonsterIndex) == 0x0000DC, "Member 'WBP_Menu_WorldMap_List_007_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_007_modern::K2Node_CustomEvent_OutMonsterIndex' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_007_modern.WBP_Menu_WorldMap_List_007_modern_C.MonsterZukan
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan final
{
public:
	int32                                         OutMonsterIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan");
static_assert(sizeof(WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan) == 0x000004, "Wrong size on WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan, OutMonsterIndex) == 0x000000, "Member 'WBP_Menu_WorldMap_List_007_modern_C_MonsterZukan::OutMonsterIndex' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_007_modern.WBP_Menu_WorldMap_List_007_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_WorldMap_List_007_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_007_modern.WBP_Menu_WorldMap_List_007_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_List_007_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_007_modern.WBP_Menu_WorldMap_List_007_modern_C.SetParamSetumei
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRuraEmpty;                                       // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei");
static_assert(sizeof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei) == 0x000028, "Wrong size on WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, ItemIndex) == 0x000000, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, IsEmpty) == 0x000004, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, IsRuraEmpty) == 0x000005, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::IsRuraEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei, CallFunc_GetRuraData_ReturnValue) == 0x000020, "Member 'WBP_Menu_WorldMap_List_007_modern_C_SetParamSetumei::CallFunc_GetRuraData_ReturnValue' has a wrong offset!");

}

