#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_List_002_modern.WBP_Menu_Shop_List_002_modern_C.ExecuteUbergraph_WBP_Menu_Shop_List_002_modern
// 0x07E0 (0x07E0 - 0x0000)
struct WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCommonBag_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue2;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInputValue_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId2;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue2;             // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue3;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue3;   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetActionItemNameTag_JackMessageArgumentData; // 0x0110(0x0048)()
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetTotalPriceTag_JackMessageArgumentData; // 0x0160(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetActionItemNameTag_JackMessageArgumentData2; // 0x01A8(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array4;                           // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagCountBySelected_ReturnValue;        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId3;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue3;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue4;   // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetActionItemNameTag_JackMessageArgumentData3; // 0x0250(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetActionItemCountTag_JackMessageArgumentData; // 0x0298(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetTotalPriceTag_JackMessageArgumentData2; // 0x02E0(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array5;                           // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue2;                 // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId4;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue4;             // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetItemEquipmentInfo_ReturnValue;         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383[0x5];                                      // 0x0383(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue12;            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetActionItemCount_ReturnValue;           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetActionItemNameTag_JackMessageArgumentData4; // 0x03A8(0x0048)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetTotalPriceTag_JackMessageArgumentData3; // 0x03F8(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array6;                           // 0x0440(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue13;            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetPrevPageWidget_ReturnValue;            // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue14;            // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActionItemCount_ReturnValue2;          // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue15;            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId5;        // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue5;             // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemList_NewParam;                     // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x04C8(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue16;            // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue17;            // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId6;        // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue6;             // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue18;            // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array7;                           // 0x0528(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue19;            // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue20;            // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemClassRefineType                   CallFunc_Array_Get_Item;                           // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue21;            // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ValueLooper_ReturnValue;                  // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue22;            // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId7;        // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue7;             // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackUMGItemListInfo>           CallFunc_GetItemSyousaiList_ReturnValue;           // 0x0588(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue23;            // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetFirstMembarCharacterType_ReturnValue;  // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x05AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AB[0x5];                                      // 0x05AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue24;            // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue;            // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue25;            // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue2; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array8;                           // 0x05F0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue26;            // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array9;                           // 0x0610(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue3; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue27;            // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId8;        // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue8;             // 0x0638(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidgetIfNotGet_ReturnValue;     // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_007_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_007_Modern; // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66A[0x6];                                      // 0x066A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array10;                          // 0x0670(0x0010)(ZeroConstructor, ReferenceParm)
	EJackItem_SellType                            CallFunc_GetSellType_SellType;                     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue28;            // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId9;        // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue9;             // 0x06A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue29;            // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId10;       // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue10;            // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue30;            // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue31;            // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagCountBySelected_ReturnValue2;       // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array11;                          // 0x06F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Common_Quantity_001_modern_C* K2Node_DynamicCast_AsWBP_Menu_Common_Quantity_001_Modern; // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue32;            // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId11;       // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue11;            // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0758(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue33;            // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId12;       // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue12;            // 0x0778(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate5;             // 0x0788(0x0010)(ZeroConstructor, NoDestructor)
	EJackItem_SellType                            CallFunc_GetSellType_SellType2;                    // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue34;            // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SortBagItemList_ReturnValue;              // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4[0x4];                                      // 0x07B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue2;   // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x07C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue35;            // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountInBag_ReturnValue;                   // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue3;             // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern");
static_assert(sizeof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern) == 0x0007E0, "Wrong size on WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x000010, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000014, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000015, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_IsCommonBag_ReturnValue) == 0x000016, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_IsCommonBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x00003C, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetInputValue_ReturnValue) == 0x000040, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetInputValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_OutShopMessageId) == 0x000060, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_OutShopMessageId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_ReturnValue) == 0x000068, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000078, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_MakeArray_Array2) == 0x000080, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CustomEvent_EventTag) == 0x000090, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CustomEvent_EventName) == 0x000098, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CustomEvent_InItemBase) == 0x0000A0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchName_CmpSuccess) == 0x0000A8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000A9, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetSoundSet_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_OutShopMessageId2) == 0x0000C8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_OutShopMessageId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x0000E0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_ActionItem_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x0000F0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue3) == 0x0000F8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x000100, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue3) == 0x000108, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetActionItemNameTag_JackMessageArgumentData) == 0x000110, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetActionItemNameTag_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchInteger3_CmpSuccess) == 0x000158, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetTotalPriceTag_JackMessageArgumentData) == 0x000160, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetTotalPriceTag_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetActionItemNameTag_JackMessageArgumentData2) == 0x0001A8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetActionItemNameTag_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_MakeArray_Array3) == 0x0001F0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_MakeArray_Array4) == 0x000200, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x000210, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue9) == 0x000218, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetBagCountBySelected_ReturnValue) == 0x000220, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetBagCountBySelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_OutShopMessageId3) == 0x000228, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_OutShopMessageId3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_ReturnValue3) == 0x000230, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000240, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue4) == 0x000244, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchInteger4_CmpSuccess) == 0x000248, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetActionItemNameTag_JackMessageArgumentData3) == 0x000250, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetActionItemNameTag_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetActionItemCountTag_JackMessageArgumentData) == 0x000298, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetActionItemCountTag_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetTotalPriceTag_JackMessageArgumentData2) == 0x0002E0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetTotalPriceTag_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_MakeArray_Array5) == 0x000328, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000338, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue10) == 0x000340, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetSoundSet_ReturnValue2) == 0x000348, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetSoundSet_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_OutShopMessageId4) == 0x000350, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_OutShopMessageId4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetShopTalkText_ReturnValue4) == 0x000358, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetShopTalkText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue11) == 0x000368, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000370, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetItemEquipmentInfo_ReturnValue) == 0x000378, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetItemEquipmentInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CustomEvent_InKeyType) == 0x000380, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CustomEvent_bIsPressed) == 0x000381, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000382, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue12) == 0x000388, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000390, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetActionItemCount_ReturnValue) == 0x0003A0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetActionItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetActionItemNameTag_JackMessageArgumentData4) == 0x0003A8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetActionItemNameTag_JackMessageArgumentData4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0003F0, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetTotalPriceTag_JackMessageArgumentData3) == 0x0003F8, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetTotalPriceTag_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, K2Node_MakeArray_Array6) == 0x000440, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::K2Node_MakeArray_Array6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000450, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue13) == 0x000458, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue) == 0x000460, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetPrevPageWidget_ReturnValue) == 0x000468, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetPrevPageWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern, CallFunc_GetAccessorItem_ReturnValue14) == 0x000470, "Member 'WBP_Menu_Shop_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_002_modern::CallFunc_GetAccessorItem_ReturnValue14' has a wrong offset!");
