#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Save_data_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Save_data_002_modern.WBP_Menu_Namae_Save_data_002_modern_C.OnSelect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature final
{
public:
	class UJackUMGItemBase*                       ItemBase;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature");
static_assert(sizeof(WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature, ItemBase) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_OnSelect__DelegateSignature::ItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Save_data_002_modern.WBP_Menu_Namae_Save_data_002_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSaveDataListFromCached_ReturnValue;    // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InDataIndex;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSaveDataListFromCached_ReturnValue2;   // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMainSlotIndex_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetSaveDataListFromCached_ReturnValue3;   // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue2;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMainSlotIndex_ReturnValue2;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue2;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Scenario_Tensei_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Scenario_Tensei_000_Modern; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern");
static_assert(sizeof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern) == 0x0000F8, "Wrong size on WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CustomEvent_InKeyType) == 0x000041, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CustomEvent_bIsPressed) == 0x000042, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000043, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000048, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetSaveDataListFromCached_ReturnValue) == 0x000050, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetSaveDataListFromCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CustomEvent_EventName) == 0x000060, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CustomEvent_InItemBase) == 0x000068, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_CustomEvent_InDataIndex) == 0x000070, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_CustomEvent_InDataIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x000074, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetSaveDataListFromCached_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetSaveDataListFromCached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetSaveData_ReturnValue) == 0x000090, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetMainSlotIndex_ReturnValue) == 0x000098, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetMainSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x0000A0, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_Max_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetSaveDataListFromCached_ReturnValue3) == 0x0000B0, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetSaveDataListFromCached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetSaveData_ReturnValue2) == 0x0000C0, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetMainSlotIndex_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetMainSlotIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, CallFunc_Max_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::CallFunc_Max_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_DynamicCast_AsWBP_Menu_Scenario_Tensei_000_Modern) == 0x0000E8, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_DynamicCast_AsWBP_Menu_Scenario_Tensei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_002_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Namae_Save_data_002_modern.WBP_Menu_Namae_Save_data_002_modern_C.UpdateData
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Namae_Save_data_002_modern_C_UpdateData final
{
public:
	int32                                         InDataIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_002_modern_C_UpdateData) == 0x000004, "Wrong alignment on WBP_Menu_Namae_Save_data_002_modern_C_UpdateData");
static_assert(sizeof(WBP_Menu_Namae_Save_data_002_modern_C_UpdateData) == 0x000004, "Wrong size on WBP_Menu_Namae_Save_data_002_modern_C_UpdateData");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_UpdateData, InDataIndex) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_UpdateData::InDataIndex' has a wrong offset!");

// Function WBP_Menu_Namae_Save_data_002_modern.WBP_Menu_Namae_Save_data_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Save_data_002_modern.WBP_Menu_Namae_Save_data_002_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Namae_Save_data_002_modern.WBP_Menu_Namae_Save_data_002_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_002_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

}

