#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_List_000_modern.WBP_Menu_Sakusen_List_000_modern_C
// 0x0108 (0x0538 - 0x0430)
class UWBP_Menu_Sakusen_List_000_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_001;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_002;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_003;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_004;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_005;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_006;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_007;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_121;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBPMenuParts008;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBPMenuParts009;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBPMenuParts010;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBPMenuParts011;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHighlightTokugiPanelMenu;                         // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHoboMantan;                                       // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnableIrekae;                                    // 0x04BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BB[0x5];                                      // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Menu_Senreki_Window_000_Asset;                     // 0x04C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Tutorial_Window_001_Asset;                    // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Sakusen_List_001_Asset;                       // 0x04F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Sakusen_List_002_Asset;                       // 0x0508(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Sakusen_Member_Change_Window_000_Asset;       // 0x0520(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern(int32 EntryPoint);
	void CustomEvent_0(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void OnMantanCommandEnd();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void Construct();
	void SendTokugiPanelMessage(class FName Message);
	void SetMenuMode();
	void PlayAnimData(const struct FJackUMGTokugiPanelAnimData& AnimData);
	void SetCharacterItemData(class UJackUMGItemData* ItemData);
	void SetPanelData(class UJackUMGTokugiPanelData* PanelData);
	void PlayAnimationNameArg(class FName Arg);
	void PlayAnimationIntArg(int32 Arg);
	void OnEndAnim(class UUserWidget* Sender);
	void SetEndAnimEventListener(TScriptInterface<class IBP_IF_TokugiPanel_Item_C> Listener);
	void PlayDefaultAnimation();
	void OnTokugiPanelWindowDestruct();
	void SetResetMode();
	void SetBattleResultMode(EJackCharacter CharacterType);
	void OnTokugiPanelWindowCancel();
	void SetCancelEventListener(TScriptInterface<class IBP_IF_TokugiPanel_Item_C> CancelEventListener);
	void SetBackGroundScroll(const struct FVector2D& BgScroll);
	void SetDisplayScale(float DisplayScale);
	void SetDisplayData(const struct FVector2D& Position_0, float Scale_0, const struct FVector2D& BgScroll);
	void SetDrawPos(const struct FVector2D& Position_0);
	void SetInfoText(class FName Selection);
	void SetEnableIrekae();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_List_000_modern_C">();
	}
	static class UWBP_Menu_Sakusen_List_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_List_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_List_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_List_000_modern_C");
static_assert(sizeof(UWBP_Menu_Sakusen_List_000_modern_C) == 0x000538, "Wrong size on UWBP_Menu_Sakusen_List_000_modern_C");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_001) == 0x000448, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_002) == 0x000450, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_003) == 0x000458, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_004) == 0x000460, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_005) == 0x000468, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_005' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_006) == 0x000470, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_007) == 0x000478, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_000_C_114) == 0x000480, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBP_Menu_Parts_000_C_121) == 0x000488, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBP_Menu_Parts_000_C_121' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBPMenuParts008) == 0x000490, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBPMenuParts008' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBPMenuParts009) == 0x000498, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBPMenuParts009' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBPMenuParts010) == 0x0004A0, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBPMenuParts010' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WBPMenuParts011) == 0x0004A8, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WBPMenuParts011' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, WindowFrame) == 0x0004B0, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, bHighlightTokugiPanelMenu) == 0x0004B8, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::bHighlightTokugiPanelMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, bHoboMantan) == 0x0004B9, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::bHoboMantan' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, IsEnableIrekae) == 0x0004BA, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::IsEnableIrekae' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, Menu_Senreki_Window_000_Asset) == 0x0004C0, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::Menu_Senreki_Window_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, Menu_Tutorial_Window_001_Asset) == 0x0004D8, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::Menu_Tutorial_Window_001_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, Menu_Sakusen_List_001_Asset) == 0x0004F0, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::Menu_Sakusen_List_001_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, Menu_Sakusen_List_002_Asset) == 0x000508, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::Menu_Sakusen_List_002_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_000_modern_C, Menu_Sakusen_Member_Change_Window_000_Asset) == 0x000520, "Member 'UWBP_Menu_Sakusen_List_000_modern_C::Menu_Sakusen_Member_Change_Window_000_Asset' has a wrong offset!");

}

