#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_047_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_047_modern.WBP_Menu_Parts_047_modern_C.ExecuteUbergraph_WBP_Menu_Parts_047_modern
// 0x0128 (0x0128 - 0x0000)
struct WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable3;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable4;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPanelPageType                      Temp_byte_Variable5;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable6;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable7;                               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable8;                               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable9;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable10;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable11;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable12;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPanelPageType                      Temp_byte_Variable13;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable14;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable15;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable16;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable17;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable18;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          Temp_bool_Variable7;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable19;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable20;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGTokugiPanelData*                K2Node_CustomEvent_Data;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPanelPageType                      K2Node_CustomEvent_PageType;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOpen_ReturnValue;                      // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNowLock_ReturnValue;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOpen_ReturnValue2;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNowLock_ReturnValue2;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select2_Default;                            // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select3_Default;                            // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue6;         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select4_Default;                            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select5_Default;                            // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select6_Default;                            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetIconTexture_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNeedSkillPointText_ReturnValue;        // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x00B0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue7;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetName_ReturnValue;                      // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select7_Default;                            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable21;                              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable9;                               // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable22;                              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select8_Default;                            // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select9_Default;                            // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select10_Default;                           // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select11_Default;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_FindChildTextBlock_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0100(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_TextHyphenation_OutLineTextArray;         // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0120(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern");
static_assert(sizeof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern) == 0x000128, "Wrong size on WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable2) == 0x000010, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable2) == 0x000011, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable3) == 0x000012, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable4) == 0x000013, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable5) == 0x000014, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable6) == 0x000015, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable7) == 0x000016, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable8) == 0x000017, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable3) == 0x000018, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable9) == 0x000019, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable10) == 0x00001A, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable4) == 0x00001B, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable11) == 0x00001C, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable12) == 0x00001D, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable13) == 0x00001E, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable14) == 0x00001F, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable15) == 0x000020, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable16) == 0x000021, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable5) == 0x000022, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable17) == 0x000023, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable6) == 0x000024, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable18) == 0x000025, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_JoinStringArray_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable7) == 0x000060, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_float_Variable) == 0x000064, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_float_Variable2) == 0x000068, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable19) == 0x00006C, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select_Default) == 0x000070, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable20) == 0x000074, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable20' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable8) == 0x000075, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_CustomEvent_Data) == 0x000078, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_CustomEvent_PageType) == 0x000080, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_CustomEvent_PageType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000081, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000082, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_CanOpen_ReturnValue) == 0x000083, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_CanOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BooleanOR_ReturnValue) == 0x000084, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_IsNowLock_ReturnValue) == 0x000085, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_IsNowLock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BooleanAND_ReturnValue) == 0x000086, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000087, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BooleanOR_ReturnValue2) == 0x000088, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_CanOpen_ReturnValue2) == 0x000089, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_CanOpen_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_IsNowLock_ReturnValue2) == 0x00008A, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_IsNowLock_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select2_Default) == 0x00008B, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BooleanAND_ReturnValue2) == 0x00008C, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select3_Default) == 0x00008D, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x00008E, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BooleanOR_ReturnValue3) == 0x00008F, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x000090, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue6) == 0x000091, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select4_Default) == 0x000092, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select5_Default) == 0x000093, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select6_Default) == 0x000094, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_GetIconTexture_ReturnValue) == 0x000098, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_GetIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_GetNeedSkillPointText_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_GetNeedSkillPointText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x0000B0, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_EqualEqual_ByteByte_ReturnValue7) == 0x0000C8, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_EqualEqual_ByteByte_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_GetName_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select7_Default) == 0x0000E1, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable21) == 0x0000E2, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable21' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_bool_Variable9) == 0x0000E3, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, Temp_byte_Variable22) == 0x0000E4, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::Temp_byte_Variable22' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select8_Default) == 0x0000E5, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select8_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select9_Default) == 0x0000E6, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select9_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select10_Default) == 0x0000E7, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select10_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, K2Node_Select11_Default) == 0x0000E8, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::K2Node_Select11_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_FindChildTextBlock_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_FindChildTextBlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_GetPosition_ReturnValue) == 0x000100, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_TextHyphenation_OutLineTextArray) == 0x000108, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_TextHyphenation_OutLineTextArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BreakVector2D_X) == 0x000118, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_BreakVector2D_Y) == 0x00011C, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000120, "Member 'WBP_Menu_Parts_047_modern_C_ExecuteUbergraph_WBP_Menu_Parts_047_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_047_modern.WBP_Menu_Parts_047_modern_C.SetTokugiPanelData
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Parts_047_modern_C_SetTokugiPanelData final
{
public:
	class UJackUMGTokugiPanelData*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTokugiPanelPageType                      PageType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_047_modern_C_SetTokugiPanelData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_047_modern_C_SetTokugiPanelData");
static_assert(sizeof(WBP_Menu_Parts_047_modern_C_SetTokugiPanelData) == 0x000010, "Wrong size on WBP_Menu_Parts_047_modern_C_SetTokugiPanelData");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_SetTokugiPanelData, Data) == 0x000000, "Member 'WBP_Menu_Parts_047_modern_C_SetTokugiPanelData::Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_047_modern_C_SetTokugiPanelData, PageType) == 0x000008, "Member 'WBP_Menu_Parts_047_modern_C_SetTokugiPanelData::PageType' has a wrong offset!");

}

