#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_List_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_List_003_modern.WBP_Menu_Dougu_List_003_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern
// 0x0738 (0x0738 - 0x0000)
struct WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateMembarList_IsList;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   K2Node_DynamicCast_AsJack_UMGUIAction_Info;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExecutableAction_ReturnValue;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName5_CmpSuccess;                     // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayUseJumonMessage_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayUseItemMessage_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFieldUseItemCommonActionResult_bValidCommonAction; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFieldUseItemCommonActionResult_bSuccess; // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue3;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_List_000_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Dougu_List_000_Modern; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetMsgActionName_JackMessageArgumentData; // 0x0158(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackMessageArgumentData               CallFunc_GetMsgActionName_JackMessageArgumentData2; // 0x01B0(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetMsgTargetCharName_JackMessageArgumentData; // 0x01F8(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetMsgItemUseCharName_JackMessageArgumentData; // 0x0240(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0288(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackMessageArgumentData               CallFunc_GetMsgTargetCharName2_JackMessageArgumentData; // 0x0298(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetMsgActionName_JackMessageArgumentData3; // 0x02E0(0x0048)()
	class FName                                   CallFunc_CheckAllActionFlow2_OutTextId;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0330(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_CheckSingleActionFlow2_OutTextId;         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue2;            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecutableAction_ReturnValue2;          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInBattle_ReturnValue2;                  // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemRemain_ReturnValue;              // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMembarList_IsList2;                 // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x0388(0x0050)()
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               K2Node_DynamicCast_AsJack_UMGItem_Action_Status;   // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x03F8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0408(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackMessageArgumentData               CallFunc_GetMsgItemUseCharName_JackMessageArgumentData2; // 0x0418(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetMsgActionName_JackMessageArgumentData4; // 0x0460(0x0048)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array4;                           // 0x04B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue4;        // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_List_000_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Jumon_List_000_Modern; // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_GetMsgActionName_JackMessageArgumentData5; // 0x04E0(0x0048)()
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue2;   // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_GetMsgTargetCharName_JackMessageArgumentData2; // 0x0530(0x0048)()
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result4;             // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array5;                           // 0x0580(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackMessageArgumentData               CallFunc_GetMsgItemUseCharName_JackMessageArgumentData3; // 0x0590(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetMsgTargetCharName2_JackMessageArgumentData2; // 0x05D8(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetMsgActionName_JackMessageArgumentData6; // 0x0620(0x0048)()
	class FName                                   CallFunc_CheckAllActionFlow2_OutTextId2;           // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array6;                           // 0x0670(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_CheckSingleActionFlow2_OutTextId2;        // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCasterMP_ReturnValue;                  // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCasterMP_ReturnValue2;                 // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x06A0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMembarList_IsList3;                 // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B2[0x6];                                      // 0x06B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue2; // 0x06C0(0x0050)()
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue5;        // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               K2Node_DynamicCast_AsJack_UMGItem_Action_Status2;  // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern");
static_assert(sizeof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern) == 0x000738, "Wrong size on WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CustomEvent_EventName) == 0x000018, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CustomEvent_InItemBase) == 0x000020, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchName2_CmpSuccess) == 0x000031, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchName3_CmpSuccess) == 0x000032, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchName4_CmpSuccess) == 0x000033, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000038, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_UpdateMembarList_IsList) == 0x000058, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_UpdateMembarList_IsList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetBattleManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000068, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_IsInBattle_ReturnValue) == 0x000070, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CustomEvent_InEventTag) == 0x000078, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000080, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CustomEvent_InObject) == 0x000088, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_AsJack_UMGUIAction_Info) == 0x000090, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_AsJack_UMGUIAction_Info' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_IsExecutableAction_ReturnValue) == 0x000099, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_IsExecutableAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchName5_CmpSuccess) == 0x00009A, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchName5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_DisplayUseJumonMessage_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_DisplayUseJumonMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x0000C8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_DisplayUseItemMessage_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_DisplayUseItemMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetFieldUseItemCommonActionResult_bValidCommonAction) == 0x0000F0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetFieldUseItemCommonActionResult_bValidCommonAction' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetFieldUseItemCommonActionResult_bSuccess) == 0x0000F1, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetFieldUseItemCommonActionResult_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x0000F8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_IsValid_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000108, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGWidgetFromName_ReturnValue3) == 0x000110, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGWidgetFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_List_000_Modern) == 0x000118, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_List_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_bSuccess2) == 0x000120, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000128, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000130, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_WaitMessageEndFromBP_Result3) == 0x000138, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_WaitMessageEndFromBP_Result3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, Temp_struct_Variable) == 0x000140, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_NotEqual_NameName_ReturnValue) == 0x000150, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgActionName_JackMessageArgumentData) == 0x000158, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgActionName_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_MakeArray_Array) == 0x0001A0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgActionName_JackMessageArgumentData2) == 0x0001B0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgActionName_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgTargetCharName_JackMessageArgumentData) == 0x0001F8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgTargetCharName_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgItemUseCharName_JackMessageArgumentData) == 0x000240, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgItemUseCharName_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_MakeArray_Array2) == 0x000288, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgTargetCharName2_JackMessageArgumentData) == 0x000298, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgTargetCharName2_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgActionName_JackMessageArgumentData3) == 0x0002E0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgActionName_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CheckAllActionFlow2_OutTextId) == 0x000328, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CheckAllActionFlow2_OutTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_MakeArray_Array3) == 0x000330, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CheckSingleActionFlow2_OutTextId) == 0x000340, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CheckSingleActionFlow2_OutTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000348, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000350, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetBattleManager_ReturnValue2) == 0x000358, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetBattleManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_IsExecutableAction_ReturnValue2) == 0x000360, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_IsExecutableAction_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_IsInBattle_ReturnValue2) == 0x000361, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_IsInBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000368, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CountItemRemain_ReturnValue) == 0x000370, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CountItemRemain_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000374, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_UpdateMembarList_IsList2) == 0x000375, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_UpdateMembarList_IsList2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000378, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_ActionItem_ReturnValue) == 0x000380, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetItemContainerFromSelected_ReturnValue) == 0x000388, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetItemContainerFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x0003D8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CharTypeToBagType_ReturnValue) == 0x0003E0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CharTypeToBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_AsJack_UMGItem_Action_Status) == 0x0003E8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_AsJack_UMGItem_Action_Status' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_bSuccess3) == 0x0003F0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0003F8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, Temp_struct_Variable2) == 0x000408, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgItemUseCharName_JackMessageArgumentData2) == 0x000418, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgItemUseCharName_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgActionName_JackMessageArgumentData4) == 0x000460, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgActionName_JackMessageArgumentData4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0004A8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_MakeArray_Array4) == 0x0004B0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGWidgetFromName_ReturnValue4) == 0x0004C0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGWidgetFromName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_AsWBP_Menu_Jumon_List_000_Modern) == 0x0004C8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_AsWBP_Menu_Jumon_List_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_bSuccess4) == 0x0004D0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x0004D8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgActionName_JackMessageArgumentData5) == 0x0004E0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgActionName_JackMessageArgumentData5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetSerifuWindowController_ReturnValue2) == 0x000528, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetSerifuWindowController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgTargetCharName_JackMessageArgumentData2) == 0x000530, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgTargetCharName_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_WaitMessageEndFromBP_Result4) == 0x000578, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_WaitMessageEndFromBP_Result4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_MakeArray_Array5) == 0x000580, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgItemUseCharName_JackMessageArgumentData3) == 0x000590, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgItemUseCharName_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgTargetCharName2_JackMessageArgumentData2) == 0x0005D8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgTargetCharName2_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetMsgActionName_JackMessageArgumentData6) == 0x000620, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetMsgActionName_JackMessageArgumentData6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CheckAllActionFlow2_OutTextId2) == 0x000668, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CheckAllActionFlow2_OutTextId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_MakeArray_Array6) == 0x000670, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_MakeArray_Array6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_CheckSingleActionFlow2_OutTextId2) == 0x000680, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_CheckSingleActionFlow2_OutTextId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x000688, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000690, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetCasterMP_ReturnValue) == 0x000698, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetCasterMP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetCasterMP_ReturnValue2) == 0x00069C, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetCasterMP_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, Temp_struct_Variable3) == 0x0006A0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0006B0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_UpdateMembarList_IsList3) == 0x0006B1, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_UpdateMembarList_IsList3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x0006B8, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetItemContainerFromSelected_ReturnValue2) == 0x0006C0, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetItemContainerFromSelected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, CallFunc_GetUMGWidgetFromName_ReturnValue5) == 0x000710, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::CallFunc_GetUMGWidgetFromName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern) == 0x000718, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_bSuccess5) == 0x000720, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_AsJack_UMGItem_Action_Status2) == 0x000728, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_AsJack_UMGItem_Action_Status2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern, K2Node_DynamicCast_bSuccess6) == 0x000730, "Member 'WBP_Menu_Dougu_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern::K2Node_DynamicCast_bSuccess6' has a wrong offset!");

// Function WBP_Menu_Dougu_List_003_modern.WBP_Menu_Dougu_List_003_modern_C.CustomEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1) == 0x000018, "Wrong size on WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1, InEventTag) == 0x000000, "Member 'WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1, InObject) == 0x000010, "Member 'WBP_Menu_Dougu_List_003_modern_C_CustomEvent_1::InObject' has a wrong offset!");

// Function WBP_Menu_Dougu_List_003_modern.WBP_Menu_Dougu_List_003_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Dougu_List_003_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Dougu_List_003_modern.WBP_Menu_Dougu_List_003_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Dougu_List_003_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_003_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_003_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Dougu_List_003_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Dougu_List_003_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Dougu_List_003_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_003_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Dougu_List_003_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Dougu_List_003_modern.WBP_Menu_Dougu_List_003_modern_C.GetDataNames
// 0x0150 (0x0150 - 0x0000)
struct WBP_Menu_Dougu_List_003_modern_C_GetDataNames final
{
public:
