#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Jumon_Setumei_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBattleMode;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern) == 0x000040, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, Temp_float_Variable) == 0x000008, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, Temp_float_Variable2) == 0x00000C, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, K2Node_Select_Default) == 0x000010, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000014, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, K2Node_CustomEvent_bBattleMode) == 0x00001C, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::K2Node_CustomEvent_bBattleMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00001D, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, CallFunc_GetPosition_ReturnValue) == 0x000028, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000030, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_Setumei_000_modern::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.SetBattleMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode final
{
public:
	bool                                          bBattleMode_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode) == 0x000001, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode) == 0x000001, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode, bBattleMode_0) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetBattleMode::bBattleMode_0' has a wrong offset!");

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.SetSetumei
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei final
{
public:
	class FString                                 InDescription;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_GetDecMenuText_ReturnValue2;              // 0x0038(0x0018)()
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei) == 0x000050, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei, InDescription) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei::InDescription' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei, Value) == 0x000010, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei::Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei, MaxValue) == 0x000014, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei::MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei, CallFunc_GetDecMenuText_ReturnValue) == 0x000020, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei, CallFunc_GetDecMenuText_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumei::CallFunc_GetDecMenuText_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.SetPresent
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent) == 0x000020, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent, NewParam) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent, CallFunc_GetDecMenuText_ReturnValue) == 0x000008, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetPresent::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.SetValueSingle
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle final
{
public:
	class FString                                 Caption;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InValue;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle) == 0x000030, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle, Caption) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle::Caption' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle, InValue) == 0x000010, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle, CallFunc_GetDecMenuText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetValueSingle::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.SetSetumeiTitleFromTextID
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID final
{
public:
	class FName                                   MenuTextId;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID) == 0x000008, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID, MenuTextId) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetSetumeiTitleFromTextID::MenuTextId' has a wrong offset!");

// Function WBP_Menu_Jumon_Setumei_000_modern.WBP_Menu_Jumon_Setumei_000_modern_C.SetMPSyouhiColor
// 0x0005 (0x0005 - 0x0000)
struct WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor final
{
public:
	bool                                          bIsMPZouka;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor) == 0x000001, "Wrong alignment on WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor");
static_assert(sizeof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor) == 0x000005, "Wrong size on WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor, bIsMPZouka) == 0x000000, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor::bIsMPZouka' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor, Temp_bool_Variable) == 0x000001, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor, Temp_byte_Variable) == 0x000002, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor, Temp_byte_Variable2) == 0x000003, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor, K2Node_Select_Default) == 0x000004, "Member 'WBP_Menu_Jumon_Setumei_000_modern_C_SetMPSyouhiColor::K2Node_Select_Default' has a wrong offset!");

}

