#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_010_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_010_modern.WBP_Menu_Battle_List_010_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_010_modern
// 0x0330 (0x0330 - 0x0000)
struct WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_011_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_011_Modern; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSibariPlayFlag_ReturnValue;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagTargetItemIndex_ReturnValue;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue3;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndexFromRegion_ReturnValue;       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue4;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue12;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue5;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue13;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue6;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindItemFromInBag_ReturnValue;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue14;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBagSelectedItemIndex_ReturnValue;      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue15;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue16;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue17;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue3;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          Temp_byte_Variable2;                               // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          Temp_byte_Variable3;                               // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetUMGEquippedItemFromRegion_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemListInfo                   K2Node_MakeStruct_JackUMGItemListInfo;             // 0x0210(0x0018)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue18;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemInBag_ReturnValue;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable4;                               // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          Temp_byte_Variable5;                               // 0x023F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SortBagItemList_ReturnValue;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_InsertUMGMenuWithSnap_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_006_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_006_Modern; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          Temp_byte_Variable6;                               // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable7;                               // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable8;                               // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue5;     // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Status_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable9;                               // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Setumei_003_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          K2Node_Select_Default;                             // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x02B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue19;            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue2;           // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemGettableCountInBag_ReturnValue;    // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue20;            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndexFromRegion_ReturnValue2;      // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue21;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndexFromRegion_ReturnValue3;      // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRegionTextId_ReturnValue;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern");
static_assert(sizeof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern) == 0x000330, "Wrong size on WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_ActionItem_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000058, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_011_Modern) == 0x000060, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_011_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000070, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_ActionItem_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_ActionItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x000080, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_IsSibariPlayFlag_ReturnValue) == 0x000099, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_IsSibariPlayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000A0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000B0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable) == 0x0000B8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x0000C0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_CharTypeToBagType_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_CharTypeToBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x0000D0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x0000D8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue9) == 0x0000E0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetBagTargetItemIndex_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetBagTargetItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_ActionItem_ReturnValue3) == 0x0000EC, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_ActionItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue10) == 0x0000F0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue11) == 0x0000F8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetItemIndexFromRegion_ReturnValue) == 0x000100, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetItemIndexFromRegion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_ActionItem_ReturnValue4) == 0x000104, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_ActionItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000108, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue12) == 0x000110, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_ActionItem_ReturnValue5) == 0x000118, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_ActionItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CustomEvent_InKeyType) == 0x00011C, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CustomEvent_bIsPressed) == 0x00011D, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x00011E, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00011F, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000120, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue13) == 0x000128, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_ActionItem_ReturnValue6) == 0x000130, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_ActionItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CustomEvent_EventName) == 0x000138, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CustomEvent_InItemBase) == 0x000140, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_FindItemFromInBag_ReturnValue) == 0x000148, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_FindItemFromInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_SwitchName_CmpSuccess) == 0x00014C, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue14) == 0x000150, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetBagSelectedItemIndex_ReturnValue) == 0x00015C, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetBagSelectedItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x000160, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue15) == 0x000168, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x000170, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue16) == 0x000178, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue17) == 0x000180, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetBagSelectedType_ReturnValue3) == 0x000188, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetBagSelectedType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CustomEvent_EventTag) == 0x000190, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000198, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_SwitchName2_CmpSuccess) == 0x000199, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable2) == 0x00019A, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0001A0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CustomEvent_OutItemIndex) == 0x0001B0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CustomEvent_OutItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0001B8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x0001C0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_bSuccess2) == 0x0001C8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable3) == 0x0001C9, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGEquippedItemFromRegion_ReturnValue) == 0x0001D0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGEquippedItemFromRegion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0001D8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_int_Array_Index_Variable) == 0x0001E4, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0001F0, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x000200, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_Array_Length_ReturnValue) == 0x000204, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetValidValue_ReturnValue) == 0x000208, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000209, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_MakeStruct_JackUMGItemListInfo) == 0x000210, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_MakeStruct_JackUMGItemListInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_Array_Add_ReturnValue) == 0x000228, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetAccessorItem_ReturnValue18) == 0x000230, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetAccessorItem_ReturnValue18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_CountItemInBag_ReturnValue) == 0x000238, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_CountItemInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable4) == 0x00023C, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00023D, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x00023E, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable5) == 0x00023F, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000240, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_SortBagItemList_ReturnValue) == 0x000244, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_SortBagItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000248, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000250, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_InsertUMGMenuWithSnap_ReturnValue) == 0x000258, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_InsertUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_006_Modern) == 0x000260, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_006_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_bSuccess3) == 0x000268, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable6) == 0x000269, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable7) == 0x00026A, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, Temp_byte_Variable8) == 0x00026B, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue4) == 0x00026C, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue5) == 0x00026D, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000270, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000278, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern) == 0x000280, "Member 'WBP_Menu_Battle_List_010_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_010_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern' has a wrong offset!");
