#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_101_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_101_modern.WBP_Menu_Dougu_Syousai_101_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern
// 0x0118 (0x0118 - 0x0000)
struct WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_InItemSyousaiRef;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetUMGRarityTextAndColor_OutText;         // 0x0020(0x0018)()
	EJackUMGTextColorSet                          CallFunc_GetUMGRarityTextAndColor_OutColor;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetItemIdFromPictorialBookNo_OutItemId;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0048(0x0048)()
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern) == 0x000118, "Wrong size on WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_CustomEvent_InItemSyousaiRef) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_CustomEvent_InItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_GetUMGRarityTextAndColor_OutText) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_GetUMGRarityTextAndColor_OutText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_GetUMGRarityTextAndColor_OutColor) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_GetUMGRarityTextAndColor_OutColor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_GetItemIdFromPictorialBookNo_OutItemId) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_GetItemIdFromPictorialBookNo_OutItemId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_CustomEvent_InEventTag) == 0x000090, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000098, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_CustomEvent_InObject) == 0x0000A0, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x0000B8, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x0000C8, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_DynamicCast_bSuccess2) == 0x0000D0, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_SwitchName_CmpSuccess) == 0x0000D1, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, Temp_bool_Variable) == 0x0000D2, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, Temp_byte_Variable) == 0x0000D3, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D4, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, Temp_byte_Variable2) == 0x0000D5, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D6, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_BooleanAND_ReturnValue) == 0x0000D7, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_BooleanAND_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, K2Node_Select_Default) == 0x0000D9, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_GetText_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_ReplaceMessageTag_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_ReplaceMessageTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_101_modern.WBP_Menu_Dougu_Syousai_101_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_101_modern.WBP_Menu_Dougu_Syousai_101_modern_C.DispItemFromSyousaiRef
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef final
{
public:
	class UJackUMGItemSyousai*                    InItemSyousaiRef;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong size on WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef, InItemSyousaiRef) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_DispItemFromSyousaiRef::InItemSyousaiRef' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_101_modern.WBP_Menu_Dougu_Syousai_101_modern_C.SetRecipeTitle
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle final
{
public:
	bool                                          IsRecipeTitle_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle) == 0x000001, "Wrong size on WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle, IsRecipeTitle_0) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_101_modern_C_SetRecipeTitle::IsRecipeTitle_0' has a wrong offset!");

}

