#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_020_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_020_modern.WBP_Menu_Battle_List_020_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_020_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleSpeedMode                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleSpeedMode                          CallFunc_GetBattleSpeedMode_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern");
static_assert(sizeof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern) == 0x000090, "Wrong size on WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, Temp_int_Variable) == 0x000008, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, Temp_int_Variable2) == 0x00000C, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, Temp_int_Variable3) == 0x000010, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_CustomEvent_EventName) == 0x000028, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_CustomEvent_InItemBase) == 0x000030, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_SwitchName2_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_SwitchName3_CmpSuccess) == 0x000049, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, CallFunc_GetBattleSpeedMode_ReturnValue) == 0x000070, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::CallFunc_GetBattleSpeedMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_Select_Default) == 0x000080, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, CallFunc_GetValue_ReturnValue) == 0x000084, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Battle_List_020_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_020_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Battle_List_020_modern.WBP_Menu_Battle_List_020_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_020_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_020_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_020_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_020_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Battle_List_020_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_020_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_020_modern.WBP_Menu_Battle_List_020_modern_C.OnItemListControlEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0 final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0");
static_assert(sizeof(WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0) == 0x000010, "Wrong size on WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_020_modern_C_OnItemListControlEvent_Event_0::InItemBase' has a wrong offset!");

}

