#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_MapText_Z01_1F_01_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_MapText_Z01_1F_01_modern.WBP_Menu_MapText_Z01_1F_01_modern_C.ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern
// 0x0170 (0x0170 - 0x0000)
struct WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetRuraList_ReturnValue;                  // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item2;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item3;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveDataInRura*         K2Node_CustomEvent_RuraData;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item4;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue2;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00F4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_WorldMap_RuraPointBase_C*     K2Node_DynamicCast_AsWBP_Menu_World_Map_Rura_Point_Base; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue3;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue3;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue4;             // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue5;             // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue6;             // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue7;             // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue8;             // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue9;             // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue10;            // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue11;            // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern) == 0x000008, "Wrong alignment on WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern");
static_assert(sizeof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern) == 0x000170, "Wrong size on WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x000004, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_bool_Variable) == 0x000005, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_byte_Variable) == 0x000006, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_byte_Variable2) == 0x000007, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_bool_Variable2) == 0x00000C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Array_Index_Variable2) == 0x000014, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_byte_Variable3) == 0x00001C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Loop_Counter_Variable2) == 0x000020, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x000024, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Array_Index_Variable3) == 0x000028, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_byte_Variable4) == 0x00002C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_byte_Variable5) == 0x00002D, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Variable) == 0x000030, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x000034, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000038, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetRuraList_ReturnValue) == 0x000040, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetRuraList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetRuraData_ReturnValue) == 0x000060, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetRuraData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Conv_NameToString_ReturnValue) == 0x000068, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Length_ReturnValue2) == 0x000078, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Loop_Counter_Variable3) == 0x00007C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Get_Item2) == 0x000080, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetObjectName_ReturnValue) == 0x000088, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000099, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Add_IntInt_ReturnValue4) == 0x00009C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000A0, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0000A4, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Array_Index_Variable4) == 0x0000A8, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Get_Item3) == 0x0000B0, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, K2Node_CustomEvent_RuraData) == 0x0000B8, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::K2Node_CustomEvent_RuraData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Get_Item4) == 0x0000C0, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetObjectName_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetObjectName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Conv_NameToString_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x0000F0, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetPosition_ReturnValue) == 0x0000F4, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Not_PreBool_ReturnValue) == 0x0000FC, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, K2Node_DynamicCast_AsWBP_Menu_World_Map_Rura_Point_Base) == 0x000100, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::K2Node_DynamicCast_AsWBP_Menu_World_Map_Rura_Point_Base' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, K2Node_Select_Default) == 0x000109, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Length_ReturnValue4) == 0x00010C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Less_IntInt_ReturnValue3) == 0x000110, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x000118, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetChildAt_ReturnValue) == 0x000120, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetChildrenCount_ReturnValue) == 0x000128, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Array_Add_ReturnValue2) == 0x00012C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x000130, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetObjectName_ReturnValue3) == 0x000138, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetObjectName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000148, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_FindSubstring_ReturnValue) == 0x00014C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000150, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_bool_Variable3) == 0x000151, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, K2Node_Select2_Default) == 0x000152, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue2) == 0x000153, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue3) == 0x000154, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_int_Loop_Counter_Variable4) == 0x000158, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Less_IntInt_ReturnValue4) == 0x00015C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_Add_IntInt_ReturnValue5) == 0x000160, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue4) == 0x000164, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue5) == 0x000165, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue6) == 0x000166, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue7) == 0x000167, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, Temp_byte_Variable6) == 0x000168, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, K2Node_Select3_Default) == 0x000169, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue8) == 0x00016A, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue9) == 0x00016B, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue10) == 0x00016C, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern, CallFunc_GetGameFlagBool_ReturnValue11) == 0x00016D, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern::CallFunc_GetGameFlagBool_ReturnValue11' has a wrong offset!");

// Function WBP_Menu_MapText_Z01_1F_01_modern.WBP_Menu_MapText_Z01_1F_01_modern_C.SetRuraData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData final
{
public:
	class UJackUMGAccessorSaveDataInRura*         RuraData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData) == 0x000008, "Wrong alignment on WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData");
static_assert(sizeof(WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData) == 0x000008, "Wrong size on WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData");
static_assert(offsetof(WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData, RuraData) == 0x000000, "Member 'WBP_Menu_MapText_Z01_1F_01_modern_C_SetRuraData::RuraData' has a wrong offset!");

}

