#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_TitleBack_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_TitleBack_000_modern.WBP_Menu_Sakusen_TitleBack_000_modern_C
// 0x0098 (0x04C8 - 0x0430)
class UWBP_Menu_Sakusen_TitleBack_000_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Img_Icon;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Info;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_LocationName;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      PartsText080_SavePoint;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_090_modern_C*      PartsText090_Kigou;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBPMenuPartsText080_LvNum;                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBPMenuPartsText080_LvText;                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBPMenuPartsText080_PlayerName;                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBPMenuPartsText080_RecordDay;                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBPMenuPartsText080_RecordTime;                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBPMenuPartsText080_RecordTimeText;                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         FadeTime;                                          // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Kakunin_Text;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_TitleBack_000_modern(int32 EntryPoint);
	void Construct();
	void IsOpenTitle();
	void OnSerifuWindowSelectedDelegate(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void BpAction(class FName EventTag);
	void TextSet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_TitleBack_000_modern_C">();
	}
	static class UWBP_Menu_Sakusen_TitleBack_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_TitleBack_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_TitleBack_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_TitleBack_000_modern_C");
static_assert(sizeof(UWBP_Menu_Sakusen_TitleBack_000_modern_C) == 0x0004C8, "Wrong size on UWBP_Menu_Sakusen_TitleBack_000_modern_C");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, Img_Icon) == 0x000438, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, Info) == 0x000440, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::Info' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, Panel) == 0x000448, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, Parts000_LocationName) == 0x000450, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::Parts000_LocationName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, PartsText080_SavePoint) == 0x000458, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::PartsText080_SavePoint' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, PartsText090_Kigou) == 0x000460, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::PartsText090_Kigou' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, RootPanel) == 0x000468, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBP_Menu_Parts_000) == 0x000470, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBPMenuPartsText080_LvNum) == 0x000478, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBPMenuPartsText080_LvNum' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBPMenuPartsText080_LvText) == 0x000480, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBPMenuPartsText080_LvText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBPMenuPartsText080_PlayerName) == 0x000488, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBPMenuPartsText080_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBPMenuPartsText080_RecordDay) == 0x000490, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBPMenuPartsText080_RecordDay' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBPMenuPartsText080_RecordTime) == 0x000498, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBPMenuPartsText080_RecordTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WBPMenuPartsText080_RecordTimeText) == 0x0004A0, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WBPMenuPartsText080_RecordTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WindowFrame) == 0x0004A8, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, WindowLine) == 0x0004B0, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::WindowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, FadeTime) == 0x0004B8, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::FadeTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_TitleBack_000_modern_C, Kakunin_Text) == 0x0004C0, "Member 'UWBP_Menu_Sakusen_TitleBack_000_modern_C::Kakunin_Text' has a wrong offset!");

}

