#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern
// 0x0188 (0x0188 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue2;       // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedMainMenu_OpenedMainMenu;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackRenkeiSettei                             CallFunc_GetRenkeiSettei_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	EJackRenkeiSettei                             CallFunc_GetRenkeiSettei_ReturnValue2;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x0130(0x0050)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern) == 0x000188, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_EventName) == 0x000008, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_InItemBase) == 0x000010, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x000019, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetBattleManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_IsInBattle_ReturnValue) == 0x000038, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000039, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchName3_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, Temp_struct_Variable) == 0x000058, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000068, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_InKeyType) == 0x000088, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_bIsPressed) == 0x000089, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00008A, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_NotEqual_ObjectObject_ReturnValue2) == 0x00008B, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_NotEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_Sender) == 0x000090, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_CurrentTextID) == 0x000098, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x0000A0, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000A4, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_IsOpenedMainMenu_OpenedMainMenu) == 0x0000B8, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_IsOpenedMainMenu_OpenedMainMenu' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetRenkeiSettei_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetRenkeiSettei_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x0000D4, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0000D8, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E8, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetRenkeiSettei_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetRenkeiSettei_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000100, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_SwitchEnum3_CmpSuccess) == 0x000108, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000110, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000120, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetItemContainerFromSelected_ReturnValue) == 0x000130, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetItemContainerFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x000180, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern, CallFunc_GetValidValue_ReturnValue) == 0x000181, "Member 'WBP_Menu_Sakusen_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.CustomEvent_0_Copy
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy) == 0x000018, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0_Copy::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Sakusen_List_002_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_List_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.AdjustPanel
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel final
{
public:
	TArray<class UWBP_Menu_Parts_018_modern_C*>   Parts_018;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleCharacters_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSakusenMemberList_ReturnValue;         // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel) == 0x000038, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel, Parts_018) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel::Parts_018' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel, CallFunc_GetAccessorMembers_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel, CallFunc_IsMultipleCharacters_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel::CallFunc_IsMultipleCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel, CallFunc_GetSakusenMemberList_ReturnValue) == 0x000028, "Member 'WBP_Menu_Sakusen_List_002_modern_C_AdjustPanel::CallFunc_GetSakusenMemberList_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.SetVisibilityImage
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_018_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_018_Modern;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage) == 0x000030, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, K2Node_DynamicCast_AsWBP_Menu_Parts_018_Modern) == 0x000020, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::K2Node_DynamicCast_AsWBP_Menu_Parts_018_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilityImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.SnapRenkeiModeWidget
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget final
{
public:
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLearnedRenkei_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Sakusen_Renkei_Settei_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Sakusen_Renkei_Settei_000_Modern; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Sakusen_Renkei_Settei_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Sakusen_Renkei_Settei_000_Modern2; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGMenuId                                CallFunc_GetOpenMenuId_ReturnValue;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget) == 0x000068, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_GetAccessorMembers_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_IsLearnedRenkei_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_IsLearnedRenkei_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, K2Node_DynamicCast_AsWBP_Menu_Sakusen_Renkei_Settei_000_Modern) == 0x000018, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::K2Node_DynamicCast_AsWBP_Menu_Sakusen_Renkei_Settei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_BreakVector2D_X) == 0x000024, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_BreakVector2D_X2) == 0x00002C, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_BreakVector2D_Y2) == 0x000030, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000048, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, K2Node_DynamicCast_AsWBP_Menu_Sakusen_Renkei_Settei_000_Modern2) == 0x000058, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::K2Node_DynamicCast_AsWBP_Menu_Sakusen_Renkei_Settei_000_Modern2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_GetOpenMenuId_ReturnValue) == 0x000061, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_GetOpenMenuId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000062, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SnapRenkeiModeWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.SetVisibilitySakusenWindow
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenedMainMenu_OpenedMainMenu;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow) == 0x000003, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow, InVisibility) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow, CallFunc_IsOpenedMainMenu_OpenedMainMenu) == 0x000002, "Member 'WBP_Menu_Sakusen_List_002_modern_C_SetVisibilitySakusenWindow::CallFunc_IsOpenedMainMenu_OpenedMainMenu' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C.IsOpenedMainMenu
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu final
{
public:
	bool                                          OpenedMainMenu;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGMenuId                                CallFunc_GetOpenMenuId_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu");
static_assert(sizeof(WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu) == 0x000018, "Wrong size on WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu, OpenedMainMenu) == 0x000000, "Member 'WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu::OpenedMainMenu' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_List_002_modern_C_IsOpenedMainMenu::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
