#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Soubi_Item_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern
// 0x0168 (0x0168 - 0x0000)
struct WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBackgroundColor                       Temp_byte_Variable3;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable4;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable5;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable6;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable7;                               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGSoubiData                      K2Node_CustomEvent_Data;                           // 0x0048(0x0070)()
	EJackUMGBackgroundColor                       K2Node_CustomEvent_BgType;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable8;                               // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBackgroundColor                       Temp_byte_Variable9;                               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable10;                              // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable11;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetNoEquipmentIcon_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select2_Default;                            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select3_Default;                            // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                K2Node_CustomEvent_InTextureAsset;                 // 0x00E8(0x0018)(HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                CallFunc_GetItemBookIconAssetPtr_ReturnValue;      // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_SetLoaddedTextureFromId_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select4_Default;                            // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemOsyareIconTexture_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemOsyareType                        CallFunc_GetItemOsyareTypeFromItemId_ReturnValue;  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern) == 0x000168, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable2) == 0x000018, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable3) == 0x000019, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable4) == 0x00001A, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable5) == 0x00001B, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable6) == 0x00001C, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable7) == 0x00001D, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000030, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_EventTag) == 0x000038, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_Data) == 0x000048, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_BgType) == 0x0000B8, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_BgType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_Select_Default) == 0x0000B9, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000BA, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable8) == 0x0000BB, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable9) == 0x0000BC, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable10) == 0x0000BD, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_byte_Variable11) == 0x0000D0, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetNoEquipmentIcon_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetNoEquipmentIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_bool_Variable) == 0x0000E0, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_Select2_Default) == 0x0000E1, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_Select3_Default) == 0x0000E2, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_InTextureAsset) == 0x0000E8, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_InTextureAsset' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000100, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_InResultCode) == 0x000108, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_InLoaddedObject) == 0x000110, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_CustomEvent_InLoadInfo) == 0x000118, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x000120, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetItemBookIconAssetPtr_ReturnValue) == 0x000128, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetItemBookIconAssetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_SetLoaddedTextureFromId_ReturnValue) == 0x000140, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_SetLoaddedTextureFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, Temp_bool_Variable2) == 0x000141, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, K2Node_Select4_Default) == 0x000142, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000148, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetItemOsyareIconTexture_ReturnValue) == 0x000150, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetItemOsyareIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000158, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern, CallFunc_GetItemOsyareTypeFromItemId_ReturnValue) == 0x000160, "Member 'WBP_Menu_Soubi_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Item_000_modern::CallFunc_GetItemOsyareTypeFromItemId_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.LoadTextureComplete
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete) == 0x000018, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete, InResultCode) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Soubi_Item_000_modern_C_LoadTextureComplete::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.LoadIconTexture
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture final
{
public:
	TSoftObjectPtr<class UTexture>                InTextureAsset;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture) == 0x000018, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture, InTextureAsset) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_LoadIconTexture::InTextureAsset' has a wrong offset!");

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.SetSoubiData
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData final
{
public:
	struct FJackUMGSoubiData                      Data;                                              // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	EJackUMGBackgroundColor                       BgType;                                            // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData) == 0x000078, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData, Data) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData::Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData, BgType) == 0x000070, "Member 'WBP_Menu_Soubi_Item_000_modern_C_SetSoubiData::BgType' has a wrong offset!");

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.SetCharacterSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing final
{
public:
	float                                         InCharacterSpacing;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing) == 0x000004, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing) == 0x000004, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing, InCharacterSpacing) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_SetCharacterSpacing::InCharacterSpacing' has a wrong offset!");

// Function WBP_Menu_Soubi_Item_000_modern.WBP_Menu_Soubi_Item_000_modern_C.CancelLoadTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture");
static_assert(sizeof(WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture) == 0x000008, "Wrong size on WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture");
static_assert(offsetof(WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Soubi_Item_000_modern_C_CancelLoadTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

}

