#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Button_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C
// 0x00E8 (0x0458 - 0x0370)
class UWBP_Menu_Common_Button_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ButtonImagePanel_L1;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonImagePanel_R1;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Caption_1;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Caption_2;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Caption_3;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Caption_5;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Caption5TextPanel;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper1ImagePanel;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper2ImagePanel;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper3ImagePanel;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper5ImagePanel;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_C_1;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_C_2;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Caption5Text;                                      // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      Caption1Position;                                  // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector2D>                      Caption2Position;                                  // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector2D>                      Caption3Position;                                  // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector2D>                      Caption5Position;                                  // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bPlayAnimPushL1;                                   // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayAnimPushR1;                                   // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimPushL1Timer;                                   // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimPushR1Timer;                                   // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ModernTextureRef;                                  // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Common_Button_000_modern(int32 EntryPoint);
	void AnimReset();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetButtonAndCaption1(EJackKeys InKeyType, class FName InTxetId, bool IsTransparentBG);
	void SetButtonAndCaption2(EJackKeys InKeyType1, class FName InTxetId1, EJackKeys InKeyType2, class FName InTxetId2, bool IsTransparentBG);
	void SetButtonAndCaption3(EJackKeys InKeyType1, class FName InTxetId1, EJackKeys InKeyType2, class FName InTxetId2, bool IsTransparentBG);
	void PushAnimButton11();
	void PushAnimButton21();
	void PushAnimButton22();
	void SetButtonAndCaption5(EJackKeys InKeyType1, class FName InTxetId1, EJackKeys InKeyType2, class FName InTxetId2, class FName InTxetId3, bool IsTransparentBG);
	void PushAnimButton51();
	void PushAnimButton52();
	void PushAnimButton5Lb();
	void PushAnimButton5Rb();
	void SetTextFontColorCaption1(EJackUMGTextColorSet InColorType);
	void PushAnimButton31();
	void PushAnimButton32();
	void SetVisibleCaption3(bool bIsVisibleLeft, bool bIsVisibleRight);
	void SetVisibleCaption5(ESlateVisibility Visibillity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Common_Button_000_modern_C">();
	}
	static class UWBP_Menu_Common_Button_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Common_Button_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Common_Button_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Common_Button_000_modern_C");
static_assert(sizeof(UWBP_Menu_Common_Button_000_modern_C) == 0x000458, "Wrong size on UWBP_Menu_Common_Button_000_modern_C");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Common_Button_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, ButtonImagePanel_L1) == 0x000378, "Member 'UWBP_Menu_Common_Button_000_modern_C::ButtonImagePanel_L1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, ButtonImagePanel_R1) == 0x000380, "Member 'UWBP_Menu_Common_Button_000_modern_C::ButtonImagePanel_R1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption_1) == 0x000388, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption_2) == 0x000390, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption_3) == 0x000398, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption_5) == 0x0003A0, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption5TextPanel) == 0x0003A8, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption5TextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, InvalidationBox_0) == 0x0003B0, "Member 'UWBP_Menu_Common_Button_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Paper1ImagePanel) == 0x0003B8, "Member 'UWBP_Menu_Common_Button_000_modern_C::Paper1ImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Paper2ImagePanel) == 0x0003C0, "Member 'UWBP_Menu_Common_Button_000_modern_C::Paper2ImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Paper3ImagePanel) == 0x0003C8, "Member 'UWBP_Menu_Common_Button_000_modern_C::Paper3ImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Paper5ImagePanel) == 0x0003D0, "Member 'UWBP_Menu_Common_Button_000_modern_C::Paper5ImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, WBP_Menu_Parts_008_C_1) == 0x0003D8, "Member 'UWBP_Menu_Common_Button_000_modern_C::WBP_Menu_Parts_008_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, WBP_Menu_Parts_008_C_2) == 0x0003E0, "Member 'UWBP_Menu_Common_Button_000_modern_C::WBP_Menu_Parts_008_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption5Text) == 0x0003E8, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption5Text' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption1Position) == 0x000400, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption1Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption2Position) == 0x000410, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption2Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption3Position) == 0x000420, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption3Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, Caption5Position) == 0x000430, "Member 'UWBP_Menu_Common_Button_000_modern_C::Caption5Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, bPlayAnimPushL1) == 0x000440, "Member 'UWBP_Menu_Common_Button_000_modern_C::bPlayAnimPushL1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, bPlayAnimPushR1) == 0x000441, "Member 'UWBP_Menu_Common_Button_000_modern_C::bPlayAnimPushR1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, AnimPushL1Timer) == 0x000444, "Member 'UWBP_Menu_Common_Button_000_modern_C::AnimPushL1Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, AnimPushR1Timer) == 0x000448, "Member 'UWBP_Menu_Common_Button_000_modern_C::AnimPushR1Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Button_000_modern_C, ModernTextureRef) == 0x000450, "Member 'UWBP_Menu_Common_Button_000_modern_C::ModernTextureRef' has a wrong offset!");

}

