#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_000_modern
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_GetControlCharacter_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue2;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNigeruEnable_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x00E8(0x0050)()
	bool                                          CallFunc_IsActivePlayerAI_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue2;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSakusenMemberList_ReturnValue;         // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsEnableIrekae_ReturnValue;               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSibariPlayFlag_ReturnValue;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue4;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSyuurenjou_ReturnValue;                 // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue5;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountMember_ReturnValue;                  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array;                            // 0x0288(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array2;                           // 0x0298(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern) == 0x0002B8, "Wrong size on WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_struct_Variable2) == 0x000018, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_struct_Variable3) == 0x000028, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_struct_Variable4) == 0x000038, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x000050, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000058, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000060, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CustomEvent_InKeyType) == 0x000070, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CustomEvent_bIsPressed) == 0x000071, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000072, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetBattleManager_ReturnValue) == 0x000078, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetControlCharacter_ReturnValue) == 0x000080, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetControlCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_IsInBattle_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000089, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000098, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_OpenMenu_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetBattleManager_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetBattleManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_IsNigeruEnable_ReturnValue) == 0x0000DC, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_IsNigeruEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetItemContainer_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetItemContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_IsActivePlayerAI_ReturnValue) == 0x000138, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_IsActivePlayerAI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000139, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000140, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_OpenMenu_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_OpenMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x000150, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000158, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_struct_Variable5) == 0x000160, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, Temp_int_Loop_Counter_Variable) == 0x000170, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000178, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CustomEvent_EventTag) == 0x000180, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000188, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000190, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CustomEvent_EventName) == 0x000198, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CustomEvent_InItemBase) == 0x0001A0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x0001A8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x0001A9, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0001B0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x0001B8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetSakusenMemberList_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetSakusenMemberList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_IsEnableIrekae_ReturnValue) == 0x0001D0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_IsEnableIrekae_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0001D8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0001E8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0001F8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000200, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000208, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x000210, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x000214, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000218, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_IsSibariPlayFlag_ReturnValue) == 0x000220, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_IsSibariPlayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue4) == 0x000228, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_IsSyuurenjou_ReturnValue) == 0x000230, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_IsSyuurenjou_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000238, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000240, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue5) == 0x000250, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000258, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_CountMember_ReturnValue) == 0x000260, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_CountMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000268, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x000270, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000278, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000280, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_MakeArray_Array) == 0x000288, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, K2Node_MakeArray_Array2) == 0x000298, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x0002A8, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x0002B0, "Member 'WBP_Menu_Battle_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_000_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Battle_List_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_000_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.CreateMenu
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_CreateMenu final
{
public:
	TArray<class UJackUMGItemData*>               MenuItemDataList;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackCharacter>                        CallFunc_GetFriendJoinedAfterList_ReturnValue;     // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_CreateMenu) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_CreateMenu");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_CreateMenu) == 0x000030, "Wrong size on WBP_Menu_Battle_List_000_modern_C_CreateMenu");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CreateMenu, MenuItemDataList) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_CreateMenu::MenuItemDataList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CreateMenu, CallFunc_GetAccessorMembers_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_000_modern_C_CreateMenu::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CreateMenu, CallFunc_GetFriendJoinedAfterList_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_000_modern_C_CreateMenu::CallFunc_GetFriendJoinedAfterList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CreateMenu, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_000_modern_C_CreateMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CreateMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Battle_List_000_modern_C_CreateMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.AddMenuCommand
// 0x0058 (0x0058 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_AddMenuCommand final
{
public:
	TArray<class UJackUMGItemData*>               TargetArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FName                                   InItemId;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       NewLocalVar_1;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_CreateItemData_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0040(0x0018)()
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_AddMenuCommand");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand) == 0x000058, "Wrong size on WBP_Menu_Battle_List_000_modern_C_AddMenuCommand");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, TargetArray) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::TargetArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, InItemId) == 0x000010, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::InItemId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, NewLocalVar_1) == 0x000018, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, CallFunc_CreateItemData_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::CallFunc_CreateItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, CallFunc_MakeLiteralName_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_AddMenuCommand, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_List_000_modern_C_AddMenuCommand::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.SetNigeruTextColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           PartsNigeru;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNigeruEnable_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor) == 0x000030, "Wrong size on WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor, PartsNigeru) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor::PartsNigeru' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor, CallFunc_GetItemFromTextId_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor::CallFunc_GetItemFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor, K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern) == 0x000010, "Member 'WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor::K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor, CallFunc_GetBattleManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor, CallFunc_IsNigeruEnable_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_000_modern_C_SetNigeruTextColor::CallFunc_IsNigeruEnable_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.SetVisibilityWindow
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow) == 0x000001, "Wrong size on WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow, IsVisible_0) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_SetVisibilityWindow::IsVisible_0' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.CheckJoutaiIjou
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TempResult;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperationalWithIgnoreOddEffectIDs_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou");
static_assert(sizeof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou) == 0x000030, "Wrong size on WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, Result) == 0x000000, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, TempResult) == 0x000001, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::TempResult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, CallFunc_GetAccessorBattle_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou, CallFunc_IsOperationalWithIgnoreOddEffectIDs_ReturnValue) == 0x000029, "Member 'WBP_Menu_Battle_List_000_modern_C_CheckJoutaiIjou::CallFunc_IsOperationalWithIgnoreOddEffectIDs_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_000_modern.WBP_Menu_Battle_List_000_modern_C.SetIrekaeTextColor
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Battle_List_000_modern_C_SetIrekaeTextColor final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           PartsIrekae;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSyuurenjou_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
