#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_ItemList_Window_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern
// 0x0160 (0x0160 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetZukanItemList_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetZukanItemList_ReturnValue2;            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackUMGItemData*>               CallFunc_GetZukanItemList_ReturnValue3;            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_MakeReturnSyousaiItemsList_ReturnValue;   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue4;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ChangeIndexListToSyousai_ReturnValue;     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate4;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue5;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue6;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemListInfo                   K2Node_MakeStruct_JackUMGItemListInfo;             // 0x0140(0x0018)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern) == 0x000160, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CustomEvent_InKeyType) == 0x000028, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CustomEvent_bIsPressed) == 0x000029, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000030, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetZukanItemList_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetZukanItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000048, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000058, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x000068, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CustomEvent_OutItemIndex) == 0x000074, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CustomEvent_OutItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000078, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000080, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000090, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue3) == 0x000098, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetZukanItemList_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetZukanItemList_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetZukanItemList_ReturnValue3) == 0x0000B0, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetZukanItemList_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_MakeReturnSyousaiItemsList_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_MakeReturnSyousaiItemsList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000C4, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue4) == 0x0000C8, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_ChangeIndexListToSyousai_ReturnValue) == 0x0000D4, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_ChangeIndexListToSyousai_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0000D8, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000E8, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Divide_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Array_Length_ReturnValue4) == 0x0000F0, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000100, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue5) == 0x000108, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue6) == 0x000110, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CustomEvent_EventTag) == 0x000118, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CustomEvent_EventName) == 0x000120, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_CustomEvent_InItemBase) == 0x000128, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000130, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x000131, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_SwitchName3_CmpSuccess) == 0x000132, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, Temp_int_Array_Index_Variable) == 0x000134, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Array_Get_Item) == 0x000138, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, K2Node_MakeStruct_JackUMGItemListInfo) == 0x000140, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::K2Node_MakeStruct_JackUMGItemListInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern, CallFunc_Array_Add_ReturnValue) == 0x000158, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_002_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.CustomEvent_1
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1 final
{
public:
	int32                                         OutItemIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1) == 0x000004, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1, OutItemIndex) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_CustomEvent_1::OutItemIndex' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.WidgetKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_WidgetKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.InitZukanList
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSenreki_ItemCategory                     CallFunc_GetSelectedItemCategory_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetZukanItemList_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Classification                      CallFunc_GetSelectedClassification_ReturnValue;    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList) == 0x000030, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList, CallFunc_GetSelectedItemCategory_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList::CallFunc_GetSelectedItemCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList, CallFunc_GetZukanItemList_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList::CallFunc_GetZukanItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList, CallFunc_GetSelectedClassification_ReturnValue) == 0x000029, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_InitZukanList::CallFunc_GetSelectedClassification_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.SetSortButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton final
{
public:
	bool                                          IsID;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Classification                      CallFunc_GetSelectedClassification_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackSenreki_ItemCategory                     CallFunc_GetSelectedItemCategory_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton) == 0x000018, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, IsID) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::IsID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, CallFunc_GetSelectedClassification_ReturnValue) == 0x000011, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::CallFunc_GetSelectedClassification_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000013, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, CallFunc_GetSelectedItemCategory_ReturnValue) == 0x000014, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::CallFunc_GetSelectedItemCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton, K2Node_SwitchEnum2_CmpSuccess) == 0x000015, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_SetSortButton::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_002_modern.WBP_Menu_Senreki_ItemList_Window_002_modern_C.ChangeSort
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort final
{
public:
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_GetSenrekiSortMode_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSenrekiSortMode                       CallFunc_SetSenrekiSortMode_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSenrekiSortMode                       CallFunc_SetSenrekiSortMode_ReturnValue2;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort) == 0x000010, "Wrong size on WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort, CallFunc_GetSenrekiSortMode_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_002_modern_C_ChangeSort::CallFunc_GetSenrekiSortMode_ReturnValue' has a wrong offset!");
