#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_List_001_modern.WBP_Menu_WorldMap_List_001_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern
// 0x0130 (0x0130 - 0x0000)
struct WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_064_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_064_Modern;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMapVolumeID_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_PoppedWidget;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_CurrentActiveWidget;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetParentMapVolumeID_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGMapSymbolInfoBase*>      CallFunc_GetMapSymbolInfoList_ReturnValue;         // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Tag_NPCID_ReturnValue;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMapSymbolInfoBase*              CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentFloorSymbol_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackNameTagDict                       CallFunc_FindTag_RefTag;                           // 0x00D0(0x0010)(NoDestructor)
	bool                                          CallFunc_FindTag_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUniqueNo_ReturnValue;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetQuestMemoDataList_ItemDataList;        // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern");
static_assert(sizeof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern) == 0x000130, "Wrong size on WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_CustomEvent_EventTag) == 0x000020, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_CustomEvent_EventName) == 0x000030, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_CustomEvent_InItemBase) == 0x000038, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Parts_064_Modern) == 0x000048, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Parts_064_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetMapVolumeID_ReturnValue) == 0x000058, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetMapVolumeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000060, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000068, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000070, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_PopMenu_PoppedWidget) == 0x000080, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_PopMenu_PoppedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_PopMenu_CurrentActiveWidget) == 0x000088, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_PopMenu_CurrentActiveWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetParentMapVolumeID_ReturnValue) == 0x000090, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetParentMapVolumeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetMapSymbolInfoList_ReturnValue) == 0x000098, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetMapSymbolInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000AC, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, Temp_int_Array_Index_Variable) == 0x0000B4, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_Tag_NPCID_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_Tag_NPCID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_IsCurrentFloorSymbol_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_IsCurrentFloorSymbol_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_IsVisible_ReturnValue) == 0x0000C9, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_FindTag_RefTag) == 0x0000D0, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_FindTag_RefTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_FindTag_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_FindTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetUniqueNo_ReturnValue) == 0x0000E4, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetUniqueNo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000100, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x000108, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, CallFunc_GetQuestMemoDataList_ItemDataList) == 0x000110, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::CallFunc_GetQuestMemoDataList_ItemDataList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000120, "Member 'WBP_Menu_WorldMap_List_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_001_modern.WBP_Menu_WorldMap_List_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_WorldMap_List_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_001_modern.WBP_Menu_WorldMap_List_001_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_List_001_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_001_modern.WBP_Menu_WorldMap_List_001_modern_C.SetParamSetumei
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRuraEmpty;                                       // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveDataInRura*         CallFunc_GetRuraData_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei");
static_assert(sizeof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei) == 0x000028, "Wrong size on WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, ItemIndex) == 0x000000, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, IsEmpty) == 0x000004, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, IsRuraEmpty) == 0x000005, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::IsRuraEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei, CallFunc_GetRuraData_ReturnValue) == 0x000020, "Member 'WBP_Menu_WorldMap_List_001_modern_C_SetParamSetumei::CallFunc_GetRuraData_ReturnValue' has a wrong offset!");

}

