#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_Command_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C
// 0x0068 (0x0498 - 0x0430)
class UWBP_Menu_Battle_Command_003_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_0;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_463;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_464;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern_C_0;                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEnableIrekae;                                    // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               ItemDataList0;                                     // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void SetVisibilityWindow(bool IsVisible_0);
	void SetIrekaeTextColor();
	void SetNigeruTextColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_Command_003_modern_C">();
	}
	static class UWBP_Menu_Battle_Command_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_Command_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_Command_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_Command_003_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_Command_003_modern_C) == 0x000498, "Wrong size on UWBP_Menu_Battle_Command_003_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Battle_Command_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Battle_Command_003_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_Battle_Command_003_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, RootPanel) == 0x000448, "Member 'UWBP_Menu_Battle_Command_003_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, WBP_Menu_Parts_000) == 0x000450, "Member 'UWBP_Menu_Battle_Command_003_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, WBP_Menu_Parts_000_0) == 0x000458, "Member 'UWBP_Menu_Battle_Command_003_modern_C::WBP_Menu_Parts_000_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, WBP_Menu_Parts_000_C_463) == 0x000460, "Member 'UWBP_Menu_Battle_Command_003_modern_C::WBP_Menu_Parts_000_C_463' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, WBP_Menu_Parts_000_C_464) == 0x000468, "Member 'UWBP_Menu_Battle_Command_003_modern_C::WBP_Menu_Parts_000_C_464' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, WBP_Menu_Parts_000_modern_C_0) == 0x000470, "Member 'UWBP_Menu_Battle_Command_003_modern_C::WBP_Menu_Parts_000_modern_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, WindowFrame) == 0x000478, "Member 'UWBP_Menu_Battle_Command_003_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, IsEnableIrekae) == 0x000480, "Member 'UWBP_Menu_Battle_Command_003_modern_C::IsEnableIrekae' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_003_modern_C, ItemDataList0) == 0x000488, "Member 'UWBP_Menu_Battle_Command_003_modern_C::ItemDataList0' has a wrong offset!");

}

