#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_Button_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_Button_002_modern.WBP_Menu_WorldMap_Button_002_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern");
static_assert(sizeof(WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern) == 0x000004, "Wrong size on WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern");
static_assert(offsetof(WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_002_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_Button_002_modern::EntryPoint' has a wrong offset!");

// Function WBP_Menu_WorldMap_Button_002_modern.WBP_Menu_WorldMap_Button_002_modern_C.SetButtonAndCaption
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption");
static_assert(sizeof(WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption) == 0x000010, "Wrong size on WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption");
static_assert(offsetof(WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption, InKeyType) == 0x000000, "Member 'WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption, InTxetId) == 0x000008, "Member 'WBP_Menu_WorldMap_Button_002_modern_C_SetButtonAndCaption::InTxetId' has a wrong offset!");

}

