#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Akarusa_Setting_001

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Akarusa_Setting_001.WBP_Menu_Namae_Akarusa_Setting_001_C.ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001) == 0x000004, "Wrong alignment on WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001");
static_assert(sizeof(WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001) == 0x000004, "Wrong size on WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001");
static_assert(offsetof(WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Akarusa_Setting_001_C_ExecuteUbergraph_WBP_Menu_Namae_Akarusa_Setting_001::EntryPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Akarusa_Setting_001.WBP_Menu_Namae_Akarusa_Setting_001_C.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible final
{
public:
	bool                                          InVisivle;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible");
static_assert(sizeof(WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible) == 0x000001, "Wrong size on WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible");
static_assert(offsetof(WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible, InVisivle) == 0x000000, "Member 'WBP_Menu_Namae_Akarusa_Setting_001_C_SetVisible::InVisivle' has a wrong offset!");

}

