#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Photo_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.ExecuteUbergraph_WBP_Menu_Photo_000_modern
// 0x0170 (0x0170 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTextId_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetMemberListInPhotoModeMenu_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsCharacterHiddenFromCharacterType_NewParam; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterHiddenFromCharacterType_NewParam2; // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackPhotoModeEvent EventType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterHiddenFromItemData_NewParam;   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackPhotoModeEvent                           K2Node_CustomEvent_EventType;                      // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue2;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue2;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue3;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue4;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue3;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue4;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBokehEnable_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue5;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue5;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_062_modern_C*>   K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Parts_062_modern_C*           CallFunc_Array_Get_Item2;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_Menu_Parts_062_modern_C*           CallFunc_Array_Get_Item3;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern) == 0x000170, "Wrong size on WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CustomEvent_EventName) == 0x000008, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CustomEvent_InItemBase) == 0x000010, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetTextId_ReturnValue) == 0x000018, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000021, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x000022, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetValidValue_ReturnValue) == 0x000023, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000028, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetMemberListInPhotoModeMenu_ReturnValue) == 0x000030, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetMemberListInPhotoModeMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_IsCharacterHiddenFromCharacterType_NewParam) == 0x000040, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_IsCharacterHiddenFromCharacterType_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_IsCharacterHiddenFromCharacterType_NewParam2) == 0x000042, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_IsCharacterHiddenFromCharacterType_NewParam2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetJackGameMode_ReturnValue) == 0x000048, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Not_PreBool_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CustomEvent_EventTag) == 0x000068, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000074, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000078, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetSoundSet_ReturnValue) == 0x000080, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, Temp_int_Array_Index_Variable) == 0x000098, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A0, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_IsCharacterHiddenFromItemData_NewParam) == 0x0000BC, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_IsCharacterHiddenFromItemData_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000BD, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Not_PreBool_ReturnValue3) == 0x0000BE, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CustomEvent_InKeyType) == 0x0000BF, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CustomEvent_bIsPressed) == 0x0000C0, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0000C1, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CustomEvent_EventType) == 0x0000C2, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetJackGameMode_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetJackGameMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0000D0, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E0, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetJackGameMode_ReturnValue3) == 0x0000F8, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetJackGameMode_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetJackGameMode_ReturnValue4) == 0x000100, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetJackGameMode_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue3) == 0x000108, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue4) == 0x000110, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetBokehEnable_ReturnValue) == 0x000118, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetBokehEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetJackGameMode_ReturnValue5) == 0x000120, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetJackGameMode_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue5) == 0x000128, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Array_Get_Item2) == 0x000140, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000148, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_Array_Get_Item3) == 0x000158, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000160, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, CallFunc_GetValue_ReturnValue) == 0x000164, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000168, "Member 'WBP_Menu_Photo_000_modern_C_ExecuteUbergraph_WBP_Menu_Photo_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.PhotoModeBPDelegate_Event_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0 final
{
public:
	EJackPhotoModeEvent                           EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0) == 0x000001, "Wrong alignment on WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0) == 0x000001, "Wrong size on WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0, EventType) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_PhotoModeBPDelegate_Event_0::EventType' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.OnKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_OnKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_OnKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Photo_000_modern_C_OnKeyEvent");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_OnKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Photo_000_modern_C_OnKeyEvent");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_OnKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_OnKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_OnKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Photo_000_modern_C_OnKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Photo_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Photo_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Photo_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.IsCharacterHiddenFromItemData
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData final
{
public:
	class UJackUMGItemData*                       NewParam1;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGeneralValue_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHidden_ReturnValue;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData) == 0x000008, "Wrong alignment on WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData) == 0x000030, "Wrong size on WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, NewParam1) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::NewParam1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, NewParam) == 0x000008, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, CallFunc_GetJackGameMode_ReturnValue) == 0x000010, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, CallFunc_GetGeneralValue_ReturnValue) == 0x000018, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::CallFunc_GetGeneralValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, CallFunc_GetPhotoModeManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::CallFunc_GetPhotoModeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, CallFunc_Conv_IntToByte_ReturnValue) == 0x000028, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, CallFunc_GetValidValue_ReturnValue) == 0x000029, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData, CallFunc_IsHidden_ReturnValue) == 0x00002A, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromItemData::CallFunc_IsHidden_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.IsCharacterHiddenFromCharacterType
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType final
{
public:
	EJackCharacter                                NewParam1;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHidden_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType) == 0x000008, "Wrong alignment on WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType) == 0x000020, "Wrong size on WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType, NewParam1) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType::NewParam1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType, NewParam) == 0x000001, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType, CallFunc_GetJackGameMode_ReturnValue) == 0x000008, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType, CallFunc_GetPhotoModeManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType::CallFunc_GetPhotoModeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType, CallFunc_IsHidden_ReturnValue) == 0x000018, "Member 'WBP_Menu_Photo_000_modern_C_IsCharacterHiddenFromCharacterType::CallFunc_IsHidden_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Photo_000_modern.WBP_Menu_Photo_000_modern_C.HideHUD
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_Photo_000_modern_C_HideHUD final
{
public:
	bool                                          bIsHide;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              IsHideHud;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Photo_000_modern_C_HideHUD) == 0x000001, "Wrong alignment on WBP_Menu_Photo_000_modern_C_HideHUD");
static_assert(sizeof(WBP_Menu_Photo_000_modern_C_HideHUD) == 0x000003, "Wrong size on WBP_Menu_Photo_000_modern_C_HideHUD");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_HideHUD, bIsHide) == 0x000000, "Member 'WBP_Menu_Photo_000_modern_C_HideHUD::bIsHide' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_HideHUD, IsHideHud) == 0x000001, "Member 'WBP_Menu_Photo_000_modern_C_HideHUD::IsHideHud' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Photo_000_modern_C_HideHUD, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Menu_Photo_000_modern_C_HideHUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

