#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Command_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_Menu_ActionFlowResult_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_Command_000_modern.WBP_Menu_Dougu_Command_000_modern_C
// 0x0318 (0x0748 - 0x0430)
class UWBP_Menu_Dougu_Command_000_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SmalleFramePanel;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmalleWindowPanel;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Soubi_000_modern_C*     WBP_Menu_Dougu_Soubi_000;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_24;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1063;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1064;                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1065;                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1066;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1317;                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WideFramePanel;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WideWindowPanel;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               MsgAliveName;                                      // 0x04A8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgCharName;                                       // 0x04F0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgItemName;                                       // 0x0538(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgItemCount;                                      // 0x0580(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgReleaseItemName;                                // 0x05C8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Menu_Common_Quantity_001_modern_C* QuantityWindowRef;                                 // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectedWindowPanel;                               // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectedListPanel;                                 // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionItemId;                                      // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                SelectedCharType;                                  // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSoubiList*                      SoubiListRef;                                      // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HandItemId;                                        // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   UIActionInfoRef;                                   // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          EquipmentRegion;                                   // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   EquipmentItemRef;                                  // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   EquippedAccessory1Ref;                             // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   EquippedAccessory2Ref;                             // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedIndexInBag;                                // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActionEquipment;                                 // 0x0674(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EJackEquipmentRegion                          TempRegion;                                        // 0x0675(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_676[0x2];                                      // 0x0676(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Main_Command_000_modern_C*    MainCommandWindowRef;                              // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGEquipmentResultData            EquipmentResultData;                               // 0x0680(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class FName>                           UseCommandList;                                    // 0x0698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           EquippedCommandList;                               // 0x06A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           DefaultEquipmentCommandList;                       // 0x06B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           DaiziItemCommandList;                              // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           BattleCommandList;                                 // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UJackUMGItemData*>               DataItemList;                                      // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UJackUMGUIActionInfo*                   HandednessRef;                                     // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    FlowResult;                                        // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGUIActionFlow                          UIFlow;                                            // 0x0701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_702[0x2];                                      // 0x0702(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SaveItemIndex;                                     // 0x0704(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGActionBagInfo                  SaveSelectedBag;                                   // 0x0708(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class FName>                           DaizinamonoFlowList;                               // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          bIsFixupFlag;                                      // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 SelectedBagType;                                   // 0x0721(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_722[0x6];                                      // 0x0722(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   NewEventDispatcher_0;                              // 0x0728(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         CountNowLoading;                                   // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsShowNowLoading;                                 // 0x073C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73D[0x3];                                      // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplayNowLoadingTime;                             // 0x0740(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void NewEventDispatcher_0__DelegateSignature();
	void ExecuteUbergraph_WBP_Menu_Dougu_Command_000_modern(int32 EntryPoint);
	void DoEquipmentEventFinish_Event_0();
	void DoDispResultMessageFinish_Event_0();
	void NotifyDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void CustomEvent_0(bool bIsCustomFlow);
	void WaitToFixpu(EJackCharacter CharacterType);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void SetupCommandList(class UJackUMGUIActionInfo* InUIActionInfoRef, class UJackUMGItemSyousai* InItemSyousaiRef);
	void OpenQuantityWindow(class UWBP_Menu_Common_Quantity_001_modern_C** OutQuantityWindow);
	void SetupSoubiData();
	void MakeMessageArgument();
	void IsHandedWeapons(class FName& InItemId, bool* IsHanded);
	void GetSoubi(class UJackUMGSoubiList** AsJack_UMGSoubi_List);
	void CheckAccessoryFlow(EJackEquipmentRegion* OutRegion);
	void GetEquipmentActionResult(bool* IsActionlEquipment);
	void SetDisableCommandsByFish();
	void CreateCommand(TArray<class FName>& InCommandIdList, class UCanvasPanel* InListPanel, class UCanvasPanel* InFramePanel, class UWidget* InWindowPanel);
	void UpdateDouguList101(class FName InSelectItemId, int32 InItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_Command_000_modern_C">();
	}
	static class UWBP_Menu_Dougu_Command_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_Command_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_Command_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_Command_000_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_Command_000_modern_C) == 0x000748, "Wrong size on UWBP_Menu_Dougu_Command_000_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SmalleFramePanel) == 0x000448, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SmalleFramePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SmalleWindowPanel) == 0x000450, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SmalleWindowPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Dougu_Soubi_000) == 0x000458, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Dougu_Soubi_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Parts_000_C_24) == 0x000460, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Parts_000_C_24' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Parts_000_C_1063) == 0x000468, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Parts_000_C_1063' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Parts_000_C_1064) == 0x000470, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Parts_000_C_1064' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Parts_000_C_1065) == 0x000478, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Parts_000_C_1065' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Parts_000_C_1066) == 0x000480, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Parts_000_C_1066' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WBP_Menu_Parts_000_C_1317) == 0x000488, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WBP_Menu_Parts_000_C_1317' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WideFramePanel) == 0x000490, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WideFramePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, WideWindowPanel) == 0x000498, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::WideWindowPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, ItemSyousaiRef) == 0x0004A0, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, MsgAliveName) == 0x0004A8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::MsgAliveName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, MsgCharName) == 0x0004F0, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::MsgCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, MsgItemName) == 0x000538, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::MsgItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, MsgItemCount) == 0x000580, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::MsgItemCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, MsgReleaseItemName) == 0x0005C8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::MsgReleaseItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, QuantityWindowRef) == 0x000610, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::QuantityWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SelectedWindowPanel) == 0x000618, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SelectedWindowPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SelectedListPanel) == 0x000620, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SelectedListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, ActionItemId) == 0x000628, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::ActionItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SelectedCharType) == 0x000630, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SelectedCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SoubiListRef) == 0x000638, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SoubiListRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, HandItemId) == 0x000640, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::HandItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, UIActionInfoRef) == 0x000648, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::UIActionInfoRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, EquipmentRegion) == 0x000650, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::EquipmentRegion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, EquipmentItemRef) == 0x000658, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::EquipmentItemRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, EquippedAccessory1Ref) == 0x000660, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::EquippedAccessory1Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, EquippedAccessory2Ref) == 0x000668, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::EquippedAccessory2Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SelectedIndexInBag) == 0x000670, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SelectedIndexInBag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, IsActionEquipment) == 0x000674, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::IsActionEquipment' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, TempRegion) == 0x000675, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::TempRegion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, MainCommandWindowRef) == 0x000678, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::MainCommandWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, EquipmentResultData) == 0x000680, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::EquipmentResultData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, UseCommandList) == 0x000698, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::UseCommandList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, EquippedCommandList) == 0x0006A8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::EquippedCommandList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, DefaultEquipmentCommandList) == 0x0006B8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::DefaultEquipmentCommandList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, DaiziItemCommandList) == 0x0006C8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::DaiziItemCommandList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, BattleCommandList) == 0x0006D8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::BattleCommandList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, DataItemList) == 0x0006E8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::DataItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, HandednessRef) == 0x0006F8, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::HandednessRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, FlowResult) == 0x000700, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::FlowResult' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, UIFlow) == 0x000701, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::UIFlow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SaveItemIndex) == 0x000704, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SaveItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SaveSelectedBag) == 0x000708, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SaveSelectedBag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, DaizinamonoFlowList) == 0x000710, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::DaizinamonoFlowList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, bIsFixupFlag) == 0x000720, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::bIsFixupFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, SelectedBagType) == 0x000721, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::SelectedBagType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, NewEventDispatcher_0) == 0x000728, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::NewEventDispatcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, CountNowLoading) == 0x000738, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::CountNowLoading' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, bIsShowNowLoading) == 0x00073C, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::bIsShowNowLoading' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Command_000_modern_C, DisplayNowLoadingTime) == 0x000740, "Member 'UWBP_Menu_Dougu_Command_000_modern_C::DisplayNowLoadingTime' has a wrong offset!");

}

