#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StaffRollWindow_modern

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_StaffRollWindow_modern.WBP_StaffRollWindow_modern_C.ExecuteUbergraph_WBP_StaffRollWindow_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Execute_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlaythroughSecond;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_DynamicCast_AsImage;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern) == 0x000008, "Wrong alignment on WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern");
static_assert(sizeof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern) == 0x000090, "Wrong size on WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, EntryPoint) == 0x000000, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, Temp_int_Variable) == 0x000004, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_Execute_ReturnValue) == 0x000050, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_Execute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, K2Node_Event_bPlaythroughSecond) == 0x000060, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::K2Node_Event_bPlaythroughSecond' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_GetChildrenCount_ReturnValue) == 0x000064, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_GetChildAt_ReturnValue) == 0x000078, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, K2Node_DynamicCast_AsImage) == 0x000080, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::K2Node_DynamicCast_AsImage' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'WBP_StaffRollWindow_modern_C_ExecuteUbergraph_WBP_StaffRollWindow_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_StaffRollWindow_modern.WBP_StaffRollWindow_modern_C.StartStaffRoll
// 0x0001 (0x0001 - 0x0000)
struct WBP_StaffRollWindow_modern_C_StartStaffRoll final
{
public:
	bool                                          bPlayThroughSecond;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_StaffRollWindow_modern_C_StartStaffRoll) == 0x000001, "Wrong alignment on WBP_StaffRollWindow_modern_C_StartStaffRoll");
static_assert(sizeof(WBP_StaffRollWindow_modern_C_StartStaffRoll) == 0x000001, "Wrong size on WBP_StaffRollWindow_modern_C_StartStaffRoll");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_StartStaffRoll, bPlayThroughSecond) == 0x000000, "Member 'WBP_StaffRollWindow_modern_C_StartStaffRoll::bPlayThroughSecond' has a wrong offset!");

// Function WBP_StaffRollWindow_modern.WBP_StaffRollWindow_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_StaffRollWindow_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaffRollWindow_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_StaffRollWindow_modern_C_Tick");
static_assert(sizeof(WBP_StaffRollWindow_modern_C_Tick) == 0x000040, "Wrong size on WBP_StaffRollWindow_modern_C_Tick");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_StaffRollWindow_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_StaffRollWindow_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_StaffRollWindow_modern.WBP_StaffRollWindow_modern_C.PoolChildTextBlock
// 0x0050 (0x0050 - 0x0000)
struct WBP_StaffRollWindow_modern_C_PoolChildTextBlock final
{
public:
	class UPanelWidget*                           TargetPanel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontTypeKey;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TempList;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_DynamicCast_AsText;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock) == 0x000008, "Wrong alignment on WBP_StaffRollWindow_modern_C_PoolChildTextBlock");
static_assert(sizeof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock) == 0x000050, "Wrong size on WBP_StaffRollWindow_modern_C_PoolChildTextBlock");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, TargetPanel) == 0x000000, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::TargetPanel' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, FontTypeKey) == 0x000008, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::FontTypeKey' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, TempList) == 0x000010, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::TempList' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, Temp_int_Variable) == 0x000028, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, K2Node_DynamicCast_AsText) == 0x000038, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::K2Node_DynamicCast_AsText' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaffRollWindow_modern_C_PoolChildTextBlock, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_StaffRollWindow_modern_C_PoolChildTextBlock::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

