#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_056_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.ExecuteUbergraph_WBP_Menu_Parts_056_modern
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern) == 0x000004, "Wrong alignment on WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern) == 0x000004, "Wrong size on WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_ExecuteUbergraph_WBP_Menu_Parts_056_modern::EntryPoint' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.SetCompRate
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Parts_056_modern_C_SetCompRate final
{
public:
	class FName                                   InCaptionID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCompRate;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetRealText_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_SetCompRate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_056_modern_C_SetCompRate");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_SetCompRate) == 0x000030, "Wrong size on WBP_Menu_Parts_056_modern_C_SetCompRate");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompRate, InCaptionID) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_SetCompRate::InCaptionID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompRate, InCompRate) == 0x000008, "Member 'WBP_Menu_Parts_056_modern_C_SetCompRate::InCompRate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompRate, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Parts_056_modern_C_SetCompRate::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompRate, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_056_modern_C_SetCompRate::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompRate, CallFunc_GetRealText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_056_modern_C_SetCompRate::CallFunc_GetRealText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.SetCompValue
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_056_modern_C_SetCompValue final
{
public:
	class FName                                   InCaptionID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNowValue;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InAllValue;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_SetCompValue) == 0x000008, "Wrong alignment on WBP_Menu_Parts_056_modern_C_SetCompValue");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_SetCompValue) == 0x000020, "Wrong size on WBP_Menu_Parts_056_modern_C_SetCompValue");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, InCaptionID) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::InCaptionID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, InNowValue) == 0x000008, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::InNowValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, InAllValue) == 0x00000C, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::InAllValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000014, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetCompValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Parts_056_modern_C_SetCompValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.SetNumberValue
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Parts_056_modern_C_SetNumberValue final
{
public:
	class FName                                   InCaptionID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValue;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InUnitTextId;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0020(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_SetNumberValue) == 0x000008, "Wrong alignment on WBP_Menu_Parts_056_modern_C_SetNumberValue");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_SetNumberValue) == 0x000038, "Wrong size on WBP_Menu_Parts_056_modern_C_SetNumberValue");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetNumberValue, InCaptionID) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_SetNumberValue::InCaptionID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetNumberValue, InValue) == 0x000008, "Member 'WBP_Menu_Parts_056_modern_C_SetNumberValue::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetNumberValue, InUnitTextId) == 0x000010, "Member 'WBP_Menu_Parts_056_modern_C_SetNumberValue::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetNumberValue, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_056_modern_C_SetNumberValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetNumberValue, CallFunc_GetAsciiDecText_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_056_modern_C_SetNumberValue::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.SetValue002
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_056_modern_C_SetValue002 final
{
public:
	class FName                                   InTextId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_SetValue002) == 0x000008, "Wrong alignment on WBP_Menu_Parts_056_modern_C_SetValue002");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_SetValue002) == 0x000010, "Wrong size on WBP_Menu_Parts_056_modern_C_SetValue002");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetValue002, InTextId) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_SetValue002::InTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetValue002, Value) == 0x000008, "Member 'WBP_Menu_Parts_056_modern_C_SetValue002::Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetValue002, MaxValue) == 0x00000C, "Member 'WBP_Menu_Parts_056_modern_C_SetValue002::MaxValue' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.SetSenrekiTopVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible) == 0x000001, "Wrong alignment on WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible) == 0x000001, "Wrong size on WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible, Visible) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_SetSenrekiTopVisible::Visible' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.Set2ValueText
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_056_modern_C_Set2ValueText final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueMax;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UnitTextId;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CaptionId;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_Set2ValueText) == 0x000008, "Wrong alignment on WBP_Menu_Parts_056_modern_C_Set2ValueText");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_Set2ValueText) == 0x000018, "Wrong size on WBP_Menu_Parts_056_modern_C_Set2ValueText");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_Set2ValueText, Value) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_Set2ValueText::Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_Set2ValueText, ValueMax) == 0x000004, "Member 'WBP_Menu_Parts_056_modern_C_Set2ValueText::ValueMax' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_Set2ValueText, UnitTextId) == 0x000008, "Member 'WBP_Menu_Parts_056_modern_C_Set2ValueText::UnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_Set2ValueText, CaptionId) == 0x000010, "Member 'WBP_Menu_Parts_056_modern_C_Set2ValueText::CaptionId' has a wrong offset!");

// Function WBP_Menu_Parts_056_modern.WBP_Menu_Parts_056_modern_C.SetValueText
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_056_modern_C_SetValueText final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UnitTextId;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CaptionId;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_056_modern_C_SetValueText) == 0x000008, "Wrong alignment on WBP_Menu_Parts_056_modern_C_SetValueText");
static_assert(sizeof(WBP_Menu_Parts_056_modern_C_SetValueText) == 0x000018, "Wrong size on WBP_Menu_Parts_056_modern_C_SetValueText");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetValueText, Value) == 0x000000, "Member 'WBP_Menu_Parts_056_modern_C_SetValueText::Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetValueText, UnitTextId) == 0x000008, "Member 'WBP_Menu_Parts_056_modern_C_SetValueText::UnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_056_modern_C_SetValueText, CaptionId) == 0x000010, "Member 'WBP_Menu_Parts_056_modern_C_SetValueText::CaptionId' has a wrong offset!");

}

