#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Fukidasi_Battle_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Fukidasi_Battle_003_modern.WBP_Hud_Fukidasi_Battle_003_modern_C
// 0x0080 (0x0420 - 0x03A0)
class UWBP_Hud_Fukidasi_Battle_003_modern_C final : public UJackUMGHudFukidasiBattleScenario
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FaceIcon;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fukidasi;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_000;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Open;                                              // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PlaySec;                                           // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWidgetAnimation*                       NextPlayAnim;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                NextCharaType;                                     // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NextString;                                        // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   NextFaceIcon;                                      // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Fukidasi_Battle_003_modern(int32 EntryPoint);
	void LoopFukidasi();
	void SetStringAndFace(const class FString& InString, class FName FaceID);
	void Construct();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ResetAnimation();
	void CloseFukidasi();
	void ChangePhotoModeDelegate_Event_0(bool bIsPhotoMode);
	void AllAnimationStop();
	void ExecStringAndChara(const class FString& InStr, class FName InFace);
	void GetCharacterDisplayText(EJackCharacter NewParam, class FName MonsterID, class FString* DisplayName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Fukidasi_Battle_003_modern_C">();
	}
	static class UWBP_Hud_Fukidasi_Battle_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Fukidasi_Battle_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Fukidasi_Battle_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Fukidasi_Battle_003_modern_C");
static_assert(sizeof(UWBP_Hud_Fukidasi_Battle_003_modern_C) == 0x000420, "Wrong size on UWBP_Hud_Fukidasi_Battle_003_modern_C");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, Out) == 0x0003A8, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, Loop) == 0x0003B0, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, In) == 0x0003B8, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, FaceIcon) == 0x0003C0, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::FaceIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, Fukidasi) == 0x0003C8, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::Fukidasi' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, RootPanel) == 0x0003D0, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, Text_000) == 0x0003D8, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::Text_000' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, Open) == 0x0003E0, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::Open' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, PlaySec) == 0x0003E8, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::PlaySec' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, NextPlayAnim) == 0x0003F8, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::NextPlayAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, NextCharaType) == 0x000400, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::NextCharaType' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, NextString) == 0x000408, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::NextString' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Battle_003_modern_C, NextFaceIcon) == 0x000418, "Member 'UWBP_Hud_Fukidasi_Battle_003_modern_C::NextFaceIcon' has a wrong offset!");

}

