#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_015_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_015_modern.WBP_Menu_Battle_List_015_modern_C
// 0x0180 (0x05E8 - 0x0468)
class UWBP_Menu_Battle_List_015_modern_C final : public UJackUMGJoutaiMiru
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel1;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel2;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9122;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9123;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9124;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Member_2;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Member2_Face1;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Member2_Face2;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MemberList_2;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_2_1;                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_2_2;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_044_C*                  WBP_Menu_Parts_044_C_207;                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1854;                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1855;                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1856;                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1857;                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1858;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1859;                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1860;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1861;                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1862;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1863;                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1864;                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1865;                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1866;                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1869;                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1870;                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1871;                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1872;                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1873;                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1874;                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1875;                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1876;                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1877;                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1878;                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1879;                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1880;                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1881;                         // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumData;                                           // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPageItem;                                       // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BarPanel;                                          // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceIcon_0;                                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceIcon_1;                                        // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextPanels;                                        // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_015_modern(int32 EntryPoint);
	void CustomEvent_1(int32 InListOffset);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void CustomEvent_0(class FName EventTag);
	void Construct();
	void ResetWindow();
	void SetFaceAndName(int32 InIndex, class UWBP_Menu_Parts_000_modern_C* Parts000, class UTexture2D** FaceTexture, EJackCharacter* CharacterType, bool* Valid);
	void SetOddEffectIcon(TArray<class UJackUMGItemBase*>& ItemBase);
	void SetDiscription(class FName InName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_015_modern_C">();
	}
	static class UWBP_Menu_Battle_List_015_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_015_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_015_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_015_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_015_modern_C) == 0x0005E8, "Wrong size on UWBP_Menu_Battle_List_015_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, UberGraphFrame) == 0x000468, "Member 'UWBP_Menu_Battle_List_015_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, CaptionPanel) == 0x000470, "Member 'UWBP_Menu_Battle_List_015_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, CaptionPanel1) == 0x000478, "Member 'UWBP_Menu_Battle_List_015_modern_C::CaptionPanel1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, CaptionPanel2) == 0x000480, "Member 'UWBP_Menu_Battle_List_015_modern_C::CaptionPanel2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, Image_9122) == 0x000488, "Member 'UWBP_Menu_Battle_List_015_modern_C::Image_9122' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, Image_9123) == 0x000490, "Member 'UWBP_Menu_Battle_List_015_modern_C::Image_9123' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, Image_9124) == 0x000498, "Member 'UWBP_Menu_Battle_List_015_modern_C::Image_9124' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, InvalidationBox_0) == 0x0004A0, "Member 'UWBP_Menu_Battle_List_015_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, Member_2) == 0x0004A8, "Member 'UWBP_Menu_Battle_List_015_modern_C::Member_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, Member2_Face1) == 0x0004B0, "Member 'UWBP_Menu_Battle_List_015_modern_C::Member2_Face1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, Member2_Face2) == 0x0004B8, "Member 'UWBP_Menu_Battle_List_015_modern_C::Member2_Face2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, MemberList_2) == 0x0004C0, "Member 'UWBP_Menu_Battle_List_015_modern_C::MemberList_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_000) == 0x0004C8, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_000_2_1) == 0x0004D0, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_000_2_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_000_2_2) == 0x0004D8, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_000_2_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_044_C_207) == 0x0004E0, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_044_C_207' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1854) == 0x0004E8, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1854' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1855) == 0x0004F0, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1855' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1856) == 0x0004F8, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1856' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1857) == 0x000500, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1857' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1858) == 0x000508, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1858' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1859) == 0x000510, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1859' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1860) == 0x000518, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1860' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1861) == 0x000520, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1861' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1862) == 0x000528, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1862' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1863) == 0x000530, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1863' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1864) == 0x000538, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1864' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1865) == 0x000540, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1865' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1866) == 0x000548, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1866' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1869) == 0x000550, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1869' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1870) == 0x000558, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1870' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1871) == 0x000560, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1871' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1872) == 0x000568, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1872' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1873) == 0x000570, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1873' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1874) == 0x000578, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1874' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1875) == 0x000580, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1875' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1876) == 0x000588, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1876' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1877) == 0x000590, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1877' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1878) == 0x000598, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1878' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1879) == 0x0005A0, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1879' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1880) == 0x0005A8, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1880' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, WBP_Menu_Parts_063_C_1881) == 0x0005B0, "Member 'UWBP_Menu_Battle_List_015_modern_C::WBP_Menu_Parts_063_C_1881' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, NumData) == 0x0005B8, "Member 'UWBP_Menu_Battle_List_015_modern_C::NumData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, NumPageItem) == 0x0005BC, "Member 'UWBP_Menu_Battle_List_015_modern_C::NumPageItem' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, BarPanel) == 0x0005C0, "Member 'UWBP_Menu_Battle_List_015_modern_C::BarPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, FaceIcon_0) == 0x0005C8, "Member 'UWBP_Menu_Battle_List_015_modern_C::FaceIcon_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, FaceIcon_1) == 0x0005D0, "Member 'UWBP_Menu_Battle_List_015_modern_C::FaceIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_015_modern_C, TextPanels) == 0x0005D8, "Member 'UWBP_Menu_Battle_List_015_modern_C::TextPanels' has a wrong offset!");

}

