#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Load_Indicator_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Load_Indicator_000.WBP_Load_Indicator_000_C
// 0x0028 (0x01F8 - 0x01D0)
class UWBP_Load_Indicator_000_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnimation;                                     // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel;                                        // 0x01E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsShowing;                                        // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Load_Indicator_000(int32 EntryPoint);
	void Construct();
	void Hide();
	void Show();
	void IsShowingAnimation(bool* IsShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Load_Indicator_000_C">();
	}
	static class UWBP_Load_Indicator_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Load_Indicator_000_C>();
	}
};
static_assert(alignof(UWBP_Load_Indicator_000_C) == 0x000008, "Wrong alignment on UWBP_Load_Indicator_000_C");
static_assert(sizeof(UWBP_Load_Indicator_000_C) == 0x0001F8, "Wrong size on UWBP_Load_Indicator_000_C");
static_assert(offsetof(UWBP_Load_Indicator_000_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Load_Indicator_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Load_Indicator_000_C, HideAnimation) == 0x0001D8, "Member 'UWBP_Load_Indicator_000_C::HideAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Load_Indicator_000_C, ShowAnimation) == 0x0001E0, "Member 'UWBP_Load_Indicator_000_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Load_Indicator_000_C, ImagePanel) == 0x0001E8, "Member 'UWBP_Load_Indicator_000_C::ImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Load_Indicator_000_C, bIsShowing) == 0x0001F0, "Member 'UWBP_Load_Indicator_000_C::bIsShowing' has a wrong offset!");

}

