#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_014_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_014_modern.WBP_Menu_Battle_List_014_modern_C
// 0x00F0 (0x0558 - 0x0468)
class UWBP_Menu_Battle_List_014_modern_C final : public UJackUMGJoutaiMiru
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel1;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel2;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14364;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Member_1;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Member1_Face1;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MemberList_1;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_1_1;                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_044_C*                  WBP_Menu_Parts_044_C_295;                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1914;                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1915;                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1916;                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1917;                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1918;                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1919;                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1920;                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1921;                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1922;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1923;                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1924;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1925;                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_1926;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumData;                                           // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPageItem;                                       // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BarPanel;                                          // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceIcon_0;                                        // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextPanels;                                        // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_014_modern(int32 EntryPoint);
	void CustomEvent_1(int32 InListOffset);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void CustomEvent_0(class FName EventTag);
	void Construct();
	void ResetWindow();
	void SetFaceAndName(int32 InIndex, class UWBP_Menu_Parts_000_modern_C* Parts000, class UTexture2D** FaceTexture, EJackCharacter* CharacterType, bool* Valid);
	void SetOddEffectIcon(TArray<class UJackUMGItemBase*>& ItemBase);
	void SetDiscription(class FName InName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_014_modern_C">();
	}
	static class UWBP_Menu_Battle_List_014_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_014_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_014_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_014_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_014_modern_C) == 0x000558, "Wrong size on UWBP_Menu_Battle_List_014_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, UberGraphFrame) == 0x000468, "Member 'UWBP_Menu_Battle_List_014_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, CaptionPanel) == 0x000470, "Member 'UWBP_Menu_Battle_List_014_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, CaptionPanel1) == 0x000478, "Member 'UWBP_Menu_Battle_List_014_modern_C::CaptionPanel1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, CaptionPanel2) == 0x000480, "Member 'UWBP_Menu_Battle_List_014_modern_C::CaptionPanel2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, Image_14364) == 0x000488, "Member 'UWBP_Menu_Battle_List_014_modern_C::Image_14364' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, InvalidationBox_0) == 0x000490, "Member 'UWBP_Menu_Battle_List_014_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, Member_1) == 0x000498, "Member 'UWBP_Menu_Battle_List_014_modern_C::Member_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, Member1_Face1) == 0x0004A0, "Member 'UWBP_Menu_Battle_List_014_modern_C::Member1_Face1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, MemberList_1) == 0x0004A8, "Member 'UWBP_Menu_Battle_List_014_modern_C::MemberList_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_000) == 0x0004B0, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_000_1_1) == 0x0004B8, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_000_1_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_044_C_295) == 0x0004C0, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_044_C_295' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1914) == 0x0004C8, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1914' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1915) == 0x0004D0, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1915' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1916) == 0x0004D8, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1916' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1917) == 0x0004E0, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1917' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1918) == 0x0004E8, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1918' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1919) == 0x0004F0, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1919' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1920) == 0x0004F8, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1920' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1921) == 0x000500, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1921' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1922) == 0x000508, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1922' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1923) == 0x000510, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1923' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1924) == 0x000518, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1924' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1925) == 0x000520, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1925' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, WBP_Menu_Parts_063_C_1926) == 0x000528, "Member 'UWBP_Menu_Battle_List_014_modern_C::WBP_Menu_Parts_063_C_1926' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, NumData) == 0x000530, "Member 'UWBP_Menu_Battle_List_014_modern_C::NumData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, NumPageItem) == 0x000534, "Member 'UWBP_Menu_Battle_List_014_modern_C::NumPageItem' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, BarPanel) == 0x000538, "Member 'UWBP_Menu_Battle_List_014_modern_C::BarPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, FaceIcon_0) == 0x000540, "Member 'UWBP_Menu_Battle_List_014_modern_C::FaceIcon_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_014_modern_C, TextPanels) == 0x000548, "Member 'UWBP_Menu_Battle_List_014_modern_C::TextPanels' has a wrong offset!");

}

