#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Theater_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Theater_000.WBP_Hud_Theater_000_C
// 0x0030 (0x03A0 - 0x0370)
class UWBP_Hud_Theater_000_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BlackStripeBottom;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackStripeTop;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TheaterScreenImage;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BlackStripeColor;                                  // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Theater_000(int32 EntryPoint);
	void AnimEndDelegate();
	void Construct();
	void SetMaterial(class UMaterialInterface* Material);
	void WidgetBPActionDelegate(class FName EventTag);
	void WidgetNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Theater_000_C">();
	}
	static class UWBP_Hud_Theater_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Theater_000_C>();
	}
};
static_assert(alignof(UWBP_Hud_Theater_000_C) == 0x000008, "Wrong alignment on UWBP_Hud_Theater_000_C");
static_assert(sizeof(UWBP_Hud_Theater_000_C) == 0x0003A0, "Wrong size on UWBP_Hud_Theater_000_C");
static_assert(offsetof(UWBP_Hud_Theater_000_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Theater_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Theater_000_C, BlackStripeBottom) == 0x000378, "Member 'UWBP_Hud_Theater_000_C::BlackStripeBottom' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Theater_000_C, BlackStripeTop) == 0x000380, "Member 'UWBP_Hud_Theater_000_C::BlackStripeTop' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Theater_000_C, TheaterScreenImage) == 0x000388, "Member 'UWBP_Hud_Theater_000_C::TheaterScreenImage' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Theater_000_C, BlackStripeColor) == 0x000390, "Member 'UWBP_Hud_Theater_000_C::BlackStripeColor' has a wrong offset!");

}

