#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_008_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_List_008_modern.WBP_Menu_Shop_List_008_modern_C.ExecuteUbergraph_WBP_Menu_Shop_List_008_modern
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern) == 0x000004, "Wrong alignment on WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern");
static_assert(sizeof(WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern) == 0x000004, "Wrong size on WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_List_008_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_008_modern::EntryPoint' has a wrong offset!");

// Function WBP_Menu_Shop_List_008_modern.WBP_Menu_Shop_List_008_modern_C.UpdateStateWindow
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGEquipmentParam                 CallFunc_GetItemMajorParameterType_ReturnValue;    // 0x0020(0x0038)()
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetShopEquipmentStateList_ReturnValue;    // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow");
static_assert(sizeof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow) == 0x000078, "Wrong size on WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, InItemId) == 0x000000, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::InItemId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_Array_Length_ReturnValue2) == 0x00000C, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_GetAccessorItem_ReturnValue) == 0x000010, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_Clamp_ReturnValue) == 0x000018, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_GetItemMajorParameterType_ReturnValue) == 0x000020, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_GetItemMajorParameterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_GetAccessorItem_ReturnValue2) == 0x000060, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow, CallFunc_GetShopEquipmentStateList_ReturnValue) == 0x000068, "Member 'WBP_Menu_Shop_List_008_modern_C_UpdateStateWindow::CallFunc_GetShopEquipmentStateList_ReturnValue' has a wrong offset!");

}

