#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_013_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_013_modern.WBP_Menu_Parts_013_modern_C.ExecuteUbergraph_WBP_Menu_Parts_013_modern
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue9;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue10;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue11;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern");
static_assert(sizeof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern) == 0x000050, "Wrong size on WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue2) == 0x00001C, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue3) == 0x000020, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue4) == 0x000024, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue5) == 0x000028, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue6) == 0x00002C, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue7) == 0x000030, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue8) == 0x000034, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue9) == 0x000038, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue10) == 0x00003C, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_Array_Add_ReturnValue11) == 0x000040, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_Array_Add_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern, CallFunc_SpawnSound2D_ReturnValue) == 0x000048, "Member 'WBP_Menu_Parts_013_modern_C_ExecuteUbergraph_WBP_Menu_Parts_013_modern::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

}

