#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Kakutoku_All_000

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Kakutoku_All_000.WBP_Hud_Kakutoku_All_000_C.ExecuteUbergraph_WBP_Hud_Kakutoku_All_000
// 0x0108 (0x0108 - 0x0000)
struct WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ItemID, class UObject* LoadedObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsPhotoMode)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItemGetIcon                              K2Node_CustomEvent_IconType;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ItemID2;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingMe_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ItemID;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_LoadedObject;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable4;                              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPhotoMode;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPhotoModeActivated_ReturnValue;         // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00E0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor2;                    // 0x00F4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000) == 0x000008, "Wrong alignment on WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000");
static_assert(sizeof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000) == 0x000108, "Wrong size on WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, EntryPoint) == 0x000000, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, Temp_bool_Variable) == 0x000004, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, Temp_float_Variable) == 0x000008, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetUMGManager_ReturnValue) == 0x000030, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetAccessorItem_ReturnValue) == 0x000038, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_IsValid_ReturnValue2) == 0x000041, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000042, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CustomEvent_IconType) == 0x000044, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CustomEvent_IconType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CustomEvent_ItemID2) == 0x000048, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CustomEvent_ItemID2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, Temp_float_Variable2) == 0x000054, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_Event_Animation) == 0x000058, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetUMGManager_ReturnValue2) == 0x000068, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000070, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, Temp_float_Variable3) == 0x000078, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_IsPlayingMe_ReturnValue) == 0x00007C, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_IsPlayingMe_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CustomEvent_ItemID) == 0x000080, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CustomEvent_ItemID' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CustomEvent_LoadedObject) == 0x000088, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CustomEvent_LoadedObject' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_DynamicCast_AsTexture_2D) == 0x000090, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, Temp_float_Variable4) == 0x00009C, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, Temp_bool_Variable2) == 0x0000A0, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetUMGManager_ReturnValue3) == 0x0000A8, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_IsValid_ReturnValue3) == 0x0000B0, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000B8, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_IsValid_ReturnValue4) == 0x0000C0, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_CustomEvent_bIsPhotoMode) == 0x0000C1, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_CustomEvent_bIsPhotoMode' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetUMGManager_ReturnValue4) == 0x0000C8, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_GetAccessorBattle_ReturnValue) == 0x0000D0, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, CallFunc_IsPhotoModeActivated_ReturnValue) == 0x0000DC, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::CallFunc_IsPhotoModeActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_MakeStruct_LinearColor) == 0x0000E0, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_Select2_Default) == 0x0000F0, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000, K2Node_MakeStruct_LinearColor2) == 0x0000F4, "Member 'WBP_Hud_Kakutoku_All_000_C_ExecuteUbergraph_WBP_Hud_Kakutoku_All_000::K2Node_MakeStruct_LinearColor2' has a wrong offset!");

// Function WBP_Hud_Kakutoku_All_000.WBP_Hud_Kakutoku_All_000_C.ChangePhotoModeDelegate
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate final
{
public:
	bool                                          bIsPhotoMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate) == 0x000001, "Wrong alignment on WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate");
static_assert(sizeof(WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate) == 0x000001, "Wrong size on WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate, bIsPhotoMode) == 0x000000, "Member 'WBP_Hud_Kakutoku_All_000_C_ChangePhotoModeDelegate::bIsPhotoMode' has a wrong offset!");

// Function WBP_Hud_Kakutoku_All_000.WBP_Hud_Kakutoku_All_000_C.OnLoadedItemPopIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon final
{
public:
	class FName                                   ItemID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LoadedObject;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon) == 0x000008, "Wrong alignment on WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon");
static_assert(sizeof(WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon) == 0x000010, "Wrong size on WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon, ItemID) == 0x000000, "Member 'WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon::ItemID' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon, LoadedObject) == 0x000008, "Member 'WBP_Hud_Kakutoku_All_000_C_OnLoadedItemPopIcon::LoadedObject' has a wrong offset!");

// Function WBP_Hud_Kakutoku_All_000.WBP_Hud_Kakutoku_All_000_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished");
static_assert(sizeof(WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Hud_Kakutoku_All_000_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Hud_Kakutoku_All_000.WBP_Hud_Kakutoku_All_000_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Hud_Kakutoku_All_000_C_SetData final
{
public:
	EJackItemGetIcon                              IconType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemID;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Kakutoku_All_000_C_SetData) == 0x000008, "Wrong alignment on WBP_Hud_Kakutoku_All_000_C_SetData");
static_assert(sizeof(WBP_Hud_Kakutoku_All_000_C_SetData) == 0x000010, "Wrong size on WBP_Hud_Kakutoku_All_000_C_SetData");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_SetData, IconType) == 0x000000, "Member 'WBP_Hud_Kakutoku_All_000_C_SetData::IconType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Kakutoku_All_000_C_SetData, ItemID) == 0x000008, "Member 'WBP_Hud_Kakutoku_All_000_C_SetData::ItemID' has a wrong offset!");

}

