#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_003_modern.WBP_Hud_Status_003_modern_C.ExecuteUbergraph_WBP_Hud_Status_003_modern
// 0x0004 (0x0004 - 0x0000)
struct WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern) == 0x000004, "Wrong alignment on WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern");
static_assert(sizeof(WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern) == 0x000004, "Wrong size on WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern");
static_assert(offsetof(WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_003_modern_C_ExecuteUbergraph_WBP_Hud_Status_003_modern::EntryPoint' has a wrong offset!");

// Function WBP_Hud_Status_003_modern.WBP_Hud_Status_003_modern_C.SetZoneVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Status_003_modern_C_SetZoneVisibility final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_003_modern_C_SetZoneVisibility) == 0x000001, "Wrong alignment on WBP_Hud_Status_003_modern_C_SetZoneVisibility");
static_assert(sizeof(WBP_Hud_Status_003_modern_C_SetZoneVisibility) == 0x000001, "Wrong size on WBP_Hud_Status_003_modern_C_SetZoneVisibility");
static_assert(offsetof(WBP_Hud_Status_003_modern_C_SetZoneVisibility, InFlag) == 0x000000, "Member 'WBP_Hud_Status_003_modern_C_SetZoneVisibility::InFlag' has a wrong offset!");

// Function WBP_Hud_Status_003_modern.WBP_Hud_Status_003_modern_C.SetSenaHair
// 0x0002 (0x0002 - 0x0000)
struct WBP_Hud_Status_003_modern_C_SetSenaHair final
{
public:
	bool                                          IsShort;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUIFaceIcon                               IconType;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_003_modern_C_SetSenaHair) == 0x000001, "Wrong alignment on WBP_Hud_Status_003_modern_C_SetSenaHair");
static_assert(sizeof(WBP_Hud_Status_003_modern_C_SetSenaHair) == 0x000002, "Wrong size on WBP_Hud_Status_003_modern_C_SetSenaHair");
static_assert(offsetof(WBP_Hud_Status_003_modern_C_SetSenaHair, IsShort) == 0x000000, "Member 'WBP_Hud_Status_003_modern_C_SetSenaHair::IsShort' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_003_modern_C_SetSenaHair, IconType) == 0x000001, "Member 'WBP_Hud_Status_003_modern_C_SetSenaHair::IconType' has a wrong offset!");

}

