#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Settei_002_Steam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C
// 0x0078 (0x0478 - 0x0400)
class UWBP_Menu_Keyconfig_Settei_002_Steam_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList_2;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Setumei_Panel;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_000;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_001;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_Setumei;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_hairetusettei;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_kettei;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBPMenuSyokisettei;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCloseWindow;                                     // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsExecOpenAnim;                                    // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_000_modern_C*>   Parts000List;                                      // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWBP_Menu_Keyconfig_Settei_000_Steam_C* KeyConfigSettei000;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageLoopMode;                                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemListMax;                                       // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_003_Steam_C* KeyConfigSettei003;                                // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam(int32 EntryPoint);
	void ChangeKeyConfigYN(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void DefoultKeyYN(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void ResetCaptureCameraPosition();
	void ChangedCancelYN(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void ShowDebugInfo();
	void HideDebugInfo();
	void KeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void WidgetBPActionDelegate(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void SetDebugTargetSize(bool bVisible, const struct FVector2D& SlideTargetOrigin, const struct FVector2D& MaxSlideTargetSize, const struct FVector2D& MinSlideTargetSize);
	void HideDebugTargetSize();
	void ShowDebugTargetSize();
	void InitText();
	void SetCursorOffset(bool IsActive);
	void SetWidgetKeyConfigSettei000(class UWBP_Menu_Keyconfig_Settei_000_Steam_C* InWidget);
	void ReFocusWidget(bool IsInUp);
	void SetSetumeiVisible(bool IsVisible_0);
	void SetKeyAssignPanelPosition(const struct FVector2D& Position_0, bool Visible);
	void SetFocus001();
	void GetChangedKeyListMode(int32* NoChangedChangedMode);
	void SetDefaultKeyboard();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Keyconfig_Settei_002_Steam_C">();
	}
	static class UWBP_Menu_Keyconfig_Settei_002_Steam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Keyconfig_Settei_002_Steam_C>();
	}
};
static_assert(alignof(UWBP_Menu_Keyconfig_Settei_002_Steam_C) == 0x000008, "Wrong alignment on UWBP_Menu_Keyconfig_Settei_002_Steam_C");
static_assert(sizeof(UWBP_Menu_Keyconfig_Settei_002_Steam_C) == 0x000478, "Wrong size on UWBP_Menu_Keyconfig_Settei_002_Steam_C");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, ItemList_2) == 0x000408, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::ItemList_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, Setumei_Panel) == 0x000410, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::Setumei_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, TextPanel_000) == 0x000418, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::TextPanel_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, TextPanel_001) == 0x000420, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::TextPanel_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, TextPanel_Setumei) == 0x000428, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::TextPanel_Setumei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, WBP_Menu_hairetusettei) == 0x000430, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::WBP_Menu_hairetusettei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, WBP_Menu_kettei) == 0x000438, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::WBP_Menu_kettei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, WBPMenuSyokisettei) == 0x000440, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::WBPMenuSyokisettei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, IsCloseWindow) == 0x000448, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::IsCloseWindow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, IsExecOpenAnim) == 0x000449, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::IsExecOpenAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, Parts000List) == 0x000450, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::Parts000List' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, KeyConfigSettei000) == 0x000460, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::KeyConfigSettei000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, PageLoopMode) == 0x000468, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::PageLoopMode' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, ItemListMax) == 0x00046C, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::ItemListMax' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_002_Steam_C, KeyConfigSettei003) == 0x000470, "Member 'UWBP_Menu_Keyconfig_Settei_002_Steam_C::KeyConfigSettei003' has a wrong offset!");

}

