#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Sibari_Setting_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Sibari_Setting_000_modern.WBP_Menu_Namae_Sibari_Setting_000_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern
// 0x0448 (0x0448 - 0x0000)
struct WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackLanguage                                 Temp_byte_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable10;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable11;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable12;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable13;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable14;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable15;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable16;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable17;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNotTitle_NotTitle;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender4;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID4;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex4;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue3;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender3;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID3;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex3;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender2;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID2;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex2;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue4;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBoukenSibariKakunin_Kakunin;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SlotIndex;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_CustomEvent_SaveLoadResult;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSibariMode                            CallFunc_GetSibariMode_ReturnValue;                // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue5;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable18;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackLanguage                                 Temp_byte_Variable2;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_DynamicCast_AsBP_IF_Save_Data_Check;        // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> CallFunc_ExecuteSaveDataCheckResult_Sender_CastInput; // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SibariBoukenNoSyo_IsKettei;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SibariField_SibariOn;                     // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSibariMode                            CallFunc_GetSibariMode_ReturnValue2;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue6;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue7;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue8;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGSibariMode                            CallFunc_GetSibariMode_ReturnValue3;               // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue9;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSibariMode                            CallFunc_GetSibariMode_ReturnValue4;               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0254(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue10;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0268(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue7;         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSibariChecked_Checked;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0288(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSibariChecked_Checked2;                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable7;                             // 0x02E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result4;             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable8;                             // 0x0308(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result5;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue7; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable9;                             // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue8; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDecMessageString_ReturnValue;          // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0368(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x03B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue9; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackLanguage                                 CallFunc_GetLanguageType_ReturnValue;              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackLanguage                                 CallFunc_GetLanguageType_ReturnValue2;             // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select2_Default;                            // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Namae_Window_001_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Namae_Window_001_Modern; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate5;             // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0418(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue8;         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSibariMode                            CallFunc_GetSibariMode_ReturnValue5;               // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern");
static_assert(sizeof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern) == 0x000448, "Wrong size on WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable2) == 0x000005, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable3) == 0x000006, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable4) == 0x000007, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable5) == 0x000008, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable6) == 0x000009, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable7) == 0x00000A, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_byte_Variable) == 0x00000B, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable8) == 0x00000C, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable9) == 0x00000D, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable10) == 0x00000E, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable11) == 0x00000F, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable12) == 0x000010, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable13) == 0x000011, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable14) == 0x000012, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable15) == 0x000013, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable16) == 0x000014, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_MakeVector2D_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000040, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable17) == 0x000048, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_IsNotTitle_NotTitle) == 0x000058, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_IsNotTitle_NotTitle' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_Sender4) == 0x000060, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_Sender4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_CurrentTextID4) == 0x000068, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_CurrentTextID4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_SelectDialogIndex4) == 0x000070, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_SelectDialogIndex4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000074, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_Sender3) == 0x000080, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_Sender3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_CurrentTextID3) == 0x000088, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_CurrentTextID3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_SelectDialogIndex3) == 0x000090, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_SelectDialogIndex3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_Sender2) == 0x000098, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_CurrentTextID2) == 0x0000A0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_CurrentTextID2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_SelectDialogIndex2) == 0x0000A8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_SelectDialogIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x0000AC, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchInteger3_CmpSuccess) == 0x0000AD, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue4) == 0x0000B0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_IsBoukenSibariKakunin_Kakunin) == 0x0000B8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_IsBoukenSibariKakunin_Kakunin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_SlotIndex) == 0x0000C8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_SaveLoadResult) == 0x0000CC, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_SaveLoadResult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetSibariMode_ReturnValue) == 0x0000CD, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetSibariMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue5) == 0x0000D0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_bool_Variable18) == 0x0000E8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_bool_Variable18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_OpenMenu_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_byte_Variable2) == 0x000100, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000108, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_DynamicCast_AsBP_IF_Save_Data_Check) == 0x000110, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_DynamicCast_AsBP_IF_Save_Data_Check' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000128, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_Event_CheckPoint4) == 0x000138, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_Event_Result) == 0x000139, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_ExecuteSaveDataCheckResult_Sender_CastInput) == 0x000140, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_ExecuteSaveDataCheckResult_Sender_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x000150, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_struct_Variable) == 0x000158, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000168, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000178, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_struct_Variable2) == 0x000180, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000190, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000198, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_EventName) == 0x0001A0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_CustomEvent_InItemBase) == 0x0001A8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_SibariBoukenNoSyo_IsKettei) == 0x0001B0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_SibariBoukenNoSyo_IsKettei' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchName_CmpSuccess) == 0x0001B1, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_SibariField_SibariOn) == 0x0001B2, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_SibariField_SibariOn' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x0001B3, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_Event_CheckPoint3) == 0x0001B4, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x0001B8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetSibariMode_ReturnValue2) == 0x0001C0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetSibariMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue6) == 0x0001C8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchEnum3_CmpSuccess) == 0x0001D0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x0001D8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue7) == 0x0001E0, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_Event_Sender2) == 0x0001E8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_Event_CheckPoint2) == 0x0001F8, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_Event_CheckRusult) == 0x0001F9, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue8) == 0x000200, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x000208, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, Temp_struct_Variable3) == 0x000210, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_GetSibariMode_ReturnValue3) == 0x000220, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_GetSibariMode_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x000228, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern, K2Node_SwitchEnum4_CmpSuccess) == 0x000230, "Member 'WBP_Menu_Namae_Sibari_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
