#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Clock_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Clock_000.WBP_Menu_Clock_000_C
// 0x0020 (0x01F0 - 0x01D0)
class UWBP_Menu_Clock_000_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Clock_DailPanel;                                   // 0x01D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Clock_FramePanel;                                  // 0x01E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x01E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Clock_000(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Clock_000_C">();
	}
	static class UWBP_Menu_Clock_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Clock_000_C>();
	}
};
static_assert(alignof(UWBP_Menu_Clock_000_C) == 0x000008, "Wrong alignment on UWBP_Menu_Clock_000_C");
static_assert(sizeof(UWBP_Menu_Clock_000_C) == 0x0001F0, "Wrong size on UWBP_Menu_Clock_000_C");
static_assert(offsetof(UWBP_Menu_Clock_000_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Menu_Clock_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Clock_000_C, Clock_DailPanel) == 0x0001D8, "Member 'UWBP_Menu_Clock_000_C::Clock_DailPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Clock_000_C, Clock_FramePanel) == 0x0001E0, "Member 'UWBP_Menu_Clock_000_C::Clock_FramePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Clock_000_C, InvalidationBox_0) == 0x0001E8, "Member 'UWBP_Menu_Clock_000_C::InvalidationBox_0' has a wrong offset!");

}

