#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_054_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_054_modern.WBP_Menu_Parts_054_modern_C.OnChangeValue__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature");
static_assert(sizeof(WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature, Value) == 0x000000, "Member 'WBP_Menu_Parts_054_modern_C_OnChangeValue__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Parts_054_modern.WBP_Menu_Parts_054_modern_C.ExecuteUbergraph_WBP_Menu_Parts_054_modern
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern");
static_assert(sizeof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern) == 0x000030, "Wrong size on WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern, K2Node_CustomEvent_EventTag) == 0x000020, "Member 'WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern, CallFunc_Array_Add_ReturnValue2) == 0x00002C, "Member 'WBP_Menu_Parts_054_modern_C_ExecuteUbergraph_WBP_Menu_Parts_054_modern::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Parts_054_modern.WBP_Menu_Parts_054_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_054_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_054_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_054_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_054_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_054_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_054_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_054_modern.WBP_Menu_Parts_054_modern_C.SakusenTextIdSetting
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting final
{
public:
	class FName                                   TitleText;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Value_1;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Value_2;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting) == 0x000008, "Wrong alignment on WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting");
static_assert(sizeof(WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting) == 0x000018, "Wrong size on WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting, TitleText) == 0x000000, "Member 'WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting::TitleText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting, Value_1) == 0x000008, "Member 'WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting::Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting, Value_2) == 0x000010, "Member 'WBP_Menu_Parts_054_modern_C_SakusenTextIdSetting::Value_2' has a wrong offset!");

}

