#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_PlayGoBase_modern

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_PlayGoBase_modern.WBP_Menu_PlayGoBase_modern_C.ExecuteUbergraph_WBP_Menu_PlayGoBase_modern
// 0x0200 (0x0200 - 0x0000)
struct WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClosed_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClosed_ReturnValue2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x006C(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayGoInstallRemainTime_ReturnValue;   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue; // 0x00D8(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable5;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackPlayGoMenuType                           K2Node_CustomEvent_Type;                           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable6;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0180(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Namae_Fukkatu_Input_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Namae_Fukkatu_Input_000_Modern; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select4_Default;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x01E8(0x0018)()
};
static_assert(alignof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern) == 0x000008, "Wrong alignment on WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern");
static_assert(sizeof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern) == 0x000200, "Wrong size on WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_bool_Variable) == 0x000018, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_name_Variable) == 0x000020, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_name_Variable2) == 0x000028, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_bool_Variable2) == 0x000030, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_Select_Default) == 0x000038, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_bool_Variable3) == 0x000040, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_name_Variable3) == 0x000048, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_name_Variable4) == 0x000050, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_IsClosed_ReturnValue) == 0x000058, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_IsClosed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_Select2_Default) == 0x000060, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_bool_Variable4) == 0x000068, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_IsClosed_ReturnValue2) == 0x000069, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_IsClosed_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_Event_MyGeometry) == 0x00006C, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_Event_InDeltaTime) == 0x0000A8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_CustomEvent_InKeyType) == 0x0000AC, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_CustomEvent_bIsPressed) == 0x0000AD, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0000B8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetPlayGoInstallRemainTime_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetPlayGoInstallRemainTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_bool_Has_Been_Initd_Variable) == 0x0000CC, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000130, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000131, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_name_Variable5) == 0x000138, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_CustomEvent_Type) == 0x000140, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000148, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000150, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_name_Variable6) == 0x000158, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, Temp_bool_IsClosed_Variable) == 0x000160, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_Select3_Default) == 0x000168, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetText_ReturnValue) == 0x000170, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000180, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000198, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0001A0, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x0001A8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_DynamicCast_AsWBP_Menu_Namae_Fukkatu_Input_000_Modern) == 0x0001B0, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_DynamicCast_AsWBP_Menu_Namae_Fukkatu_Input_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, K2Node_Select4_Default) == 0x0001C0, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_GetText_ReturnValue2) == 0x0001C8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_ReplaceMessageTag_ReturnValue) == 0x0001D8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_ReplaceMessageTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x0001E8, "Member 'WBP_Menu_PlayGoBase_modern_C_ExecuteUbergraph_WBP_Menu_PlayGoBase_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_PlayGoBase_modern.WBP_Menu_PlayGoBase_modern_C.SetData
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_PlayGoBase_modern_C_SetData final
{
public:
	EJackPlayGoMenuType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_PlayGoBase_modern_C_SetData) == 0x000001, "Wrong alignment on WBP_Menu_PlayGoBase_modern_C_SetData");
static_assert(sizeof(WBP_Menu_PlayGoBase_modern_C_SetData) == 0x000001, "Wrong size on WBP_Menu_PlayGoBase_modern_C_SetData");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_SetData, Type) == 0x000000, "Member 'WBP_Menu_PlayGoBase_modern_C_SetData::Type' has a wrong offset!");

// Function WBP_Menu_PlayGoBase_modern.WBP_Menu_PlayGoBase_modern_C.OnKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_PlayGoBase_modern_C_OnKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_PlayGoBase_modern_C_OnKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_PlayGoBase_modern_C_OnKeyEvent");
static_assert(sizeof(WBP_Menu_PlayGoBase_modern_C_OnKeyEvent) == 0x000002, "Wrong size on WBP_Menu_PlayGoBase_modern_C_OnKeyEvent");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_OnKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_PlayGoBase_modern_C_OnKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_OnKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_PlayGoBase_modern_C_OnKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_PlayGoBase_modern.WBP_Menu_PlayGoBase_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_PlayGoBase_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_PlayGoBase_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_PlayGoBase_modern_C_Tick");
static_assert(sizeof(WBP_Menu_PlayGoBase_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_PlayGoBase_modern_C_Tick");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_PlayGoBase_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_PlayGoBase_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_PlayGoBase_modern_C_Tick::InDeltaTime' has a wrong offset!");

}

