#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Message_Window_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Message_Window_000_modern.WBP_Menu_Message_Window_000_modern_C
// 0x0158 (0x0698 - 0x0540)
class UWBP_Menu_Message_Window_000_modern_C final : public UJackUMGSerifuWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ContentPanel;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image00_00;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image00_01;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image00_02;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image01_00;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image01_01;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image01_02;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image02_00;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image02_01;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image02_02;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image03_00;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image03_01;                                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image03_02;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image04_00;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image04_01;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image04_02;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MaterialWindwFrame;                                // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PageMarkerImage;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel00_00;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel00_01;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel00_02;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel00_03;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel01_00;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel01_01;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel01_02;                                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel01_03;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel02_00;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel02_01;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel02_02;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel02_03;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel03_00;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel03_01;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel03_02;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel03_03;                                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel04_00;                                    // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel04_01;                                    // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel04_02;                                    // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel04_03;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             FrameTexture;                                      // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Message_Window_000_modern(int32 EntryPoint);
	void Construct();
	void ChengePageMarkerShowState(bool bIsShow);
	void SetupNameWindow(bool bIsShow, const class FText& DisplayName, const struct FVector2D& NameSize);
	void SetupChoicesWindowShowMode(bool bIsShow, int32 TextLength);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Message_Window_000_modern_C">();
	}
	static class UWBP_Menu_Message_Window_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Message_Window_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Message_Window_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Message_Window_000_modern_C");
static_assert(sizeof(UWBP_Menu_Message_Window_000_modern_C) == 0x000698, "Wrong size on UWBP_Menu_Message_Window_000_modern_C");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, UberGraphFrame) == 0x000540, "Member 'UWBP_Menu_Message_Window_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Loop) == 0x000548, "Member 'UWBP_Menu_Message_Window_000_modern_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, ContentPanel) == 0x000550, "Member 'UWBP_Menu_Message_Window_000_modern_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image00_00) == 0x000558, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image00_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image00_01) == 0x000560, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image00_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image00_02) == 0x000568, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image00_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image01_00) == 0x000570, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image01_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image01_01) == 0x000578, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image01_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image01_02) == 0x000580, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image01_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image02_00) == 0x000588, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image02_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image02_01) == 0x000590, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image02_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image02_02) == 0x000598, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image02_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image03_00) == 0x0005A0, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image03_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image03_01) == 0x0005A8, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image03_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image03_02) == 0x0005B0, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image03_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image04_00) == 0x0005B8, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image04_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image04_01) == 0x0005C0, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image04_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, Image04_02) == 0x0005C8, "Member 'UWBP_Menu_Message_Window_000_modern_C::Image04_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, MaterialWindwFrame) == 0x0005D0, "Member 'UWBP_Menu_Message_Window_000_modern_C::MaterialWindwFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, NameText) == 0x0005D8, "Member 'UWBP_Menu_Message_Window_000_modern_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, PageMarkerImage) == 0x0005E0, "Member 'UWBP_Menu_Message_Window_000_modern_C::PageMarkerImage' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel00_00) == 0x0005E8, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel00_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel00_01) == 0x0005F0, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel00_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel00_02) == 0x0005F8, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel00_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel00_03) == 0x000600, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel00_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel01_00) == 0x000608, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel01_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel01_01) == 0x000610, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel01_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel01_02) == 0x000618, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel01_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel01_03) == 0x000620, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel01_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel02_00) == 0x000628, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel02_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel02_01) == 0x000630, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel02_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel02_02) == 0x000638, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel02_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel02_03) == 0x000640, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel02_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel03_00) == 0x000648, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel03_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel03_01) == 0x000650, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel03_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel03_02) == 0x000658, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel03_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel03_03) == 0x000660, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel03_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel04_00) == 0x000668, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel04_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel04_01) == 0x000670, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel04_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel04_02) == 0x000678, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel04_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, TextLabel04_03) == 0x000680, "Member 'UWBP_Menu_Message_Window_000_modern_C::TextLabel04_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, WindowFrame) == 0x000688, "Member 'UWBP_Menu_Message_Window_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Window_000_modern_C, FrameTexture) == 0x000690, "Member 'UWBP_Menu_Message_Window_000_modern_C::FrameTexture' has a wrong offset!");

}

