#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tokugi_SkillInfoBase_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "JackGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C
// 0x0070 (0x0240 - 0x01D0)
class UWBP_Menu_Tokugi_SkillInfoBase_modern_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWBP_Menu_Parts_007_modern_C*           Parts007_Text_Invalid_AtTextUseMp;                 // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000TextUseMpRef;                              // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           Parts006DescriptionRef;                            // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           Parts006_SkillResetInfo;                           // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           Parts024UseMpRef;                                  // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CenterLineRef;                                     // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnSetText;                                         // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnSetVisible;                                      // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UImage*                                 SplitLineRef;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLimitedExecWeapon;                              // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Tokugi_SkillInfo_002_modern_C* SkillInfo002Modern;                                // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSetText__DelegateSignature(const class FString& Text);
	void OnSetVisible__DelegateSignature(bool IsVisible_0);
	void ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern(int32 EntryPoint);
	void SetSkillInfoVisible(bool IsVisible_0);
	void InitTextFontColor(EJackUMGTextColorSet InColorType);
	void Construct();
	void SetData(class UJackUMGTokugiPanelData* PanelData);
	void SetSkillInfo002Widget(class UWBP_Menu_Tokugi_SkillInfo_002_modern_C* SkillInfo002);
	void ShowInfoTextInSkillReset(class UJackUMGTokugiPanelSkillLineData* SkillLineData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tokugi_SkillInfoBase_modern_C">();
	}
	static class UWBP_Menu_Tokugi_SkillInfoBase_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tokugi_SkillInfoBase_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tokugi_SkillInfoBase_modern_C");
static_assert(sizeof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C) == 0x000240, "Wrong size on UWBP_Menu_Tokugi_SkillInfoBase_modern_C");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, Parts007_Text_Invalid_AtTextUseMp) == 0x0001D8, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::Parts007_Text_Invalid_AtTextUseMp' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, Parts000TextUseMpRef) == 0x0001E0, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::Parts000TextUseMpRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, Parts006DescriptionRef) == 0x0001E8, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::Parts006DescriptionRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, Parts006_SkillResetInfo) == 0x0001F0, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::Parts006_SkillResetInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, Parts024UseMpRef) == 0x0001F8, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::Parts024UseMpRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, CenterLineRef) == 0x000200, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::CenterLineRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, OnSetText) == 0x000208, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::OnSetText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, OnSetVisible) == 0x000218, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::OnSetVisible' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, SplitLineRef) == 0x000228, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::SplitLineRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, bIsLimitedExecWeapon) == 0x000230, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::bIsLimitedExecWeapon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tokugi_SkillInfoBase_modern_C, SkillInfo002Modern) == 0x000238, "Member 'UWBP_Menu_Tokugi_SkillInfoBase_modern_C::SkillInfo002Modern' has a wrong offset!");

}

