#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_059_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.ExecuteUbergraph_WBP_Menu_Parts_059_modern
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable13;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable14;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Numerator;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Denominator;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0050(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0070(0x0018)()
	bool                                          K2Node_CustomEvent_bIsRight;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Input;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsVisibleLeft;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsVisibleRight;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsEnableLeft;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsEnableRight;                 // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select6_Default;                            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select7_Default;                            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern) == 0x0000A0, "Wrong size on WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable2) == 0x000007, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable3) == 0x000008, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable4) == 0x000009, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable3) == 0x00000A, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable5) == 0x00000B, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable6) == 0x00000C, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable4) == 0x00000D, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable7) == 0x000020, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable8) == 0x000021, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable5) == 0x000022, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable9) == 0x000023, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable10) == 0x000024, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable6) == 0x000025, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable11) == 0x000026, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable12) == 0x000027, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable13) == 0x000028, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_byte_Variable14) == 0x000029, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_EventTag) == 0x000030, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_SwitchName_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_Numerator) == 0x00003C, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_Numerator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_Denominator) == 0x000040, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_Denominator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x000050, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select_Default) == 0x000068, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_bIsRight) == 0x000088, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_bIsRight' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_Input) == 0x00008C, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_Input' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000090, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_bIsVisibleLeft) == 0x000091, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_bIsVisibleLeft' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_bIsVisibleRight) == 0x000092, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_bIsVisibleRight' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select2_Default) == 0x000093, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select3_Default) == 0x000094, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_bIsEnableLeft) == 0x000095, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_bIsEnableLeft' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_CustomEvent_bIsEnableRight) == 0x000096, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_CustomEvent_bIsEnableRight' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000097, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select4_Default) == 0x000098, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select5_Default) == 0x000099, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, CallFunc_Not_PreBool_ReturnValue2) == 0x00009A, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, Temp_bool_Variable7) == 0x00009B, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select6_Default) == 0x00009C, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern, K2Node_Select7_Default) == 0x00009D, "Member 'WBP_Menu_Parts_059_modern_C_ExecuteUbergraph_WBP_Menu_Parts_059_modern::K2Node_Select7_Default' has a wrong offset!");

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.SetArrowEnable
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Parts_059_modern_C_SetArrowEnable final
{
public:
	bool                                          bIsEnableLeft;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsEnableRight;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_SetArrowEnable) == 0x000001, "Wrong alignment on WBP_Menu_Parts_059_modern_C_SetArrowEnable");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_SetArrowEnable) == 0x000002, "Wrong size on WBP_Menu_Parts_059_modern_C_SetArrowEnable");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_SetArrowEnable, bIsEnableLeft) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_SetArrowEnable::bIsEnableLeft' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_SetArrowEnable, bIsEnableRight) == 0x000001, "Member 'WBP_Menu_Parts_059_modern_C_SetArrowEnable::bIsEnableRight' has a wrong offset!");

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.SetArrowVisible
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Parts_059_modern_C_SetArrowVisible final
{
public:
	bool                                          bIsVisibleLeft;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsVisibleRight;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_SetArrowVisible) == 0x000001, "Wrong alignment on WBP_Menu_Parts_059_modern_C_SetArrowVisible");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_SetArrowVisible) == 0x000002, "Wrong size on WBP_Menu_Parts_059_modern_C_SetArrowVisible");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_SetArrowVisible, bIsVisibleLeft) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_SetArrowVisible::bIsVisibleLeft' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_SetArrowVisible, bIsVisibleRight) == 0x000001, "Member 'WBP_Menu_Parts_059_modern_C_SetArrowVisible::bIsVisibleRight' has a wrong offset!");

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.PlayArrowAnimAtInputValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue final
{
public:
	int32                                         Input;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue) == 0x000004, "Wrong alignment on WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue) == 0x000004, "Wrong size on WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue, Input) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_PlayArrowAnimAtInputValue::Input' has a wrong offset!");

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.PlayArrowAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_059_modern_C_PlayArrowAnimation final
{
public:
	bool                                          bIsRight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_PlayArrowAnimation) == 0x000001, "Wrong alignment on WBP_Menu_Parts_059_modern_C_PlayArrowAnimation");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_PlayArrowAnimation) == 0x000001, "Wrong size on WBP_Menu_Parts_059_modern_C_PlayArrowAnimation");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_PlayArrowAnimation, bIsRight) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_PlayArrowAnimation::bIsRight' has a wrong offset!");

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_059_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_059_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_059_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_059_modern.WBP_Menu_Parts_059_modern_C.SetNumber
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_059_modern_C_SetNumber final
{
public:
	int32                                         Numerator;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Denominator;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_059_modern_C_SetNumber) == 0x000004, "Wrong alignment on WBP_Menu_Parts_059_modern_C_SetNumber");
static_assert(sizeof(WBP_Menu_Parts_059_modern_C_SetNumber) == 0x000008, "Wrong size on WBP_Menu_Parts_059_modern_C_SetNumber");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_SetNumber, Numerator) == 0x000000, "Member 'WBP_Menu_Parts_059_modern_C_SetNumber::Numerator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_059_modern_C_SetNumber, Denominator) == 0x000004, "Member 'WBP_Menu_Parts_059_modern_C_SetNumber::Denominator' has a wrong offset!");

}

