#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Settei_002_Steam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam
// 0x0228 (0x0228 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_SlideTargetOrigin;                    // 0x00D4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MaxSlideTargetSize;                   // 0x00DC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MinSlideTargetSize;                   // 0x00E4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackKeyStatus                         CallFunc_GetKeyStatus_ReturnValue;                 // 0x0128(0x0040)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_003_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_003_Steam; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender3;                        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID3;                 // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex3;             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender2;                        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID2;                 // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex2;             // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate5;             // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate6;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetChangedKeyListMode_NoChangedChangedMode; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChangedKeyListMode_NoChangedChangedMode2; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam) == 0x000228, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, Temp_struct_Variable) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, Temp_struct_Variable2) == 0x000040, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, Temp_struct_Variable3) == 0x000058, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_WaitMessageEndFromBP_Result) == 0x000068, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, Temp_struct_Variable4) == 0x000078, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_WaitMessageEndFromBP_Result2) == 0x000088, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x000090, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, Temp_struct_Variable5) == 0x000098, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5) == 0x0000B8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CreateDelegate_OutputDelegate4) == 0x0000C0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_Event_bVisible) == 0x0000D0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_Event_SlideTargetOrigin) == 0x0000D4, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_Event_SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_Event_MaxSlideTargetSize) == 0x0000DC, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_Event_MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_Event_MinSlideTargetSize) == 0x0000E4, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_Event_MinSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_EventName) == 0x0000F0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_InItemBase) == 0x0000F8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_EventTag) == 0x000100, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchName_CmpSuccess) == 0x000108, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000109, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchName3_CmpSuccess) == 0x00010A, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00010B, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_MakeArray_Array) == 0x000110, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_InKeyType) == 0x000120, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_bIsPressed) == 0x000121, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchEnum_CmpSuccess) == 0x000122, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000123, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000124, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GetKeyStatus_ReturnValue) == 0x000128, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GetKeyStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchInteger_CmpSuccess) == 0x000168, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GetUMGManager_ReturnValue) == 0x000170, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000178, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000180, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_003_Steam) == 0x000188, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_003_Steam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_Sender3) == 0x000198, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_Sender3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_CurrentTextID3) == 0x0001A0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_CurrentTextID3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_SelectDialogIndex3) == 0x0001A8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_SelectDialogIndex3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchInteger2_CmpSuccess) == 0x0001AC, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_Sender2) == 0x0001B8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_CurrentTextID2) == 0x0001C0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_CurrentTextID2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_SelectDialogIndex2) == 0x0001C8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_SelectDialogIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchInteger3_CmpSuccess) == 0x0001CC, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CreateDelegate_OutputDelegate5) == 0x0001D0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_Sender) == 0x0001E0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_CurrentTextID) == 0x0001E8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CustomEvent_SelectDialogIndex) == 0x0001F0, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchInteger4_CmpSuccess) == 0x0001F4, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_CreateDelegate_OutputDelegate6) == 0x0001F8, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GetChangedKeyListMode_NoChangedChangedMode) == 0x000208, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GetChangedKeyListMode_NoChangedChangedMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_GetChangedKeyListMode_NoChangedChangedMode2) == 0x00020C, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_GetChangedKeyListMode_NoChangedChangedMode2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, K2Node_SwitchInteger5_CmpSuccess) == 0x000210, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000211, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000218, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000220, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000221, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_002_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.ChangeKeyConfigYN
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN) == 0x000018, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN, Sender) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangeKeyConfigYN::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.DefoultKeyYN
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN) == 0x000018, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN, Sender) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_DefoultKeyYN::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.ChangedCancelYN
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN) == 0x000018, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN, Sender) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ChangedCancelYN::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.KeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_KeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.SetDebugTargetSize
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlideTargetOrigin;                                 // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxSlideTargetSize;                                // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinSlideTargetSize;                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize) == 0x000004, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize) == 0x00001C, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize, bVisible) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize, SlideTargetOrigin) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize::SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize, MaxSlideTargetSize) == 0x00000C, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize::MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize, MinSlideTargetSize) == 0x000014, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetDebugTargetSize::MinSlideTargetSize' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.InitText
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText final
{
public:
	class FText                                   CallFunc_GetTextFromTextId_ReturnValue;            // 0x0000(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_TextHyphenation_OutLineTextArray;         // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText) == 0x000070, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_GetTextFromTextId_ReturnValue) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_GetTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_GetPanelSize_ReturnValue) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_BreakVector2D_Y) == 0x000034, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_TextHyphenation_OutLineTextArray) == 0x000038, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_TextHyphenation_OutLineTextArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_JoinStringArray_ReturnValue) == 0x000048, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_InitText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.SetCursorOffset
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset) == 0x000028, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, IsActive) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001D, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetCursorOffset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.SetWidgetKeyConfigSettei000
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000 final
{
public:
	class UWBP_Menu_Keyconfig_Settei_000_Steam_C* InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000) == 0x000008, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000, InWidget) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetWidgetKeyConfigSettei000::InWidget' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.ReFocusWidget
// 0x000C (0x000C - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget final
{
public:
	bool                                          IsInUp;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget) == 0x000004, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget) == 0x00000C, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget, IsInUp) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget::IsInUp' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_ReFocusWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.SetSetumeiVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible) == 0x000001, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible) == 0x000001, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible, IsVisible_0) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetSetumeiVisible::IsVisible_0' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.SetKeyAssignPanelPosition
// 0x000C (0x000C - 0x0000)
struct WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition final
{
public:
	struct FVector2D                              Position_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition) == 0x000004, "Wrong alignment on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition) == 0x00000C, "Wrong size on WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition, Position_0) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition::Position_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition, Visible) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_002_Steam_C_SetKeyAssignPanelPosition::Visible' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_002_Steam.WBP_Menu_Keyconfig_Settei_002_Steam_C.SetFocus001
// 0x0028 (0x0028 - 0x0000)
