#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_006_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_006_modern.WBP_Hud_Status_006_modern_C
// 0x0188 (0x05D0 - 0x0448)
class UWBP_Hud_Status_006_modern_C final : public UJackUMGHpMpBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Wait_3;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_End_3;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Wait_3;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Start_3;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait_2;                                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_End_2;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Wait_2;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Start_2;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait_1;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_End_1;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Wait_1;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Start_1;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait_0;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_End_0;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Wait_0;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Start_0;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StatusListPanel;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             WBP_Hud_Chara_Frame_001_0;                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             WBP_Hud_Chara_Frame_001_1;                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             WBP_Hud_Chara_Frame_001_2;                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             WBP_Hud_Chara_Frame_001_3;                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_003_modern_C*           WBP_Hud_Status_003_0;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_003_modern_C*           WBP_Hud_Status_003_1;                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_003_modern_C*           WBP_Hud_Status_003_2;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_003_modern_C*           WBP_Hud_Status_003_3;                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_005_modern_C*           WBP_Hud_Status_005_0;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_005_modern_C*           WBP_Hud_Status_005_1;                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_005_modern_C*           WBP_Hud_Status_005_2;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_005_modern_C*           WBP_Hud_Status_005_3;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_Face2_modern_C*         WBP_Hud_Status_Face2_modern;                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         OffsetY;                                           // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CountM;                                            // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountR;                                            // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               WaitAnim;                                          // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWidgetAnimation*>               ActiveStartAnim;                                   // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWidgetAnimation*>               ActiveWaitAnim;                                    // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWidgetAnimation*>               ActiveEndAnim;                                     // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWBP_Hud_Chara_Frame_001_C*>     Plate;                                             // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          FieldDamage;                                       // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FieldDamageTime;                                   // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Hud_Status_003_modern_C*>   HudStatus003;                                      // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         FieldDamegeTimeVar;                                // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCloseAnim;                                       // 0x05C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                NewVar_0;                                          // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_006_modern(int32 EntryPoint);
	void ChangePhotoModeDelegate_Event_0(bool bIsPhotoMode);
	void CustomEvent_4(int32 Type, int32 Index_0);
	void CustomEvent_3(bool IsShort, EJackUIFaceIcon InType, int32 Index_0);
	void CustomEvent_2();
	void CustomEvent_0(int32 Index_0, int32 Acion, EJackUMGHudAnimationAction AnimType);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetAnimation(int32 Index_0, EJackUMGHudAnimationAction AnimType);
	void CustomEvent_1(EJackUMGHudAnimationAction AnimType, bool IsFieldDamage);
	void Construct();
	void InitializeHudStatus();
	void SetAllAnimation();
	void SetHud003RenkeiActive(bool Inactive, int32 InIndex);
	void IsHud003RenkeiActive(int32 Index_0, bool* Active);
	void IsActivePosition(int32 Index_0, bool* Active);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_006_modern_C">();
	}
	static class UWBP_Hud_Status_006_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_006_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_006_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_006_modern_C");
static_assert(sizeof(UWBP_Hud_Status_006_modern_C) == 0x0005D0, "Wrong size on UWBP_Hud_Status_006_modern_C");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, UberGraphFrame) == 0x000448, "Member 'UWBP_Hud_Status_006_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Wait_3) == 0x000450, "Member 'UWBP_Hud_Status_006_modern_C::Wait_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_End_3) == 0x000458, "Member 'UWBP_Hud_Status_006_modern_C::Active_End_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Wait_3) == 0x000460, "Member 'UWBP_Hud_Status_006_modern_C::Active_Wait_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Start_3) == 0x000468, "Member 'UWBP_Hud_Status_006_modern_C::Active_Start_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Wait_2) == 0x000470, "Member 'UWBP_Hud_Status_006_modern_C::Wait_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_End_2) == 0x000478, "Member 'UWBP_Hud_Status_006_modern_C::Active_End_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Wait_2) == 0x000480, "Member 'UWBP_Hud_Status_006_modern_C::Active_Wait_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Start_2) == 0x000488, "Member 'UWBP_Hud_Status_006_modern_C::Active_Start_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Wait_1) == 0x000490, "Member 'UWBP_Hud_Status_006_modern_C::Wait_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_End_1) == 0x000498, "Member 'UWBP_Hud_Status_006_modern_C::Active_End_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Wait_1) == 0x0004A0, "Member 'UWBP_Hud_Status_006_modern_C::Active_Wait_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Start_1) == 0x0004A8, "Member 'UWBP_Hud_Status_006_modern_C::Active_Start_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Wait_0) == 0x0004B0, "Member 'UWBP_Hud_Status_006_modern_C::Wait_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_End_0) == 0x0004B8, "Member 'UWBP_Hud_Status_006_modern_C::Active_End_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Wait_0) == 0x0004C0, "Member 'UWBP_Hud_Status_006_modern_C::Active_Wait_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Active_Start_0) == 0x0004C8, "Member 'UWBP_Hud_Status_006_modern_C::Active_Start_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, RootPanel) == 0x0004D0, "Member 'UWBP_Hud_Status_006_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, StatusListPanel) == 0x0004D8, "Member 'UWBP_Hud_Status_006_modern_C::StatusListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Chara_Frame_001_0) == 0x0004E0, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Chara_Frame_001_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Chara_Frame_001_1) == 0x0004E8, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Chara_Frame_001_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Chara_Frame_001_2) == 0x0004F0, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Chara_Frame_001_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Chara_Frame_001_3) == 0x0004F8, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Chara_Frame_001_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_003_0) == 0x000500, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_003_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_003_1) == 0x000508, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_003_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_003_2) == 0x000510, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_003_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_003_3) == 0x000518, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_003_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_005_0) == 0x000520, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_005_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_005_1) == 0x000528, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_005_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_005_2) == 0x000530, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_005_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_005_3) == 0x000538, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_005_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WBP_Hud_Status_Face2_modern) == 0x000540, "Member 'UWBP_Hud_Status_006_modern_C::WBP_Hud_Status_Face2_modern' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, OffsetY) == 0x000548, "Member 'UWBP_Hud_Status_006_modern_C::OffsetY' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, CountM) == 0x00054C, "Member 'UWBP_Hud_Status_006_modern_C::CountM' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Opened) == 0x000550, "Member 'UWBP_Hud_Status_006_modern_C::Opened' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, CountR) == 0x000554, "Member 'UWBP_Hud_Status_006_modern_C::CountR' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, WaitAnim) == 0x000558, "Member 'UWBP_Hud_Status_006_modern_C::WaitAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, ActiveStartAnim) == 0x000568, "Member 'UWBP_Hud_Status_006_modern_C::ActiveStartAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, ActiveWaitAnim) == 0x000578, "Member 'UWBP_Hud_Status_006_modern_C::ActiveWaitAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, ActiveEndAnim) == 0x000588, "Member 'UWBP_Hud_Status_006_modern_C::ActiveEndAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, Plate) == 0x000598, "Member 'UWBP_Hud_Status_006_modern_C::Plate' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, FieldDamage) == 0x0005A8, "Member 'UWBP_Hud_Status_006_modern_C::FieldDamage' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, FieldDamageTime) == 0x0005AC, "Member 'UWBP_Hud_Status_006_modern_C::FieldDamageTime' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, HudStatus003) == 0x0005B0, "Member 'UWBP_Hud_Status_006_modern_C::HudStatus003' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, FieldDamegeTimeVar) == 0x0005C0, "Member 'UWBP_Hud_Status_006_modern_C::FieldDamegeTimeVar' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, IsCloseAnim) == 0x0005C4, "Member 'UWBP_Hud_Status_006_modern_C::IsCloseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_006_modern_C, NewVar_0) == 0x0005C8, "Member 'UWBP_Hud_Status_006_modern_C::NewVar_0' has a wrong offset!");

}

