#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Casino_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Casino_000_modern.WBP_Menu_Casino_000_modern_C
// 0x0050 (0x03C0 - 0x0370)
class UWBP_Menu_Casino_000_modern_C final : public UJackUMGCasinoCoinBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 IconCoinPanel;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGold;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconHoujuPanel;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_6;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_40;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_090_modern_C*      WBP_Menu_Parts_Text_090;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_090_modern_C*      WBP_Menu_Parts_Text_090_0;                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_1;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ExchangeRate;                                      // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGShopType                              DisplayShopType;                                   // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Casino_000_modern(int32 EntryPoint);
	void UpdateWindowCasino(int32 InCasinoCoin);
	void Construct();
	void UpdateWindow();
	void SetupDisplayMode(EJackUMGShopType InDisplayShopType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Casino_000_modern_C">();
	}
	static class UWBP_Menu_Casino_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Casino_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Casino_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Casino_000_modern_C");
static_assert(sizeof(UWBP_Menu_Casino_000_modern_C) == 0x0003C0, "Wrong size on UWBP_Menu_Casino_000_modern_C");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Casino_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, IconCoinPanel) == 0x000378, "Member 'UWBP_Menu_Casino_000_modern_C::IconCoinPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, IconGold) == 0x000380, "Member 'UWBP_Menu_Casino_000_modern_C::IconGold' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, IconHoujuPanel) == 0x000388, "Member 'UWBP_Menu_Casino_000_modern_C::IconHoujuPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, WBP_Menu_Parts_024_C_6) == 0x000390, "Member 'UWBP_Menu_Casino_000_modern_C::WBP_Menu_Parts_024_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, WBP_Menu_Parts_024_C_40) == 0x000398, "Member 'UWBP_Menu_Casino_000_modern_C::WBP_Menu_Parts_024_C_40' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, WBP_Menu_Parts_Text_090) == 0x0003A0, "Member 'UWBP_Menu_Casino_000_modern_C::WBP_Menu_Parts_Text_090' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, WBP_Menu_Parts_Text_090_0) == 0x0003A8, "Member 'UWBP_Menu_Casino_000_modern_C::WBP_Menu_Parts_Text_090_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, Window_Line_1) == 0x0003B0, "Member 'UWBP_Menu_Casino_000_modern_C::Window_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, ExchangeRate) == 0x0003B8, "Member 'UWBP_Menu_Casino_000_modern_C::ExchangeRate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_000_modern_C, DisplayShopType) == 0x0003BC, "Member 'UWBP_Menu_Casino_000_modern_C::DisplayShopType' has a wrong offset!");

}

