#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_007_Steam

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_007_Steam.WBP_Menu_Sakusen_Settei_007_Steam_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam) == 0x0000E8, "Wrong size on WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, Temp_struct_Variable) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, Temp_struct_Variable2) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CustomEvent_EventTag) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_WaitMessageEndFromBP_Result) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CustomEvent_EventName) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CustomEvent_InItemBase) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_SwitchName3_CmpSuccess) == 0x000079, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_SwitchName4_CmpSuccess) == 0x00007A, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_GetUMGManager_ReturnValue) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CustomEvent_Sender) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CustomEvent_CurrentTextID) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CustomEvent_SelectDialogIndex) == 0x0000B0, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_SwitchInteger_CmpSuccess) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_GetUMGManager_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, K2Node_CreateDelegate_OutputDelegate3) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam, CallFunc_IsOpenSerifuWindow_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_007_Steam::CallFunc_IsOpenSerifuWindow_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_007_Steam.WBP_Menu_Sakusen_Settei_007_Steam_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_007_Steam.WBP_Menu_Sakusen_Settei_007_Steam_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_007_Steam.WBP_Menu_Sakusen_Settei_007_Steam_C.SaveAndBack
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack, CallFunc_GetValue_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_SaveAndBack::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_007_Steam.WBP_Menu_Sakusen_Settei_007_Steam_C.SelectTextSet
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet final
{
public:
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFrameRateLimit_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet, CallFunc_GetFrameRateLimit_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_SelectTextSet::CallFunc_GetFrameRateLimit_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_007_Steam.WBP_Menu_Sakusen_Settei_007_Steam_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_007_Steam_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

}

