#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_Item_002_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C.ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagType_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLoaddedTextureFromId_ReturnValue;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemOsyareIconTexture_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern");
static_assert(sizeof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern) == 0x000080, "Wrong size on WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_Event_InItemData) == 0x000018, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetDataIndex_ReturnValue) == 0x000020, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetBagType_ReturnValue) == 0x000024, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, Temp_bool_Variable2) == 0x000027, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_Not_PreBool_ReturnValue2) == 0x000029, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_Select_Default) == 0x00002A, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_Not_PreBool_ReturnValue3) == 0x00002B, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000030, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue) == 0x000038, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x000048, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_CustomEvent_InResultCode) == 0x000050, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_CustomEvent_InLoaddedObject) == 0x000058, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_CustomEvent_InLoadInfo) == 0x000060, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, Temp_byte_Variable3) == 0x000068, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_SetLoaddedTextureFromId_ReturnValue) == 0x000069, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_SetLoaddedTextureFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, Temp_byte_Variable4) == 0x00006A, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_Select2_Default) == 0x00006B, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00006C, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern, CallFunc_GetItemOsyareIconTexture_ReturnValue) == 0x000078, "Member 'WBP_Menu_Shop_Item_002_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_002_modern::CallFunc_GetItemOsyareIconTexture_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C.ASyncLoadTextureDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate");
static_assert(sizeof(WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate) == 0x000018, "Wrong size on WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate, InResultCode) == 0x000000, "Member 'WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Shop_Item_002_modern_C_ASyncLoadTextureDelegate::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_Item_002_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_002_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_002_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Shop_Item_002_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_002_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Shop_Item_002_modern_C_DrawItemBase::InItemData' has a wrong offset!");

// Function WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C.SetUnitTextId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId final
{
public:
	class FName                                   InUnitTextId;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId");
static_assert(sizeof(WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId) == 0x000010, "Wrong size on WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId, InUnitTextId) == 0x000000, "Member 'WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Shop_Item_002_modern_C_SetUnitTextId::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C.CancelLoadTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture");
static_assert(sizeof(WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Shop_Item_002_modern_C_CancelLoadTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Shop_Item_002_modern.WBP_Menu_Shop_Item_002_modern_C.SetPossessionAmount
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount final
{
public:
	int32                                         InPossessionAmount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount) == 0x000004, "Wrong alignment on WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount");
static_assert(sizeof(WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount) == 0x000004, "Wrong size on WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount");
static_assert(offsetof(WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount, InPossessionAmount) == 0x000000, "Member 'WBP_Menu_Shop_Item_002_modern_C_SetPossessionAmount::InPossessionAmount' has a wrong offset!");

}

