#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Triangle_000_modern

#include "Basic.hpp"

#include "WBP_Menu_Parts_Text_000_classes.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Common_Triangle_000_modern.WBP_Menu_Common_Triangle_000_modern_C
// 0x0018 (0x03E8 - 0x03D0)
class UWBP_Menu_Common_Triangle_000_modern_C final : public UWBP_Menu_Parts_Text_000_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Image_1;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBP_Menu_Parts_Text_080;                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Common_Triangle_000_modern(int32 EntryPoint);
	void Construct();
	void SetCaptionJustification(ETextJustify InJustification);
	void SetCharacterSpacing(float InCharacterSpacing);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Common_Triangle_000_modern_C">();
	}
	static class UWBP_Menu_Common_Triangle_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Common_Triangle_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Common_Triangle_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Common_Triangle_000_modern_C");
static_assert(sizeof(UWBP_Menu_Common_Triangle_000_modern_C) == 0x0003E8, "Wrong size on UWBP_Menu_Common_Triangle_000_modern_C");
static_assert(offsetof(UWBP_Menu_Common_Triangle_000_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Common_Triangle_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Triangle_000_modern_C, Image_1) == 0x0003D8, "Member 'UWBP_Menu_Common_Triangle_000_modern_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Triangle_000_modern_C, WBP_Menu_Parts_Text_080) == 0x0003E0, "Member 'UWBP_Menu_Common_Triangle_000_modern_C::WBP_Menu_Parts_Text_080' has a wrong offset!");

}

