#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_ItemList_Window_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Senreki_ItemList_Window_001_modern.WBP_Menu_Senreki_ItemList_Window_001_modern_C
// 0x0198 (0x0598 - 0x0400)
class UWBP_Menu_Senreki_ItemList_Window_001_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           AccessoryList;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           BouguList;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           BukiList;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel_1;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel_2;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CategoryAccessory;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CategoryBougu;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CategoryBuki;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Information;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListCategory;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_5;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_6;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_7;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_8;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_18;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_19;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_21;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_22;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_23;                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_28;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_29;                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_78;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_79;                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_80;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_81;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_82;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_84;                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_85;                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_86;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_502;                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_503;                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_504;                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_505;                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_506;                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_507;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_508;                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_509;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           WBP_Menu_Parts_006;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_8;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           WBP_Menu_Parts_037_C_426;                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EJackCharacter                                SelectedCharType;                                  // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CharSoubiData;                                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiList*                      SoubiList;                                         // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiState*                     SoubiState;                                        // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharacterName;                                     // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsShowTokugi;                                      // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           Category;                                          // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempCount;                                         // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempCount1;                                        // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_001_modern(int32 EntryPoint);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void CustomEvent_0(class FName EventTag);
	void Construct();
	void SelectCategoryList(class UCanvasPanel** OutCategory);
	void CheckItemsCount();
	void SetClassification(class FName InName);
	void SetDisplayColorBuki();
	void SetDisplayColorBougu();
	void SetDisplayColorAccessory();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Senreki_ItemList_Window_001_modern_C">();
	}
	static class UWBP_Menu_Senreki_ItemList_Window_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Senreki_ItemList_Window_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Senreki_ItemList_Window_001_modern_C");
static_assert(sizeof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C) == 0x000598, "Wrong size on UWBP_Menu_Senreki_ItemList_Window_001_modern_C");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, AccessoryList) == 0x000408, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::AccessoryList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, BouguList) == 0x000410, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::BouguList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, BukiList) == 0x000418, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::BukiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CaptionPanel_1) == 0x000420, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CaptionPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CaptionPanel_2) == 0x000428, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CaptionPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CategoryAccessory) == 0x000430, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CategoryAccessory' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CategoryBougu) == 0x000438, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CategoryBougu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CategoryBuki) == 0x000440, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CategoryBuki' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, Information) == 0x000448, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::Information' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, InvalidationBox_0) == 0x000450, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, ItemListCategory) == 0x000458, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::ItemListCategory' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_5) == 0x000460, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_6) == 0x000468, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_7) == 0x000470, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_8) == 0x000478, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_18) == 0x000480, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_19) == 0x000488, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_21) == 0x000490, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_21' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_22) == 0x000498, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_22' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_23) == 0x0004A0, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_23' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_28) == 0x0004A8, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_28' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_29) == 0x0004B0, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_29' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_78) == 0x0004B8, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_78' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_79) == 0x0004C0, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_79' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_80) == 0x0004C8, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_80' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_81) == 0x0004D0, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_81' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_82) == 0x0004D8, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_82' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_84) == 0x0004E0, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_84' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_85) == 0x0004E8, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_85' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_86) == 0x0004F0, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_86' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_502) == 0x0004F8, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_502' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_503) == 0x000500, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_503' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_504) == 0x000508, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_504' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_505) == 0x000510, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_505' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_506) == 0x000518, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_506' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_507) == 0x000520, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_507' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_508) == 0x000528, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_508' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_000_C_509) == 0x000530, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_000_C_509' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_006) == 0x000538, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_024_C_8) == 0x000540, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_024_C_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, WBP_Menu_Parts_037_C_426) == 0x000548, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::WBP_Menu_Parts_037_C_426' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, SelectedCharType) == 0x000550, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::SelectedCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CharSoubiData) == 0x000558, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CharSoubiData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, SoubiList) == 0x000560, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::SoubiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, SoubiState) == 0x000568, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::SoubiState' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, CharacterName) == 0x000570, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, IsShowTokugi) == 0x000580, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::IsShowTokugi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, Category) == 0x000588, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::Category' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, TempCount) == 0x000590, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::TempCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_ItemList_Window_001_modern_C, TempCount1) == 0x000594, "Member 'UWBP_Menu_Senreki_ItemList_Window_001_modern_C::TempCount1' has a wrong offset!");

}

