#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_CS_Skip_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_CS_Skip_001_modern.WBP_Hud_CS_Skip_001_modern_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_Hud_CS_Skip_001_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBP_Menu_Parts_Text_080;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bStartedMatineeRenkei;                             // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern(int32 EntryPoint);
	void Construct();
	void OnWidgetNotification(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_CS_Skip_001_modern_C">();
	}
	static class UWBP_Hud_CS_Skip_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_CS_Skip_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_CS_Skip_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_CS_Skip_001_modern_C");
static_assert(sizeof(UWBP_Hud_CS_Skip_001_modern_C) == 0x000398, "Wrong size on UWBP_Hud_CS_Skip_001_modern_C");
static_assert(offsetof(UWBP_Hud_CS_Skip_001_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_CS_Skip_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_CS_Skip_001_modern_C, InvalidationBox_0) == 0x000378, "Member 'UWBP_Hud_CS_Skip_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_CS_Skip_001_modern_C, RootPanel) == 0x000380, "Member 'UWBP_Hud_CS_Skip_001_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_CS_Skip_001_modern_C, WBP_Menu_Parts_Text_080) == 0x000388, "Member 'UWBP_Hud_CS_Skip_001_modern_C::WBP_Menu_Parts_Text_080' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_CS_Skip_001_modern_C, bStartedMatineeRenkei) == 0x000390, "Member 'UWBP_Hud_CS_Skip_001_modern_C::bStartedMatineeRenkei' has a wrong offset!");

}

