#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Icon3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Menu_Parts_Buff_001_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_Icon3.WBP_Hud_Status_Icon3_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_Hud_Status_Icon3_C final : public UWBP_Menu_Parts_Buff_001_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           RootPanel;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlideNumberPanel;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TexturePanel;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_Icon3(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetAlpha(float InAlpha);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_Icon3_C">();
	}
	static class UWBP_Hud_Status_Icon3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_Icon3_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_Icon3_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_Icon3_C");
static_assert(sizeof(UWBP_Hud_Status_Icon3_C) == 0x000480, "Wrong size on UWBP_Hud_Status_Icon3_C");
static_assert(offsetof(UWBP_Hud_Status_Icon3_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Hud_Status_Icon3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Icon3_C, RootPanel) == 0x000468, "Member 'UWBP_Hud_Status_Icon3_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Icon3_C, SlideNumberPanel) == 0x000470, "Member 'UWBP_Hud_Status_Icon3_C::SlideNumberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Icon3_C, TexturePanel) == 0x000478, "Member 'UWBP_Hud_Status_Icon3_C::TexturePanel' has a wrong offset!");

}

