#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Syuurenjou_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Syuurenjou_001_modern.WBP_Menu_Syuurenjou_001_modern_C.ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern
// 0x0180 (0x0180 - 0x0000)
struct WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSyuurenjouItemData*             K2Node_CustomEvent_Data;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue; // 0x0038(0x0048)()
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue2; // 0x0080(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	class FName                                   K2Node_Select_Default;                             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select2_Default;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0130(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue2;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x0168(0x0018)()
};
static_assert(alignof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern");
static_assert(sizeof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern) == 0x000180, "Wrong size on WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, Temp_name_Variable2) == 0x000010, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, Temp_bool_Variable2) == 0x000018, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, Temp_name_Variable3) == 0x000020, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, Temp_name_Variable4) == 0x000028, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, K2Node_CustomEvent_Data) == 0x000030, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue) == 0x000038, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, K2Node_MakeArray_Array2) == 0x0000D8, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, K2Node_Select_Default) == 0x000100, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_GetText_ReturnValue) == 0x000108, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_ReplaceMessageTag_ReturnValue) == 0x000118, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_ReplaceMessageTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, K2Node_Select2_Default) == 0x000128, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x000130, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_GetText_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_ReplaceMessageTag_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_ReplaceMessageTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern, CallFunc_Conv_StringToText_ReturnValue3) == 0x000168, "Member 'WBP_Menu_Syuurenjou_001_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_001_modern::CallFunc_Conv_StringToText_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Syuurenjou_001_modern.WBP_Menu_Syuurenjou_001_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Syuurenjou_001_modern_C_SetData final
{
public:
	class UJackUMGSyuurenjouItemData*             Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Syuurenjou_001_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Syuurenjou_001_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Syuurenjou_001_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Syuurenjou_001_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Syuurenjou_001_modern_C_SetData, Data) == 0x000000, "Member 'WBP_Menu_Syuurenjou_001_modern_C_SetData::Data' has a wrong offset!");

}

