#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_Status_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tuyosa_Status_000_modern.WBP_Menu_Tuyosa_Status_000_modern_C.ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern
// 0x0170 (0x0170 - 0x0000)
struct WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorMemberDataInTuyosa*     K2Node_CustomEvent_TuyosaData;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue3;                     // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue4;                     // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue5;                     // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue12;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0158(0x0018)()
};
static_assert(alignof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern");
static_assert(sizeof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern) == 0x000170, "Wrong size on WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, K2Node_CustomEvent_TuyosaData) == 0x000018, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::K2Node_CustomEvent_TuyosaData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000020, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000030, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000038, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetText_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetText_ReturnValue3) == 0x000060, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue3) == 0x000080, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue4) == 0x000090, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetText_ReturnValue4) == 0x0000A0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue5) == 0x0000B0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue6) == 0x0000C0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue7) == 0x0000D0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue8) == 0x0000E0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue9) == 0x0000F0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_GetText_ReturnValue5) == 0x000100, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_GetText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue10) == 0x000128, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue11) == 0x000138, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Concat_StrStr_ReturnValue12) == 0x000148, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Concat_StrStr_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_Status_000_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Tuyosa_Status_000_modern.WBP_Menu_Tuyosa_Status_000_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tuyosa_Status_000_modern_C_SetData final
{
public:
	class UJackUMGAccessorMemberDataInTuyosa*     TuyosaData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_Status_000_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_Status_000_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Tuyosa_Status_000_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_Status_000_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_SetData, TuyosaData) == 0x000000, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_SetData::TuyosaData' has a wrong offset!");

// Function WBP_Menu_Tuyosa_Status_000_modern.WBP_Menu_Tuyosa_Status_000_modern_C.InitParamValue
// 0x0110 (0x0110 - 0x0000)
struct WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue final
{
public:
	class UJackGameCharacter*                     GameCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WorkText;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 WorkValueList;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CallFunc_GetSubayasa_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSyubiryoku_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKougekiryoku_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrialLevelLimit_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackCharacterSystem*                   CallFunc_GetJackCharacterSystem_ReturnValue;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingExpToNextLevel_ReturnValue;   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue2;             // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue");
static_assert(sizeof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue) == 0x000110, "Wrong size on WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, GameCharacter) == 0x000000, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::GameCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, WorkText) == 0x000008, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::WorkText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, WorkValueList) == 0x000018, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::WorkValueList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetSubayasa_ReturnValue) == 0x000028, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetSubayasa_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetSyubiryoku_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetSyubiryoku_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetKougekiryoku_ReturnValue) == 0x000030, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetKougekiryoku_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetAccessorMembers_ReturnValue) == 0x000050, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_IsTrialLevelLimit_ReturnValue) == 0x00005C, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_IsTrialLevelLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetAsciiDecText_ReturnValue) == 0x000060, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, Temp_int_Loop_Counter_Variable) == 0x0000B0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetText_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Concat_StrStr_ReturnValue3) == 0x0000C8, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetJackCharacterSystem_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetJackCharacterSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetRemainingExpToNextLevel_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetRemainingExpToNextLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_GetAsciiDecText_ReturnValue2) == 0x0000F0, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue, CallFunc_Concat_StrStr_ReturnValue4) == 0x000100, "Member 'WBP_Menu_Tuyosa_Status_000_modern_C_InitParamValue::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");

}

