#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Fukidasi_Window_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Fukidasi_Window_000_modern.WBP_Hud_Fukidasi_Window_000_modern_C
// 0x00D0 (0x0440 - 0x0370)
class UWBP_Hud_Fukidasi_Window_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Icon_In;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FukidasiPanel;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImagePanel;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           IconPanel;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sippo;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SippoOutLine;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_000;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_001;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              IconPosition;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempAlpha;                                         // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TextArray;                                         // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 LineText1;                                         // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 LineText2;                                         // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   FukidasiColorTable;                                // 0x0418(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UTexture2D*>                     IconTextureTable;                                  // 0x0428(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class UTexture2D*                             IconTextureRef;                                    // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Fukidasi_Window_000_modern(int32 EntryPoint);
	void PhotoModeEvent(bool bIsPhotoMode);
	void SetMessage(const class FString& Message);
	void Construct();
	void ApplyIconScale(const struct FVector& Scale_0);
	void ApplyImportance(EJackNPCImportance Importance);
	void ApplyIconAlpha(float InAlpha);
	void UpdateData(class UJackUMGFukidasiData* Data);
	void ApplyData(class UJackUMGFukidasiData* Data);
	void SetFukidasiSize(float In_Size_X, float In_Size_Y);
	void ApplyScale(const struct FVector& Scale_0);
	void ApplyAlpha(float Alpha_0);
	void HideFukidasi();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Fukidasi_Window_000_modern_C">();
	}
	static class UWBP_Hud_Fukidasi_Window_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Fukidasi_Window_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Fukidasi_Window_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Fukidasi_Window_000_modern_C");
static_assert(sizeof(UWBP_Hud_Fukidasi_Window_000_modern_C) == 0x000440, "Wrong size on UWBP_Hud_Fukidasi_Window_000_modern_C");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, Icon_In) == 0x000378, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::Icon_In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, FukidasiPanel) == 0x000380, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::FukidasiPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, IconImagePanel) == 0x000388, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::IconImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, IconPanel) == 0x000390, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::IconPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, RootPanel) == 0x000398, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, Sippo) == 0x0003A0, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::Sippo' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, SippoOutLine) == 0x0003A8, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::SippoOutLine' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, Text_000) == 0x0003B0, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::Text_000' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, Text_001) == 0x0003B8, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::Text_001' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, WindowFrame) == 0x0003C0, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, IconPosition) == 0x0003C8, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::IconPosition' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, Color) == 0x0003D0, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::Color' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, TempAlpha) == 0x0003E0, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::TempAlpha' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, TextArray) == 0x0003E8, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::TextArray' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, LineText1) == 0x0003F8, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::LineText1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, LineText2) == 0x000408, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::LineText2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, FukidasiColorTable) == 0x000418, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::FukidasiColorTable' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, IconTextureTable) == 0x000428, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::IconTextureTable' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Fukidasi_Window_000_modern_C, IconTextureRef) == 0x000438, "Member 'UWBP_Hud_Fukidasi_Window_000_modern_C::IconTextureRef' has a wrong offset!");

}

