#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_048

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_048.WBP_Menu_Parts_048_C
// 0x0050 (0x03C0 - 0x0370)
class UWBP_Menu_Parts_048_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow_Down;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Down_Disable;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Up;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_UP_Disable;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StratumBase;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StratumCursorPanel;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSpinnerAvailable;                                 // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUpArrowEnabled;                                   // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDownArrowEnabled;                                 // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackWorldMapState>                    SpinnerDisableStates;                              // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_048(int32 EntryPoint);
	void CustomEvent_0(class FName EventTag);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetUpArrowEnabled(bool bEnabled);
	void SetDownArrowEnabled(bool bEnabled);
	void SetSpinnerAvailable(bool bAvailable);
	void UpdateUpArrowEnabled(bool bVisible);
	void UpdateDownArrowEnabled(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_048_C">();
	}
	static class UWBP_Menu_Parts_048_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_048_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_048_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_048_C");
static_assert(sizeof(UWBP_Menu_Parts_048_C) == 0x0003C0, "Wrong size on UWBP_Menu_Parts_048_C");
static_assert(offsetof(UWBP_Menu_Parts_048_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Parts_048_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, Arrow_Down) == 0x000378, "Member 'UWBP_Menu_Parts_048_C::Arrow_Down' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, Arrow_Down_Disable) == 0x000380, "Member 'UWBP_Menu_Parts_048_C::Arrow_Down_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, Arrow_Up) == 0x000388, "Member 'UWBP_Menu_Parts_048_C::Arrow_Up' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, Arrow_UP_Disable) == 0x000390, "Member 'UWBP_Menu_Parts_048_C::Arrow_UP_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, StratumBase) == 0x000398, "Member 'UWBP_Menu_Parts_048_C::StratumBase' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, StratumCursorPanel) == 0x0003A0, "Member 'UWBP_Menu_Parts_048_C::StratumCursorPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, bSpinnerAvailable) == 0x0003A8, "Member 'UWBP_Menu_Parts_048_C::bSpinnerAvailable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, bUpArrowEnabled) == 0x0003A9, "Member 'UWBP_Menu_Parts_048_C::bUpArrowEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, bDownArrowEnabled) == 0x0003AA, "Member 'UWBP_Menu_Parts_048_C::bDownArrowEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_048_C, SpinnerDisableStates) == 0x0003B0, "Member 'UWBP_Menu_Parts_048_C::SpinnerDisableStates' has a wrong offset!");

}

