#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Buff_001

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_Buff_001.WBP_Menu_Parts_Buff_001_C
// 0x0090 (0x0460 - 0x03D0)
class UWBP_Menu_Parts_Buff_001_C : public UJackUMGItemBase
{
public:
	struct FVector2D                              IconPosition;                                      // 0x03D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TexUVOffset;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconIndex;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconMargin;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimSpeed;                                         // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimTime;                                          // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimIndex;                                         // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSetOddEffectId;                                  // 0x03FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OddEffectID;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TexturePanelRef;                                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumAnimIndex;                                      // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      TexturePositionTable;                              // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         BuffIconSize;                                      // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 SlidePanelRef;                                     // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      SlideIconPositionTable;                            // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 SlideIconIndexTable;                               // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bIsTexturePanel;                                   // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsShowTrigger;                                     // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ESlateVisibility                              HideVisibirityMode;                                // 0x045A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetOddEffectId(class FName InOddEffectId, int32 InSlideValue, bool* Debuff);
	void UpdateDraw(float InDeltaTime);
	void InitOddEffectWidget(class UImage* TexturePanelRef_0, class UImage* InSlidePanelRef, bool bIsTexturePanel_0);
	void ShowDokuIcon(bool bIsDoku);
	void SetIconFromOddEffectId(class FName InOddEffectId, bool* IsDebuff);
	void SetIconFromOddEffectStatusId(class FName InOffEffectStatusId, bool* IsDebuff);
	void SetIconFromCharacterAndAcionId();
	void SetSlideValue(int32 InSlideValue);
	void IsSetOddEffect(bool* NewParam);
	void GetVisibirityOddEffect(ESlateVisibility* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_Buff_001_C">();
	}
	static class UWBP_Menu_Parts_Buff_001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_Buff_001_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_Buff_001_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_Buff_001_C");
static_assert(sizeof(UWBP_Menu_Parts_Buff_001_C) == 0x000460, "Wrong size on UWBP_Menu_Parts_Buff_001_C");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, IconPosition) == 0x0003D0, "Member 'UWBP_Menu_Parts_Buff_001_C::IconPosition' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, TexUVOffset) == 0x0003D8, "Member 'UWBP_Menu_Parts_Buff_001_C::TexUVOffset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, IconIndex) == 0x0003E0, "Member 'UWBP_Menu_Parts_Buff_001_C::IconIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, IconMargin) == 0x0003E8, "Member 'UWBP_Menu_Parts_Buff_001_C::IconMargin' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, AnimSpeed) == 0x0003F0, "Member 'UWBP_Menu_Parts_Buff_001_C::AnimSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, AnimTime) == 0x0003F4, "Member 'UWBP_Menu_Parts_Buff_001_C::AnimTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, AnimIndex) == 0x0003F8, "Member 'UWBP_Menu_Parts_Buff_001_C::AnimIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, IsSetOddEffectId) == 0x0003FC, "Member 'UWBP_Menu_Parts_Buff_001_C::IsSetOddEffectId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, OddEffectID) == 0x000400, "Member 'UWBP_Menu_Parts_Buff_001_C::OddEffectID' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, TexturePanelRef) == 0x000408, "Member 'UWBP_Menu_Parts_Buff_001_C::TexturePanelRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, NumAnimIndex) == 0x000410, "Member 'UWBP_Menu_Parts_Buff_001_C::NumAnimIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, TexturePositionTable) == 0x000418, "Member 'UWBP_Menu_Parts_Buff_001_C::TexturePositionTable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, BuffIconSize) == 0x000428, "Member 'UWBP_Menu_Parts_Buff_001_C::BuffIconSize' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, SlidePanelRef) == 0x000430, "Member 'UWBP_Menu_Parts_Buff_001_C::SlidePanelRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, SlideIconPositionTable) == 0x000438, "Member 'UWBP_Menu_Parts_Buff_001_C::SlideIconPositionTable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, SlideIconIndexTable) == 0x000448, "Member 'UWBP_Menu_Parts_Buff_001_C::SlideIconIndexTable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, bIsTexturePanel) == 0x000458, "Member 'UWBP_Menu_Parts_Buff_001_C::bIsTexturePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, IsShowTrigger) == 0x000459, "Member 'UWBP_Menu_Parts_Buff_001_C::IsShowTrigger' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_001_C, HideVisibirityMode) == 0x00045A, "Member 'UWBP_Menu_Parts_Buff_001_C::HideVisibirityMode' has a wrong offset!");

}

