#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_PlayGoBase_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_PlayGoBase_modern.WBP_Menu_PlayGoBase_modern_C
// 0x0020 (0x0390 - 0x0370)
class UWBP_Menu_PlayGoBase_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWBP_Menu_Parts_007_modern_C*           Parts007_Text_RemineTime;                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           Parts006_Text_Description;                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlackBackLayout;                                  // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EJackPlayGoMenuType                           PlayGoType;                                        // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_PlayGoBase_modern(int32 EntryPoint);
	void SetMeasuringText();
	void Close();
	void SetData(EJackPlayGoMenuType Type);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_PlayGoBase_modern_C">();
	}
	static class UWBP_Menu_PlayGoBase_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_PlayGoBase_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_PlayGoBase_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_PlayGoBase_modern_C");
static_assert(sizeof(UWBP_Menu_PlayGoBase_modern_C) == 0x000390, "Wrong size on UWBP_Menu_PlayGoBase_modern_C");
static_assert(offsetof(UWBP_Menu_PlayGoBase_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_PlayGoBase_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_PlayGoBase_modern_C, Parts007_Text_RemineTime) == 0x000378, "Member 'UWBP_Menu_PlayGoBase_modern_C::Parts007_Text_RemineTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_PlayGoBase_modern_C, Parts006_Text_Description) == 0x000380, "Member 'UWBP_Menu_PlayGoBase_modern_C::Parts006_Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_PlayGoBase_modern_C, bBlackBackLayout) == 0x000388, "Member 'UWBP_Menu_PlayGoBase_modern_C::bBlackBackLayout' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_PlayGoBase_modern_C, PlayGoType) == 0x000389, "Member 'UWBP_Menu_PlayGoBase_modern_C::PlayGoType' has a wrong offset!");

}

