#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Buff_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Menu_Parts_Buff_001_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_Buff_000.WBP_Menu_Parts_Buff_000_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_Menu_Parts_Buff_000_C final : public UWBP_Menu_Parts_Buff_001_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 SlideNumberPanel;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TexturePanel;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bInitialized;                                      // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_Buff_000(int32 EntryPoint);
	void ManualInitialize();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_Buff_000_C">();
	}
	static class UWBP_Menu_Parts_Buff_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_Buff_000_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_Buff_000_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_Buff_000_C");
static_assert(sizeof(UWBP_Menu_Parts_Buff_000_C) == 0x000480, "Wrong size on UWBP_Menu_Parts_Buff_000_C");
static_assert(offsetof(UWBP_Menu_Parts_Buff_000_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Menu_Parts_Buff_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_000_C, SlideNumberPanel) == 0x000468, "Member 'UWBP_Menu_Parts_Buff_000_C::SlideNumberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_000_C, TexturePanel) == 0x000470, "Member 'UWBP_Menu_Parts_Buff_000_C::TexturePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Buff_000_C, bInitialized) == 0x000478, "Member 'UWBP_Menu_Parts_Buff_000_C::bInitialized' has a wrong offset!");

}

