#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C
// 0x00D0 (0x0440 - 0x0370)
class UWBP_Menu_Tuyosa_List_003_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             Parts000_99Title_00All;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts000_Title;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts010_00Param_00All;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text080_Title_Kihon;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text080_Title_Skill;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text080_Title_Soubi;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text080_Title_Tane;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_01Base_00All;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_01Base_00AllInvalid;                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_02Skill_00All;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_02Skill_00AllInvalid;                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_03Equip_00All;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_03Equip_00AllInvalid;                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_04Seed_00All;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text090_04Seed_00AllInvalid;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PageControllKeyEvent;                              // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UJackUMGItemBase*>               ParamEquipPartsList;                               // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UJackUMGItemBase*>               ParamSeedPartsList;                                // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 ParamValueList;                                    // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bShowKougekiTeParts;                               // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTempShowKougekiTeParts;                           // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PageControllKeyEvent__DelegateSignature(bool bIsRemove, bool bNextPage, bool bPrevPage);
	void ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern(int32 EntryPoint);
	void Construct();
	void SetData(class UJackUMGAccessorMemberDataInTuyosa* TuyosaData, int32 PageMoveInput);
	void WidgetBPActionDelegate(class FName EventTag);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void UpdateTitleText(class UJackGameCharacter* GameCharacter);
	void UpdateParamText(class UTextBlock* ParamText, class UTextBlock* InvalidParamText, struct FJackGameCharacterParameters& JackGameCharacterParameters, int32 KougekiTe, bool bIsNitouryuu, bool bMainParam);
	void InitText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tuyosa_List_003_modern_C">();
	}
	static class UWBP_Menu_Tuyosa_List_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tuyosa_List_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tuyosa_List_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tuyosa_List_003_modern_C");
static_assert(sizeof(UWBP_Menu_Tuyosa_List_003_modern_C) == 0x000440, "Wrong size on UWBP_Menu_Tuyosa_List_003_modern_C");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Parts000_99Title_00All) == 0x000378, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Parts000_99Title_00All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Parts000_Title) == 0x000380, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Parts000_Title' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Parts010_00Param_00All) == 0x000388, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Parts010_00Param_00All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, RootPanel) == 0x000390, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text080_Title_Kihon) == 0x000398, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text080_Title_Kihon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text080_Title_Skill) == 0x0003A0, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text080_Title_Skill' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text080_Title_Soubi) == 0x0003A8, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text080_Title_Soubi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text080_Title_Tane) == 0x0003B0, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text080_Title_Tane' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_01Base_00All) == 0x0003B8, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_01Base_00All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_01Base_00AllInvalid) == 0x0003C0, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_01Base_00AllInvalid' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_02Skill_00All) == 0x0003C8, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_02Skill_00All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_02Skill_00AllInvalid) == 0x0003D0, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_02Skill_00AllInvalid' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_03Equip_00All) == 0x0003D8, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_03Equip_00All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_03Equip_00AllInvalid) == 0x0003E0, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_03Equip_00AllInvalid' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_04Seed_00All) == 0x0003E8, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_04Seed_00All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, Text090_04Seed_00AllInvalid) == 0x0003F0, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::Text090_04Seed_00AllInvalid' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, PageControllKeyEvent) == 0x0003F8, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::PageControllKeyEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, ParamEquipPartsList) == 0x000408, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::ParamEquipPartsList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, ParamSeedPartsList) == 0x000418, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::ParamSeedPartsList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, ParamValueList) == 0x000428, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::ParamValueList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, bShowKougekiTeParts) == 0x000438, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::bShowKougekiTeParts' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_003_modern_C, bTempShowKougekiTeParts) == 0x000439, "Member 'UWBP_Menu_Tuyosa_List_003_modern_C::bTempShowKougekiTeParts' has a wrong offset!");

}

