#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C
// 0x00F8 (0x0510 - 0x0418)
class UWBP_Menu_Sakusen_Settei_001_modern_C final : public UJackUMGHorizontalSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_232;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_515;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_013_modern_C*           WBP_Menu_Parts_013_BGM;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_013_modern_C*           WBP_Menu_Parts_013_SE;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_013_modern_C*           WBP_Menu_Parts_013_VOICE;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_089_modern_C*           WBP_Menu_Parts_089_Field;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_089_modern_C*           WBP_Menu_Parts_089_Iki;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_089_modern_C*           WBP_Menu_Parts_089_Jidou;                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_089_modern_C*           WBP_Menu_Parts_089_Language;                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_089_modern_C*           WBP_Menu_Parts_089_Ongen;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_1;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_2;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_3;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLineTate_1;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLineTate_2;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDelux;                                            // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BgmVolume;                                         // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SeVolume;                                          // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VoiceVolume;                                       // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ikidukai;                                          // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BGMDiskVersion;                                    // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UseDQ8BGM;                                         // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VoiceType;                                         // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChangeBGMId;                                       // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BGMDiskVersionIni;                                 // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UseDQ8BGMIni;                                      // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChangeBGMTextId;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         JidouOkuri;                                        // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     SnapSave;                                          // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VoiceTypeIni;                                      // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern(int32 EntryPoint);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void OnFinishVoiceChange_Event();
	void MessageEnd00();
	void MessageEnd2();
	void MessageEnd1();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void CustomEvent_0(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void UpdateMenuList();
	void ResetSelectParts();
	void GetSoundSaveData(bool bGetDefaultSetting);
	void SetSoundSaveData();
	void GetAllValue();
	void SetAllValue();
	void ChangeBGM(class FName* OutBGM);
	void AddSnap();
	void SetInfoText(class FName Selection);
	void CheckVoiceVolume();
	void ChangeVoice(bool* IsChange);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_Settei_001_modern_C">();
	}
	static class UWBP_Menu_Sakusen_Settei_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_Settei_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_Settei_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_Settei_001_modern_C");
static_assert(sizeof(UWBP_Menu_Sakusen_Settei_001_modern_C) == 0x000510, "Wrong size on UWBP_Menu_Sakusen_Settei_001_modern_C");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, UberGraphFrame) == 0x000418, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, InvalidationBox_0) == 0x000420, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, ItemList) == 0x000428, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, RootPanel) == 0x000430, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_000_C_114) == 0x000438, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_000_C_232) == 0x000440, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_000_C_232' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_000_C_515) == 0x000448, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_000_C_515' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_013_BGM) == 0x000450, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_013_BGM' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_013_SE) == 0x000458, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_013_SE' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_013_VOICE) == 0x000460, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_013_VOICE' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_089_Field) == 0x000468, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_089_Field' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_089_Iki) == 0x000470, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_089_Iki' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_089_Jidou) == 0x000478, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_089_Jidou' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_089_Language) == 0x000480, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_089_Language' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WBP_Menu_Parts_089_Ongen) == 0x000488, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WBP_Menu_Parts_089_Ongen' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WindowFrame) == 0x000490, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WindowLine_1) == 0x000498, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WindowLine_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WindowLine_2) == 0x0004A0, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WindowLine_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WindowLine_3) == 0x0004A8, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WindowLine_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WindowLineTate_1) == 0x0004B0, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WindowLineTate_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, WindowLineTate_2) == 0x0004B8, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::WindowLineTate_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, bDelux) == 0x0004C0, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::bDelux' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, BgmVolume) == 0x0004C4, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::BgmVolume' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, SeVolume) == 0x0004C8, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::SeVolume' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, VoiceVolume) == 0x0004CC, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::VoiceVolume' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, Ikidukai) == 0x0004D0, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::Ikidukai' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, BGMDiskVersion) == 0x0004D4, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::BGMDiskVersion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, UseDQ8BGM) == 0x0004D8, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::UseDQ8BGM' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, VoiceType) == 0x0004DC, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::VoiceType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, ChangeBGMId) == 0x0004E0, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::ChangeBGMId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, BGMDiskVersionIni) == 0x0004E8, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::BGMDiskVersionIni' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, UseDQ8BGMIni) == 0x0004EC, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::UseDQ8BGMIni' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, ChangeBGMTextId) == 0x0004F0, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::ChangeBGMTextId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, JidouOkuri) == 0x0004F8, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::JidouOkuri' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, SnapSave) == 0x000500, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::SnapSave' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_001_modern_C, VoiceTypeIni) == 0x000508, "Member 'UWBP_Menu_Sakusen_Settei_001_modern_C::VoiceTypeIni' has a wrong offset!");

}

