#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_001_modern
// 0x0410 (0x0410 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectTargetInKey_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackKeyStatus                         CallFunc_GetKeyStatus_ReturnValue;                 // 0x0050(0x0040)()
	class UJackUMGFukidasiWindowController*       CallFunc_GetFukidasiWindowController_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBattleMenuCommand                     CallFunc_GetBattleMenuCommand_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGFukidasiWindowController*       CallFunc_GetFukidasiWindowController_ReturnValue2; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetTargetList_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue3;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive;             // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenu_ReturnValue4;           // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue9;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue10;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue11;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0170(0x0048)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue12;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGFukidasiWindowController*       CallFunc_GetFukidasiWindowController_ReturnValue3; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_Array_Get_Item2;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackCharacter_ReturnValue;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class AJackCharacter*                         CallFunc_GetJackCharacter_ReturnValue2;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue13;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableRenkei                   CallFunc_GetRenkeiInfoFromRenkeiId_ReturnValue;    // 0x0298(0x0140)()
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActionDescriptionString_OutDescriptiont; // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue14;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleCassterMP_ReturnValue;           // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern) == 0x000410, "Wrong size on WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CustomEvent_InKeyType) == 0x000018, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CustomEvent_bIsPressed) == 0x000019, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_SelectTargetInKey_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_SelectTargetInKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetKeyStatus_ReturnValue) == 0x000050, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetKeyStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetFukidasiWindowController_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetFukidasiWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x000098, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x0000A0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BooleanOR_ReturnValue) == 0x0000AA, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x0000B0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000B8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetBattleMenuCommand_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetBattleMenuCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetFukidasiWindowController_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetFukidasiWindowController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue7) == 0x0000D8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue8) == 0x0000E0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetTargetList_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetTargetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x0000FC, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BattleCommandMenu_ReturnValue3) == 0x000100, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BattleCommandMenu_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CustomEvent_EventName) == 0x000108, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CustomEvent_InItemBase) == 0x000110, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000118, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Array_Get_Item) == 0x000120, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000128, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000130, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000131, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_IsUMGAliveCharacter_bIsAlive) == 0x000132, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_IsUMGAliveCharacter_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BattleCommandMenu_ReturnValue4) == 0x000134, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BattleCommandMenu_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue9) == 0x000138, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_BattleCommandMenuItem_ReturnValue) == 0x000140, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_BattleCommandMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue10) == 0x000148, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue11) == 0x000150, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, Temp_struct_Variable) == 0x000158, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x000168, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000170, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Array_Contains_ReturnValue) == 0x0001B8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_MakeArray_Array) == 0x0001C0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001D0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue12) == 0x0001D8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0001E0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetFukidasiWindowController_ReturnValue3) == 0x0001E8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetFukidasiWindowController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Array_Get_Item2) == 0x0001F0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Array_Length_ReturnValue2) == 0x0001F8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetJackCharacter_ReturnValue) == 0x000200, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetJackCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000208, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000210, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetJackCharacter_ReturnValue2) == 0x000220, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetJackCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000228, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_Array_Length_ReturnValue3) == 0x00022C, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CustomEvent_EventTag) == 0x000230, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000238, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000240, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000248, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern) == 0x000250, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_SwitchEnum3_CmpSuccess) == 0x000259, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x00025A, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000260, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue2) == 0x000268, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern) == 0x000270, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_DynamicCast_bSuccess2) == 0x000278, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000280, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue13) == 0x000290, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetRenkeiInfoFromRenkeiId_ReturnValue) == 0x000298, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetRenkeiInfoFromRenkeiId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetText_ReturnValue) == 0x0003D8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003E8, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetActionDescriptionString_OutDescriptiont) == 0x0003F0, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetActionDescriptionString_OutDescriptiont' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetAccessorBattle_ReturnValue14) == 0x000400, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetAccessorBattle_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern, CallFunc_GetBattleCassterMP_ReturnValue) == 0x000408, "Member 'WBP_Menu_Battle_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_001_modern::CallFunc_GetBattleCassterMP_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.KeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_001_modern_C_KeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_001_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Battle_List_001_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.SetupJumonAction
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_SetupJumonAction final
{
public:
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetActionDescription_OutDescriptiont;     // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_SetupJumonAction) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_SetupJumonAction");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_SetupJumonAction) == 0x000020, "Wrong size on WBP_Menu_Battle_List_001_modern_C_SetupJumonAction");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupJumonAction, CallFunc_GetAccessorBattle_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupJumonAction::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupJumonAction, CallFunc_GetActionDescription_OutDescriptiont) == 0x000008, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupJumonAction::CallFunc_GetActionDescription_OutDescriptiont' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.SetupTokugiAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction final
{
public:
	class FName                                   InTokugiActionId;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetActionDescription_OutDescriptiont;     // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction) == 0x000028, "Wrong size on WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction, InTokugiActionId) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction::InTokugiActionId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction, CallFunc_GetAccessorBattle_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction, CallFunc_GetActionDescription_OutDescriptiont) == 0x000010, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupTokugiAction::CallFunc_GetActionDescription_OutDescriptiont' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.SetupRenkeiAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction final
{
public:
	class FName                                   InRenkeiId;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InRenkeiName;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction) == 0x000028, "Wrong size on WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction, InRenkeiId) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction::InRenkeiId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction, InRenkeiName) == 0x000008, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction::InRenkeiName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction, CallFunc_GetAccessorBattle_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupRenkeiAction::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.InitCursorIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_InitCursorIndex final
{
public:
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNearTargetMenuIndex_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorSaveTargetIndex_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_InitCursorIndex");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex) == 0x000020, "Wrong size on WBP_Menu_Battle_List_001_modern_C_InitCursorIndex");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex, CallFunc_GetAccessorBattle_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_InitCursorIndex::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex, CallFunc_GetNearTargetMenuIndex_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_001_modern_C_InitCursorIndex::CallFunc_GetNearTargetMenuIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Battle_List_001_modern_C_InitCursorIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000010, "Member 'WBP_Menu_Battle_List_001_modern_C_InitCursorIndex::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_InitCursorIndex, CallFunc_GetCursorSaveTargetIndex_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_001_modern_C_InitCursorIndex::CallFunc_GetCursorSaveTargetIndex_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_001_modern.WBP_Menu_Battle_List_001_modern_C.SetupDouguAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Battle_List_001_modern_C_SetupDouguAction final
{
public:
	class UJackUMGUIActionInfo*                   UIActionInfoRef_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_001_modern_C_SetupDouguAction) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_001_modern_C_SetupDouguAction");
static_assert(sizeof(WBP_Menu_Battle_List_001_modern_C_SetupDouguAction) == 0x000008, "Wrong size on WBP_Menu_Battle_List_001_modern_C_SetupDouguAction");
static_assert(offsetof(WBP_Menu_Battle_List_001_modern_C_SetupDouguAction, UIActionInfoRef_0) == 0x000000, "Member 'WBP_Menu_Battle_List_001_modern_C_SetupDouguAction::UIActionInfoRef_0' has a wrong offset!");

}

