#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_TenNoKoe_Window_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_TenNoKoe_Window_000_modern.WBP_Menu_TenNoKoe_Window_000_modern_C
// 0x0060 (0x05A0 - 0x0540)
class UWBP_Menu_TenNoKoe_Window_000_modern_C final : public UJackUMGSerifuWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel00_00;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel01_00;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel02_00;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel03_00;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel04_00;                                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel05_00;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel06_00;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel07_00;                                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel08_00;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLabel09_00;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_TenNoKoe_Window_000_modern_C">();
	}
	static class UWBP_Menu_TenNoKoe_Window_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_TenNoKoe_Window_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_TenNoKoe_Window_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_TenNoKoe_Window_000_modern_C");
static_assert(sizeof(UWBP_Menu_TenNoKoe_Window_000_modern_C) == 0x0005A0, "Wrong size on UWBP_Menu_TenNoKoe_Window_000_modern_C");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, UberGraphFrame) == 0x000540, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, InvalidationBox_0) == 0x000548, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel00_00) == 0x000550, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel00_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel01_00) == 0x000558, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel01_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel02_00) == 0x000560, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel02_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel03_00) == 0x000568, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel03_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel04_00) == 0x000570, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel04_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel05_00) == 0x000578, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel05_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel06_00) == 0x000580, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel06_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel07_00) == 0x000588, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel07_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel08_00) == 0x000590, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel08_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_TenNoKoe_Window_000_modern_C, TextLabel09_00) == 0x000598, "Member 'UWBP_Menu_TenNoKoe_Window_000_modern_C::TextLabel09_00' has a wrong offset!");

}

