#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Button_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Button_000_modern.WBP_Hud_Button_000_modern_C
// 0x0038 (0x0438 - 0x0400)
class UWBP_Hud_Button_000_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             DirectionkeyCaption;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DirectionkeyIcon;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           DirectionkeyPanel;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SakusenButtonCaption;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SakusenButtonIcon;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   CaptionTextId;                                     // 0x0430(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Button_000_modern(int32 EntryPoint);
	void UpdateBattleButtonCaption();
	void Construct();
	void SetMukouColor(bool bIsXButton, bool bIsDirectionButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Button_000_modern_C">();
	}
	static class UWBP_Hud_Button_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Button_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Button_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Button_000_modern_C");
static_assert(sizeof(UWBP_Hud_Button_000_modern_C) == 0x000438, "Wrong size on UWBP_Hud_Button_000_modern_C");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Hud_Button_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, DirectionkeyCaption) == 0x000408, "Member 'UWBP_Hud_Button_000_modern_C::DirectionkeyCaption' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, DirectionkeyIcon) == 0x000410, "Member 'UWBP_Hud_Button_000_modern_C::DirectionkeyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, DirectionkeyPanel) == 0x000418, "Member 'UWBP_Hud_Button_000_modern_C::DirectionkeyPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, SakusenButtonCaption) == 0x000420, "Member 'UWBP_Hud_Button_000_modern_C::SakusenButtonCaption' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, SakusenButtonIcon) == 0x000428, "Member 'UWBP_Hud_Button_000_modern_C::SakusenButtonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Button_000_modern_C, CaptionTextId) == 0x000430, "Member 'UWBP_Hud_Button_000_modern_C::CaptionTextId' has a wrong offset!");

}

