#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UMG_Fade_Widget_000

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UMG_Fade_Widget_000.WBP_UMG_Fade_Widget_000_C.ExecuteUbergraph_WBP_UMG_Fade_Widget_000
// 0x0058 (0x0058 - 0x0000)
struct WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_WidgetName;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ZOrder;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeAlpha;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_FadeColor;                      // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000) == 0x000008, "Wrong alignment on WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000");
static_assert(sizeof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000) == 0x000058, "Wrong size on WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, EntryPoint) == 0x000000, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, K2Node_CustomEvent_WidgetName) == 0x000008, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::K2Node_CustomEvent_WidgetName' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, K2Node_CustomEvent_ZOrder) == 0x000010, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::K2Node_CustomEvent_ZOrder' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, K2Node_CustomEvent_FadeAlpha) == 0x000014, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::K2Node_CustomEvent_FadeAlpha' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, K2Node_CustomEvent_FadeColor) == 0x000018, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::K2Node_CustomEvent_FadeColor' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, CallFunc_Conv_FloatToString_ReturnValue) == 0x000028, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, K2Node_MakeStruct_LinearColor) == 0x000038, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WBP_UMG_Fade_Widget_000_C_ExecuteUbergraph_WBP_UMG_Fade_Widget_000::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_UMG_Fade_Widget_000.WBP_UMG_Fade_Widget_000_C.SetFade
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) WBP_UMG_Fade_Widget_000_C_SetFade final
{
public:
	class FName                                   WidgetName_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZOrder;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeAlpha;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FadeColor;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UMG_Fade_Widget_000_C_SetFade) == 0x000008, "Wrong alignment on WBP_UMG_Fade_Widget_000_C_SetFade");
static_assert(sizeof(WBP_UMG_Fade_Widget_000_C_SetFade) == 0x000020, "Wrong size on WBP_UMG_Fade_Widget_000_C_SetFade");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_SetFade, WidgetName_0) == 0x000000, "Member 'WBP_UMG_Fade_Widget_000_C_SetFade::WidgetName_0' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_SetFade, ZOrder) == 0x000008, "Member 'WBP_UMG_Fade_Widget_000_C_SetFade::ZOrder' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_SetFade, FadeAlpha) == 0x00000C, "Member 'WBP_UMG_Fade_Widget_000_C_SetFade::FadeAlpha' has a wrong offset!");
static_assert(offsetof(WBP_UMG_Fade_Widget_000_C_SetFade, FadeColor) == 0x000010, "Member 'WBP_UMG_Fade_Widget_000_C_SetFade::FadeColor' has a wrong offset!");

}

