#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_033

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_033.WBP_Menu_Title_BG_033_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_Menu_Title_BG_033_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bubble_002;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewVar_0;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Title_BG_033(int32 EntryPoint);
	void PlayAnim033(float Duration, float PlaybackSpeed);
	void Construct();
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_033_C">();
	}
	static class UWBP_Menu_Title_BG_033_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_033_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_033_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_033_C");
static_assert(sizeof(UWBP_Menu_Title_BG_033_C) == 0x000398, "Wrong size on UWBP_Menu_Title_BG_033_C");
static_assert(offsetof(UWBP_Menu_Title_BG_033_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_033_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_033_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_BG_033_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_033_C, Bubble_002) == 0x000380, "Member 'UWBP_Menu_Title_BG_033_C::Bubble_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_033_C, RootPanel) == 0x000388, "Member 'UWBP_Menu_Title_BG_033_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_033_C, NewVar_0) == 0x000390, "Member 'UWBP_Menu_Title_BG_033_C::NewVar_0' has a wrong offset!");

}

