#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_052_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_052_modern.WBP_Menu_Parts_052_modern_C
// 0x0048 (0x0478 - 0x0430)
class UWBP_Menu_Parts_052_modern_C final : public UJackUMGHorizontalParts
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ChoiceCursorPanel;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ChoiceText;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_01;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_02;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnChangeValue;                                     // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChangeValue__DelegateSignature(int32 Value);
	void ExecuteUbergraph_WBP_Menu_Parts_052_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(class FName EventTag);
	void SakusenTextIdSetting(class FName TitleText, class FName Value_1, class FName Value_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_052_modern_C">();
	}
	static class UWBP_Menu_Parts_052_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_052_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_052_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_052_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_052_modern_C) == 0x000478, "Wrong size on UWBP_Menu_Parts_052_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Parts_052_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, Arrow) == 0x000438, "Member 'UWBP_Menu_Parts_052_modern_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, ChoiceCursorPanel) == 0x000440, "Member 'UWBP_Menu_Parts_052_modern_C::ChoiceCursorPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, ChoiceText) == 0x000448, "Member 'UWBP_Menu_Parts_052_modern_C::ChoiceText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, Text_Title) == 0x000450, "Member 'UWBP_Menu_Parts_052_modern_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, Value_01) == 0x000458, "Member 'UWBP_Menu_Parts_052_modern_C::Value_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, Value_02) == 0x000460, "Member 'UWBP_Menu_Parts_052_modern_C::Value_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_052_modern_C, OnChangeValue) == 0x000468, "Member 'UWBP_Menu_Parts_052_modern_C::OnChangeValue' has a wrong offset!");

}

