#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Input_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern
// 0x0340 (0x0340 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable2;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_005_modern_C*>   K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C8(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackImeManager*                        CallFunc_GetImeManager_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenDialog_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenIme_IsStopTick;                       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInputNameMaxAsia_ReturnValue;        // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInputNameZeroAsia_ReturnValue;       // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNGWord_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInputNameZeroAsia_ReturnValue2;      // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0148(0x0048)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x01A8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayableNameFlag_ReturnValue;        // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CanUseFont_ReturnValue;                   // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayableNameFlag_ReturnValue2;       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_CanUseFont_ReturnValue2;                  // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayableNameFlag_ReturnValue3;       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue3;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item;                           // 0x0250(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result4;             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInNameBlackSquare_ReturnValue;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUIPlatformType                           CallFunc_GetUIPlatformType_ReturnValue;            // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text2;                  // 0x02D0(0x0018)()
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0300(0x0018)()
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue2;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern) == 0x000340, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000030, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, Temp_struct_Variable2) == 0x000038, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, Temp_struct_Variable3) == 0x000048, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x000060, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_EventName) == 0x000068, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_InItemBase) == 0x000070, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_EventTag) == 0x000078, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000080, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000081, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchName3_CmpSuccess) == 0x000082, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_InKeyType) == 0x000083, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_bIsPressed) == 0x000084, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000085, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000088, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000090, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000098, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_MyGeometry) == 0x0000C8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_InDeltaTime) == 0x000104, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetImeManager_ReturnValue) == 0x000108, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetImeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_IsOpenDialog_ReturnValue) == 0x000110, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_IsOpenDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_OpenIme_IsStopTick) == 0x000111, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_OpenIme_IsStopTick' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CheckInputNameMaxAsia_ReturnValue) == 0x000112, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CheckInputNameMaxAsia_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CheckInputNameZeroAsia_ReturnValue) == 0x000113, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CheckInputNameZeroAsia_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CheckNGWord_ReturnValue) == 0x000114, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CheckNGWord_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_CheckPoint4) == 0x000115, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CheckInputNameZeroAsia_ReturnValue2) == 0x000116, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CheckInputNameZeroAsia_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_Sender2) == 0x000118, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_CheckPoint3) == 0x000128, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_CheckRusult) == 0x000129, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_Sender) == 0x000130, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_CurrentTextID) == 0x000138, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x000140, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000148, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000190, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_MakeArray_Array2) == 0x000198, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, Temp_struct_Variable4) == 0x0001A8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x0001B8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x0001C0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_WaitMessageEndFromBP_Result3) == 0x0001C8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_WaitMessageEndFromBP_Result3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0001D0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_IsDisplayableNameFlag_ReturnValue) == 0x0001D8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_IsDisplayableNameFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x0001E0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0001E8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0001F0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CanUseFont_ReturnValue) == 0x0001F8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CanUseFont_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000208, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_IsDisplayableNameFlag_ReturnValue2) == 0x000210, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_IsDisplayableNameFlag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CanUseFont_ReturnValue2) == 0x000218, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CanUseFont_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x000228, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_IsDisplayableNameFlag_ReturnValue3) == 0x000230, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_IsDisplayableNameFlag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_CheckPoint2) == 0x000231, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_Result) == 0x000232, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x000238, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetAccessorSaveData_ReturnValue6) == 0x000240, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetAccessorSaveData_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_CloseSerifuWindow_ReturnValue3) == 0x000248, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_CloseSerifuWindow_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_Array_Get_Item) == 0x000250, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, Temp_struct_Variable5) == 0x000258, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5) == 0x000268, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_StopBGM_ReturnValue) == 0x000270, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_WaitMessageEndFromBP_Result4) == 0x000278, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_WaitMessageEndFromBP_Result4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000280, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000290, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_OpenMenu_ReturnValue) == 0x000298, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_Sender) == 0x0002A0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_Event_CheckPoint) == 0x0002B0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_Event_CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0002B8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_IsInNameBlackSquare_ReturnValue) == 0x0002C8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_IsInNameBlackSquare_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetUIPlatformType_ReturnValue) == 0x0002C9, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetUIPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0002CA, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_ComponentBoundEvent_Text2) == 0x0002D0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_ComponentBoundEvent_Text2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_ComponentBoundEvent_CommitMethod) == 0x0002E8, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_SwitchEnum3_CmpSuccess) == 0x0002E9, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x0002F0, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_ComponentBoundEvent_Text) == 0x000300, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000318, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetJackPlayerController_ReturnValue) == 0x000328, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetJackPlayerController_ReturnValue2) == 0x000330, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetJackPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000338, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_001_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_Menu_Namae_Input_001_modern_C_BndEvt__EditableTextBox_0_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck) == 0x000002, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck, Result) == 0x000001, "Member 'WBP_Menu_Namae_Input_001_modern_C_OnFinishSaveDataCheck::Result' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Namae_Input_001_modern_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'WBP_Menu_Namae_Input_001_modern_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Namae_Input_001_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.WidgetKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Namae_Input_001_modern_C_WidgetKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Input_001_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Namae_Input_001_modern.WBP_Menu_Namae_Input_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Input_001_modern_C_OnItemListControl final
{
public:
