#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_TenNoKoe_Window_000_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_TenNoKoe_Window_000_modern.WBP_Menu_TenNoKoe_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetTenNoKoeWindowController_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern");
static_assert(sizeof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern) == 0x000030, "Wrong size on WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern");
static_assert(offsetof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern, CallFunc_GetTenNoKoeWindowController_ReturnValue) == 0x000010, "Member 'WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern::CallFunc_GetTenNoKoeWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern, CallFunc_GetZOrder_ReturnValue) == 0x000018, "Member 'WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_Menu_TenNoKoe_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_TenNoKoe_Window_000_modern::K2Node_MakeArray_Array' has a wrong offset!");

}

