#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_100_modern

#include "Basic.hpp"

#include "ENUM_Menu_Dougu_Syousai_Page_structs.hpp"
#include "JackGame_structs.hpp"
#include "ENUM_Menu_Dougu_Syousai_Disp_Region_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.ItemIndexNotification__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature final
{
public:
	int32                                         OutItemIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature, OutItemIndex) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ItemIndexNotification__DelegateSignature::OutItemIndex' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern
// 0x0168 (0x0168 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpDownItemIndex_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_Dougu_Syousai_Page                  CallFunc_Array_Get_Item2;                          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_GetVisibleTable_ParamVisibleList;         // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	ENUM_Menu_Dougu_Syousai_Page                  CallFunc_Array_Get_Item3;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_Array_Get_Item4;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_Array_Get_Item5;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UJackUMGWidgetBase*>             K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FText Text)>             K2Node_CreateDelegate_OutputDelegate2;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_TogglePage_IsChangedPage;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue2;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue3;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ValueLooper_ReturnValue;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue4;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item6;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_Array_Get_Item7;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     K2Node_DynamicCast_AsJack_UMGWidget_Base;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern) == 0x000168, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetSoundSet_ReturnValue) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CustomEvent_InKeyType) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CustomEvent_bIsPressed) == 0x000039, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_UpDownItemIndex_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_UpDownItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, Temp_int_Array_Index_Variable) == 0x000044, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item2) == 0x000049, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x00004A, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetVisibleTable_ParamVisibleList) == 0x000050, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetVisibleTable_ParamVisibleList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item3) == 0x000060, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item4) == 0x000070, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item5) == 0x000078, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000080, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000081, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CustomEvent_Text) == 0x000090, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C8, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_TogglePage_IsChangedPage) == 0x0000D8, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_TogglePage_IsChangedPage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000E0, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetSoundSet_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetSoundSet_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000F0, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetSoundSet_ReturnValue3) == 0x000100, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetSoundSet_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_ValueLooper_ReturnValue) == 0x000108, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_ValueLooper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000110, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000120, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetSoundSet_ReturnValue4) == 0x000128, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetSoundSet_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_GetJackPlayerController_ReturnValue) == 0x000130, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item6) == 0x000138, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Array_Get_Item7) == 0x000140, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_Create_ReturnValue) == 0x000148, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000150, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_DynamicCast_AsJack_UMGWidget_Base) == 0x000158, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_DynamicCast_AsJack_UMGWidget_Base' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000161, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_100_modern::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.OnSetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText, Text) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_OnSetText::Text' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.CustomEvent_1
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1) == 0x000002, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1, InKeyType) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1, bIsPressed) == 0x000001, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_1::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.SetupItemSyousai
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai final
{
public:
	TArray<struct FJackUMGItemListInfo>           ItemSyousalList;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         InShowItemIndex;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                InCharaType;                                       // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          InRegion;                                          // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDekiNoYosa_0;                                    // 0x0016(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowBG;                                            // 0x0017(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai, ItemSyousalList) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai::ItemSyousalList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai, InShowItemIndex) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai::InShowItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai, InCharaType) == 0x000014, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai::InCharaType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai, InRegion) == 0x000015, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai::InRegion' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai, IsDekiNoYosa_0) == 0x000016, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai::IsDekiNoYosa_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai, ShowBG) == 0x000017, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_SetupItemSyousai::ShowBG' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.ShowItemSyousai
// 0x0060 (0x0060 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai final
{
public:
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiWithBagType_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetItemEquipmentInfo_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemListInfo                   CallFunc_Array_Get_Item;                           // 0x0048(0x0018)(NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai) == 0x000060, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GetAccessorItem_ReturnValue) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GetAccessorItem_ReturnValue2) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GetItemSyousaiWithBagType_ReturnValue) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GetItemSyousaiWithBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GetItemEquipmentInfo_ReturnValue) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GetItemEquipmentInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_GetAccessorItem_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_BagTypeToCharType_ReturnValue) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_BagTypeToCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_ShowItemSyousai::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.UpdateDispList
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList final
{
public:
	class UJackUMGItemSyousai*                    ItemSyousaiTmp;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  DispPageType;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  ItemPageType;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable2;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable3;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable4;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable5;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable6;                               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable7;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable8;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable9;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable10;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable11;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemClassification                    Temp_byte_Variable12;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TogglePage_IsChangedPage;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_Dougu_Syousai_Page                  K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable13;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable14;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_Dougu_Syousai_Page                  K2Node_Select2_Default;                            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  CallFunc_Array_Get_Item;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_Dougu_Syousai_Page                  CallFunc_Array_Get_Item2;                          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_Dougu_Syousai_Page                  K2Node_Select3_Default;                            // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemListInfo                   CallFunc_Array_Get_Item3;                          // 0x0058(0x0018)(NoDestructor)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousai_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList) == 0x000078, "Wrong size on WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, ItemSyousaiTmp) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::ItemSyousaiTmp' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, DispPageType) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::DispPageType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, ItemPageType) == 0x000009, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::ItemPageType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable) == 0x00000A, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable2) == 0x00000B, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable3) == 0x00000C, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable4) == 0x00000D, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable5) == 0x00000E, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable6) == 0x00000F, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable7) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable8) == 0x000011, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable9) == 0x000012, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable10) == 0x000013, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable11) == 0x000014, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_bool_True_if_break_was_hit_Variable) == 0x000015, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable12) == 0x000024, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_TogglePage_IsChangedPage) == 0x00002C, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_TogglePage_IsChangedPage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, K2Node_SwitchEnum_CmpSuccess) == 0x00002D, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002E, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00002F, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, K2Node_Select_Default) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable13) == 0x000031, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_byte_Variable14) == 0x000032, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_bool_Variable) == 0x000033, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, K2Node_Select2_Default) == 0x000034, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Array_Get_Item) == 0x000035, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x00003C, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_BooleanAND_ReturnValue) == 0x00003E, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Array_Length_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Array_Get_Item2) == 0x000045, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, Temp_bool_Variable2) == 0x000046, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, K2Node_Select3_Default) == 0x000047, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Not_PreBool_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_GetAccessorItem_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_Array_Get_Item3) == 0x000058, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList, CallFunc_GetItemSyousai_ReturnValue) == 0x000070, "Member 'WBP_Menu_Dougu_Syousai_100_modern_C_UpdateDispList::CallFunc_GetItemSyousai_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_100_modern.WBP_Menu_Dougu_Syousai_100_modern_C.UpdateCommonButton
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) WBP_Menu_Dougu_Syousai_100_modern_C_UpdateCommonButton final
{
public:
	ENUM_Menu_Dougu_Syousai_Page                  Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_Dougu_Syousai_Page                  CallFunc_Array_Get_Item;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
