#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_Item_004_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_Item_004_modern.WBP_Menu_Shop_Item_004_modern_C.ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0028(0x0018)()
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagType_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0060(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLoaddedTextureFromId_ReturnValue;      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemOsyareIconTexture_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern");
static_assert(sizeof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern) == 0x0000B8, "Wrong size on WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_Event_InItemData) == 0x000020, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000028, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetDataIndex_ReturnValue) == 0x000040, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetBagType_ReturnValue) == 0x000044, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000048, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue) == 0x000050, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetDecMenuText_ReturnValue) == 0x000060, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_CustomEvent_InResultCode) == 0x000080, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_CustomEvent_InLoaddedObject) == 0x000088, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_CustomEvent_InLoadInfo) == 0x000090, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x000098, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, Temp_byte_Variable2) == 0x00009C, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_SetLoaddedTextureFromId_ReturnValue) == 0x00009D, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_SetLoaddedTextureFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00009E, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, Temp_bool_Variable) == 0x00009F, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, CallFunc_GetItemOsyareIconTexture_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::CallFunc_GetItemOsyareIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_Menu_Shop_Item_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_004_modern::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Shop_Item_004_modern.WBP_Menu_Shop_Item_004_modern_C.AsyncLoadTextureComplete
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete");
static_assert(sizeof(WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete) == 0x000018, "Wrong size on WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete, InResultCode) == 0x000000, "Member 'WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Shop_Item_004_modern_C_AsyncLoadTextureComplete::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Shop_Item_004_modern.WBP_Menu_Shop_Item_004_modern_C.CancelLoadTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture");
static_assert(sizeof(WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Shop_Item_004_modern_C_CancelLoadTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Shop_Item_004_modern.WBP_Menu_Shop_Item_004_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_Item_004_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_004_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_004_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Shop_Item_004_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_004_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Shop_Item_004_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Shop_Item_004_modern_C_DrawItemBase::InItemData' has a wrong offset!");

}

