#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_046_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_046_modern.WBP_Menu_Parts_046_modern_C
// 0x0068 (0x0438 - 0x03D0)
class UWBP_Menu_Parts_046_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             Parts000_Unit;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts010_Name;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Parts024;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts024_CaptionPanel;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts024_UnitPanel_SameSize;                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PartsValue0022;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartsValue002_CaptionPanel;                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartsValue002_CaptionPanel_2;                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartsValue002_Slash;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSkillResetMode;                                   // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     TempTextArray;                                     // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_046_modern(int32 EntryPoint);
	void Construct();
	void DrawUpdateContainerDelegate(const struct FJackUMGItemContainer& ItemContainer);
	void SetupSkillResetMode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_046_modern_C">();
	}
	static class UWBP_Menu_Parts_046_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_046_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_046_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_046_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_046_modern_C) == 0x000438, "Wrong size on UWBP_Menu_Parts_046_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_046_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, Parts000_Unit) == 0x0003D8, "Member 'UWBP_Menu_Parts_046_modern_C::Parts000_Unit' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, Parts010_Name) == 0x0003E0, "Member 'UWBP_Menu_Parts_046_modern_C::Parts010_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, Parts024) == 0x0003E8, "Member 'UWBP_Menu_Parts_046_modern_C::Parts024' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, Parts024_CaptionPanel) == 0x0003F0, "Member 'UWBP_Menu_Parts_046_modern_C::Parts024_CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, Parts024_UnitPanel_SameSize) == 0x0003F8, "Member 'UWBP_Menu_Parts_046_modern_C::Parts024_UnitPanel_SameSize' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, PartsValue0022) == 0x000400, "Member 'UWBP_Menu_Parts_046_modern_C::PartsValue0022' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, PartsValue002_CaptionPanel) == 0x000408, "Member 'UWBP_Menu_Parts_046_modern_C::PartsValue002_CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, PartsValue002_CaptionPanel_2) == 0x000410, "Member 'UWBP_Menu_Parts_046_modern_C::PartsValue002_CaptionPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, PartsValue002_Slash) == 0x000418, "Member 'UWBP_Menu_Parts_046_modern_C::PartsValue002_Slash' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, bSkillResetMode) == 0x000420, "Member 'UWBP_Menu_Parts_046_modern_C::bSkillResetMode' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_046_modern_C, TempTextArray) == 0x000428, "Member 'UWBP_Menu_Parts_046_modern_C::TempTextArray' has a wrong offset!");

}

