#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_QuestRewardBase

#include "Basic.hpp"

#include "WBP_Menu_Parts_Text_000_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_QuestRewardBase.WBP_Menu_Parts_QuestRewardBase_C
// 0x0040 (0x0410 - 0x03D0)
class UWBP_Menu_Parts_QuestRewardBase_C : public UWBP_Menu_Parts_Text_000_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Image_PowerUpIconRef;                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_GoldIconRef;                                 // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_MedalIconRef;                                // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_CategoryIconRef;                             // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemCountRef;                                 // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemInfoRef;                                  // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_TaniRef;                                      // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase(int32 EntryPoint);
	void SetData(const struct FJackQuestReward& QuestRewardData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_QuestRewardBase_C">();
	}
	static class UWBP_Menu_Parts_QuestRewardBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_QuestRewardBase_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_QuestRewardBase_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_QuestRewardBase_C");
static_assert(sizeof(UWBP_Menu_Parts_QuestRewardBase_C) == 0x000410, "Wrong size on UWBP_Menu_Parts_QuestRewardBase_C");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Image_PowerUpIconRef) == 0x0003D8, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Image_PowerUpIconRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Image_GoldIconRef) == 0x0003E0, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Image_GoldIconRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Image_MedalIconRef) == 0x0003E8, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Image_MedalIconRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Image_CategoryIconRef) == 0x0003F0, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Image_CategoryIconRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Text_ItemCountRef) == 0x0003F8, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Text_ItemCountRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Text_ItemInfoRef) == 0x000400, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Text_ItemInfoRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_QuestRewardBase_C, Text_TaniRef) == 0x000408, "Member 'UWBP_Menu_Parts_QuestRewardBase_C::Text_TaniRef' has a wrong offset!");

}

