#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_032_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_032_modern.WBP_Menu_Parts_032_modern_C
// 0x0058 (0x0428 - 0x03D0)
class UWBP_Menu_Parts_032_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BackgroungImagePanel;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CantEquipTextPanel;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Equipment_000;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EquippedItemPanel;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EquippedStatusPanel;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFacePanel;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_356;                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_033_modern_C*           WBP_Menu_Parts_033_C_5;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconFaceTexture;                                   // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGDispEquipmentState*             EquipmentState;                                    // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_032_modern(int32 EntryPoint);
	void Construct();
	void UpdateContainerDelegate(const struct FJackUMGItemContainer& ItemContainer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_032_modern_C">();
	}
	static class UWBP_Menu_Parts_032_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_032_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_032_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_032_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_032_modern_C) == 0x000428, "Wrong size on UWBP_Menu_Parts_032_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_032_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, BackgroungImagePanel) == 0x0003D8, "Member 'UWBP_Menu_Parts_032_modern_C::BackgroungImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, CantEquipTextPanel) == 0x0003E0, "Member 'UWBP_Menu_Parts_032_modern_C::CantEquipTextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, Equipment_000) == 0x0003E8, "Member 'UWBP_Menu_Parts_032_modern_C::Equipment_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, EquippedItemPanel) == 0x0003F0, "Member 'UWBP_Menu_Parts_032_modern_C::EquippedItemPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, EquippedStatusPanel) == 0x0003F8, "Member 'UWBP_Menu_Parts_032_modern_C::EquippedStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, IconFacePanel) == 0x000400, "Member 'UWBP_Menu_Parts_032_modern_C::IconFacePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, WBP_Menu_Parts_000_C_356) == 0x000408, "Member 'UWBP_Menu_Parts_032_modern_C::WBP_Menu_Parts_000_C_356' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, WBP_Menu_Parts_033_C_5) == 0x000410, "Member 'UWBP_Menu_Parts_032_modern_C::WBP_Menu_Parts_033_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, IconFaceTexture) == 0x000418, "Member 'UWBP_Menu_Parts_032_modern_C::IconFaceTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_032_modern_C, EquipmentState) == 0x000420, "Member 'UWBP_Menu_Parts_032_modern_C::EquipmentState' has a wrong offset!");

}

