#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Item_100_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Item_100_modern.WBP_Menu_Dougu_Item_100_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern
// 0x0118 (0x0118 - 0x0000)
struct WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_InItemData2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0030(0x0018)()
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagType_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAssetName_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0078(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_NotifyTag;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Object;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Value;                                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAssetName_ReturnValue2;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorFusigiKazi*             CallFunc_GetAccessorFusigiKazi_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKaziTableLevelUp_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLoaddedTextureFromId_ReturnValue;      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemOsyareIconTexture_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern");
static_assert(sizeof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern) == 0x000118, "Wrong size on WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, Temp_bool_Variable) == 0x000019, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, Temp_byte_Variable) == 0x00001A, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, Temp_byte_Variable2) == 0x00001B, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Event_InItemData2) == 0x000028, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Event_InItemData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000030, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetDataIndex_ReturnValue) == 0x000048, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetBagType_ReturnValue) == 0x00004C, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue) == 0x000058, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetAssetName_ReturnValue) == 0x000060, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetAssetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetDecMenuText_ReturnValue) == 0x000078, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000090, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_CustomEvent_InResultCode) == 0x000098, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_CustomEvent_InLoaddedObject) == 0x0000A0, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_CustomEvent_InLoadInfo) == 0x0000A8, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, Temp_byte_Variable3) == 0x0000B4, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Event_NotifyTag) == 0x0000B8, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Event_InItemData) == 0x0000C0, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Event_Object) == 0x0000C8, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Event_Object' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Event_Value) == 0x0000D0, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_SwitchName_CmpSuccess) == 0x0000D4, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetAssetName_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetAssetName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetAccessorFusigiKazi_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetAccessorFusigiKazi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_IsKaziTableLevelUp_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_IsKaziTableLevelUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000F9, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_BooleanAND_ReturnValue) == 0x0000FA, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Select_Default) == 0x0000FB, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_SetLoaddedTextureFromId_ReturnValue) == 0x0000FC, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_SetLoaddedTextureFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, Temp_byte_Variable4) == 0x0000FD, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0000FE, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, Temp_bool_Variable2) == 0x0000FF, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, CallFunc_GetItemOsyareIconTexture_ReturnValue) == 0x000108, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::CallFunc_GetItemOsyareIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern, K2Node_Select2_Default) == 0x000110, "Member 'WBP_Menu_Dougu_Item_100_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Item_100_modern::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Dougu_Item_100_modern.WBP_Menu_Dougu_Item_100_modern_C.CancelLoadTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture");
static_assert(sizeof(WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture) == 0x000008, "Wrong size on WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Dougu_Item_100_modern_C_CancelLoadTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Item_100_modern.WBP_Menu_Dougu_Item_100_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0 final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0, InResultCode) == 0x000000, "Member 'WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Dougu_Item_100_modern_C_CustomEvent_0::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Dougu_Item_100_modern.WBP_Menu_Dougu_Item_100_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Dougu_Item_100_modern_C_DrawItemBase::InItemData' has a wrong offset!");

// Function WBP_Menu_Dougu_Item_100_modern.WBP_Menu_Dougu_Item_100_modern_C.NotificationItemBase
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase final
{
public:
	class FName                                   NotifyTag;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       InItemData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase");
static_assert(sizeof(WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase) == 0x000020, "Wrong size on WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase, NotifyTag) == 0x000000, "Member 'WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase::NotifyTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase, InItemData) == 0x000008, "Member 'WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase::InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase, Object) == 0x000010, "Member 'WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase::Object' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase, Value) == 0x000018, "Member 'WBP_Menu_Dougu_Item_100_modern_C_NotificationItemBase::Value' has a wrong offset!");

}

