#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Renkei_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Common_Renkei_000_modern.WBP_Menu_Common_Renkei_000_modern_C
// 0x00C8 (0x0438 - 0x0370)
class UWBP_Menu_Common_Renkei_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           CharaPanel_1;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CharaPanel_2;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CharaPanel_3;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CharaPanel_4;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFacePanel_1;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFacePanel_2;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFacePanel_3;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFacePanel_4;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Name_1;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Name_2;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Name_3;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Name_4;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_Anyone_1;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_Anyone_2;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_Anyone_3;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_Anyone_4;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           WBP_Menu_Parts_006;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_3;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_4;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PanelSizeY;                                        // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PanelPosY;                                         // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DescriptionTextId;                                 // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Common_Renkei_000_modern(int32 EntryPoint);
	void Construct();
	void SetCharacterData(const struct FJackUMGTuyosaRenkeiCharacterData& Data, class UCanvasPanel* CharaPanel, class UImage* IconFacePanel, class UWBP_Menu_Parts_000_modern_C* Name_0, class UWBP_Menu_Parts_000_modern_C* Parts000_Anyone);
	void SetData(class UJackUMGTuyosaRenkeiData* Data);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Common_Renkei_000_modern_C">();
	}
	static class UWBP_Menu_Common_Renkei_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Common_Renkei_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Common_Renkei_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Common_Renkei_000_modern_C");
static_assert(sizeof(UWBP_Menu_Common_Renkei_000_modern_C) == 0x000438, "Wrong size on UWBP_Menu_Common_Renkei_000_modern_C");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, CharaPanel_1) == 0x000378, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::CharaPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, CharaPanel_2) == 0x000380, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::CharaPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, CharaPanel_3) == 0x000388, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::CharaPanel_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, CharaPanel_4) == 0x000390, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::CharaPanel_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, IconFacePanel_1) == 0x000398, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::IconFacePanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, IconFacePanel_2) == 0x0003A0, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::IconFacePanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, IconFacePanel_3) == 0x0003A8, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::IconFacePanel_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, IconFacePanel_4) == 0x0003B0, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::IconFacePanel_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, InvalidationBox_0) == 0x0003B8, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Name_1) == 0x0003C0, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Name_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Name_2) == 0x0003C8, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Name_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Name_3) == 0x0003D0, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Name_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Name_4) == 0x0003D8, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Name_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Parts000_Anyone_1) == 0x0003E0, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Parts000_Anyone_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Parts000_Anyone_2) == 0x0003E8, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Parts000_Anyone_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Parts000_Anyone_3) == 0x0003F0, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Parts000_Anyone_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Parts000_Anyone_4) == 0x0003F8, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Parts000_Anyone_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, RootPanel) == 0x000400, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, WBP_Menu_Parts_001) == 0x000408, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::WBP_Menu_Parts_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, WBP_Menu_Parts_006) == 0x000410, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::WBP_Menu_Parts_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Window_Line_3) == 0x000418, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Window_Line_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, Window_Line_4) == 0x000420, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::Window_Line_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, PanelSizeY) == 0x000428, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::PanelSizeY' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, PanelPosY) == 0x00042C, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::PanelPosY' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Renkei_000_modern_C, DescriptionTextId) == 0x000430, "Member 'UWBP_Menu_Common_Renkei_000_modern_C::DescriptionTextId' has a wrong offset!");

}

