#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Soubi_Base_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern
// 0x0130 (0x0130 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug2; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug3; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug4; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBP_IF_CharachterCapture_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture;     // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_SlideTargetOrigin;                    // 0x00C4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MaxSlideTargetSize;                   // 0x00CC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MinSlideTargetSize;                   // 0x00D4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsDisableCharacterControl;     // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E8(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayOpenCloseAnim_AnimEndTime;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern) == 0x000130, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CustomEvent_EventTag) == 0x000008, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CustomEvent_InEventTag) == 0x000010, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000018, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CustomEvent_InObject) == 0x000020, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000029, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug) == 0x000030, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug2) == 0x000048, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug3) == 0x000060, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_bSuccess3) == 0x000070, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug4) == 0x000078, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_bSuccess4) == 0x000088, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A0, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture) == 0x0000B0, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_DynamicCast_bSuccess5) == 0x0000C0, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_bVisible) == 0x0000C1, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_SlideTargetOrigin) == 0x0000C4, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_MaxSlideTargetSize) == 0x0000CC, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_MinSlideTargetSize) == 0x0000D4, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_MinSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_CustomEvent_bIsDisableCharacterControl) == 0x0000DC, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_CustomEvent_bIsDisableCharacterControl' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_Animation) == 0x0000E0, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_MyGeometry) == 0x0000E8, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, K2Node_Event_InDeltaTime) == 0x000124, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern, CallFunc_PlayOpenCloseAnim_AnimEndTime) == 0x000128, "Member 'WBP_Menu_Soubi_Base_000_modern_C_ExecuteUbergraph_WBP_Menu_Soubi_Base_000_modern::CallFunc_PlayOpenCloseAnim_AnimEndTime' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Soubi_Base_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.IsDisableCharactorControl
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl final
{
public:
	bool                                          bIsDisableCharacterControl;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl) == 0x000001, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl) == 0x000001, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl, bIsDisableCharacterControl) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_IsDisableCharactorControl::bIsDisableCharacterControl' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.SetDebugTargetSize
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlideTargetOrigin;                                 // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxSlideTargetSize;                                // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinSlideTargetSize;                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize) == 0x000004, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize) == 0x00001C, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize, bVisible) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize, SlideTargetOrigin) == 0x000004, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize::SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize, MaxSlideTargetSize) == 0x00000C, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize::MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize, MinSlideTargetSize) == 0x000014, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetDebugTargetSize::MinSlideTargetSize' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Soubi_Base_000_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.SetCharactor
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_SetCharactor final
{
public:
	EJackCharacter                                InCharaType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharNameFromType_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_SetCharactor) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_SetCharactor");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_SetCharactor) == 0x000020, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_SetCharactor");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetCharactor, InCharaType) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetCharactor::InCharaType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetCharactor, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetCharactor::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_SetCharactor, CallFunc_GetCharNameFromType_ReturnValue) == 0x000010, "Member 'WBP_Menu_Soubi_Base_000_modern_C_SetCharactor::CallFunc_GetCharNameFromType_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.PlayOpenCloseAnim
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim final
{
public:
	bool                                          IsCloseAnim;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimEndTime;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewLocalVar_0;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim) == 0x000004, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim) == 0x000018, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim, IsCloseAnim) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim::IsCloseAnim' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim, PlaybackSpeed) == 0x000004, "Member 'WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim, AnimEndTime) == 0x000008, "Member 'WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim::AnimEndTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim, NewLocalVar_0) == 0x00000C, "Member 'WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim, CallFunc_GetEndTime_ReturnValue2) == 0x000014, "Member 'WBP_Menu_Soubi_Base_000_modern_C_PlayOpenCloseAnim::CallFunc_GetEndTime_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Soubi_Base_000_modern.WBP_Menu_Soubi_Base_000_modern_C.DispSoubiList
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList final
{
public:
	TArray<class UWBP_Menu_Soubi_Item_000_modern_C*> InItem000List;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UJackUMGSoubiList*                      InSoubiList;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGSoubiData>              RegionList;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UWBP_Menu_Soubi_Item_000_modern_C*> Item000List;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FJackUMGSoubiData>              K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGSoubiData                      CallFunc_Array_Get_Item;                           // 0x0058(0x0070)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      CallFunc_Array_Get_Item2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList) == 0x000008, "Wrong alignment on WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList");
static_assert(sizeof(WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList) == 0x0000D8, "Wrong size on WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList, InItem000List) == 0x000000, "Member 'WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList::InItem000List' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList, InSoubiList) == 0x000010, "Member 'WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList::InSoubiList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList, RegionList) == 0x000018, "Member 'WBP_Menu_Soubi_Base_000_modern_C_DispSoubiList::RegionList' has a wrong offset!");
