#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Input_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C
// 0x0090 (0x0568 - 0x04D8)
class UWBP_Menu_Namae_Input_002_modern_C final : public UJackUMGName
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NameListPanel;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnderBar;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_081_modern_C*           WBP_H_modoru;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_081_modern_C*           WBP_H_owaru;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Common_Button_000_modern_C*   WBP_Menu_Common_Button_000;                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_005_modern_C*           WBP_Name_UnderBar;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   NewVar_0;                                          // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StopBGMTime;                                       // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Owaru;                                             // 0x0548(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsConfirmationName;                                // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern(int32 EntryPoint);
	void InDisableNameEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void WidgetKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void CustomEvent_0(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void EndDelegate_Event_0();
	void FlashOffUnderBar();
	void FlashUnderBar();
	void GotoModeSelect();
	void InvalidationButton();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Set005Hidden();
	void TurnOffUnderBar();
	void WidgetBPActionDelegate_Copy(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Namae_Input_002_modern_C">();
	}
	static class UWBP_Menu_Namae_Input_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Namae_Input_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Namae_Input_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Namae_Input_002_modern_C");
static_assert(sizeof(UWBP_Menu_Namae_Input_002_modern_C) == 0x000568, "Wrong size on UWBP_Menu_Namae_Input_002_modern_C");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_Menu_Namae_Input_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, Flash) == 0x0004E0, "Member 'UWBP_Menu_Namae_Input_002_modern_C::Flash' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, Image_2) == 0x0004E8, "Member 'UWBP_Menu_Namae_Input_002_modern_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, InvalidationBox_0) == 0x0004F0, "Member 'UWBP_Menu_Namae_Input_002_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, ItemListPanel) == 0x0004F8, "Member 'UWBP_Menu_Namae_Input_002_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, NameListPanel) == 0x000500, "Member 'UWBP_Menu_Namae_Input_002_modern_C::NameListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, RootPanel) == 0x000508, "Member 'UWBP_Menu_Namae_Input_002_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, UnderBar) == 0x000510, "Member 'UWBP_Menu_Namae_Input_002_modern_C::UnderBar' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, WBP_H_modoru) == 0x000518, "Member 'UWBP_Menu_Namae_Input_002_modern_C::WBP_H_modoru' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, WBP_H_owaru) == 0x000520, "Member 'UWBP_Menu_Namae_Input_002_modern_C::WBP_H_owaru' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, WBP_Menu_Common_Button_000) == 0x000528, "Member 'UWBP_Menu_Namae_Input_002_modern_C::WBP_Menu_Common_Button_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, WBP_Name_UnderBar) == 0x000530, "Member 'UWBP_Menu_Namae_Input_002_modern_C::WBP_Name_UnderBar' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, NewVar_0) == 0x000538, "Member 'UWBP_Menu_Namae_Input_002_modern_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, StopBGMTime) == 0x000540, "Member 'UWBP_Menu_Namae_Input_002_modern_C::StopBGMTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, Owaru) == 0x000548, "Member 'UWBP_Menu_Namae_Input_002_modern_C::Owaru' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Input_002_modern_C, IsConfirmationName) == 0x000560, "Member 'UWBP_Menu_Namae_Input_002_modern_C::IsConfirmationName' has a wrong offset!");

}

