#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Quantity_002_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.OnGinkouEnter__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature final
{
public:
	class UJackUMGWidgetBase*                     Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature, Sender) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature, Value) == 0x000008, "Member 'WBP_Menu_Common_Quantity_002_modern_C_OnGinkouEnter__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.OnGinkouCancel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature final
{
public:
	class UJackUMGWidgetBase*                     Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature, Sender) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_OnGinkouCancel__DelegateSignature::Sender' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern
// 0x0110 (0x0110 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_InEventTag2;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase2;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject2;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsDeposit;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLimitOfGold_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDeposit_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLimitOfDeposit_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDeposit_ReturnValue2;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue2;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue2;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue3;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue4;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue4;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue5;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue5;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue6;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue6;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue7;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue7;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue8;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue8;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue9;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue9;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue10;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue2;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDeposit_ReturnValue3;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern) == 0x000110, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_InEventTag2) == 0x000038, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_InEventTag2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_InCallWidgetBase2) == 0x000040, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_InCallWidgetBase2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_InObject2) == 0x000048, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_InObject2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_IsDeposit) == 0x000051, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_IsDeposit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetAccessorCommon_ReturnValue) == 0x000058, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetGold_ReturnValue) == 0x000060, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetLimitOfGold_ReturnValue) == 0x000064, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetLimitOfGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetDeposit_ReturnValue) == 0x000068, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetDeposit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetLimitOfDeposit_ReturnValue) == 0x000070, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetLimitOfDeposit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetDeposit_ReturnValue2) == 0x000074, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetDeposit_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_Subtract_IntInt_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_Min_ReturnValue) == 0x00007C, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetGold_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetGold_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_Min_ReturnValue2) == 0x000084, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_Min_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue) == 0x000088, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_Divide_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000091, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue2) == 0x000094, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x000098, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue3) == 0x00009C, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue4) == 0x0000A0, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue4) == 0x0000A4, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue5) == 0x0000A8, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue5) == 0x0000AC, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue6) == 0x0000B0, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue6) == 0x0000B4, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue7) == 0x0000B8, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue7) == 0x0000BC, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue8) == 0x0000C0, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue8) == 0x0000C4, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue9) == 0x0000C8, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue9) == 0x0000CC, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_SelectInt_ReturnValue10) == 0x0000D0, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_SelectInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_InEventTag) == 0x0000D8, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x0000E0, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_InObject) == 0x0000E8, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000F0, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetAccessorCommon_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetAccessorCommon_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_CustomEvent_EventTag) == 0x000100, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, CallFunc_GetDeposit_ReturnValue3) == 0x000108, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::CallFunc_GetDeposit_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern, K2Node_SwitchName3_CmpSuccess) == 0x00010C, "Member 'WBP_Menu_Common_Quantity_002_modern_C_ExecuteUbergraph_WBP_Menu_Common_Quantity_002_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.CustomEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1) == 0x000018, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1, InEventTag) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1, InObject) == 0x000010, "Member 'WBP_Menu_Common_Quantity_002_modern_C_CustomEvent_1::InObject' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.SetupGinkouMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode final
{
public:
	bool                                          IsDeposit;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode) == 0x000001, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode) == 0x000001, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode, IsDeposit) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_SetupGinkouMode::IsDeposit' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.DefaultNotificationDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate) == 0x000018, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate, InEventTag) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate, InObject) == 0x000010, "Member 'WBP_Menu_Common_Quantity_002_modern_C_DefaultNotificationDelegate::InObject' has a wrong offset!");

// Function WBP_Menu_Common_Quantity_002_modern.WBP_Menu_Common_Quantity_002_modern_C.SetupQuantity
// 0x0088 (0x0088 - 0x0000)
struct WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity final
{
public:
	class FName                                   MenuTextId;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MenuTextId1;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MenuTextId2;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0028(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue2;    // 0x0058(0x0018)()
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue3;    // 0x0070(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity) == 0x000008, "Wrong alignment on WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity");
static_assert(sizeof(WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity) == 0x000088, "Wrong size on WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity, MenuTextId) == 0x000000, "Member 'WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity::MenuTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity, MenuTextId1) == 0x000008, "Member 'WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity::MenuTextId1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity, MenuTextId2) == 0x000010, "Member 'WBP_Menu_Common_Quantity_002_modern_C_SetupQuantity::MenuTextId2' has a wrong offset!");
