#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_031

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Title_BG_031.WBP_Menu_Title_BG_031_C.ExecuteUbergraph_WBP_Menu_Title_BG_031
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaybackSpeed;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031) == 0x000008, "Wrong alignment on WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031");
static_assert(sizeof(WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031) == 0x000018, "Wrong size on WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031, EntryPoint) == 0x000000, "Member 'WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031, K2Node_CustomEvent_Duration) == 0x000004, "Member 'WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031, K2Node_CustomEvent_PlaybackSpeed) == 0x000008, "Member 'WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031::K2Node_CustomEvent_PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031, K2Node_CustomEvent_EventTag) == 0x000010, "Member 'WBP_Menu_Title_BG_031_C_ExecuteUbergraph_WBP_Menu_Title_BG_031::K2Node_CustomEvent_EventTag' has a wrong offset!");

// Function WBP_Menu_Title_BG_031.WBP_Menu_Title_BG_031_C.PlayAnim031
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Title_BG_031_C_PlayAnim031 final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackSpeed;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_BG_031_C_PlayAnim031) == 0x000004, "Wrong alignment on WBP_Menu_Title_BG_031_C_PlayAnim031");
static_assert(sizeof(WBP_Menu_Title_BG_031_C_PlayAnim031) == 0x000008, "Wrong size on WBP_Menu_Title_BG_031_C_PlayAnim031");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_PlayAnim031, Duration) == 0x000000, "Member 'WBP_Menu_Title_BG_031_C_PlayAnim031::Duration' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_PlayAnim031, PlaybackSpeed) == 0x000004, "Member 'WBP_Menu_Title_BG_031_C_PlayAnim031::PlaybackSpeed' has a wrong offset!");

// Function WBP_Menu_Title_BG_031.WBP_Menu_Title_BG_031_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Title_BG_031_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

}

