#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_031_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_031_modern.WBP_Menu_Parts_031_modern_C.ExecuteUbergraph_WBP_Menu_Parts_031_modern
// 0x0120 (0x0120 - 0x0000)
struct WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKyoukaiEffectEventType                   K2Node_CustomEvent_EventType;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0040(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Get2ByteDecText_ReturnValue;              // 0x0060(0x0018)()
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetOddEffectId_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff2;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff3;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x00A0(0x0050)()
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMemberDataInKyoukai*    K2Node_DynamicCast_AsJack_UMGAccessor_Member_Data_in_Kyoukai; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern");
static_assert(sizeof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern) == 0x000120, "Wrong size on WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_CustomEvent_EventType) == 0x000006, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_Get2ByteDecText_ReturnValue) == 0x000060, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_Get2ByteDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_SetOddEffectId_Debuff) == 0x000078, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetOddEffectId_ReturnValue) == 0x000080, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetOddEffectId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_SetOddEffectId_Debuff2) == 0x000088, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_SetOddEffectId_Debuff2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_SetOddEffectId_Debuff3) == 0x00009C, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_SetOddEffectId_Debuff3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x00009D, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_CustomEvent_ItemContainer) == 0x0000A0, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, Temp_bool_Variable) == 0x0000F0, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_DynamicCast_AsJack_UMGAccessor_Member_Data_in_Kyoukai) == 0x0000F8, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_DynamicCast_AsJack_UMGAccessor_Member_Data_in_Kyoukai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_Select_Default) == 0x000101, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, K2Node_SwitchName_CmpSuccess) == 0x000102, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000108, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000110, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000118, "Member 'WBP_Menu_Parts_031_modern_C_ExecuteUbergraph_WBP_Menu_Parts_031_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_031_modern.WBP_Menu_Parts_031_modern_C.UpdateContainerDelegate_Copy
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy");
static_assert(sizeof(WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy) == 0x000050, "Wrong size on WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_031_modern_C_UpdateContainerDelegate_Copy::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_031_modern.WBP_Menu_Parts_031_modern_C.ShowOddEffectIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon final
{
public:
	EJackKyoukaiEffectEventType                   EventType_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon) == 0x000001, "Wrong alignment on WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon");
static_assert(sizeof(WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon) == 0x000001, "Wrong size on WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon, EventType_0) == 0x000000, "Member 'WBP_Menu_Parts_031_modern_C_ShowOddEffectIcon::EventType_0' has a wrong offset!");

// Function WBP_Menu_Parts_031_modern.WBP_Menu_Parts_031_modern_C.SetVisibilityParts
// 0x000A (0x000A - 0x0000)
struct WBP_Menu_Parts_031_modern_C_SetVisibilityParts final
{
public:
	bool                                          InBuffVisibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InNumberVisibility;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts) == 0x000001, "Wrong alignment on WBP_Menu_Parts_031_modern_C_SetVisibilityParts");
static_assert(sizeof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts) == 0x00000A, "Wrong size on WBP_Menu_Parts_031_modern_C_SetVisibilityParts");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, InBuffVisibility) == 0x000000, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::InBuffVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, InNumberVisibility) == 0x000001, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::InNumberVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, Temp_byte_Variable) == 0x000002, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, Temp_byte_Variable2) == 0x000003, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, Temp_byte_Variable3) == 0x000005, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, Temp_byte_Variable4) == 0x000006, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, K2Node_Select_Default) == 0x000007, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, Temp_bool_Variable2) == 0x000008, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_031_modern_C_SetVisibilityParts, K2Node_Select2_Default) == 0x000009, "Member 'WBP_Menu_Parts_031_modern_C_SetVisibilityParts::K2Node_Select2_Default' has a wrong offset!");

}

