#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_011_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_011_modern.WBP_Menu_Battle_List_011_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_011_modern
// 0x0440 (0x0440 - 0x0000)
struct WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EJackItem_Bag                                 Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 Temp_byte_Variable2;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_InsertUMGMenuWithSnap_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Status_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable3;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x0098(0x0050)()
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 Temp_byte_Variable4;                               // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable5;                               // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F7[0x1];                                       // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable6;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable7;                               // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable8;                               // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue2;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue3;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable9;                               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedItem_ReturnValue;               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable10;                              // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 Temp_byte_Variable11;                              // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          Temp_byte_Variable12;                              // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 K2Node_Select_Default;                             // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          Temp_byte_Variable13;                              // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue12;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue13;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SortBagItemList_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Setumei_003_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue14;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          K2Node_Select2_Default;                            // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x02A0(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemListInfo                   K2Node_MakeStruct_JackUMGItemListInfo;             // 0x0308(0x0018)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0328(0x0048)()
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue15;            // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemIdFromBagIndex_ReturnValue;        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 K2Node_Select3_Default;                            // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x0388(0x0048)()
	class FText                                   CallFunc_GetUMGBagText_NewParam;                   // 0x03D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x03F8(0x0048)()
};
static_assert(alignof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern");
static_assert(sizeof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern) == 0x000440, "Wrong size on WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_bool_Variable) == 0x000018, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable) == 0x000030, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable2) == 0x000031, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CustomEvent_EventTag) == 0x000038, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CustomEvent_EventName) == 0x000040, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CustomEvent_InItemBase) == 0x000048, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_SwitchName2_CmpSuccess) == 0x000051, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_int_Array_Index_Variable) == 0x000054, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000060, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_InsertUMGMenuWithSnap_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_InsertUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern) == 0x000078, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable3) == 0x000090, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CustomEvent_InKeyType) == 0x000091, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CustomEvent_bIsPressed) == 0x000092, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000093, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetItemContainerFromSelected_ReturnValue) == 0x000098, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetItemContainerFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000F1, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0000F2, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable4) == 0x0000F3, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable5) == 0x0000F4, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F5, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0000F6, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable6) == 0x000100, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable7) == 0x000101, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable8) == 0x000102, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000108, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000110, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000130, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x000138, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_ActionItem_ReturnValue) == 0x000140, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x000148, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x000150, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x000158, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue9) == 0x000160, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue10) == 0x000168, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_ActionItem_ReturnValue2) == 0x000170, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_ActionItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_ActionItem_ReturnValue3) == 0x000174, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_ActionItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable9) == 0x000178, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_IsEquippedItem_ReturnValue) == 0x000179, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_IsEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000180, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue11) == 0x000188, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000190, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_CharTypeToBagType_ReturnValue) == 0x000198, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_CharTypeToBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable10) == 0x000199, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable11) == 0x00019A, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x0001A0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_CanBeEquippedItemInChar_ReturnValue) == 0x0001A8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_CanBeEquippedItemInChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x0001B0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_BooleanAND_ReturnValue) == 0x0001B8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_bool_Variable2) == 0x0001B9, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable12) == 0x0001BA, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_Select_Default) == 0x0001BB, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_byte_Variable13) == 0x0001BC, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue12) == 0x0001C0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x0001C8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_int_Loop_Counter_Variable) == 0x0001D0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0001D4, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue13) == 0x0001D8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_SortBagItemList_ReturnValue) == 0x0001E8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_SortBagItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern) == 0x0001F0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_bSuccess2) == 0x0001F8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue14) == 0x000200, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x000208, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, Temp_struct_Variable) == 0x000210, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000220, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_Select2_Default) == 0x000221, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000228, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000230, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000238, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x000248, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue7) == 0x000250, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000258, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x000260, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_bSuccess3) == 0x000268, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CustomEvent_OutItemIndex) == 0x00026C, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CustomEvent_OutItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorBattle_ReturnValue8) == 0x000270, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorBattle_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000278, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000280, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_Array_Get_Item) == 0x000290, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_Array_Length_ReturnValue) == 0x000298, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetItemContainer_ReturnValue) == 0x0002A0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetItemContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0002F0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x0002F8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_DynamicCast_bSuccess4) == 0x000300, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_MakeStruct_JackUMGItemListInfo) == 0x000308, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_MakeStruct_JackUMGItemListInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_Array_Add_ReturnValue) == 0x000320, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000328, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetAccessorItem_ReturnValue15) == 0x000370, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetAccessorItem_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetItemIdFromBagIndex_ReturnValue) == 0x000378, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetItemIdFromBagIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_Select3_Default) == 0x000380, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x000388, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_GetUMGBagText_NewParam) == 0x0003D0, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_GetUMGBagText_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x0003E8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern, K2Node_MakeStruct_JackMessageArgumentData3) == 0x0003F8, "Member 'WBP_Menu_Battle_List_011_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_011_modern::K2Node_MakeStruct_JackMessageArgumentData3' has a wrong offset!");

// Function WBP_Menu_Battle_List_011_modern.WBP_Menu_Battle_List_011_modern_C.ItemIndexDelegate
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate final
{
public:
	int32                                         OutItemIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate) == 0x000004, "Wrong alignment on WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate) == 0x000004, "Wrong size on WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate, OutItemIndex) == 0x000000, "Member 'WBP_Menu_Battle_List_011_modern_C_ItemIndexDelegate::OutItemIndex' has a wrong offset!");

// Function WBP_Menu_Battle_List_011_modern.WBP_Menu_Battle_List_011_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_011_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_011_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_011_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_011_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Battle_List_011_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_011_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_011_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_011_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_011_modern.WBP_Menu_Battle_List_011_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_011_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_011_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_011_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_011_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_011_modern_C_OnItemListControl");
