#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_List_001_modern.WBP_Menu_Shop_List_001_modern_C.ExecuteUbergraph_WBP_Menu_Shop_List_001_modern
// 0x0140 (0x0140 - 0x0000)
struct WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Shop_List_002_modern_C*       K2Node_DynamicCast_AsWBP_Menu_Shop_List_002_Modern; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectiveItem_ReturnValue;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommonBag_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0098(0x0048)()
	class FName                                   K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern");
static_assert(sizeof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern) == 0x000140, "Wrong size on WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, Temp_name_Variable2) == 0x000010, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_CustomEvent_EventName) == 0x000030, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_CustomEvent_InItemBase) == 0x000038, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000041, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, Temp_bool_Variable) == 0x000042, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_SwitchName3_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000058, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Shop_List_002_Modern) == 0x000060, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Shop_List_002_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_IsSelectiveItem_ReturnValue) == 0x000069, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_IsSelectiveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000070, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000080, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000088, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetBagSelectedChar_ReturnValue) == 0x000089, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_IsCommonBag_ReturnValue) == 0x00008A, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_IsCommonBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000090, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000098, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_MakeArray_Array) == 0x0000E8, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x0000F8, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetShopTalkText_OutShopMessageId) == 0x000100, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetShopTalkText_OutShopMessageId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetShopTalkText_ReturnValue) == 0x000108, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetShopTalkText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000118, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000128, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000138, "Member 'WBP_Menu_Shop_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Shop_List_001_modern.WBP_Menu_Shop_List_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Shop_List_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Shop_List_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Shop_List_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Shop_List_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Shop_List_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Shop_List_001_modern.WBP_Menu_Shop_List_001_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Shop_List_001_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Shop_List_001_modern.WBP_Menu_Shop_List_001_modern_C.UpdateList
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Shop_List_001_modern_C_UpdateList final
{
public:
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetBagListBackground_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountMember_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Shop_List_001_modern_C_UpdateList) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_001_modern_C_UpdateList");
static_assert(sizeof(WBP_Menu_Shop_List_001_modern_C_UpdateList) == 0x000038, "Wrong size on WBP_Menu_Shop_List_001_modern_C_UpdateList");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000000, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_GetBagListBackground_ReturnValue) == 0x000018, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_GetBagListBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_GetAccessorItem_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_GetAccessorMembers_ReturnValue) == 0x000028, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_CountMember_ReturnValue) == 0x000030, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_CountMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_UpdateList, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Menu_Shop_List_001_modern_C_UpdateList::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Shop_List_001_modern.WBP_Menu_Shop_List_001_modern_C.ReturnToTop
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Shop_List_001_modern_C_ReturnToTop final
{
public:
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopID_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue2;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_001_modern_C_ReturnToTop");
static_assert(sizeof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop) == 0x000028, "Wrong size on WBP_Menu_Shop_List_001_modern_C_ReturnToTop");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop, CallFunc_GetAccessorItem_ReturnValue) == 0x000000, "Member 'WBP_Menu_Shop_List_001_modern_C_ReturnToTop::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Shop_List_001_modern_C_ReturnToTop::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop, CallFunc_GetShopID_ReturnValue) == 0x000010, "Member 'WBP_Menu_Shop_List_001_modern_C_ReturnToTop::CallFunc_GetShopID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop, CallFunc_OpenMenu_ReturnValue) == 0x000018, "Member 'WBP_Menu_Shop_List_001_modern_C_ReturnToTop::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_001_modern_C_ReturnToTop, CallFunc_OpenMenu_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Shop_List_001_modern_C_ReturnToTop::CallFunc_OpenMenu_ReturnValue2' has a wrong offset!");

}

