#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_Window_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern
// 0x0288 (0x0288 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYochiCount_AllCount;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYochiCount_ClearCount;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue2;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue3;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestDataCount_AllCount;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestDataCount_ClearCount;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleVictoryCount_ReturnValue;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue4;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDefeatMonsterTotalCount_ReturnValue;   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue5;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackMedalManager*                      CallFunc_GetMedalManager_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalAcquisitionItemCount_ReturnValue; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUnlockTiisanaMedalFlag_ReturnValue;    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue6;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0108(0x0018)()
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetSenrekiAchievementList_ReturnValue;    // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Clamp_ReturnValue7;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0140(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0148(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0154(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenFusigiKaji_ReturnValue;             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue4;                // 0x0178(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue5;                // 0x0180(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue6;                // 0x018C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue8;                       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0198(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue4;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue7;                // 0x01D8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalcItemsCount_ReturnValue;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue8;                // 0x01E4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue9;                // 0x01F0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue9;                       // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01FC(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue3;             // 0x0240(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue12;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern) == 0x000288, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetYochiCount_AllCount) == 0x000020, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetYochiCount_AllCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetYochiCount_ClearCount) == 0x000024, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetYochiCount_ClearCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue2) == 0x00002C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue3) == 0x000030, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x000034, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_RemoveChild_ReturnValue) == 0x000035, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetQuestDataCount_AllCount) == 0x000040, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetQuestDataCount_AllCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetQuestDataCount_ClearCount) == 0x000044, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetQuestDataCount_ClearCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000050, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_OpenMenu_ReturnValue) == 0x000058, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_CustomEvent_EventName) == 0x000060, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_CustomEvent_InItemBase) == 0x000068, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetSaveData_ReturnValue) == 0x000070, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetBattleVictoryCount_ReturnValue) == 0x000078, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetBattleVictoryCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x00007C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue4) == 0x000080, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetDefeatMonsterTotalCount_ReturnValue) == 0x000084, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetDefeatMonsterTotalCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue5) == 0x000088, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x00008C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000090, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000098, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_CustomEvent_EventTag) == 0x0000A0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000A8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x0000B0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0000C8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000D0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x0000D8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0000E0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetItemManager_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetItemManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetMedalManager_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetMedalManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetTotalAcquisitionItemCount_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetTotalAcquisitionItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUnlockTiisanaMedalFlag_ReturnValue) == 0x0000FC, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUnlockTiisanaMedalFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue6) == 0x000100, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x000108, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAchievementManager_ReturnValue) == 0x000120, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetSenrekiAchievementList_ReturnValue) == 0x000128, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetSenrekiAchievementList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue7) == 0x000138, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Array_Length_ReturnValue) == 0x00013C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000140, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x000150, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue3) == 0x000154, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000160, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue3) == 0x000168, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_IsOpenFusigiKaji_ReturnValue) == 0x000170, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_IsOpenFusigiKaji_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000174, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue4) == 0x000178, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue5) == 0x000180, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000188, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue6) == 0x00018C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue8) == 0x000194, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000198, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x0001B0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x0001B8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Add_FloatFloat_ReturnValue4) == 0x0001C0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue10) == 0x0001C8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue4) == 0x0001D0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue7) == 0x0001D8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_CalcItemsCount_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_CalcItemsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue8) == 0x0001E4, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Add_FloatFloat_ReturnValue5) == 0x0001EC, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_MakeVector2D_ReturnValue9) == 0x0001F0, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_MakeVector2D_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Clamp_ReturnValue9) == 0x0001F8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Clamp_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_Event_MyGeometry) == 0x0001FC, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_Event_InDeltaTime) == 0x000238, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x00023C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetAsciiDecText_ReturnValue3) == 0x000240, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetAsciiDecText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue11) == 0x000258, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000260, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000270, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000278, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern, CallFunc_GetUMGManager_ReturnValue12) == 0x000280, "Member 'WBP_Menu_Senreki_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Window_000_modern::CallFunc_GetUMGManager_ReturnValue12' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_Window_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.MenuSelectCheck
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck final
{
public:
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue2;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0010(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x001C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck) == 0x000028, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_GetGameFlagBool_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_GetGameFlagBool_ReturnValue2) == 0x000001, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_GetGameFlagBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_MakeVector2D_ReturnValue2) == 0x000010, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_MakeVector2D_ReturnValue3) == 0x00001C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Menu_Senreki_Window_000_modern_C_MenuSelectCheck::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.SetPlaytime
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime final
{
public:
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayTimeHour_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayTimeMinutes_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0028(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0040(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue2;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringAlignDigits_ReturnValue;         // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringAlignDigits_ReturnValue2;        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringReplaceTagToStr_ReturnValue;     // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime) == 0x0000C0, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetAccessorCommon_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetPlayTimeHour_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetPlayTimeHour_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetPlayTimeMinutes_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetPlayTimeMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetAsciiDecText_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_Conv_TextToString_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_Conv_TextToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetStringAlignDigits_ReturnValue) == 0x000078, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetStringAlignDigits_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetStringAlignDigits_ReturnValue2) == 0x000088, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetStringAlignDigits_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_GetStringReplaceTagToStr_ReturnValue) == 0x000098, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_GetStringReplaceTagToStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetPlaytime::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.SetRecipeBook
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook final
{
public:
	class UJackUMGAccessorFusigiKazi*             CallFunc_GetAccessorFusigiKazi_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKaziGamePlayNum_Total_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook) == 0x000010, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook, CallFunc_GetAccessorFusigiKazi_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook::CallFunc_GetAccessorFusigiKazi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook, CallFunc_GetKaziGamePlayNum_Total_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetRecipeBook::CallFunc_GetKaziGamePlayNum_Total_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_Window_000_modern.WBP_Menu_Senreki_Window_000_modern_C.SetTextBattleWin
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin");
static_assert(sizeof(WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin) == 0x000028, "Wrong size on WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin, Value) == 0x000000, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin::Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin, CallFunc_GetAsciiDecText_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_Window_000_modern_C_SetTextBattleWin::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");

