#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_064_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_064_modern.WBP_Menu_Parts_064_modern_C
// 0x0090 (0x0460 - 0x03D0)
class UWBP_Menu_Parts_064_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Base;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconPanel;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconPanelK;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestTitle;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Clear;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Jutyuu;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Tassei;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TextSet;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Description;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EJackProgression                              QuestState;                                        // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetNpcId;                                       // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackQuestReward                       RewardDara;                                        // 0x0438(0x0020)(Edit, BlueprintVisible, NoDestructor)
	class UPanelSlot*                             InPosition;                                        // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_064_modern(int32 EntryPoint);
	void SetData(const class FString& Title, EJackProgression State, const class FString& Description_0, const struct FJackQuestReward& RewardData, bool bHighlight, bool bFromQuestMemo, bool bYochiQuest);
	void CustomEvent_0(const struct FJackUMGItemContainer& ItemContainer);
	void Construct();
	void SetQuestIconVisibility(bool IsYochiQuest);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_064_modern_C">();
	}
	static class UWBP_Menu_Parts_064_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_064_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_064_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_064_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_064_modern_C) == 0x000460, "Wrong size on UWBP_Menu_Parts_064_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_064_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, Base) == 0x0003D8, "Member 'UWBP_Menu_Parts_064_modern_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, IconPanel) == 0x0003E0, "Member 'UWBP_Menu_Parts_064_modern_C::IconPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, IconPanelK) == 0x0003E8, "Member 'UWBP_Menu_Parts_064_modern_C::IconPanelK' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, QuestTitle) == 0x0003F0, "Member 'UWBP_Menu_Parts_064_modern_C::QuestTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, Text_Clear) == 0x0003F8, "Member 'UWBP_Menu_Parts_064_modern_C::Text_Clear' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, Text_Jutyuu) == 0x000400, "Member 'UWBP_Menu_Parts_064_modern_C::Text_Jutyuu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, Text_Tassei) == 0x000408, "Member 'UWBP_Menu_Parts_064_modern_C::Text_Tassei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, TextSet) == 0x000410, "Member 'UWBP_Menu_Parts_064_modern_C::TextSet' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, Description) == 0x000418, "Member 'UWBP_Menu_Parts_064_modern_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, QuestState) == 0x000428, "Member 'UWBP_Menu_Parts_064_modern_C::QuestState' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, TargetNpcId) == 0x000430, "Member 'UWBP_Menu_Parts_064_modern_C::TargetNpcId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, RewardDara) == 0x000438, "Member 'UWBP_Menu_Parts_064_modern_C::RewardDara' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_064_modern_C, InPosition) == 0x000458, "Member 'UWBP_Menu_Parts_064_modern_C::InPosition' has a wrong offset!");

}

