#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_061

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_061.WBP_Menu_Title_BG_061_C
// 0x00F8 (0x0468 - 0x0370)
class UWBP_Menu_Title_BG_061_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_15;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_16;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_17;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_19;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_20;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_21;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_22;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_00;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_01;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_02;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_03;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_04;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_05;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_06;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_07;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_08;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_09;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_24_Aka_Image_00;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_25_Aka_Image_23;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_26_Aka_Image_01;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewVar_0;                                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Title_BG_061(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_061_C">();
	}
	static class UWBP_Menu_Title_BG_061_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_061_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_061_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_061_C");
static_assert(sizeof(UWBP_Menu_Title_BG_061_C) == 0x000468, "Wrong size on UWBP_Menu_Title_BG_061_C");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_061_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_BG_061_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_10) == 0x000380, "Member 'UWBP_Menu_Title_BG_061_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_11) == 0x000388, "Member 'UWBP_Menu_Title_BG_061_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_12) == 0x000390, "Member 'UWBP_Menu_Title_BG_061_C::Image_12' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_13) == 0x000398, "Member 'UWBP_Menu_Title_BG_061_C::Image_13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_14) == 0x0003A0, "Member 'UWBP_Menu_Title_BG_061_C::Image_14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_15) == 0x0003A8, "Member 'UWBP_Menu_Title_BG_061_C::Image_15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_16) == 0x0003B0, "Member 'UWBP_Menu_Title_BG_061_C::Image_16' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_17) == 0x0003B8, "Member 'UWBP_Menu_Title_BG_061_C::Image_17' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_18) == 0x0003C0, "Member 'UWBP_Menu_Title_BG_061_C::Image_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_19) == 0x0003C8, "Member 'UWBP_Menu_Title_BG_061_C::Image_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_20) == 0x0003D0, "Member 'UWBP_Menu_Title_BG_061_C::Image_20' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_21) == 0x0003D8, "Member 'UWBP_Menu_Title_BG_061_C::Image_21' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_22) == 0x0003E0, "Member 'UWBP_Menu_Title_BG_061_C::Image_22' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_23) == 0x0003E8, "Member 'UWBP_Menu_Title_BG_061_C::Image_23' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_00) == 0x0003F0, "Member 'UWBP_Menu_Title_BG_061_C::Image_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_01) == 0x0003F8, "Member 'UWBP_Menu_Title_BG_061_C::Image_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_02) == 0x000400, "Member 'UWBP_Menu_Title_BG_061_C::Image_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_03) == 0x000408, "Member 'UWBP_Menu_Title_BG_061_C::Image_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_04) == 0x000410, "Member 'UWBP_Menu_Title_BG_061_C::Image_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_05) == 0x000418, "Member 'UWBP_Menu_Title_BG_061_C::Image_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_06) == 0x000420, "Member 'UWBP_Menu_Title_BG_061_C::Image_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_07) == 0x000428, "Member 'UWBP_Menu_Title_BG_061_C::Image_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_08) == 0x000430, "Member 'UWBP_Menu_Title_BG_061_C::Image_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_09) == 0x000438, "Member 'UWBP_Menu_Title_BG_061_C::Image_09' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_24_Aka_Image_00) == 0x000440, "Member 'UWBP_Menu_Title_BG_061_C::Image_24_Aka_Image_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_25_Aka_Image_23) == 0x000448, "Member 'UWBP_Menu_Title_BG_061_C::Image_25_Aka_Image_23' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, Image_26_Aka_Image_01) == 0x000450, "Member 'UWBP_Menu_Title_BG_061_C::Image_26_Aka_Image_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, RootPanel) == 0x000458, "Member 'UWBP_Menu_Title_BG_061_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_061_C, NewVar_0) == 0x000460, "Member 'UWBP_Menu_Title_BG_061_C::NewVar_0' has a wrong offset!");

}

