#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Scenario_Window_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Scenario_Window_000_modern.WBP_Menu_Scenario_Window_000_modern_C
// 0x0048 (0x03B8 - 0x0370)
class UWBP_Menu_Scenario_Window_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pic;                                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Arasuzi;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                OmoideRef;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BGMaterial;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Scenario_Window_000_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo);
	void CustomEvent_1(class FName EventTag);
	void CustomEvent_2(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo);
	void SetCloseAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Scenario_Window_000_modern_C">();
	}
	static class UWBP_Menu_Scenario_Window_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Scenario_Window_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Scenario_Window_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Scenario_Window_000_modern_C");
static_assert(sizeof(UWBP_Menu_Scenario_Window_000_modern_C) == 0x0003B8, "Wrong size on UWBP_Menu_Scenario_Window_000_modern_C");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, Out) == 0x000378, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, In) == 0x000380, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, BG) == 0x000388, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, Frame) == 0x000390, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, Pic) == 0x000398, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::Pic' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, Text_Arasuzi) == 0x0003A0, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::Text_Arasuzi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, OmoideRef) == 0x0003A8, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::OmoideRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Scenario_Window_000_modern_C, BGMaterial) == 0x0003B0, "Member 'UWBP_Menu_Scenario_Window_000_modern_C::BGMaterial' has a wrong offset!");

}

