#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Setumei_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_Setumei_000_modern.WBP_Menu_Common_Setumei_000_modern_C.ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_TextID;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Caption;                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InTargetWidget;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSnapType                              K2Node_CustomEvent_InSnapType;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_WidgetSize;                     // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue3;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern");
static_assert(sizeof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern) == 0x000050, "Wrong size on WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, K2Node_CustomEvent_TextID) == 0x000008, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::K2Node_CustomEvent_TextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, K2Node_CustomEvent_Caption) == 0x000010, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::K2Node_CustomEvent_Caption' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, K2Node_CustomEvent_InTargetWidget) == 0x000028, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::K2Node_CustomEvent_InTargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, K2Node_CustomEvent_InSnapType) == 0x000030, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::K2Node_CustomEvent_InSnapType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, K2Node_CustomEvent_WidgetSize) == 0x000040, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::K2Node_CustomEvent_WidgetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern, CallFunc_SlotAsCanvasSlot_ReturnValue3) == 0x000048, "Member 'WBP_Menu_Common_Setumei_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_000_modern::CallFunc_SlotAsCanvasSlot_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_000_modern.WBP_Menu_Common_Setumei_000_modern_C.SetWindowSize
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize final
{
public:
	struct FVector2D                              WidgetSize_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize) == 0x000004, "Wrong alignment on WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize");
static_assert(sizeof(WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize, WidgetSize_0) == 0x000000, "Member 'WBP_Menu_Common_Setumei_000_modern_C_SetWindowSize::WidgetSize_0' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_000_modern.WBP_Menu_Common_Setumei_000_modern_C.Setup84ModeWithSnap
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap final
{
public:
	class UJackUMGWidgetBase*                     InTargetWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSnapType                              InSnapType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap");
static_assert(sizeof(WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap) == 0x000010, "Wrong size on WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap, InTargetWidget) == 0x000000, "Member 'WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap::InTargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap, InSnapType) == 0x000008, "Member 'WBP_Menu_Common_Setumei_000_modern_C_Setup84ModeWithSnap::InSnapType' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_000_modern.WBP_Menu_Common_Setumei_000_modern_C.SetCaptionData
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData final
{
public:
	class FString                                 Caption;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData");
static_assert(sizeof(WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData) == 0x000010, "Wrong size on WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData, Caption) == 0x000000, "Member 'WBP_Menu_Common_Setumei_000_modern_C_SetCaptionData::Caption' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_000_modern.WBP_Menu_Common_Setumei_000_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Setumei_000_modern_C_SetData final
{
public:
	class FName                                   TextID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_000_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_000_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Common_Setumei_000_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_000_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Common_Setumei_000_modern_C_SetData, TextID) == 0x000000, "Member 'WBP_Menu_Common_Setumei_000_modern_C_SetData::TextID' has a wrong offset!");

}

