#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_032_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_032_modern.WBP_Menu_Parts_032_modern_C.ExecuteUbergraph_WBP_Menu_Parts_032_modern
// 0x0118 (0x0118 - 0x0000)
struct WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0018(0x0050)()
	class UJackUMGDispEquipmentState*             K2Node_DynamicCast_AsJack_UMGDisp_Equipment_State; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGEquipmentParam                 CallFunc_Array_Get_Item;                           // 0x0078(0x0038)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGEquipmentParam                 CallFunc_Array_Get_Item2;                          // 0x00C0(0x0038)()
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern");
static_assert(sizeof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern) == 0x000118, "Wrong size on WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, Temp_name_Variable2) == 0x000010, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, K2Node_CustomEvent_ItemContainer) == 0x000018, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, K2Node_DynamicCast_AsJack_UMGDisp_Equipment_State) == 0x000068, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::K2Node_DynamicCast_AsJack_UMGDisp_Equipment_State' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, K2Node_SwitchName_CmpSuccess) == 0x0000B0, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, Temp_bool_Variable) == 0x0000B1, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, CallFunc_Array_Get_Item2) == 0x0000C0, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, K2Node_Select_Default) == 0x000100, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'WBP_Menu_Parts_032_modern_C_ExecuteUbergraph_WBP_Menu_Parts_032_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Menu_Parts_032_modern.WBP_Menu_Parts_032_modern_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_032_modern_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

}

