#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_022_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_022_modern.WBP_Menu_Parts_022_modern_C.ExecuteUbergraph_WBP_Menu_Parts_022_modern
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0008(0x0050)()
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select4_Default;                            // 0x00B0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern");
static_assert(sizeof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern) == 0x0000C0, "Wrong size on WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_CustomEvent_ItemContainer) == 0x000008, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_bool_Variable) == 0x000058, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_CustomEvent_EventTag) == 0x000060, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000068, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_SwitchName_CmpSuccess) == 0x000071, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, CallFunc_Conv_IntToBool_ReturnValue) == 0x000072, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_SwitchName2_CmpSuccess) == 0x000073, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_byte_Variable) == 0x000074, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_byte_Variable2) == 0x000075, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_bool_Variable2) == 0x000076, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_byte_Variable3) == 0x000077, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_byte_Variable4) == 0x000078, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_bool_Variable3) == 0x000079, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_Select_Default) == 0x000091, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_Select2_Default) == 0x000092, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_byte_Variable5) == 0x000093, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_byte_Variable6) == 0x000094, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, Temp_bool_Variable4) == 0x000095, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_Select3_Default) == 0x000096, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000098, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern, K2Node_Select4_Default) == 0x0000B0, "Member 'WBP_Menu_Parts_022_modern_C_ExecuteUbergraph_WBP_Menu_Parts_022_modern::K2Node_Select4_Default' has a wrong offset!");

// Function WBP_Menu_Parts_022_modern.WBP_Menu_Parts_022_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_022_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_022_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_022_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_022_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_022_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_022_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_022_modern.WBP_Menu_Parts_022_modern_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_022_modern_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_022_modern.WBP_Menu_Parts_022_modern_C.SetPriceMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_022_modern_C_SetPriceMode final
{
public:
	bool                                          IsPriceMode_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_022_modern_C_SetPriceMode) == 0x000001, "Wrong alignment on WBP_Menu_Parts_022_modern_C_SetPriceMode");
static_assert(sizeof(WBP_Menu_Parts_022_modern_C_SetPriceMode) == 0x000001, "Wrong size on WBP_Menu_Parts_022_modern_C_SetPriceMode");
static_assert(offsetof(WBP_Menu_Parts_022_modern_C_SetPriceMode, IsPriceMode_0) == 0x000000, "Member 'WBP_Menu_Parts_022_modern_C_SetPriceMode::IsPriceMode_0' has a wrong offset!");

}

