#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_Logo_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_Logo_000.WBP_Menu_Title_Logo_000_C
// 0x00E0 (0x0450 - 0x0370)
class UWBP_Menu_Title_Logo_000_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero00_D;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero01_R;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero02_A;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero03_G;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero04_O;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero05_N;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero06_Q;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero07_U;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero08_E;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero09_S;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero10_T;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero20_XI_1;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero21_XI_2;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero22_XI_3;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero23_XI_4;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero24_XI_5;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DemoIcon;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 S_Glow;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine_000;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine_001;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title_Logo_000_Panel;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleRoot;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              GlowPosition;                                      // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GlowColor;                                         // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DemoPosition;                                      // 0x0444(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Title_Logo_000(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_Logo_000_C">();
	}
	static class UWBP_Menu_Title_Logo_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_Logo_000_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_Logo_000_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_Logo_000_C");
static_assert(sizeof(UWBP_Menu_Title_Logo_000_C) == 0x000450, "Wrong size on UWBP_Menu_Title_Logo_000_C");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_Logo_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_Logo_000_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero00_D) == 0x000380, "Member 'UWBP_Menu_Title_Logo_000_C::Zero00_D' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero01_R) == 0x000388, "Member 'UWBP_Menu_Title_Logo_000_C::Zero01_R' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero02_A) == 0x000390, "Member 'UWBP_Menu_Title_Logo_000_C::Zero02_A' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero03_G) == 0x000398, "Member 'UWBP_Menu_Title_Logo_000_C::Zero03_G' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero04_O) == 0x0003A0, "Member 'UWBP_Menu_Title_Logo_000_C::Zero04_O' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero05_N) == 0x0003A8, "Member 'UWBP_Menu_Title_Logo_000_C::Zero05_N' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero06_Q) == 0x0003B0, "Member 'UWBP_Menu_Title_Logo_000_C::Zero06_Q' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero07_U) == 0x0003B8, "Member 'UWBP_Menu_Title_Logo_000_C::Zero07_U' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero08_E) == 0x0003C0, "Member 'UWBP_Menu_Title_Logo_000_C::Zero08_E' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero09_S) == 0x0003C8, "Member 'UWBP_Menu_Title_Logo_000_C::Zero09_S' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero10_T) == 0x0003D0, "Member 'UWBP_Menu_Title_Logo_000_C::Zero10_T' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero20_XI_1) == 0x0003D8, "Member 'UWBP_Menu_Title_Logo_000_C::Zero20_XI_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero21_XI_2) == 0x0003E0, "Member 'UWBP_Menu_Title_Logo_000_C::Zero21_XI_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero22_XI_3) == 0x0003E8, "Member 'UWBP_Menu_Title_Logo_000_C::Zero22_XI_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero23_XI_4) == 0x0003F0, "Member 'UWBP_Menu_Title_Logo_000_C::Zero23_XI_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Zero24_XI_5) == 0x0003F8, "Member 'UWBP_Menu_Title_Logo_000_C::Zero24_XI_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, DemoIcon) == 0x000400, "Member 'UWBP_Menu_Title_Logo_000_C::DemoIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, RootPanel) == 0x000408, "Member 'UWBP_Menu_Title_Logo_000_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, S_Glow) == 0x000410, "Member 'UWBP_Menu_Title_Logo_000_C::S_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Shine_000) == 0x000418, "Member 'UWBP_Menu_Title_Logo_000_C::Shine_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Shine_001) == 0x000420, "Member 'UWBP_Menu_Title_Logo_000_C::Shine_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, Title_Logo_000_Panel) == 0x000428, "Member 'UWBP_Menu_Title_Logo_000_C::Title_Logo_000_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, TitleRoot) == 0x000430, "Member 'UWBP_Menu_Title_Logo_000_C::TitleRoot' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, GlowPosition) == 0x000438, "Member 'UWBP_Menu_Title_Logo_000_C::GlowPosition' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, GlowColor) == 0x000440, "Member 'UWBP_Menu_Title_Logo_000_C::GlowColor' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Logo_000_C, DemoPosition) == 0x000444, "Member 'UWBP_Menu_Title_Logo_000_C::DemoPosition' has a wrong offset!");

}

