#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_006_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_006_modern.WBP_Hud_Status_006_modern_C.ExecuteUbergraph_WBP_Hud_Status_006_modern
// 0x0358 (0x0358 - 0x0000)
struct WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGAnimSet                        K2Node_MakeStruct_JackUMGAnimSet;                  // 0x0018(0x0038)(NoDestructor)
	struct FJackUMGAnimSet                        K2Node_MakeStruct_JackUMGAnimSet2;                 // 0x0050(0x0038)(NoDestructor)
	bool                                          CallFunc_SetAnimSet_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAnimSet_ReturnValue2;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGHudAnimationAction                    K2Node_CustomEvent_AnimType3;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFieldDamage;                  // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index4;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGHudAnimationAction                    K2Node_CustomEvent_AnimType2;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivePosition_Active;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivePosition_Active2;                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivePosition_Active3;                 // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item2;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item3;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item4;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             CallFunc_Array_Get_Item5;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             CallFunc_Array_Get_Item6;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D8(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             CallFunc_Array_Get_Item7;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index3;                         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Acion;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGHudAnimationAction                    K2Node_CustomEvent_AnimType;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item8;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackUMGHudAnimationAction AnimType, bool IsFieldDamage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item9;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item10;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             CallFunc_Array_Get_Item11;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item12;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsShort;                        // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUIFaceIcon                               K2Node_CustomEvent_InType;                         // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index2;                         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item13;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item14;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item15;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item16;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Chara_Frame_001_C*             CallFunc_Array_Get_Item17;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item18;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTurnCharacter_ReturnValue;              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGHudInitQueued                         CallFunc_GetQueuedMemberInBattle_ReturnValue;      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Chara_Frame_001_C*             CallFunc_Array_Get_Item19;                         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item20;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F[0x1];                                      // 0x022F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item21;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23E[0x2];                                      // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Type, int32 Index)>      K2Node_CreateDelegate_OutputDelegate2;             // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item22;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item23;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsShort, EJackUIFaceIcon InType, int32 Index)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Type;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item24;                         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, int32 Acion, EJackUMGHudAnimationAction AnimType)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPhotoMode;                   // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsPhotoMode)>            K2Node_CreateDelegate_OutputDelegate6;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hud_Status_003_modern_C*           CallFunc_Array_Get_Item25;                         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                CallFunc_GetOffsets_ReturnValue;                   // 0x02FC(0x0010)(NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSuperMode_ReturnValue;                  // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0318(0x0010)(NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, EJackUMGHudAnimationAction AnimType)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue8;                 // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern) == 0x000008, "Wrong alignment on WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern");
static_assert(sizeof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern) == 0x000358, "Wrong size on WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable2) == 0x000010, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_MakeStruct_JackUMGAnimSet) == 0x000018, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_MakeStruct_JackUMGAnimSet' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_MakeStruct_JackUMGAnimSet2) == 0x000050, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_MakeStruct_JackUMGAnimSet2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_SetAnimSet_ReturnValue) == 0x000088, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_SetAnimSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_SetAnimSet_ReturnValue2) == 0x000089, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_SetAnimSet_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_AnimType3) == 0x00008A, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_AnimType3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_IsFieldDamage) == 0x00008B, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_IsFieldDamage' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00008C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_Index4) == 0x000090, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_Index4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_AnimType2) == 0x000094, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_AnimType2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable3) == 0x000098, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x00009C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_IsActivePosition_Active) == 0x00009D, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_IsActivePosition_Active' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_IsActivePosition_Active2) == 0x00009E, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_IsActivePosition_Active2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_IsActivePosition_Active3) == 0x00009F, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_IsActivePosition_Active3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item2) == 0x0000B0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item3) == 0x0000B8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item4) == 0x0000C0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item5) == 0x0000C8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item6) == 0x0000D0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_Event_MyGeometry) == 0x0000D8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_Event_InDeltaTime) == 0x000114, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item7) == 0x000118, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable2) == 0x000120, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x000124, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00012C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable3) == 0x000130, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable4) == 0x000134, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x000138, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue4) == 0x00013C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_Index3) == 0x000140, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_Index3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_Acion) == 0x000144, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_Acion' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_AnimType) == 0x000148, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_AnimType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000149, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item8) == 0x000150, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000158, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000159, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable4) == 0x00015C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000160, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item9) == 0x000170, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item10) == 0x000178, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item10' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item11) == 0x000180, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item11' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable5) == 0x000188, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable6) == 0x00018C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue5) == 0x000190, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue6) == 0x000194, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable5) == 0x000198, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item12) == 0x0001A0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item12' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue) == 0x0001A8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_IsShort) == 0x0001AC, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_IsShort' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_InType) == 0x0001AD, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_InType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_Index2) == 0x0001B0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_Index2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item13) == 0x0001B8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item13' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue2) == 0x0001C0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0001C4, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item14) == 0x0001C8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item14' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue3) == 0x0001D0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue3) == 0x0001D4, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable6) == 0x0001D8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item15) == 0x0001E0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item15' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item16) == 0x0001E8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item16' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item17) == 0x0001F0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item17' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Array_Index_Variable7) == 0x0001F8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Array_Index_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item18) == 0x000200, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item18' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_IsTurnCharacter_ReturnValue) == 0x000208, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_IsTurnCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_GetQueuedMemberInBattle_ReturnValue) == 0x000209, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_GetQueuedMemberInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_SwitchEnum3_CmpSuccess) == 0x00020A, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item19) == 0x000210, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item19' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue4) == 0x000218, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue4) == 0x00021C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item20) == 0x000220, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item20' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue5) == 0x000228, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue5) == 0x00022C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_byte_Variable) == 0x00022D, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_byte_Variable2) == 0x00022E, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item21) == 0x000230, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item21' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue6) == 0x000238, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_bool_Variable) == 0x00023C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue6) == 0x00023D, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000240, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item22) == 0x000250, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item22' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item23) == 0x000258, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item23' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000260, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000270, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_Type) == 0x000280, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_Index) == 0x000284, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x000288, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item24) == 0x000290, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item24' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x000298, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x0002A8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CustomEvent_bIsPhotoMode) == 0x0002B0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CustomEvent_bIsPhotoMode' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate6) == 0x0002B8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_Select_Default) == 0x0002C8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_GetBattleManager_ReturnValue) == 0x0002D0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_IsInBattle_ReturnValue) == 0x0002D8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Get_Item25) == 0x0002E0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Get_Item25' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Array_Length_ReturnValue7) == 0x0002E8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0002F0, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue7) == 0x0002F8, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_GetOffsets_ReturnValue) == 0x0002FC, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_GetOffsets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x00030C, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_IsSuperMode_ReturnValue) == 0x000310, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_IsSuperMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000314, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_MakeStruct_Margin) == 0x000318, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000328, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, K2Node_CreateDelegate_OutputDelegate7) == 0x000330, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, Temp_int_Loop_Counter_Variable7) == 0x000340, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::Temp_int_Loop_Counter_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x000348, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Less_IntInt_ReturnValue8) == 0x000350, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Less_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern, CallFunc_Add_IntInt_ReturnValue7) == 0x000354, "Member 'WBP_Hud_Status_006_modern_C_ExecuteUbergraph_WBP_Hud_Status_006_modern::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");

// Function WBP_Hud_Status_006_modern.WBP_Hud_Status_006_modern_C.ChangePhotoModeDelegate_Event_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0 final
{
public:
	bool                                          bIsPhotoMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0) == 0x000001, "Wrong alignment on WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0");
static_assert(sizeof(WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0) == 0x000001, "Wrong size on WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0");
static_assert(offsetof(WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0, bIsPhotoMode) == 0x000000, "Member 'WBP_Hud_Status_006_modern_C_ChangePhotoModeDelegate_Event_0::bIsPhotoMode' has a wrong offset!");

// Function WBP_Hud_Status_006_modern.WBP_Hud_Status_006_modern_C.CustomEvent_4
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Status_006_modern_C_CustomEvent_4 final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
