#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_105_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_105_modern.WBP_Menu_Dougu_Syousai_105_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_InItemSyousaiRef;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGItemGetInfo>            CallFunc_GetDropMapList_OutMapList;                // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetDropMapList_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern) == 0x0000E0, "Wrong size on WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, Temp_int_Variable) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_CustomEvent_InEventTag) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_CustomEvent_InObject) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_CustomEvent_InItemSyousaiRef) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_CustomEvent_InItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_SwitchName_CmpSuccess) == 0x000049, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_GetDropMapList_OutMapList) == 0x000058, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_GetDropMapList_OutMapList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_GetDropMapList_ReturnValue) == 0x000068, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_GetDropMapList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, Temp_byte_Variable2) == 0x000080, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, Temp_int_Variable2) == 0x000084, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x00008C, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, Temp_bool_Variable) == 0x000098, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Array_Get_Item2) == 0x0000A0, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000AC, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Min_ReturnValue) == 0x0000D4, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_105_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_105_modern.WBP_Menu_Dougu_Syousai_105_modern_C.DispItemFromSyousaiRef
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef final
{
public:
	class UJackUMGItemSyousai*                    InItemSyousaiRef;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong size on WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef, InItemSyousaiRef) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_DispItemFromSyousaiRef::InItemSyousaiRef' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_105_modern.WBP_Menu_Dougu_Syousai_105_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_105_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

}

