#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_List_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.KinkoActionFinishEvent__DelegateSignature
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature final
{
public:
	bool                                          bFinish;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bContinue;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnd;                                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature) == 0x000003, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature, bFinish) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature::bFinish' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature, bContinue) == 0x000001, "Member 'WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature::bContinue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature, bEnd) == 0x000002, "Member 'WBP_Menu_Dougu_List_000_modern_C_KinkoActionFinishEvent__DelegateSignature::bEnd' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountInBag_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetFirstMembarCharacterType_ReturnValue;  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackUMGDouguSeiriResult NewParam, int32 InResult)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommonBag_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_bIsEmptyList_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Main_Command_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Main_Command_000_Modern; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGDouguSeiriResult                      K2Node_CustomEvent_NewParam;                       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InResult;                       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue3;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommonBag_ReturnValue2;                 // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue4;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_CountInBag_ReturnValue2;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateItemBrowserList_NumData;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_UpdateItemBrowserList_NumData2;           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable4;                               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGeneralValue_ReturnValue;              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGActionBagInfo                  CallFunc_GetSelectedActionBagInfo_ReturnValue;     // 0x01F4(0x0008)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x0218(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0230(0x0048)()
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Button_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Common_Button_000_Modern; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRemovingWidget_ReturnValue;             // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGDouguSeiriResult                      Temp_byte_Variable;                                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue5;          // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountInBag_ReturnValue3;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern) == 0x0002E0, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_struct_Variable) == 0x000020, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000038, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_CountInBag_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_CountInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000049, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_EventName) == 0x000058, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_InItemBase) == 0x000060, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetFirstMembarCharacterType_ReturnValue) == 0x000068, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetFirstMembarCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000069, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_CharTypeToBagType_ReturnValue) == 0x00006A, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_CharTypeToBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000070, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000080, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000088, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000090, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0000A0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_SwitchName4_CmpSuccess) == 0x0000B0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_struct_Variable2) == 0x0000B8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x0000C8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_name_Variable) == 0x0000D8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_IsCommonBag_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_IsCommonBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x0000E8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_struct_Variable3) == 0x0000F0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_bIsEmptyList_ReturnValue) == 0x000110, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_bIsEmptyList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x000114, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000118, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000120, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000128, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_name_Variable2) == 0x000130, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_DynamicCast_AsWBP_Menu_Main_Command_000_Modern) == 0x000138, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_DynamicCast_AsWBP_Menu_Main_Command_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_NewParam) == 0x000141, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_InResult) == 0x000144, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_InResult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_name_Variable3) == 0x000148, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x000150, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetBagSelectedType_ReturnValue3) == 0x000158, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetBagSelectedType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_IsCommonBag_ReturnValue2) == 0x000159, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_IsCommonBag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_InKeyType) == 0x00015A, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CustomEvent_bIsPressed) == 0x00015B, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x000160, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000168, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetBagSelectedType_ReturnValue4) == 0x000169, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetBagSelectedType_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_struct_Variable4) == 0x000170, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_CountInBag_ReturnValue2) == 0x000180, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_CountInBag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000184, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_UpdateItemBrowserList_NumData) == 0x000188, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_UpdateItemBrowserList_NumData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_struct_Variable5) == 0x000190, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_UpdateItemBrowserList_NumData2) == 0x0001A0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_UpdateItemBrowserList_NumData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_name_Variable4) == 0x0001A8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x0001B0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0001B8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetSoundSet_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0001C8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0001D0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_name_Variable5) == 0x0001D8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetGeneralValue_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetGeneralValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001E4, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue9) == 0x0001E8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetValidValue_ReturnValue) == 0x0001F0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetSelectedActionBagInfo_ReturnValue) == 0x0001F4, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetSelectedActionBagInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001FC, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_BooleanAND_ReturnValue) == 0x0001FD, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue10) == 0x000200, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetBagSelectedChar_ReturnValue) == 0x000208, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x000210, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_struct_Variable6) == 0x000218, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000228, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000230, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000278, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000280, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_DynamicCast_AsWBP_Menu_Common_Button_000_Modern) == 0x000288, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_DynamicCast_AsWBP_Menu_Common_Button_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_DynamicCast_bSuccess2) == 0x000290, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_IsRemovingWidget_ReturnValue) == 0x000291, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_IsRemovingWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x000298, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, Temp_byte_Variable) == 0x0002A8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0002B0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, K2Node_Select_Default) == 0x0002B8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetAccessorItem_ReturnValue11) == 0x0002C0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetAccessorItem_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetBagSelectedType_ReturnValue5) == 0x0002C8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetBagSelectedType_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_CountInBag_ReturnValue3) == 0x0002CC, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_CountInBag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0002D0, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x0002D8, "Member 'WBP_Menu_Dougu_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.KeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Dougu_List_000_modern_C_KeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0 final
{
public:
	EJackUMGDouguSeiriResult                      NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InResult;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0) == 0x000004, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0, NewParam) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0, InResult) == 0x000004, "Member 'WBP_Menu_Dougu_List_000_modern_C_CustomEvent_0::InResult' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Dougu_List_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.UpdateList
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_UpdateList final
{
public:
	class UTexture2D*                             BGTexRef;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBagListBackground_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultipleCharacters_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_UpdateList) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_UpdateList");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_UpdateList) == 0x000040, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_UpdateList");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, BGTexRef) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::BGTexRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_GetAccessorItem_ReturnValue) == 0x000010, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_GetAccessorMembers_ReturnValue) == 0x000020, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_GetBagListBackground_ReturnValue) == 0x000028, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_GetBagListBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_IsMultipleCharacters_ReturnValue) == 0x000030, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_IsMultipleCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_UpdateList, CallFunc_GetAccessorItem_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Dougu_List_000_modern_C_UpdateList::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.FocusSelf
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_FocusSelf final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_000_modern_C_FocusSelf) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_000_modern_C_FocusSelf");
static_assert(sizeof(WBP_Menu_Dougu_List_000_modern_C_FocusSelf) == 0x000008, "Wrong size on WBP_Menu_Dougu_List_000_modern_C_FocusSelf");
static_assert(offsetof(WBP_Menu_Dougu_List_000_modern_C_FocusSelf, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Dougu_List_000_modern_C_FocusSelf::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_List_000_modern.WBP_Menu_Dougu_List_000_modern_C.OpenDouguList
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Dougu_List_000_modern_C_OpenDouguList final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
