#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.OpenRuraMenuEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature, bOpen) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_OpenRuraMenuEvent__DelegateSignature::bOpen' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_001_modern
// 0x0210 (0x0210 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_List_010_modern_C*   K2Node_CustomEvent_Sender2;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRura;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountRuraList_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalMapOpened_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayingSeaSkyMap_bDisplaying;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_WorldMap_List_002_modern_C*   K2Node_CustomEvent_Sender;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveDataInRura*         K2Node_CustomEvent_RuraData;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackWorldMapOpenReason                       CallFunc_GetWorldMapOpenReason_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue2;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue2;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue3;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMainMapOverlayWidgetBase*       CallFunc_GetMapTextWidget_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_MapText_Z01_1F_01_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Map_Text_Z01_1F_01_Modern; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMainMapOverlayWidgetBase*       CallFunc_GetMapTextWidget_ReturnValue2;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_MapText_Z01_1F_01_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Map_Text_Z01_1F_01_Modern2; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D0(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_000_modern_C*        K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAcquiredRura_ReturnValue;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUIDisableCamera_Disabled;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0154(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue3;               // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, bool bValue, class UObject* Payload)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, bool bValue, class UObject* Payload)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackWorldMapOpenReason                       CallFunc_GetWorldMapOpenReason_ReturnValue2;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue4;          // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue5;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNowLoading_ReturnValue;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDisplayNowLoading_ReturnValue;      // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate5;             // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultDeltaTime_ReturnValue;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackWorldMapOpenReason                       CallFunc_GetWorldMapOpenReason_ReturnValue3;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAcquiredRura_ReturnValue2;              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue4;               // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_PushMenu_ReturnValue;                     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_WorldMap_Button_003_modern_C* K2Node_DynamicCast_AsWBP_Menu_World_Map_Button_003_Modern; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern) == 0x000210, "Wrong size on WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_Sender2) == 0x000020, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_bRura) == 0x000028, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_bRura' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000030, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_CountRuraList_ReturnValue) == 0x000038, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_CountRuraList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsLocalMapOpened_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsLocalMapOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsDisplayingSeaSkyMap_bDisplaying) == 0x000049, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsDisplayingSeaSkyMap_bDisplaying' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_TestsWorldMapState_ReturnValue) == 0x00004A, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_TestsWorldMapState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsSeaOrSkyMap_ReturnValue) == 0x000060, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsSeaOrSkyMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_Sender) == 0x000068, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_RuraData) == 0x000070, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_RuraData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetWorldMapOpenReason_ReturnValue) == 0x000078, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetWorldMapOpenReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsSeaOrSkyMap_ReturnValue2) == 0x000079, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsSeaOrSkyMap_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_TestsWorldMapState_ReturnValue2) == 0x00007B, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_TestsWorldMapState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_TestsWorldMapState_ReturnValue3) == 0x00007C, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_TestsWorldMapState_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetMapTextWidget_ReturnValue) == 0x000080, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetMapTextWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_AsWBP_Menu_Map_Text_Z01_1F_01_Modern) == 0x000090, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_AsWBP_Menu_Map_Text_Z01_1F_01_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetMapTextWidget_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetMapTextWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsValid_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_AsWBP_Menu_Map_Text_Z01_1F_01_Modern2) == 0x0000B0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_AsWBP_Menu_Map_Text_Z01_1F_01_Modern2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_bSuccess2) == 0x0000B8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_Event_MyGeometry) == 0x0000D0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_Event_InDeltaTime) == 0x00010C, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_EventTag) == 0x000110, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000118, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000120, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_InKeyType) == 0x000128, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CustomEvent_bIsPressed) == 0x000129, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00012A, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000130, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern) == 0x000138, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_AsWBP_Menu_World_Map_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_bSuccess3) == 0x000140, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000148, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsAcquiredRura_ReturnValue) == 0x000150, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsAcquiredRura_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUIDisableCamera_Disabled) == 0x000151, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUIDisableCamera_Disabled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000154, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsSeaOrSkyMap_ReturnValue3) == 0x00015C, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsSeaOrSkyMap_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000160, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000168, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000178, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000188, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetWorldMapOpenReason_ReturnValue2) == 0x000190, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetWorldMapOpenReason_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_TestsWorldMapState_ReturnValue4) == 0x000191, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_TestsWorldMapState_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000192, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000193, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000198, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_TestsWorldMapState_ReturnValue5) == 0x0001A0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_TestsWorldMapState_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsNowLoading_ReturnValue) == 0x0001A1, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsNowLoading_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_ShouldDisplayNowLoading_ReturnValue) == 0x0001A2, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_ShouldDisplayNowLoading_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x0001A8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0001B8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetSoundSet_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetDefaultDeltaTime_ReturnValue) == 0x0001C8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetDefaultDeltaTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsValid_ReturnValue3) == 0x0001CC, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0001CD, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x0001D0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetWorldMapOpenReason_ReturnValue3) == 0x0001D8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetWorldMapOpenReason_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsAcquiredRura_ReturnValue2) == 0x0001D9, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsAcquiredRura_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001DA, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_IsSeaOrSkyMap_ReturnValue4) == 0x0001DB, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_IsSeaOrSkyMap_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_PushMenu_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_PushMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_BooleanAND_ReturnValue2) == 0x0001E8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_AsWBP_Menu_World_Map_Button_003_Modern) == 0x0001F0, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_AsWBP_Menu_World_Map_Button_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, K2Node_DynamicCast_bSuccess4) == 0x0001F8, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetTimeRange_MinTime) == 0x0001FC, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_GetTimeRange_MaxTime) == 0x000200, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x000204, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000208, "Member 'WBP_Menu_WorldMap_001_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_001_modern::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.WidgetKeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_WorldMap_001_modern_C_WidgetKeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_Tick");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_WorldMap_001_modern_C_Tick");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_WorldMap_001_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.SetRuraData
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_SetRuraData final
{
public:
	class UWBP_Menu_WorldMap_List_002_modern_C*   Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveDataInRura*         RuraData_0;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_SetRuraData) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_SetRuraData");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_SetRuraData) == 0x000010, "Wrong size on WBP_Menu_WorldMap_001_modern_C_SetRuraData");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_SetRuraData, Sender) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_SetRuraData::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_SetRuraData, RuraData_0) == 0x000008, "Member 'WBP_Menu_WorldMap_001_modern_C_SetRuraData::RuraData_0' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.OnSelectWorldMapMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu final
{
public:
	class UWBP_Menu_WorldMap_List_010_modern_C*   Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRura;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu) == 0x000010, "Wrong size on WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu, Sender) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu, bRura) == 0x000008, "Member 'WBP_Menu_WorldMap_001_modern_C_OnSelectWorldMapMenu::bRura' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.Open
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_Open final
{
public:
	ESlateVisibility                              FloorSelectorVisibility;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackWorldMapOpenReason                       CallFunc_GetWorldMapOpenReason_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGAnimSet                        K2Node_MakeStruct_JackUMGAnimSet;                  // 0x0020(0x0038)(NoDestructor)
	bool                                          CallFunc_SetAnimSet_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapOrigin_ReturnValue;                 // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_Open) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_Open");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_Open) == 0x000080, "Wrong size on WBP_Menu_WorldMap_001_modern_C_Open");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, FloorSelectorVisibility) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::FloorSelectorVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_GetSoundSet_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_GetWorldMapOpenReason_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_GetWorldMapOpenReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_IsSeaOrSkyMap_ReturnValue) == 0x00001A, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_IsSeaOrSkyMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, K2Node_MakeStruct_JackUMGAnimSet) == 0x000020, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::K2Node_MakeStruct_JackUMGAnimSet' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_SetAnimSet_ReturnValue) == 0x000058, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_SetAnimSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000060, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_GetUMGManager_ReturnValue2) == 0x000068, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Open, CallFunc_GetMapOrigin_ReturnValue) == 0x000070, "Member 'WBP_Menu_WorldMap_001_modern_C_Open::CallFunc_GetMapOrigin_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_001_modern.WBP_Menu_WorldMap_001_modern_C.Close
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_WorldMap_001_modern_C_Close final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMainMapOverlayWidgetBase*       CallFunc_SetMapTextWidget_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackWorldMapOpenReason                       CallFunc_GetWorldMapOpenReason_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackWorldMapOpenReason                       Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMainMapOverlayWidgetBase*       CallFunc_GetMapTextWidget_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMapID_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGAnimSet                        K2Node_MakeStruct_JackUMGAnimSet;                  // 0x0040(0x0038)(NoDestructor)
	bool                                          CallFunc_IsSeaOrSkyMap_Result;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAnimSet_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_001_modern_C_Close) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_001_modern_C_Close");
static_assert(sizeof(WBP_Menu_WorldMap_001_modern_C_Close) == 0x000080, "Wrong size on WBP_Menu_WorldMap_001_modern_C_Close");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_bool_Variable) == 0x000000, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_bool_Variable2) == 0x000001, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_bool_Variable3) == 0x000002, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_bool_Variable4) == 0x000003, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_bool_Variable5) == 0x000004, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_bool_Variable6) == 0x000005, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, CallFunc_SetMapTextWidget_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::CallFunc_SetMapTextWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, CallFunc_GetWorldMapOpenReason_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::CallFunc_GetWorldMapOpenReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, Temp_byte_Variable) == 0x000011, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, CallFunc_GetMapTextWidget_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::CallFunc_GetMapTextWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_001_modern_C_Close, K2Node_Select_Default) == 0x000021, "Member 'WBP_Menu_WorldMap_001_modern_C_Close::K2Node_Select_Default' has a wrong offset!");
