#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_MonsterZukan_Window_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Senreki_MonsterZukan_Window_001_modern.WBP_Menu_Senreki_MonsterZukan_Window_001_modern_C
// 0x0110 (0x0540 - 0x0430)
class UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel_1;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel_2;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList002;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MonsterFieldList;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_706;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_707;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_708;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_709;                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_713;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_714;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_715;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_716;                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_717;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_718;                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_719;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_720;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_721;                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_722;                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_723;                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_724;                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_002_modern_C*           WBP_Menu_Parts_002;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           WBP_Menu_Parts_006;                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           WBP_Menu_Parts_007;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_343;                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           WBP_Menu_Parts_037_C_427;                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EJackCharacter                                SelectedCharType;                                  // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CharSoubiData;                                     // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiList*                      SoubiList;                                         // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiState*                     SoubiState;                                        // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharacterName;                                     // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsShowTokugi;                                      // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_001_modern(int32 EntryPoint);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void CustomEvent_0(class FName EventTag);
	void SelectVisit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Senreki_MonsterZukan_Window_001_modern_C">();
	}
	static class UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C");
static_assert(sizeof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C) == 0x000540, "Wrong size on UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, CaptionPanel_1) == 0x000438, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::CaptionPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, CaptionPanel_2) == 0x000440, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::CaptionPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, InvalidationBox_0) == 0x000448, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, ItemList002) == 0x000450, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::ItemList002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, MonsterFieldList) == 0x000458, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::MonsterFieldList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_706) == 0x000460, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_706' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_707) == 0x000468, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_707' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_708) == 0x000470, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_708' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_709) == 0x000478, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_709' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_713) == 0x000480, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_713' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_714) == 0x000488, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_714' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_715) == 0x000490, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_715' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_716) == 0x000498, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_716' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_717) == 0x0004A0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_717' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_718) == 0x0004A8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_718' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_719) == 0x0004B0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_719' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_720) == 0x0004B8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_720' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_721) == 0x0004C0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_721' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_722) == 0x0004C8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_722' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_723) == 0x0004D0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_723' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_000_C_724) == 0x0004D8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_000_C_724' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_002) == 0x0004E0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_006) == 0x0004E8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_007) == 0x0004F0, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_024_C_343) == 0x0004F8, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_024_C_343' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, WBP_Menu_Parts_037_C_427) == 0x000500, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::WBP_Menu_Parts_037_C_427' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, SelectedCharType) == 0x000508, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::SelectedCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, CharSoubiData) == 0x000510, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::CharSoubiData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, SoubiList) == 0x000518, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::SoubiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, SoubiState) == 0x000520, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::SoubiState' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, CharacterName) == 0x000528, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C, IsShowTokugi) == 0x000538, "Member 'UWBP_Menu_Senreki_MonsterZukan_Window_001_modern_C::IsShowTokugi' has a wrong offset!");

}

