#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_Fusigikazi_Window_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_Fusigikazi_Window_000_modern.WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern
// 0x0120 (0x0120 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorFusigiKazi*             CallFunc_GetAccessorFusigiKazi_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetKaziGamePlayNum_Retry_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorFusigiKazi*             CallFunc_GetAccessorFusigiKazi_ReturnValue2;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSuccessNum_Normal_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue2;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGFusigiPossibleList>     CallFunc_GetFusigiPossibleList_ReturnValue;        // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue4;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x00E0(0x0018)()
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue5;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue6;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue2;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecipeNumber_ReturnValue3;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern) == 0x000120, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_CustomEvent_EventName) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_CustomEvent_InItemBase) == 0x000010, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000019, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorFusigiKazi_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorFusigiKazi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetKaziGamePlayNum_Retry_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetKaziGamePlayNum_Retry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_Clamp_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorFusigiKazi_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorFusigiKazi_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetSuccessNum_Normal_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetSuccessNum_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_Clamp_ReturnValue2) == 0x00003C, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_Clamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000060, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetFusigiPossibleList_ReturnValue) == 0x000068, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetFusigiPossibleList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000080, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000088, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000090, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue3) == 0x000098, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000B0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue4) == 0x0000B8, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000C8, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue5) == 0x0000F8, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000100, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue6) == 0x000108, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetRecipeNumber_ReturnValue) == 0x000110, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetRecipeNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetRecipeNumber_ReturnValue2) == 0x000114, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetRecipeNumber_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern, CallFunc_GetRecipeNumber_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Fusigikazi_Window_000_modern::CallFunc_GetRecipeNumber_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_000_modern.WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_Fusigikazi_Window_000_modern.WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_Fusigikazi_Window_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

}

