#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_034_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_034_modern.WBP_Menu_Parts_034_modern_C.ExecuteUbergraph_WBP_Menu_Parts_034_modern
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0010(0x0050)()
	class UJackUMGItemActionStatus*               K2Node_DynamicCast_AsJack_UMGItem_Action_Status;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIconFromOddEffectStatusId_IsDebuff;    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          CallFunc_GetTextColorTypeHP_ReturnValue;           // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextFromTextId_ReturnValue;            // 0x0098(0x0018)()
	class FText                                   CallFunc_GetTextFromTextId_ReturnValue2;           // 0x00B0(0x0018)()
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern");
static_assert(sizeof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern) == 0x0000D8, "Wrong size on WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_CustomEvent_ItemContainer) == 0x000010, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_DynamicCast_AsJack_UMGItem_Action_Status) == 0x000060, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_DynamicCast_AsJack_UMGItem_Action_Status' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_SwitchName_CmpSuccess) == 0x000069, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, Temp_bool_Variable) == 0x00006A, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00006B, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, Temp_byte_Variable) == 0x00007C, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00007D, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_Select_Default) == 0x000080, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_SetIconFromOddEffectStatusId_IsDebuff) == 0x00008D, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_SetIconFromOddEffectStatusId_IsDebuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, Temp_byte_Variable2) == 0x00008E, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_GetTextColorTypeHP_ReturnValue) == 0x00008F, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_GetTextColorTypeHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, Temp_bool_Variable2) == 0x000090, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_Select2_Default) == 0x000091, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_GetTextFromTextId_ReturnValue) == 0x000098, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_GetTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, CallFunc_GetTextFromTextId_ReturnValue2) == 0x0000B0, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::CallFunc_GetTextFromTextId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'WBP_Menu_Parts_034_modern_C_ExecuteUbergraph_WBP_Menu_Parts_034_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Menu_Parts_034_modern.WBP_Menu_Parts_034_modern_C.CustomEvent_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_034_modern_C_CustomEvent_0 final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_034_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_034_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_034_modern_C_CustomEvent_0) == 0x000050, "Wrong size on WBP_Menu_Parts_034_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_CustomEvent_0, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_034_modern_C_CustomEvent_0::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_034_modern.WBP_Menu_Parts_034_modern_C.SetVisibilityParts
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Parts_034_modern_C_SetVisibilityParts final
{
public:
	bool                                          InBuffVisibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InNumberVisibility;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_034_modern_C_SetVisibilityParts) == 0x000001, "Wrong alignment on WBP_Menu_Parts_034_modern_C_SetVisibilityParts");
static_assert(sizeof(WBP_Menu_Parts_034_modern_C_SetVisibilityParts) == 0x000002, "Wrong size on WBP_Menu_Parts_034_modern_C_SetVisibilityParts");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_SetVisibilityParts, InBuffVisibility) == 0x000000, "Member 'WBP_Menu_Parts_034_modern_C_SetVisibilityParts::InBuffVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_SetVisibilityParts, InNumberVisibility) == 0x000001, "Member 'WBP_Menu_Parts_034_modern_C_SetVisibilityParts::InNumberVisibility' has a wrong offset!");

// Function WBP_Menu_Parts_034_modern.WBP_Menu_Parts_034_modern_C.SetOddEffectType
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_034_modern_C_SetOddEffectType final
{
public:
	class FName                                   InOddEffectId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_034_modern_C_SetOddEffectType) == 0x000008, "Wrong alignment on WBP_Menu_Parts_034_modern_C_SetOddEffectType");
static_assert(sizeof(WBP_Menu_Parts_034_modern_C_SetOddEffectType) == 0x000008, "Wrong size on WBP_Menu_Parts_034_modern_C_SetOddEffectType");
static_assert(offsetof(WBP_Menu_Parts_034_modern_C_SetOddEffectType, InOddEffectId) == 0x000000, "Member 'WBP_Menu_Parts_034_modern_C_SetOddEffectType::InOddEffectId' has a wrong offset!");

}

