#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_017_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_017_modern.WBP_Menu_Parts_017_modern_C.OnChangeValue__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature");
static_assert(sizeof(WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature, Value) == 0x000000, "Member 'WBP_Menu_Parts_017_modern_C_OnChangeValue__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Parts_017_modern.WBP_Menu_Parts_017_modern_C.ExecuteUbergraph_WBP_Menu_Parts_017_modern
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue9;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue10;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue11;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern");
static_assert(sizeof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern) == 0x000058, "Wrong size on WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue2) == 0x00001C, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue3) == 0x000020, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue4) == 0x000024, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue5) == 0x000028, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue6) == 0x00002C, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue7) == 0x000030, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue8) == 0x000034, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue9) == 0x000038, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue10) == 0x00003C, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, CallFunc_Array_Add_ReturnValue11) == 0x000040, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::CallFunc_Array_Add_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, K2Node_CustomEvent_EventTag) == 0x000048, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Parts_017_modern_C_ExecuteUbergraph_WBP_Menu_Parts_017_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Parts_017_modern.WBP_Menu_Parts_017_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_017_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_017_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_017_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_017_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_017_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_017_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_017_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

}

