#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Arasuzi_All_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C
// 0x00D0 (0x0440 - 0x0370)
class UWBP_Menu_Arasuzi_All_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeClear;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeBlack;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fade;                                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Arasuzi_Picture_000_C*        WBP_Hud_Arasuzi_Picture_000;                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Arasuzi_Text_000_modern_C*    WBP_Hud_Arasuzi_Text_000;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Arasuzi_Rou_000_modern_C*     WBP_Menu_Arasuzi_Rou_000;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     TextureList;                                       // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         TextList;                                          // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bSkipIsPossible_;                                  // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bWaitForInput;                                     // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInputFlag;                                        // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CB[0x1];                                      // 0x03CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayingPageIndex;                                  // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeBlackTime;                                     // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeClearTime;                                     // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SafeTime;                                          // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SepiaAnimTime;                                     // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextFadeInWait;                                    // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextFadeInTime;                                    // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InputWait;                                         // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClossFadeAnimTime;                                 // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageCountMax;                                      // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayedPageIndex;                                // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PictureClossFadeCheck;                             // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PictureFadeInCheck;                                // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplaySafeCheck;                                  // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextFadeInCheck;                                   // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromMenu;                                         // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BGMID;                                             // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGetArasuziDataResult*              ArasuziData;                                       // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TextFadeOutCheck;                                  // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStarted;                                         // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       PlayingAnim;                                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RequestAnim;                                       // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipedFromMenu;                                   // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayAnimRequest(class UWidgetAnimation* InAnimation);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void RunArasuzi(bool bFromMenu_0);
	void SkipToInputWait();
	void InitParamater();
	void PlayFadeClear();
	void PlayFadeBlack();
	void RunArasuziPage(int32 Index_0);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Arasuzi_All_000_modern_C">();
	}
	static class UWBP_Menu_Arasuzi_All_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Arasuzi_All_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Arasuzi_All_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Arasuzi_All_000_modern_C");
static_assert(sizeof(UWBP_Menu_Arasuzi_All_000_modern_C) == 0x000440, "Wrong size on UWBP_Menu_Arasuzi_All_000_modern_C");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, FadeClear) == 0x000378, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::FadeClear' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, FadeBlack) == 0x000380, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::FadeBlack' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, Fade) == 0x000388, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::Fade' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, WBP_Hud_Arasuzi_Picture_000) == 0x000390, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::WBP_Hud_Arasuzi_Picture_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, WBP_Hud_Arasuzi_Text_000) == 0x000398, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::WBP_Hud_Arasuzi_Text_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, WBP_Menu_Arasuzi_Rou_000) == 0x0003A0, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::WBP_Menu_Arasuzi_Rou_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, TextureList) == 0x0003A8, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::TextureList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, TextList) == 0x0003B8, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::TextList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, bSkipIsPossible_) == 0x0003C8, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::bSkipIsPossible_' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, bWaitForInput) == 0x0003C9, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::bWaitForInput' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, bInputFlag) == 0x0003CA, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::bInputFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, PlayingPageIndex) == 0x0003CC, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::PlayingPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, FadeBlackTime) == 0x0003D0, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::FadeBlackTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, FadeClearTime) == 0x0003D4, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::FadeClearTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, SafeTime) == 0x0003D8, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::SafeTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, SepiaAnimTime) == 0x0003DC, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::SepiaAnimTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, TextFadeInWait) == 0x0003E0, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::TextFadeInWait' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, TextFadeInTime) == 0x0003E4, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::TextFadeInTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, InputWait) == 0x0003E8, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::InputWait' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, ClossFadeAnimTime) == 0x0003EC, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::ClossFadeAnimTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, PageCountMax) == 0x0003F0, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::PageCountMax' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, DisplayedPageIndex) == 0x0003F4, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::DisplayedPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, PictureClossFadeCheck) == 0x0003F8, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::PictureClossFadeCheck' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, PictureFadeInCheck) == 0x0003FC, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::PictureFadeInCheck' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, DisplaySafeCheck) == 0x000400, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::DisplaySafeCheck' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, TextFadeInCheck) == 0x000404, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::TextFadeInCheck' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, bFromMenu) == 0x000408, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::bFromMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, BGMID) == 0x000410, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::BGMID' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, ArasuziData) == 0x000418, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::ArasuziData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, TextFadeOutCheck) == 0x000420, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::TextFadeOutCheck' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, IsStarted) == 0x000424, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::IsStarted' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, PlayingAnim) == 0x000428, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::PlayingAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, RequestAnim) == 0x000430, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::RequestAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_All_000_modern_C, bSkipedFromMenu) == 0x000438, "Member 'UWBP_Menu_Arasuzi_All_000_modern_C::bSkipedFromMenu' has a wrong offset!");

}

