#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Arasuzi_Picture_000

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Texture3;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SepiaAnimTimeMax;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Texture2;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ClossFadeAnimTimeMax;           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000) == 0x000080, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, EntryPoint) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_Event_InDeltaTime) == 0x000044, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_CustomEvent_Texture3) == 0x000048, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_CustomEvent_Texture3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_CustomEvent_SepiaAnimTimeMax) == 0x000054, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_CustomEvent_SepiaAnimTimeMax' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_CustomEvent_Texture2) == 0x000060, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_CustomEvent_Texture2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_CustomEvent_ClossFadeAnimTimeMax) == 0x000068, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_CustomEvent_ClossFadeAnimTimeMax' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_Less_FloatFloat_ReturnValue) == 0x000074, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000075, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000, K2Node_CustomEvent_Texture) == 0x000078, "Member 'WBP_Menu_Arasuzi_Picture_000_C_ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000::K2Node_CustomEvent_Texture' has a wrong offset!");

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.SkipAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation) == 0x000008, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation, Texture) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_SkipAnimation::Texture' has a wrong offset!");

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.PlayClossFadeAnim
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim final
{
public:
	float                                         ClossFadeAnimTimeMax_0;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim) == 0x000004, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim) == 0x000004, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim, ClossFadeAnimTimeMax_0) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_PlayClossFadeAnim::ClossFadeAnimTimeMax_0' has a wrong offset!");

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.SetClossFadeTargetTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture) == 0x000008, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture, Texture) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_SetClossFadeTargetTexture::Texture' has a wrong offset!");

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.PlayColorAnim
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim final
{
public:
	float                                         SepiaAnimTimeMax_0;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim) == 0x000004, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim) == 0x000004, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim, SepiaAnimTimeMax_0) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_PlayColorAnim::SepiaAnimTimeMax_0' has a wrong offset!");

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.SetTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_SetTexture) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_SetTexture");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_SetTexture) == 0x000008, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_SetTexture");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_SetTexture, Texture) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_SetTexture::Texture' has a wrong offset!");

// Function WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Arasuzi_Picture_000_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_Picture_000_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Arasuzi_Picture_000_C_Tick");
static_assert(sizeof(WBP_Menu_Arasuzi_Picture_000_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Arasuzi_Picture_000_C_Tick");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Arasuzi_Picture_000_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_Picture_000_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Arasuzi_Picture_000_C_Tick::InDeltaTime' has a wrong offset!");

}

