#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_018_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_018_modern.WBP_Menu_Parts_018_modern_C.ExecuteUbergraph_WBP_Menu_Parts_018_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0008(0x0050)()
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_NotifyTag;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Object;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Value;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern");
static_assert(sizeof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern) == 0x000090, "Wrong size on WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_CustomEvent_ItemContainer) == 0x000008, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, Temp_byte_Variable2) == 0x000058, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x000059, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_SwitchName_CmpSuccess) == 0x00005A, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, CallFunc_GetValidValue_ReturnValue) == 0x00005B, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, Temp_bool_Variable) == 0x00005C, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_Event_NotifyTag) == 0x000060, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_Event_InItemData) == 0x000068, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_Event_Object) == 0x000070, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_Event_Object' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_Event_Value) == 0x000078, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, CallFunc_Conv_IntToBool_ReturnValue) == 0x00007C, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_Select_Default) == 0x00007D, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_SwitchName2_CmpSuccess) == 0x00007E, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'WBP_Menu_Parts_018_modern_C_ExecuteUbergraph_WBP_Menu_Parts_018_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Menu_Parts_018_modern.WBP_Menu_Parts_018_modern_C.NotificationItemBase
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Parts_018_modern_C_NotificationItemBase final
{
public:
	class FName                                   NotifyTag;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       InItemData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_018_modern_C_NotificationItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Parts_018_modern_C_NotificationItemBase");
static_assert(sizeof(WBP_Menu_Parts_018_modern_C_NotificationItemBase) == 0x000020, "Wrong size on WBP_Menu_Parts_018_modern_C_NotificationItemBase");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_NotificationItemBase, NotifyTag) == 0x000000, "Member 'WBP_Menu_Parts_018_modern_C_NotificationItemBase::NotifyTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_NotificationItemBase, InItemData) == 0x000008, "Member 'WBP_Menu_Parts_018_modern_C_NotificationItemBase::InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_NotificationItemBase, Object) == 0x000010, "Member 'WBP_Menu_Parts_018_modern_C_NotificationItemBase::Object' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_NotificationItemBase, Value) == 0x000018, "Member 'WBP_Menu_Parts_018_modern_C_NotificationItemBase::Value' has a wrong offset!");

// Function WBP_Menu_Parts_018_modern.WBP_Menu_Parts_018_modern_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_018_modern_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

}

