#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_Logo_000

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Title_Logo_000.WBP_Menu_Title_Logo_000_C.ExecuteUbergraph_WBP_Menu_Title_Logo_000
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackLanguage                                 CallFunc_GetLanguageType_ReturnValue;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x000C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000) == 0x000004, "Wrong alignment on WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000");
static_assert(sizeof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000) == 0x000020, "Wrong size on WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, EntryPoint) == 0x000000, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, CallFunc_GetLanguageType_ReturnValue) == 0x000007, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::CallFunc_GetLanguageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, K2Node_MakeStruct_LinearColor) == 0x00000C, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, CallFunc_IsTrial_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000, K2Node_Select_Default) == 0x00001D, "Member 'WBP_Menu_Title_Logo_000_C_ExecuteUbergraph_WBP_Menu_Title_Logo_000::K2Node_Select_Default' has a wrong offset!");

}

