#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Arasuzi_All_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern
// 0x0158 (0x0158 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTexture2D*>                     K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSerifuWindowControlKey_ReturnValue; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item2;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item3;                          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array2;                           // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGetArasuziDataResult*              CallFunc_GetArasuziData_Result;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item4;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item5;                          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromMenu;                            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayBGMFromBGMID_ReturnValue;             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item6;                          // 0x00D8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue2;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00EC(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_CustomEvent_InAnimation;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item7;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern) == 0x000158, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_CustomEvent_InKeyType) == 0x000028, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_CustomEvent_bIsPressed) == 0x000029, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_IsValidSerifuWindowControlKey_ReturnValue) == 0x00002A, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_IsValidSerifuWindowControlKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_CustomEvent_Index) == 0x00002C, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item2) == 0x000048, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item3) == 0x000058, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000070, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000071, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_MakeArray_Array2) == 0x000078, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000088, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_GetArasuziData_Result) == 0x000090, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_GetArasuziData_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item4) == 0x000098, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item5) == 0x0000A0, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0000B0, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue3) == 0x0000C8, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_Event_bFromMenu) == 0x0000C9, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_Event_bFromMenu' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_PlayBGMFromBGMID_ReturnValue) == 0x0000CA, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_PlayBGMFromBGMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item6) == 0x0000D8, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_BooleanOR_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue4) == 0x0000E1, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, Temp_byte_Variable) == 0x0000E2, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue5) == 0x0000E3, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_GetEndTime_ReturnValue) == 0x0000E4, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_GetEndTime_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_GetEndTime_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_Event_MyGeometry) == 0x0000EC, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_Event_InDeltaTime) == 0x000128, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_CustomEvent_InAnimation) == 0x000130, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_CustomEvent_InAnimation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_Event_Animation) == 0x000138, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000140, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue6) == 0x000141, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000142, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, Temp_byte_Variable2) == 0x000143, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000144, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, K2Node_Select_Default) == 0x000145, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Array_Get_Item7) == 0x000148, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern, CallFunc_Less_IntInt_ReturnValue7) == 0x000150, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_ExecuteUbergraph_WBP_Menu_Arasuzi_All_000_modern::CallFunc_Less_IntInt_ReturnValue7' has a wrong offset!");

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.PlayAnimRequest
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest) == 0x000008, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest) == 0x000008, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest, InAnimation) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_PlayAnimRequest::InAnimation' has a wrong offset!");

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.RunArasuzi
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi final
{
public:
	bool                                          bFromMenu_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi) == 0x000001, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi) == 0x000001, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi, bFromMenu_0) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_RunArasuzi::bFromMenu_0' has a wrong offset!");

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.RunArasuziPage
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage) == 0x000004, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage) == 0x000004, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage, Index_0) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_RunArasuziPage::Index_0' has a wrong offset!");

// Function WBP_Menu_Arasuzi_All_000_modern.WBP_Menu_Arasuzi_All_000_modern_C.OnKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent");
static_assert(sizeof(WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Arasuzi_All_000_modern_C_OnKeyEvent::bIsPressed' has a wrong offset!");

}

