#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_001_Steam

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetScreenResolutionList_ReturnValue;      // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetScreenResolutionIndex_ReturnValue;     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender2;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID2;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex2;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IntToResolution_OutResolution;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue3;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0168(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUpdateResolutionList_bUpdate;           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam) == 0x0001B0, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, Temp_struct_Variable) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_GetScreenResolutionList_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_GetScreenResolutionList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, Temp_struct_Variable2) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_Sender2) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_CheckPoint4) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate3) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_CheckPoint3) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_Result) == 0x000091, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_Sender) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_CheckPoint2) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_CheckRusult) == 0x0000A9, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_CheckPoint) == 0x0000AA, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_EventTag) == 0x0000B0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_SwitchName_CmpSuccess) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_GetScreenResolutionIndex_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_GetScreenResolutionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_Sender2) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_CurrentTextID2) == 0x0000D8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_CurrentTextID2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_SelectDialogIndex2) == 0x0000E0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_SelectDialogIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_SwitchInteger_CmpSuccess) == 0x0000E4, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_EventName) == 0x0000F0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_InItemBase) == 0x0000F8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000100, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_SwitchName3_CmpSuccess) == 0x000101, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_Sender) == 0x000108, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_CurrentTextID) == 0x000110, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CustomEvent_SelectDialogIndex) == 0x000118, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_Clamp_ReturnValue) == 0x00011C, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_SwitchInteger2_CmpSuccess) == 0x000120, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_Array_Get_Item) == 0x000128, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000130, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_IntToResolution_OutResolution) == 0x000138, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_IntToResolution_OutResolution' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000140, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate4) == 0x000150, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_CloseSerifuWindow_ReturnValue3) == 0x000160, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_CloseSerifuWindow_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_MyGeometry) == 0x000168, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, K2Node_Event_InDeltaTime) == 0x0001A4, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam, CallFunc_IsUpdateResolutionList_bUpdate) == 0x0001A8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_Steam::CallFunc_IsUpdateResolutionList_bUpdate' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_Tick");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_Tick");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.CustomEvent_2
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_2::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.CustomEvent_1
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1 final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_1::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck) == 0x000002, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck, Result) == 0x000001, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_OnFinishSaveDataCheck::Result' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.TurnOnCheckMark
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark final
{
public:
	int32                                         InMode;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark, InMode) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark::InMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_TurnOnCheckMark::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.SetCheckMark
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark final
{
public:
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScreenResolutionIndex_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark, CallFunc_GetScreenResolutionIndex_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetCheckMark::CallFunc_GetScreenResolutionIndex_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.ResolutionToInt
// 0x0014 (0x0014 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt final
{
public:
	int32                                         InResolution;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutMode;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempMode;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue6;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt) == 0x000014, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, InResolution) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::InResolution' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, OutMode) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::OutMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, TempMode) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::TempMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x00000D, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x00000E, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x00000F, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, CallFunc_EqualEqual_IntInt_ReturnValue5) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::CallFunc_EqualEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt, CallFunc_EqualEqual_IntInt_ReturnValue6) == 0x000011, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_ResolutionToInt::CallFunc_EqualEqual_IntInt_ReturnValue6' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.IntToResolution
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution final
{
public:
	int32                                         InMode;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutResolution;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempResolutionX;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution, InMode) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution::InMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution, OutResolution) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution::OutResolution' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution, TempResolutionX) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution::TempResolutionX' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_IntToResolution::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_Steam.WBP_Menu_Sakusen_Settei_001_Steam_C.SetResolutionText
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0020(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0038(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue3;             // 0x0060(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue4;             // 0x0078(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue5;             // 0x00A0(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue6;             // 0x00B8(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue7;             // 0x00E0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue8;             // 0x0110(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue9;             // 0x0138(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue10;            // 0x0150(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue12;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue11;            // 0x0178(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue12;            // 0x0190(0x0018)()
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText) == 0x0001A8, "Wrong size on WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue4) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue3) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue4) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue5) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue6) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue5) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue6) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue7) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue7) == 0x0000E0, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue8) == 0x000100, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue8) == 0x000110, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue9) == 0x000128, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue10) == 0x000130, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue9) == 0x000138, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetAsciiDecText_ReturnValue10) == 0x000150, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetAsciiDecText_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue11) == 0x000168, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText, CallFunc_GetUMGManager_ReturnValue12) == 0x000170, "Member 'WBP_Menu_Sakusen_Settei_001_Steam_C_SetResolutionText::CallFunc_GetUMGManager_ReturnValue12' has a wrong offset!");
