#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Settei_000_Steam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_SlideTargetOrigin;                    // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MaxSlideTargetSize;                   // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MinSlideTargetSize;                   // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetKeyConfigItemListSteam_ReturnValue;    // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackKeyStatus                         CallFunc_GetKeyStatus_ReturnValue;                 // 0x0098(0x0040)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNoChangedKeyList_NoChanges;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_Menu_Keyconfig_Settei_001_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_001_Steam; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue3;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_003_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_003_Steam; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Keyconfig_Settei_002_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_002_Steam; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam) == 0x0001C0, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_Event_bVisible) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_Event_SlideTargetOrigin) == 0x00002C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_Event_SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_Event_MaxSlideTargetSize) == 0x000034, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_Event_MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_Event_MinSlideTargetSize) == 0x00003C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_Event_MinSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_EventName) == 0x000048, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_InItemBase) == 0x000050, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_EventTag) == 0x000058, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000061, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetUMGManager_ReturnValue) == 0x000068, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000070, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetKeyConfigItemListSteam_ReturnValue) == 0x000078, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetKeyConfigItemListSteam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_Array_Length_ReturnValue2) == 0x00008C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_InKeyType) == 0x000090, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_bIsPressed) == 0x000091, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_SwitchEnum_CmpSuccess) == 0x000092, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_SwitchInteger_CmpSuccess) == 0x000093, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetKeyStatus_ReturnValue) == 0x000098, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetKeyStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_Array_Length_ReturnValue3) == 0x0000DC, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, Temp_struct_Variable) == 0x0000E8, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CreateDelegate_OutputDelegate3) == 0x000100, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, Temp_struct_Variable2) == 0x000110, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000120, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_Sender) == 0x000128, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_CurrentTextID) == 0x000130, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CustomEvent_SelectDialogIndex) == 0x000138, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_WaitMessageEndFromBP_Result) == 0x000140, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_SwitchInteger2_CmpSuccess) == 0x000148, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_IsNoChangedKeyList_NoChanges) == 0x000149, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_IsNoChangedKeyList_NoChanges' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetUMGManager_ReturnValue2) == 0x000150, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000158, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_CreateDelegate_OutputDelegate4) == 0x000160, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_001_Steam) == 0x000170, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_001_Steam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x000180, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue3) == 0x000188, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_003_Steam) == 0x000190, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_003_Steam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_DynamicCast_bSuccess2) == 0x000198, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_002_Steam) == 0x0001A0, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_002_Steam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, K2Node_DynamicCast_bSuccess3) == 0x0001A8, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0001B0, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001B8, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0001B9, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.ChangedCancelYN
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN) == 0x000018, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN, Sender) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ChangedCancelYN::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.KeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_KeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1) == 0x000008, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1, EventTag) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent_1::EventTag' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent) == 0x000010, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent, EventName) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent, InItemBase) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_CustomEvent::InItemBase' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.SetDebugTargetSize
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlideTargetOrigin;                                 // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxSlideTargetSize;                                // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinSlideTargetSize;                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize) == 0x000004, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize) == 0x00001C, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize, bVisible) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize, SlideTargetOrigin) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize::SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize, MaxSlideTargetSize) == 0x00000C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize::MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize, MinSlideTargetSize) == 0x000014, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetDebugTargetSize::MinSlideTargetSize' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.SetArray
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class AJackHUD*                               CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnterButtonReverse_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array2;                           // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Keyconfig_Parts_000_Steam_C*> K2Node_MakeArray_Array3;                           // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray) == 0x000048, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray, CallFunc_IsEnterButtonReverse_ReturnValue) == 0x000020, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray::CallFunc_IsEnterButtonReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray, K2Node_MakeArray_Array2) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray, K2Node_MakeArray_Array3) == 0x000038, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetArray::K2Node_MakeArray_Array3' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.SetCursorOffset
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset) == 0x000028, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, IsActive) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001D, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetCursorOffset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.ReFocusWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget final
{
public:
	bool                                          IsInUp;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget) == 0x000001, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget) == 0x000001, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget, IsInUp) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_ReFocusWidget::IsInUp' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.SetIconTexture
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture final
{
public:
	TArray<class UTexture2D*>                     TextureButtonRev;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FName                                   IconTag;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     TextureButton;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UTexture2D*>                     K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     K2Node_MakeArray_Array2;                           // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item2;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackHUD*                               CallFunc_GetHUD_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnterButtonReverse_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item3;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item4;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture) == 0x0000B8, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, TextureButtonRev) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::TextureButtonRev' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, IconTag) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::IconTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, TextureButton) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::TextureButton' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, Temp_int_Array_Index_Variable2) == 0x000044, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, K2Node_MakeArray_Array2) == 0x000048, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, Temp_int_Loop_Counter_Variable2) == 0x000068, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Add_IntInt_ReturnValue2) == 0x00006C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000070, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Get_Item2) == 0x000078, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_GetHUD_ReturnValue) == 0x000080, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_IsEnterButtonReverse_ReturnValue) == 0x000088, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_IsEnterButtonReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Length_ReturnValue2) == 0x00008C, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Less_IntInt_ReturnValue2) == 0x000090, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Get_Item3) == 0x000098, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Length_ReturnValue3) == 0x0000A0, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Less_IntInt_ReturnValue3) == 0x0000A4, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Get_Item4) == 0x0000A8, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Array_Length_ReturnValue4) == 0x0000B0, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture, CallFunc_Less_IntInt_ReturnValue4) == 0x0000B4, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetIconTexture::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C.SetGamePadButtonVisible
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible final
{
public:
	int32                                         VisibleIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item2;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible) == 0x000038, "Wrong size on WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible, VisibleIndex) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_000_Steam_C_SetGamePadButtonVisible::VisibleIndex' has a wrong offset!");
