#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_004_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern) == 0x0000C8, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CustomEvent_EventName) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CustomEvent_InItemBase) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_SwitchName2_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_SwitchName3_CmpSuccess) == 0x000049, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_SwitchName4_CmpSuccess) == 0x00004A, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CustomEvent_Sender) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CustomEvent_CurrentTextID) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.SelectTextSet
// 0x0024 (0x0024 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet final
{
public:
	EJackBattleSpeedMode                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleCameraMode                         Temp_byte_Variable2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable4;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet) == 0x000024, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_byte_Variable) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_int_Variable2) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_int_Variable3) == 0x00000C, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_byte_Variable2) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_int_Variable4) == 0x000014, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, Temp_int_Variable5) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet, K2Node_Select2_Default) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SelectTextSet::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.SaveAndBack
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack final
{
public:
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue2;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleCameraMode                         CallFunc_IntToMode_OutMode;                        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack) == 0x000020, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack, CallFunc_GetValue_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack, CallFunc_GetValue_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack::CallFunc_GetValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack, CallFunc_IntToMode_OutMode) == 0x00001C, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SaveAndBack::CallFunc_IntToMode_OutMode' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.IntToMode
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode final
{
public:
	int32                                         InMode;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleCameraMode                         OutMode;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleCameraMode                         TempMode;                                          // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode, InMode) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode::InMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode, OutMode) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode::OutMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode, TempMode) == 0x000005, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode::TempMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode, K2Node_SwitchInteger_CmpSuccess) == 0x000006, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_IntToMode::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.GetValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_GetValue final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleCameraMode                         CallFunc_GetBattleCameraMode_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleSpeedMode                          CallFunc_GetBattleSpeedMode_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_GetValue) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_GetValue");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_GetValue) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_GetValue");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_GetValue, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_GetValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_GetValue, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_GetValue::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_GetValue, CallFunc_GetBattleCameraMode_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_GetValue::CallFunc_GetBattleCameraMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_GetValue, CallFunc_GetBattleSpeedMode_ReturnValue) == 0x000011, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_GetValue::CallFunc_GetBattleSpeedMode_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.SetValue
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_SetValue final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_SetValue) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_SetValue");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_SetValue) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_SetValue");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetValue, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetValue, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetValue::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.SetInfoText
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText) == 0x000038, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, InName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::InName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, CallFunc_GetValue_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText, K2Node_SwitchInteger_CmpSuccess) == 0x000031, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_SetInfoText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C.RemoveSnap
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap) == 0x000001, "Wrong size on WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_004_modern_C_RemoveSnap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

