#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Message_Sentaku_Blacksmith_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Menu_Message_SentakuBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Message_Sentaku_Blacksmith_modern.WBP_Menu_Message_Sentaku_Blacksmith_modern_C
// 0x0078 (0x0480 - 0x0408)
class UWBP_Menu_Message_Sentaku_Blacksmith_modern_C final : public UWBP_Menu_Message_SentakuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Menu_Message_Sentaku_Blacksmith_modern_C; // 0x0408(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_0;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_1;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_2;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_3;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_010_modern_C*           Parts_010_0;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_010_modern_C*           Parts_010_1;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_010_modern_C*           Parts_010_2;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_010_modern_C*           Parts_010_3;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   Parts000List;                                      // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWBP_Menu_Parts_010_modern_C*>   Parts010List;                                      // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Message_Sentaku_Blacksmith_modern(int32 EntryPoint);
	void SetData(const TArray<class FString>& ItemNameList, const TArray<int32>& CountList, int32 ItemNameLength);
	void Construct();
	void RemoveUnuseParts(TArray<class UJackUMGItemBase*>& PartsList, TArray<class FString>& TargetArray);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Message_Sentaku_Blacksmith_modern_C">();
	}
	static class UWBP_Menu_Message_Sentaku_Blacksmith_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Message_Sentaku_Blacksmith_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Message_Sentaku_Blacksmith_modern_C");
static_assert(sizeof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C) == 0x000480, "Wrong size on UWBP_Menu_Message_Sentaku_Blacksmith_modern_C");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, UberGraphFrame_WBP_Menu_Message_Sentaku_Blacksmith_modern_C) == 0x000408, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::UberGraphFrame_WBP_Menu_Message_Sentaku_Blacksmith_modern_C' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, ItemList) == 0x000410, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_000_0) == 0x000418, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_000_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_000_1) == 0x000420, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_000_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_000_2) == 0x000428, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_000_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_000_3) == 0x000430, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_000_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_010_0) == 0x000438, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_010_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_010_1) == 0x000440, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_010_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_010_2) == 0x000448, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_010_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts_010_3) == 0x000450, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts_010_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, RootPanel) == 0x000458, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts000List) == 0x000460, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts000List' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_Blacksmith_modern_C, Parts010List) == 0x000470, "Member 'UWBP_Menu_Message_Sentaku_Blacksmith_modern_C::Parts010List' has a wrong offset!");

}

