#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_005_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_005_modern.WBP_Menu_Sakusen_Settei_005_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern) == 0x000070, "Wrong size on WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_CustomEvent_EventName) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_CustomEvent_InItemBase) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_SwitchName2_CmpSuccess) == 0x000049, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, K2Node_SwitchName3_CmpSuccess) == 0x00004A, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_005_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_005_modern.WBP_Menu_Sakusen_Settei_005_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_005_modern.WBP_Menu_Sakusen_Settei_005_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_005_modern.WBP_Menu_Sakusen_Settei_005_modern_C.SetSnapInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo final
{
public:
	class FName                                   InSelect;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo) == 0x000020, "Wrong size on WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo, InSelect) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo::InSelect' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'WBP_Menu_Sakusen_Settei_005_modern_C_SetSnapInfo::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

