#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Casino_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Casino_000_modern.WBP_Menu_Casino_000_modern_C.ExecuteUbergraph_WBP_Menu_Casino_000_modern
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCasinoCoin;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern");
static_assert(sizeof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern) == 0x000040, "Wrong size on WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, K2Node_Event_InCasinoCoin) == 0x000004, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::K2Node_Event_InCasinoCoin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, Temp_bool_Variable) == 0x000010, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, Temp_name_Variable2) == 0x000018, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, K2Node_Select_Default) == 0x000028, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, CallFunc_GetAccessorCommon_ReturnValue) == 0x000030, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern, CallFunc_GetGold_ReturnValue) == 0x000038, "Member 'WBP_Menu_Casino_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_000_modern::CallFunc_GetGold_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Casino_000_modern.WBP_Menu_Casino_000_modern_C.UpdateWindowCasino
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Casino_000_modern_C_UpdateWindowCasino final
{
public:
	int32                                         InCasinoCoin;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_000_modern_C_UpdateWindowCasino) == 0x000004, "Wrong alignment on WBP_Menu_Casino_000_modern_C_UpdateWindowCasino");
static_assert(sizeof(WBP_Menu_Casino_000_modern_C_UpdateWindowCasino) == 0x000004, "Wrong size on WBP_Menu_Casino_000_modern_C_UpdateWindowCasino");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindowCasino, InCasinoCoin) == 0x000000, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindowCasino::InCasinoCoin' has a wrong offset!");

// Function WBP_Menu_Casino_000_modern.WBP_Menu_Casino_000_modern_C.UpdateWindow
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Casino_000_modern_C_UpdateWindow final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCasinoCoin_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUtinaosiNoHouju_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue2;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_000_modern_C_UpdateWindow) == 0x000008, "Wrong alignment on WBP_Menu_Casino_000_modern_C_UpdateWindow");
static_assert(sizeof(WBP_Menu_Casino_000_modern_C_UpdateWindow) == 0x000048, "Wrong size on WBP_Menu_Casino_000_modern_C_UpdateWindow");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, Temp_name_Variable) == 0x000000, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, Temp_name_Variable2) == 0x000008, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_GetAccessorCommon_ReturnValue) == 0x000010, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_GetCasinoCoin_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_GetCasinoCoin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_GetUtinaosiNoHouju_ReturnValue) == 0x000020, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_GetUtinaosiNoHouju_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, Temp_bool_Variable) == 0x000024, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, Temp_bool_Variable2) == 0x000025, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, K2Node_Select_Default) == 0x000028, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00002C, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, K2Node_Select2_Default) == 0x000030, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_GetAccessorCommon_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_GetAccessorCommon_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_UpdateWindow, CallFunc_GetGold_ReturnValue) == 0x000040, "Member 'WBP_Menu_Casino_000_modern_C_UpdateWindow::CallFunc_GetGold_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Casino_000_modern.WBP_Menu_Casino_000_modern_C.SetupDisplayMode
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) WBP_Menu_Casino_000_modern_C_SetupDisplayMode final
{
public:
	EJackUMGShopType                              InDisplayShopType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable4;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select4_Default;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode) == 0x000008, "Wrong alignment on WBP_Menu_Casino_000_modern_C_SetupDisplayMode");
static_assert(sizeof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode) == 0x000058, "Wrong size on WBP_Menu_Casino_000_modern_C_SetupDisplayMode");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, InDisplayShopType) == 0x000000, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::InDisplayShopType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_bool_Variable) == 0x000010, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_name_Variable2) == 0x000018, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_name_Variable3) == 0x000020, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_bool_Variable2) == 0x000028, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_byte_Variable) == 0x000029, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_byte_Variable2) == 0x00002A, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_bool_Variable3) == 0x00002B, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_byte_Variable3) == 0x00002C, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_byte_Variable4) == 0x00002D, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_bool_Variable4) == 0x00002E, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002F, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, K2Node_Select_Default) == 0x000031, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, K2Node_Select2_Default) == 0x000032, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, Temp_name_Variable4) == 0x000038, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000040, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, K2Node_Select3_Default) == 0x000048, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_000_modern_C_SetupDisplayMode, K2Node_Select4_Default) == 0x000050, "Member 'WBP_Menu_Casino_000_modern_C_SetupDisplayMode::K2Node_Select4_Default' has a wrong offset!");

}

