#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Level2_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_Level2_modern.WBP_Hud_Status_Level2_modern_C
// 0x0028 (0x04F0 - 0x04C8)
class UWBP_Hud_Status_Level2_modern_C final : public UJackUMGHudStatusBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             Level;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_98;                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_Level2_modern(int32 EntryPoint);
	void SetSubLevel(const int32 InLevel, EJackUMGTextColorSet InColorType);
	void SetNameText(const class FString& InName);
	void CustomEvent_2(int32 Level_0, EJackUMGTextColorSet ColorType);
	void CustomEvent_0(const class FString& Name_0);
	void Construct();
	void SetColor(int32 HP, int32 MaxHP);
	void SetTextSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_Level2_modern_C">();
	}
	static class UWBP_Hud_Status_Level2_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_Level2_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_Level2_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_Level2_modern_C");
static_assert(sizeof(UWBP_Hud_Status_Level2_modern_C) == 0x0004F0, "Wrong size on UWBP_Hud_Status_Level2_modern_C");
static_assert(offsetof(UWBP_Hud_Status_Level2_modern_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Hud_Status_Level2_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Level2_modern_C, Level) == 0x0004D0, "Member 'UWBP_Hud_Status_Level2_modern_C::Level' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Level2_modern_C, RootPanel) == 0x0004D8, "Member 'UWBP_Hud_Status_Level2_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Level2_modern_C, WBP_Menu_Parts_000) == 0x0004E0, "Member 'UWBP_Hud_Status_Level2_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Level2_modern_C, WBP_Menu_Parts_000_98) == 0x0004E8, "Member 'UWBP_Hud_Status_Level2_modern_C::WBP_Menu_Parts_000_98' has a wrong offset!");

}

