#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_062_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C
// 0x0060 (0x0430 - 0x03D0)
class UWBP_Menu_Parts_062_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 AchievementStar;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CheckMark;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FramePanel_Brown;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FramePanel_White;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sibari;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star1;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star2;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star3;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFusigi;                                          // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_062_modern(int32 EntryPoint);
	void ShowCheck(bool bShow);
	void SetData(const class FText& CaptionText_0, bool bIsCheck);
	void SetTextJustification(ETextJustify InJustification);
	void WidgetBPActionDelegate(class FName EventTag);
	void DrawUpdateContainerDelegate(const struct FJackUMGItemContainer& ItemContainer);
	void Construct();
	void SetCaptionJustification(ETextJustify InJustification);
	void SetCharacterSpacing(float InCharacterSpacing);
	void SetActive(bool IsActive);
	void SetSibariKey(bool Active);
	void SetAchievementStar(bool Clear);
	void SetOffsetMode();
	void SetCheckMark(bool Visibility_0);
	void SetActiveBlue(bool IsActive);
	void SetSenrekiFusigiKazi();
	void SetTextActive(bool IsActive);
	void SetSibariTasseiStar(bool InTassei);
	void SetYottiListSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_062_modern_C">();
	}
	static class UWBP_Menu_Parts_062_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_062_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_062_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_062_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_062_modern_C) == 0x000430, "Wrong size on UWBP_Menu_Parts_062_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_062_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, AchievementStar) == 0x0003D8, "Member 'UWBP_Menu_Parts_062_modern_C::AchievementStar' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, CaptionPanel) == 0x0003E0, "Member 'UWBP_Menu_Parts_062_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, CheckMark) == 0x0003E8, "Member 'UWBP_Menu_Parts_062_modern_C::CheckMark' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, FramePanel_Brown) == 0x0003F0, "Member 'UWBP_Menu_Parts_062_modern_C::FramePanel_Brown' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, FramePanel_White) == 0x0003F8, "Member 'UWBP_Menu_Parts_062_modern_C::FramePanel_White' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, RootPanel) == 0x000400, "Member 'UWBP_Menu_Parts_062_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, Sibari) == 0x000408, "Member 'UWBP_Menu_Parts_062_modern_C::Sibari' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, Star1) == 0x000410, "Member 'UWBP_Menu_Parts_062_modern_C::Star1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, Star2) == 0x000418, "Member 'UWBP_Menu_Parts_062_modern_C::Star2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, Star3) == 0x000420, "Member 'UWBP_Menu_Parts_062_modern_C::Star3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_062_modern_C, IsFusigi) == 0x000428, "Member 'UWBP_Menu_Parts_062_modern_C::IsFusigi' has a wrong offset!");

}

