#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Balloon_004

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Balloon_004.WBP_Hud_Balloon_004_C.ExecuteUbergraph_WBP_Hud_Balloon_004
// 0x0014 (0x0014 - 0x0000)
struct WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004");
static_assert(sizeof(WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004) == 0x000014, "Wrong size on WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004");
static_assert(offsetof(WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004, EntryPoint) == 0x000000, "Member 'WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004, CallFunc_GetPanelSize_ReturnValue) == 0x000004, "Member 'WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Balloon_004_C_ExecuteUbergraph_WBP_Hud_Balloon_004::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Balloon_004.WBP_Hud_Balloon_004_C.SetBalloon
// 0x0004 (0x0004 - 0x0000)
struct WBP_Hud_Balloon_004_C_SetBalloon final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_004_C_SetBalloon) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_004_C_SetBalloon");
static_assert(sizeof(WBP_Hud_Balloon_004_C_SetBalloon) == 0x000004, "Wrong size on WBP_Hud_Balloon_004_C_SetBalloon");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetBalloon, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'WBP_Hud_Balloon_004_C_SetBalloon::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Balloon_004.WBP_Hud_Balloon_004_C.SetTextureNumber
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Balloon_004_C_SetTextureNumber final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Balloon_004_C_SetTextureNumber) == 0x000001, "Wrong alignment on WBP_Hud_Balloon_004_C_SetTextureNumber");
static_assert(sizeof(WBP_Hud_Balloon_004_C_SetTextureNumber) == 0x000001, "Wrong size on WBP_Hud_Balloon_004_C_SetTextureNumber");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetTextureNumber, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_Hud_Balloon_004_C_SetTextureNumber::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Hud_Balloon_004.WBP_Hud_Balloon_004_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_Balloon_004_C_SetTexture final
{
public:
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_004_C_SetTexture) == 0x000008, "Wrong alignment on WBP_Hud_Balloon_004_C_SetTexture");
static_assert(sizeof(WBP_Hud_Balloon_004_C_SetTexture) == 0x000010, "Wrong size on WBP_Hud_Balloon_004_C_SetTexture");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetTexture, CallFunc_Array_Get_Item) == 0x000000, "Member 'WBP_Hud_Balloon_004_C_SetTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Hud_Balloon_004_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Balloon_004.WBP_Hud_Balloon_004_C.GetNumberTexture
// 0x002C (0x002C - 0x0000)
struct WBP_Hud_Balloon_004_C_GetNumberTexture final
{
public:
	int32                                         Digit;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlockIndex;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempIndex;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_004_C_GetNumberTexture) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_004_C_GetNumberTexture");
static_assert(sizeof(WBP_Hud_Balloon_004_C_GetNumberTexture) == 0x00002C, "Wrong size on WBP_Hud_Balloon_004_C_GetNumberTexture");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, Digit) == 0x000000, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::Digit' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, BlockIndex) == 0x000004, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::BlockIndex' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, TempIndex) == 0x000008, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::TempIndex' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000010, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Array_Get_Item) == 0x000014, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000020, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_GetNumberTexture, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000028, "Member 'WBP_Hud_Balloon_004_C_GetNumberTexture::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");

// Function WBP_Hud_Balloon_004.WBP_Hud_Balloon_004_C.SetDelayTime
// 0x002C (0x002C - 0x0000)
struct WBP_Hud_Balloon_004_C_SetDelayTime final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempDelta;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_004_C_SetDelayTime) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_004_C_SetDelayTime");
static_assert(sizeof(WBP_Hud_Balloon_004_C_SetDelayTime) == 0x00002C, "Wrong size on WBP_Hud_Balloon_004_C_SetDelayTime");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, Delta) == 0x000000, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::Delta' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, TempDelta) == 0x000004, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::TempDelta' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Clamp_ReturnValue) == 0x000024, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_004_C_SetDelayTime, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'WBP_Hud_Balloon_004_C_SetDelayTime::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

}

