#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_058_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_058_modern.WBP_Menu_Parts_058_modern_C
// 0x00A0 (0x0470 - 0x03D0)
class UWBP_Menu_Parts_058_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             Equipment_000;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Equipment_Left_Panel;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Equipment_Num_L;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Equipment_Unit_L;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Possible_Num_1;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Possible_Num_2;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Possible_Panel;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Possible_Unit_1;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Possible_Unit_2;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sankaku_Image;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Possible_Text_1;                                   // 0x0428(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Possible_Text_2;                                   // 0x0440(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Equipment_Text_L;                                  // 0x0458(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_058_modern(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetValue(int32 InCurrent, int32 InChanged);
	void HideValue();
	void SetParamUp(int32 InCurrent, int32 InChanged);
	void SetPossibleValue(int32 InCurrent, int32 InChanged);
	void SetEquipmentLeft(int32 InCurrent, int32 InChanged);
	void HideAll();
	void SetValueFloat(float InCurrent, float InChanged, class FName InUnitTextId);
	void SetEquipmentLeftFloat(float InValue);
	void SetPossibleValueFloat(float InCurrent, float InChanged);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_058_modern_C">();
	}
	static class UWBP_Menu_Parts_058_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_058_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_058_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_058_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_058_modern_C) == 0x000470, "Wrong size on UWBP_Menu_Parts_058_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_058_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Equipment_000) == 0x0003D8, "Member 'UWBP_Menu_Parts_058_modern_C::Equipment_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Equipment_Left_Panel) == 0x0003E0, "Member 'UWBP_Menu_Parts_058_modern_C::Equipment_Left_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Equipment_Num_L) == 0x0003E8, "Member 'UWBP_Menu_Parts_058_modern_C::Equipment_Num_L' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Equipment_Unit_L) == 0x0003F0, "Member 'UWBP_Menu_Parts_058_modern_C::Equipment_Unit_L' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Num_1) == 0x0003F8, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Num_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Num_2) == 0x000400, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Num_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Panel) == 0x000408, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Unit_1) == 0x000410, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Unit_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Unit_2) == 0x000418, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Unit_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Sankaku_Image) == 0x000420, "Member 'UWBP_Menu_Parts_058_modern_C::Sankaku_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Text_1) == 0x000428, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Text_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Possible_Text_2) == 0x000440, "Member 'UWBP_Menu_Parts_058_modern_C::Possible_Text_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_058_modern_C, Equipment_Text_L) == 0x000458, "Member 'UWBP_Menu_Parts_058_modern_C::Equipment_Text_L' has a wrong offset!");

}

