#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tuyosa_List_000_modern.WBP_Menu_Tuyosa_List_000_modern_C
// 0x00B0 (0x04B0 - 0x0400)
class UWBP_Menu_Tuyosa_List_000_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 P001;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts000_00AllParam;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts007_Kigou000_0;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts007_Kigou000_1;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts010_00AllValue;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts010_Exp;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts010_Katagaki;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Parts010_RemainingExp;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartsText080_Keikenchi;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartsText080_NextLevel;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Status_008_modern_C*           WBP_Hud_Status_008;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_00Handedness;                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_01Hand;                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_02Head;                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_03Body;                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_04Accessory1;                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_05Accessory2;                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_023_modern_C*           WBP_Menu_Parts_023;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FJackGameCharacterEquippedItem> EquippedItems;                                     // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Tuyosa_List_000_modern(int32 EntryPoint);
	void SetSoubiListData(class UJackUMGSoubiList* Data);
	void SetData(class UJackUMGAccessorMemberDataInTuyosa* TuyosaData);
	void SetGameCharacterData(class UJackGameCharacter* Data);
	void OnWidgetBPActionDelegate(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void UpdateParamText(class UJackGameCharacter* GameCharacter);
	void UpdateValueText(class UJackGameCharacter* GameCharacter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tuyosa_List_000_modern_C">();
	}
	static class UWBP_Menu_Tuyosa_List_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tuyosa_List_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tuyosa_List_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tuyosa_List_000_modern_C");
static_assert(sizeof(UWBP_Menu_Tuyosa_List_000_modern_C) == 0x0004B0, "Wrong size on UWBP_Menu_Tuyosa_List_000_modern_C");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, P001) == 0x000410, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::P001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts000_00AllParam) == 0x000418, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts000_00AllParam' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts007_Kigou000_0) == 0x000420, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts007_Kigou000_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts007_Kigou000_1) == 0x000428, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts007_Kigou000_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts010_00AllValue) == 0x000430, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts010_00AllValue' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts010_Exp) == 0x000438, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts010_Exp' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts010_Katagaki) == 0x000440, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts010_Katagaki' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, Parts010_RemainingExp) == 0x000448, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::Parts010_RemainingExp' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, PartsText080_Keikenchi) == 0x000450, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::PartsText080_Keikenchi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, PartsText080_NextLevel) == 0x000458, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::PartsText080_NextLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Hud_Status_008) == 0x000460, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Hud_Status_008' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_001_C_00Handedness) == 0x000468, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_001_C_00Handedness' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_001_C_01Hand) == 0x000470, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_001_C_01Hand' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_001_C_02Head) == 0x000478, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_001_C_02Head' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_001_C_03Body) == 0x000480, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_001_C_03Body' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_001_C_04Accessory1) == 0x000488, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_001_C_04Accessory1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_001_C_05Accessory2) == 0x000490, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_001_C_05Accessory2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, WBP_Menu_Parts_023) == 0x000498, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::WBP_Menu_Parts_023' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_000_modern_C, EquippedItems) == 0x0004A0, "Member 'UWBP_Menu_Tuyosa_List_000_modern_C::EquippedItems' has a wrong offset!");

}

