#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Message_Battle_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Message_Battle_000_modern.WBP_Hud_Message_Battle_000_modern_C.ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern
// 0x0038 (0x0038 - 0x0000)
struct WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValue;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_GetBattleMessageController_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern) == 0x000008, "Wrong alignment on WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern");
static_assert(sizeof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern) == 0x000038, "Wrong size on WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, K2Node_Event_bValue) == 0x000004, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::K2Node_Event_bValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, Temp_bool_Variable) == 0x000005, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, Temp_byte_Variable) == 0x000006, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, Temp_byte_Variable2) == 0x000007, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, K2Node_Select_Default) == 0x000008, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, CallFunc_GetBattleMessageController_ReturnValue) == 0x000028, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::CallFunc_GetBattleMessageController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern, CallFunc_GetZOrder_ReturnValue) == 0x000030, "Member 'WBP_Hud_Message_Battle_000_modern_C_ExecuteUbergraph_WBP_Hud_Message_Battle_000_modern::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Message_Battle_000_modern.WBP_Hud_Message_Battle_000_modern_C.SetVisibleBackgroundImage
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage) == 0x000001, "Wrong alignment on WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage");
static_assert(sizeof(WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage) == 0x000001, "Wrong size on WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage");
static_assert(offsetof(WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage, bValue) == 0x000000, "Member 'WBP_Hud_Message_Battle_000_modern_C_SetVisibleBackgroundImage::bValue' has a wrong offset!");

}

