#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Present_List_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Present_List_000_modern.WBP_Menu_Present_List_000_modern_C.ExecuteUbergraph_WBP_Menu_Present_List_000_modern
// 0x0158 (0x0158 - 0x0000)
struct WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackStoreManager*                      CallFunc_GetStoreManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenPresentItemStore_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue2;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCheckDlcDataUpdateEnd_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue3;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackItemPresentTitle>          CallFunc_GetItemPresentTitleList_ReturnValue;      // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Loading_004_modern_C*          K2Node_DynamicCast_AsWBP_Hud_Loading_004_Modern;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UJackStoreManager*                      CallFunc_GetStoreManager_ReturnValue2;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenPresentCodeInputScreen_ReturnValue;   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern");
static_assert(sizeof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern) == 0x000158, "Wrong size on WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetStoreManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetStoreManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_OpenPresentItemStore_ReturnValue) == 0x000010, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_OpenPresentItemStore_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_CustomEvent_EventName) == 0x000028, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_CustomEvent_InItemBase) == 0x000030, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000041, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000050, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetItemPresentManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetItemPresentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000060, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_Event_MyGeometry) == 0x000068, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_Event_InDeltaTime) == 0x0000A4, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetItemPresentManager_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetItemPresentManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_IsCheckDlcDataUpdateEnd_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_IsCheckDlcDataUpdateEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetItemPresentManager_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetItemPresentManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetItemPresentTitleList_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetItemPresentTitleList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000E0, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_DynamicCast_AsWBP_Hud_Loading_004_Modern) == 0x0000F8, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_DynamicCast_AsWBP_Hud_Loading_004_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000101, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, Temp_struct_Variable) == 0x000108, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_GetStoreManager_ReturnValue2) == 0x000128, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_GetStoreManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_OpenPresentCodeInputScreen_ReturnValue) == 0x000130, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_OpenPresentCodeInputScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000138, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000140, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000148, "Member 'WBP_Menu_Present_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_Present_List_000_modern.WBP_Menu_Present_List_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Present_List_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Present_List_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Present_List_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Present_List_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Present_List_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Present_List_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Present_List_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Present_List_000_modern.WBP_Menu_Present_List_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Present_List_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Present_List_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Present_List_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Present_List_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Present_List_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Present_List_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Present_List_000_modern.WBP_Menu_Present_List_000_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Present_List_000_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Present_List_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Present_List_000_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Present_List_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Present_List_000_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Present_List_000_modern.WBP_Menu_Present_List_000_modern_C.RemoveMenu
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Present_List_000_modern_C_RemoveMenu final
{
public:
	TArray<class UWBP_Menu_Parts_000_modern_C*>   ItemArray;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Parts_000_modern_C*           Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x005C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue2;        // 0x0064(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Present_List_000_modern_C_RemoveMenu) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_000_modern_C_RemoveMenu");
static_assert(sizeof(WBP_Menu_Present_List_000_modern_C_RemoveMenu) == 0x000070, "Wrong size on WBP_Menu_Present_List_000_modern_C_RemoveMenu");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, ItemArray) == 0x000000, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::ItemArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, Target) == 0x000010, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::Target' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Array_Find_ReturnValue) == 0x000030, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_GetPosition_ReturnValue) == 0x000034, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Less_IntInt_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_GetSize_ReturnValue) == 0x00005C, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Add_Vector2DVector2D_ReturnValue2) == 0x000064, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Add_Vector2DVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_RemoveMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Present_List_000_modern_C_RemoveMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Present_List_000_modern.WBP_Menu_Present_List_000_modern_C.SetInfoText
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Present_List_000_modern_C_SetInfoText final
{
public:
	class FName                                   InSelected;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Present_List_000_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_000_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Present_List_000_modern_C_SetInfoText) == 0x000020, "Wrong size on WBP_Menu_Present_List_000_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_SetInfoText, InSelected) == 0x000000, "Member 'WBP_Menu_Present_List_000_modern_C_SetInfoText::InSelected' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_000_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Present_List_000_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
