#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_074_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_074_modern.WBP_Menu_Parts_074_modern_C.ExecuteUbergraph_WBP_Menu_Parts_074_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGBattleGroupInfo*                K2Node_DynamicCast_AsJack_UMGBattle_Group_Info;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0028(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern");
static_assert(sizeof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern) == 0x000048, "Wrong size on WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, K2Node_Event_InItemData) == 0x000008, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, K2Node_DynamicCast_AsJack_UMGBattle_Group_Info) == 0x000010, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::K2Node_DynamicCast_AsJack_UMGBattle_Group_Info' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, CallFunc_GetDecMenuText_ReturnValue) == 0x000028, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Parts_074_modern_C_ExecuteUbergraph_WBP_Menu_Parts_074_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Parts_074_modern.WBP_Menu_Parts_074_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_074_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_074_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Parts_074_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Parts_074_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Parts_074_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Parts_074_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Parts_074_modern_C_DrawItemBase::InItemData' has a wrong offset!");

}

