#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_List_002_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_List_002_modern.WBP_Menu_Dougu_List_002_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern
// 0x06F0 (0x06F0 - 0x0000)
struct WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_List_101_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Dougu_List_101_Modern; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue;             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemGettableCountInBag_ReturnValue;    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue2;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemGettableCountInBag_ReturnValue2;   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagTargetItemIndex_ReturnValue;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue3;            // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetItemIdFromBagIndex_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue4;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommonBag_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable5;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue5;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable6;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0180(0x0048)()
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue3;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUMGBagString_NewParam;                 // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue6;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x01E8(0x0048)()
	class FString                                 CallFunc_GetUMGBagString_NewParam2;                // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x0240(0x0048)()
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue7;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue4;          // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetBagCharacter_ReturnValue;              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetBagCharacter_ReturnValue2;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x02A8(0x0048)()
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x02F0(0x0048)()
	class FName                                   Temp_name_Variable7;                               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0340(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue5;          // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue8;            // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0360(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue12;            // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData4;        // 0x0390(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x03D8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsUMGAliveTargetCharacter_bIsAlive;       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGAliveTargetCharacter_bIsAlive2;      // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable8;                               // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Quantity_001_modern_C* K2Node_DynamicCast_AsWBP_Menu_Common_Quantity_001_Modern; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array4;                           // 0x0420(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue13;            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue2;                  // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue14;            // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDecMessageString_ReturnValue;          // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0488(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData5;        // 0x0498(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array5;                           // 0x04E0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x04F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive2;       // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue15;            // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array6;                           // 0x0518(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_ActionItem_ReturnValue3;                  // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveTargetCharacter_bIsAlive3;      // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive3;       // 0x052D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E[0x2];                                      // 0x052E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue16;            // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array7;                           // 0x0538(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_ActionItem_ReturnValue4;                  // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0550(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array8;                           // 0x0560(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue17;            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array9;                           // 0x0578(0x0010)(ZeroConstructor, ReferenceParm)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue6;          // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommonBag_ReturnValue2;                 // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58A[0x6];                                      // 0x058A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0590(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue18;            // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagSelectedItemIndex_ReturnValue;      // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue7;          // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AD[0x3];                                      // 0x05AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable9;                               // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetItemIdFromBagIndex_ReturnValue2;       // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue19;            // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemInBag_ReturnValue;               // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue9;            // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D5[0x3];                                      // 0x05D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select4_Default;                            // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemGettableCountInBag_ReturnValue3;   // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x05E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsUMGAliveTargetCharacter_bIsAlive4;      // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue20;            // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select5_Default;                            // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue5;                  // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue21;            // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array10;                          // 0x0620(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0630(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0640(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0650(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue22;            // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue;             // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66A[0x2];                                      // 0x066A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateItemBrowserList_NumData;            // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable10;                              // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue23;            // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select6_Default;                            // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable7;                               // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select7_Default;                            // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A3[0x5];                                      // 0x06A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate8;             // 0x06A8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x06B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue24;            // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue8;          // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x3];                                      // 0x06D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindItemFromInBag_ReturnValue;            // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x06D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern");
static_assert(sizeof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern) == 0x0006F0, "Wrong size on WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable) == 0x000038, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable2) == 0x000050, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000058, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_CustomEvent_EventTag) == 0x000060, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000068, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_CustomEvent_EventName) == 0x000070, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_CustomEvent_InItemBase) == 0x000078, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000080, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetDataIndex_ReturnValue) == 0x000088, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x00008C, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000090, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_List_101_Modern) == 0x000098, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_List_101_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable3) == 0x0000A8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000B8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetActionItemId_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetActionItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_bool_Variable) == 0x0000D0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue) == 0x0000D1, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x0000D8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetItemGettableCountInBag_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetItemGettableCountInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue2) == 0x0000E4, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E5, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetItemGettableCountInBag_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetItemGettableCountInBag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x0000EC, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x0000F0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x0000F8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetItemIndex_ReturnValue) == 0x000100, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000104, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue3) == 0x000105, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetItemIdFromBagIndex_ReturnValue) == 0x000108, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetItemIdFromBagIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x000110, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable4) == 0x000118, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue4) == 0x000120, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_IsCommonBag_ReturnValue) == 0x000121, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_IsCommonBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000128, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_bool_Variable2) == 0x000130, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable5) == 0x000138, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x000140, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue5) == 0x000149, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x000150, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000158, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_int_Variable) == 0x00015C, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000160, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000161, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_bool_Variable3) == 0x000162, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable6) == 0x000168, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000170, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue9) == 0x000178, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000180, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue3) == 0x0001C8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGBagString_NewParam) == 0x0001D0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGBagString_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue6) == 0x0001E0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0001E8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetUMGBagString_NewParam2) == 0x000230, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetUMGBagString_NewParam2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_MakeStruct_JackMessageArgumentData3) == 0x000240, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_MakeStruct_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue10) == 0x000288, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue7) == 0x000290, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue4) == 0x000291, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagCharacter_ReturnValue) == 0x000298, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagCharacter_ReturnValue2) == 0x0002A0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x0002A8, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2) == 0x0002F0, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, Temp_name_Variable7) == 0x000338, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::Temp_name_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, K2Node_MakeArray_Array) == 0x000340, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetAccessorItem_ReturnValue11) == 0x000350, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetAccessorItem_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_IsUMGAliveSelectCharacter_bIsLive) == 0x000358, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_IsUMGAliveSelectCharacter_bIsLive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagSelectedType_ReturnValue5) == 0x000359, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagSelectedType_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern, CallFunc_GetBagTargetType_ReturnValue8) == 0x00035A, "Member 'WBP_Menu_Dougu_List_002_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern::CallFunc_GetBagTargetType_ReturnValue8' has a wrong offset!");
