#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Setumei_003_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_Setumei_003_modern.WBP_Menu_Common_Setumei_003_modern_C.ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TextID;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bValue;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern");
static_assert(sizeof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern) == 0x000050, "Wrong size on WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, Temp_float_Variable) == 0x000008, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, Temp_float_Variable2) == 0x00000C, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, K2Node_CustomEvent_TextID) == 0x000010, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::K2Node_CustomEvent_TextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, K2Node_Select_Default) == 0x000018, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, K2Node_CustomEvent_bValue) == 0x00001C, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::K2Node_CustomEvent_bValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_GetPosition_ReturnValue) == 0x000030, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000048, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern, CallFunc_MakeLiteralInt_ReturnValue) == 0x00004C, "Member 'WBP_Menu_Common_Setumei_003_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_003_modern::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_003_modern.WBP_Menu_Common_Setumei_003_modern_C.SetBattleMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode) == 0x000001, "Wrong alignment on WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode");
static_assert(sizeof(WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode) == 0x000001, "Wrong size on WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode, bValue) == 0x000000, "Member 'WBP_Menu_Common_Setumei_003_modern_C_SetBattleMode::bValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_003_modern.WBP_Menu_Common_Setumei_003_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Setumei_003_modern_C_SetData final
{
public:
	class FName                                   TextID;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_003_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_003_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Common_Setumei_003_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_003_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_SetData, TextID) == 0x000000, "Member 'WBP_Menu_Common_Setumei_003_modern_C_SetData::TextID' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_003_modern.WBP_Menu_Common_Setumei_003_modern_C.SetSetumei
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Common_Setumei_003_modern_C_SetSetumei final
{
public:
	class FText                                   InCategory;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDescription;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_003_modern_C_SetSetumei) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_003_modern_C_SetSetumei");
static_assert(sizeof(WBP_Menu_Common_Setumei_003_modern_C_SetSetumei) == 0x000040, "Wrong size on WBP_Menu_Common_Setumei_003_modern_C_SetSetumei");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_SetSetumei, InCategory) == 0x000000, "Member 'WBP_Menu_Common_Setumei_003_modern_C_SetSetumei::InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_SetSetumei, InDescription) == 0x000018, "Member 'WBP_Menu_Common_Setumei_003_modern_C_SetSetumei::InDescription' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_003_modern_C_SetSetumei, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_Menu_Common_Setumei_003_modern_C_SetSetumei::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

