#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_ActionCursor_All_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_ActionCursor_All_000.WBP_Hud_ActionCursor_All_000_C
// 0x0068 (0x0238 - 0x01D0)
class UWBP_Hud_ActionCursor_All_000_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopAnimation_Exclamation;                         // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       InAnimation_Exclamation;                           // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoopAnimation;                                     // 0x01E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       InAnimation;                                       // 0x01F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x01F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImagePanel;                                    // 0x0200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bInitialized;                                      // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconTextureRef;                                    // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ExclamationTexture;                                // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             AnglyTexture;                                      // 0x0220(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BattleCursorTexture;                               // 0x0228(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetAnimPlayer*               AnimationPlayer;                                   // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_ActionCursor_All_000(int32 EntryPoint);
	void ChangePhotoModeDelegate_Event_0(bool bIsPhotoMode);
	void Construct();
	void HideAll();
	void HideAndStopAnimAll(class UWidgetAnimation* InAnimation_0);
	void Init();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ShowActionGuide();
	void ShowAngryIcon();
	void ShowBattleCursor();
	void StopAnimAll(class UWidgetAnimation* InAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_ActionCursor_All_000_C">();
	}
	static class UWBP_Hud_ActionCursor_All_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_ActionCursor_All_000_C>();
	}
};
static_assert(alignof(UWBP_Hud_ActionCursor_All_000_C) == 0x000008, "Wrong alignment on UWBP_Hud_ActionCursor_All_000_C");
static_assert(sizeof(UWBP_Hud_ActionCursor_All_000_C) == 0x000238, "Wrong size on UWBP_Hud_ActionCursor_All_000_C");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Hud_ActionCursor_All_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, LoopAnimation_Exclamation) == 0x0001D8, "Member 'UWBP_Hud_ActionCursor_All_000_C::LoopAnimation_Exclamation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, InAnimation_Exclamation) == 0x0001E0, "Member 'UWBP_Hud_ActionCursor_All_000_C::InAnimation_Exclamation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, LoopAnimation) == 0x0001E8, "Member 'UWBP_Hud_ActionCursor_All_000_C::LoopAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, InAnimation) == 0x0001F0, "Member 'UWBP_Hud_ActionCursor_All_000_C::InAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, CanvasPanel) == 0x0001F8, "Member 'UWBP_Hud_ActionCursor_All_000_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, IconImagePanel) == 0x000200, "Member 'UWBP_Hud_ActionCursor_All_000_C::IconImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, bInitialized) == 0x000208, "Member 'UWBP_Hud_ActionCursor_All_000_C::bInitialized' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, IconTextureRef) == 0x000210, "Member 'UWBP_Hud_ActionCursor_All_000_C::IconTextureRef' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, ExclamationTexture) == 0x000218, "Member 'UWBP_Hud_ActionCursor_All_000_C::ExclamationTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, AnglyTexture) == 0x000220, "Member 'UWBP_Hud_ActionCursor_All_000_C::AnglyTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, BattleCursorTexture) == 0x000228, "Member 'UWBP_Hud_ActionCursor_All_000_C::BattleCursorTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_All_000_C, AnimationPlayer) == 0x000230, "Member 'UWBP_Hud_ActionCursor_All_000_C::AnimationPlayer' has a wrong offset!");

}

