#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_090_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_090_modern.WBP_Menu_Parts_090_modern_C.ExecuteUbergraph_WBP_Menu_Parts_090_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGMitameSoubiState                      Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGMitameItemInfo                 K2Node_CustomEvent_JackUMGMitameItemInfo;          // 0x0010(0x0030)(ConstParm)
	bool                                          K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern");
static_assert(sizeof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern) == 0x000048, "Wrong size on WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_byte_Variable3) == 0x000007, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_bool_Variable2) == 0x000008, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_bool_Variable3) == 0x000009, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_bool_Variable4) == 0x00000A, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_bool_Variable5) == 0x00000B, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, Temp_bool_Variable6) == 0x00000C, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, K2Node_CustomEvent_JackUMGMitameItemInfo) == 0x000010, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::K2Node_CustomEvent_JackUMGMitameItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, K2Node_Select_Default) == 0x000040, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern, K2Node_Select2_Default) == 0x000042, "Member 'WBP_Menu_Parts_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_090_modern::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Parts_090_modern.WBP_Menu_Parts_090_modern_C.SetMtameItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Parts_090_modern_C_SetMtameItem final
{
public:
	struct FJackUMGMitameItemInfo                 JackUMGMitameItemInfo;                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Parts_090_modern_C_SetMtameItem) == 0x000008, "Wrong alignment on WBP_Menu_Parts_090_modern_C_SetMtameItem");
static_assert(sizeof(WBP_Menu_Parts_090_modern_C_SetMtameItem) == 0x000030, "Wrong size on WBP_Menu_Parts_090_modern_C_SetMtameItem");
static_assert(offsetof(WBP_Menu_Parts_090_modern_C_SetMtameItem, JackUMGMitameItemInfo) == 0x000000, "Member 'WBP_Menu_Parts_090_modern_C_SetMtameItem::JackUMGMitameItemInfo' has a wrong offset!");

}

