#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Exclamation_000

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Exclamation_000.WBP_Hud_Exclamation_000_C.ExecuteUbergraph_WBP_Hud_Exclamation_000
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlay2dSe;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000) == 0x000004, "Wrong alignment on WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000");
static_assert(sizeof(WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000) == 0x000008, "Wrong size on WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000");
static_assert(offsetof(WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000, EntryPoint) == 0x000000, "Member 'WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000, K2Node_CustomEvent_bPlay2dSe) == 0x000004, "Member 'WBP_Hud_Exclamation_000_C_ExecuteUbergraph_WBP_Hud_Exclamation_000::K2Node_CustomEvent_bPlay2dSe' has a wrong offset!");

// Function WBP_Hud_Exclamation_000.WBP_Hud_Exclamation_000_C.InitData
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Exclamation_000_C_InitData final
{
public:
	bool                                          bPlay2dSe;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Exclamation_000_C_InitData) == 0x000001, "Wrong alignment on WBP_Hud_Exclamation_000_C_InitData");
static_assert(sizeof(WBP_Hud_Exclamation_000_C_InitData) == 0x000001, "Wrong size on WBP_Hud_Exclamation_000_C_InitData");
static_assert(offsetof(WBP_Hud_Exclamation_000_C_InitData, bPlay2dSe) == 0x000000, "Member 'WBP_Hud_Exclamation_000_C_InitData::bPlay2dSe' has a wrong offset!");

}

