#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Renkei_Settei_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Renkei_Settei_000_modern.WBP_Menu_Sakusen_Renkei_Settei_000_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern) == 0x000004, "Wrong size on WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Renkei_Settei_000_modern::EntryPoint' has a wrong offset!");

// Function WBP_Menu_Sakusen_Renkei_Settei_000_modern.WBP_Menu_Sakusen_Renkei_Settei_000_modern_C.SetRenkeiText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText final
{
public:
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackRenkeiSettei                             CallFunc_GetRenkeiSettei_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText");
static_assert(sizeof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText");
static_assert(offsetof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText, CallFunc_GetRenkeiSettei_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText::CallFunc_GetRenkeiSettei_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WBP_Menu_Sakusen_Renkei_Settei_000_modern_C_SetRenkeiText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

