#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_RuraPoint_003

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WorldMap_RuraPoint_003.WBP_Menu_WorldMap_RuraPoint_003_C
// 0x0018 (0x01E8 - 0x01D0)
class UWBP_Menu_WorldMap_RuraPoint_003_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 RuraPoint_002;                                     // 0x01D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RuraPoint_Grow;                                    // 0x01E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_WorldMap_RuraPoint_003(int32 EntryPoint);
	void SetFlag(bool bIsOn);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WorldMap_RuraPoint_003_C">();
	}
	static class UWBP_Menu_WorldMap_RuraPoint_003_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WorldMap_RuraPoint_003_C>();
	}
};
static_assert(alignof(UWBP_Menu_WorldMap_RuraPoint_003_C) == 0x000008, "Wrong alignment on UWBP_Menu_WorldMap_RuraPoint_003_C");
static_assert(sizeof(UWBP_Menu_WorldMap_RuraPoint_003_C) == 0x0001E8, "Wrong size on UWBP_Menu_WorldMap_RuraPoint_003_C");
static_assert(offsetof(UWBP_Menu_WorldMap_RuraPoint_003_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Menu_WorldMap_RuraPoint_003_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_RuraPoint_003_C, RuraPoint_002) == 0x0001D8, "Member 'UWBP_Menu_WorldMap_RuraPoint_003_C::RuraPoint_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_RuraPoint_003_C, RuraPoint_Grow) == 0x0001E0, "Member 'UWBP_Menu_WorldMap_RuraPoint_003_C::RuraPoint_Grow' has a wrong offset!");

}

