#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Norimono_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Norimono_000_modern.WBP_Hud_Norimono_000_modern_C
// 0x00A8 (0x0468 - 0x03C0)
class UWBP_Hud_Norimono_000_modern_C final : public UJackUMGNorimonoGauge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       InOut;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base3;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base4;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base5;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base6;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Norimono_1_All;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Norimono_2_All;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Norimono_3_All;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Norimono_4_All;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_1_0;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_1_1;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_2_0;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_3_0;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_4_0;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_4_1;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_4_2;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsGauge3;                                          // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NorimonoModeSave;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Norimono_000_modern(int32 EntryPoint);
	void FripAutoRun(class FName Mode);
	void NorimonoGaugeAction(EJackUMGNorimonoGaugeAction Action);
	void CustomEvent_0(class FName EventTag);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void HorseInit();
	void Horse3Init();
	void Norimono5Init();
	void Norimono1Init();
	void Norimono2Init();
	void Norimono3Init();
	void Norimono4Init();
	void IsAutoRun(bool* AutoRun);
	void Norimono6Init();
	void Notimono7Init();
	void Notimono8Init();
	void Norimono8Loop();
	void SetAutoRunVisibility();
	void Norimono00Init();
	void Norimono01Init();
	void Norimono02Init();
	void Norimono03Init();
	void SetNorimonoAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Norimono_000_modern_C">();
	}
	static class UWBP_Hud_Norimono_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Norimono_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Norimono_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Norimono_000_modern_C");
static_assert(sizeof(UWBP_Hud_Norimono_000_modern_C) == 0x000468, "Wrong size on UWBP_Hud_Norimono_000_modern_C");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, UberGraphFrame) == 0x0003C0, "Member 'UWBP_Hud_Norimono_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, InOut) == 0x0003C8, "Member 'UWBP_Hud_Norimono_000_modern_C::InOut' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Base3) == 0x0003D0, "Member 'UWBP_Hud_Norimono_000_modern_C::Base3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Base4) == 0x0003D8, "Member 'UWBP_Hud_Norimono_000_modern_C::Base4' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Base5) == 0x0003E0, "Member 'UWBP_Hud_Norimono_000_modern_C::Base5' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Base6) == 0x0003E8, "Member 'UWBP_Hud_Norimono_000_modern_C::Base6' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, InvalidationBox_0) == 0x0003F0, "Member 'UWBP_Hud_Norimono_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Norimono_1_All) == 0x0003F8, "Member 'UWBP_Hud_Norimono_000_modern_C::Norimono_1_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Norimono_2_All) == 0x000400, "Member 'UWBP_Hud_Norimono_000_modern_C::Norimono_2_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Norimono_3_All) == 0x000408, "Member 'UWBP_Hud_Norimono_000_modern_C::Norimono_3_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, Norimono_4_All) == 0x000410, "Member 'UWBP_Hud_Norimono_000_modern_C::Norimono_4_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, RootPanel) == 0x000418, "Member 'UWBP_Hud_Norimono_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_1_0) == 0x000420, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_1_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_1_1) == 0x000428, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_1_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_2_0) == 0x000430, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_2_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_3_0) == 0x000438, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_3_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_4_0) == 0x000440, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_4_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_4_1) == 0x000448, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_4_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, WBP_Menu_Parts_008_4_2) == 0x000450, "Member 'UWBP_Hud_Norimono_000_modern_C::WBP_Menu_Parts_008_4_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, IsGauge3) == 0x000458, "Member 'UWBP_Hud_Norimono_000_modern_C::IsGauge3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Norimono_000_modern_C, NorimonoModeSave) == 0x000460, "Member 'UWBP_Hud_Norimono_000_modern_C::NorimonoModeSave' has a wrong offset!");

}

