#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Casino_Quantity_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C
// 0x0060 (0x0498 - 0x0438)
class UWBP_Menu_Casino_Quantity_000_modern_C final : public UJackUMGCashierWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(Transient, DuplicateTransient)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_2;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_364;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_003_modern_C*           WBP_Menu_Parts_003_C_1;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           WBP_Menu_Parts_007_C_2;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_59;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_1;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_2;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnGinkouEnter;                                     // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnGinkouCancel;                                    // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnGinkouEnter__DelegateSignature(class UJackUMGWidgetBase* Sender, int32 Value);
	void OnGinkouCancel__DelegateSignature(class UJackUMGWidgetBase* Sender);
	void ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern(int32 EntryPoint);
	void Construct();
	void BPActionDelegate(class FName EventTag);
	void DefaultNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void SetupQuantity(class FName CaptionTextId, class FName UnitTextId1, class FName TotalTextId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Casino_Quantity_000_modern_C">();
	}
	static class UWBP_Menu_Casino_Quantity_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Casino_Quantity_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Casino_Quantity_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Casino_Quantity_000_modern_C");
static_assert(sizeof(UWBP_Menu_Casino_Quantity_000_modern_C) == 0x000498, "Wrong size on UWBP_Menu_Casino_Quantity_000_modern_C");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, UberGraphFrame) == 0x000438, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, WBP_Menu_Parts_000_C_2) == 0x000440, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::WBP_Menu_Parts_000_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, WBP_Menu_Parts_000_C_364) == 0x000448, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::WBP_Menu_Parts_000_C_364' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, WBP_Menu_Parts_003_C_1) == 0x000450, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::WBP_Menu_Parts_003_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, WBP_Menu_Parts_007_C_2) == 0x000458, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::WBP_Menu_Parts_007_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, WBP_Menu_Parts_024_C_59) == 0x000460, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::WBP_Menu_Parts_024_C_59' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, Window_Line_1) == 0x000468, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::Window_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, Window_Line_2) == 0x000470, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::Window_Line_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, OnGinkouEnter) == 0x000478, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::OnGinkouEnter' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Casino_Quantity_000_modern_C, OnGinkouCancel) == 0x000488, "Member 'UWBP_Menu_Casino_Quantity_000_modern_C::OnGinkouCancel' has a wrong offset!");

}

