#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_040

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_040.WBP_Menu_Title_BG_040_C
// 0x0058 (0x03C8 - 0x0370)
class UWBP_Menu_Title_BG_040_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glowcloud;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glowstar;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title_Bg_040_Panel;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleRoot;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tree;                                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_041_C*               WBP_Menu_Title_BG_041;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Title_BG_042_C*               WBP_Menu_Title_BG_042;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Title_BG_040(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_040_C">();
	}
	static class UWBP_Menu_Title_BG_040_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_040_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_040_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_040_C");
static_assert(sizeof(UWBP_Menu_Title_BG_040_C) == 0x0003C8, "Wrong size on UWBP_Menu_Title_BG_040_C");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_040_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_BG_040_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, Glowcloud) == 0x000380, "Member 'UWBP_Menu_Title_BG_040_C::Glowcloud' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, Glowstar) == 0x000388, "Member 'UWBP_Menu_Title_BG_040_C::Glowstar' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, RootPanel) == 0x000390, "Member 'UWBP_Menu_Title_BG_040_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, Star) == 0x000398, "Member 'UWBP_Menu_Title_BG_040_C::Star' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, Title_Bg_040_Panel) == 0x0003A0, "Member 'UWBP_Menu_Title_BG_040_C::Title_Bg_040_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, TitleRoot) == 0x0003A8, "Member 'UWBP_Menu_Title_BG_040_C::TitleRoot' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, Tree) == 0x0003B0, "Member 'UWBP_Menu_Title_BG_040_C::Tree' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, WBP_Menu_Title_BG_041) == 0x0003B8, "Member 'UWBP_Menu_Title_BG_040_C::WBP_Menu_Title_BG_041' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_040_C, WBP_Menu_Title_BG_042) == 0x0003C0, "Member 'UWBP_Menu_Title_BG_040_C::WBP_Menu_Title_BG_042' has a wrong offset!");

}

