#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_023_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_023_modern.WBP_Menu_Parts_023_modern_C.ExecuteUbergraph_WBP_Menu_Parts_023_modern
// 0x0200 (0x0200 - 0x0000)
struct WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     K2Node_CustomEvent_Data;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0050(0x0050)()
	class UJackFriendGameCharacter*               K2Node_DynamicCast_AsJack_Friend_Game_Character;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMemberDataInKyoukai*    K2Node_DynamicCast_AsJack_UMGAccessor_Member_Data_in_Kyoukai; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0018)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     K2Node_CustomEvent_Data2;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue2;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRawDisplayName_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0100(0x0018)()
	TArray<class UWBP_Menu_Parts_Buff_000_C*>     K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_ColorType;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackUMGFontColor                      CallFunc_GetFontColor_ReturnValue;                 // 0x0170(0x0024)(NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetUMGMenuStringFromTextId_ReturnValue;   // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01B0(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x01E8(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern");
static_assert(sizeof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern) == 0x000200, "Wrong size on WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_CustomEvent_Data) == 0x000008, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetLevel_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, Temp_bool_Variable) == 0x000028, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, Temp_string_Variable) == 0x000030, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, Temp_string_Variable2) == 0x000040, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_CustomEvent_ItemContainer) == 0x000050, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_DynamicCast_AsJack_Friend_Game_Character) == 0x0000A0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_DynamicCast_AsJack_Friend_Game_Character' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_DynamicCast_AsJack_UMGAccessor_Member_Data_in_Kyoukai) == 0x0000B0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_DynamicCast_AsJack_UMGAccessor_Member_Data_in_Kyoukai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_DynamicCast_bSuccess2) == 0x0000B8, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_SwitchName_CmpSuccess) == 0x0000D8, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_CustomEvent_Data2) == 0x0000E0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_CustomEvent_Data2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetLevel_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetRawDisplayName_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetRawDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_MakeArray_Array) == 0x000118, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000128, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_CustomEvent_Level) == 0x000130, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_CustomEvent_ColorType) == 0x000134, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_CustomEvent_ColorType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000135, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x000138, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_Select_Default) == 0x000148, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000158, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_Concat_StrStr_ReturnValue) == 0x000160, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetFontColor_ReturnValue) == 0x000170, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetFontColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000198, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_GetUMGMenuStringFromTextId_ReturnValue) == 0x0001A0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_GetUMGMenuStringFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, K2Node_MakeStruct_SlateColor) == 0x0001B0, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_Concat_StrStr_ReturnValue2) == 0x0001D8, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern, CallFunc_Conv_StringToText_ReturnValue3) == 0x0001E8, "Member 'WBP_Menu_Parts_023_modern_C_ExecuteUbergraph_WBP_Menu_Parts_023_modern::CallFunc_Conv_StringToText_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Parts_023_modern.WBP_Menu_Parts_023_modern_C.SetLevel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_023_modern_C_SetLevel final
{
public:
	class UJackGameCharacter*                     Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_023_modern_C_SetLevel) == 0x000008, "Wrong alignment on WBP_Menu_Parts_023_modern_C_SetLevel");
static_assert(sizeof(WBP_Menu_Parts_023_modern_C_SetLevel) == 0x000008, "Wrong size on WBP_Menu_Parts_023_modern_C_SetLevel");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_SetLevel, Data) == 0x000000, "Member 'WBP_Menu_Parts_023_modern_C_SetLevel::Data' has a wrong offset!");

// Function WBP_Menu_Parts_023_modern.WBP_Menu_Parts_023_modern_C.InitLevel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_023_modern_C_InitLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          ColorType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_023_modern_C_InitLevel) == 0x000004, "Wrong alignment on WBP_Menu_Parts_023_modern_C_InitLevel");
static_assert(sizeof(WBP_Menu_Parts_023_modern_C_InitLevel) == 0x000008, "Wrong size on WBP_Menu_Parts_023_modern_C_InitLevel");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_InitLevel, Level) == 0x000000, "Member 'WBP_Menu_Parts_023_modern_C_InitLevel::Level' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_InitLevel, ColorType) == 0x000004, "Member 'WBP_Menu_Parts_023_modern_C_InitLevel::ColorType' has a wrong offset!");

// Function WBP_Menu_Parts_023_modern.WBP_Menu_Parts_023_modern_C.SetGameCharacterData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_023_modern_C_SetGameCharacterData final
{
public:
	class UJackGameCharacter*                     Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_023_modern_C_SetGameCharacterData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_023_modern_C_SetGameCharacterData");
static_assert(sizeof(WBP_Menu_Parts_023_modern_C_SetGameCharacterData) == 0x000008, "Wrong size on WBP_Menu_Parts_023_modern_C_SetGameCharacterData");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_SetGameCharacterData, Data) == 0x000000, "Member 'WBP_Menu_Parts_023_modern_C_SetGameCharacterData::Data' has a wrong offset!");

// Function WBP_Menu_Parts_023_modern.WBP_Menu_Parts_023_modern_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_023_modern_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

}

