#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Message_Sentaku_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Menu_Message_SentakuBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Message_Sentaku_000_modern.WBP_Menu_Message_Sentaku_000_modern_C
// 0x0020 (0x0428 - 0x0408)
class UWBP_Menu_Message_Sentaku_000_modern_C final : public UWBP_Menu_Message_SentakuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Menu_Message_Sentaku_000_modern_C; // 0x0408(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           WBP_Menu_Parts_037_Hai;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           WBP_Menu_Parts_037_Iie;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Message_Sentaku_000_modern(int32 EntryPoint);
	void PlayOpenSe();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Message_Sentaku_000_modern_C">();
	}
	static class UWBP_Menu_Message_Sentaku_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Message_Sentaku_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Message_Sentaku_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Message_Sentaku_000_modern_C");
static_assert(sizeof(UWBP_Menu_Message_Sentaku_000_modern_C) == 0x000428, "Wrong size on UWBP_Menu_Message_Sentaku_000_modern_C");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_000_modern_C, UberGraphFrame_WBP_Menu_Message_Sentaku_000_modern_C) == 0x000408, "Member 'UWBP_Menu_Message_Sentaku_000_modern_C::UberGraphFrame_WBP_Menu_Message_Sentaku_000_modern_C' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_000_modern_C, ItemList) == 0x000410, "Member 'UWBP_Menu_Message_Sentaku_000_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_000_modern_C, WBP_Menu_Parts_037_Hai) == 0x000418, "Member 'UWBP_Menu_Message_Sentaku_000_modern_C::WBP_Menu_Parts_037_Hai' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Message_Sentaku_000_modern_C, WBP_Menu_Parts_037_Iie) == 0x000420, "Member 'UWBP_Menu_Message_Sentaku_000_modern_C::WBP_Menu_Parts_037_Iie' has a wrong offset!");

}

