#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_110_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_Syousai_110_modern.WBP_Menu_Dougu_Syousai_110_modern_C
// 0x00D8 (0x0448 - 0x0370)
class UWBP_Menu_Dougu_Syousai_110_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       PrevItemAnim_Bottom;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrevItemAnim_Top;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_01;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_126;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_127;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1104;                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1106;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1108;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1111;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_3311;                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4156;                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4157;                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4158;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4159;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4160;                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4163;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4164;                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4165;                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4166;                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_4167;                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WeaponList;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UJackUMGWidgetBase*>             WidgetList;                                        // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         DispItemList;                                      // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Dougu_Syousai_110_modern(int32 EntryPoint);
	void Construct();
	void DispItemFromSyousaiRef(class UJackUMGItemSyousai* InItemSyousaiRef);
	void JackOnWidgetNotificationDelegate_Event_0(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_Syousai_110_modern_C">();
	}
	static class UWBP_Menu_Dougu_Syousai_110_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_Syousai_110_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_Syousai_110_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_Syousai_110_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_Syousai_110_modern_C) == 0x000448, "Wrong size on UWBP_Menu_Dougu_Syousai_110_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, PrevItemAnim_Bottom) == 0x000378, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::PrevItemAnim_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, PrevItemAnim_Top) == 0x000380, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::PrevItemAnim_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, Title_01) == 0x000388, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::Title_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000) == 0x000390, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_126) == 0x000398, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_126' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_127) == 0x0003A0, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_127' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_1104) == 0x0003A8, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_1104' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_1106) == 0x0003B0, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_1106' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_1108) == 0x0003B8, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_1108' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_1111) == 0x0003C0, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_1111' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_3311) == 0x0003C8, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_3311' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4156) == 0x0003D0, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4156' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4157) == 0x0003D8, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4157' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4158) == 0x0003E0, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4158' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4159) == 0x0003E8, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4159' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4160) == 0x0003F0, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4160' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4163) == 0x0003F8, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4163' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4164) == 0x000400, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4164' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4165) == 0x000408, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4165' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4166) == 0x000410, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4166' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WBP_Menu_Parts_000_C_4167) == 0x000418, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WBP_Menu_Parts_000_C_4167' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WeaponList) == 0x000420, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WeaponList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, WidgetList) == 0x000428, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::WidgetList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_110_modern_C, DispItemList) == 0x000438, "Member 'UWBP_Menu_Dougu_Syousai_110_modern_C::DispItemList' has a wrong offset!");

}

