#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_List_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_List_002_modern.WBP_Menu_Dougu_List_002_modern_C
// 0x0438 (0x0868 - 0x0430)
class UWBP_Menu_Dougu_List_002_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemHighlightPanel;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanelNE;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Soubi_000_modern_C*     WBP_Menu_Dougu_Soubi_000;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_0;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_1;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_2;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_3;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_4;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_5;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_6;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_7;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_083_modern_C*           WBP_Menu_Parts_083_C_8;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrameAll;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_List_101_modern_C*      ItemListWindow105Ref;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 MenuTargetCharName;                                // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 MenuCharName;                                      // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 MenuItemName;                                      // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 MenuItemCount;                                     // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FJackMessageArgumentData               MsgMenuCharName;                                   // 0x04F0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgTargetCharName;                                 // 0x0538(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgItemName;                                       // 0x0580(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgItemCount;                                      // 0x05C8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgSwapItemName;                                   // 0x0610(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   FromCommonEquipment;                               // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   FromCharacterEquipment;                            // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         IndexInBag;                                        // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 SaveBagSelectedType;                               // 0x067C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HandednessIndex;                                   // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          EquipmentRegion;                                   // 0x0684(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Main_Command_000_modern_C*    MainCommandWindowRef;                              // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PessedItemIndex;                                   // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               MsgAliveName;                                      // 0x0698(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgCharName;                                       // 0x06E0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgReleaseItemName;                                // 0x0728(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackUMGEquipmentResultData            EquipmentResultData;                               // 0x0770(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EJackCharacter                                SoubiCharType;                                     // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               MsgTargetBagName;                                  // 0x0790(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgSelectBagName;                                  // 0x07D8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ActionItemId;                                      // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GettableCount;                                     // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PassItemCount;                                     // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Quantity_001_modern_C* QuantityWindowRef;                                 // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoubiItemId;                                       // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       MessageArgList;                                    // 0x0848(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsFocusEvent;                                      // 0x0858(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectBagID;                                       // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FromCommonEquipment__DelegateSignature();
	void FromCharacterEquipment__DelegateSignature();
	void ExecuteUbergraph_WBP_Menu_Dougu_List_002_modern(int32 EntryPoint);
	void DoDispResultMessageFinish_Event_0();
	void DoEquipmentEventFinish_Event_0();
	void NotifyDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void Destruct();
	void SenaHairstyleChangedDelegate_Event_0();
	void DoEquipment();
	void FromCharacterEquipmentEvent();
	void FromCommonEquipmentEvent();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void DoPass();
	void SetActionCount(int32 InCount, int32* NewParam);
	void FocusSwapTargetList();
	void UpdateList();
	void ReturnToDouguList();
	void SetEquipmentItem(int32 InIndex);
	void FocusItemListWindow();
	void UpdateItemListWindow(class FName InSelectItemId, int32 InItemIndex);
	void PassedUpdateItemList(class FName InSelectItemId, int32 InItemIndex);

	bool IsSameBagType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_List_002_modern_C">();
	}
	static class UWBP_Menu_Dougu_List_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_List_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_List_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_List_002_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_List_002_modern_C) == 0x000868, "Wrong size on UWBP_Menu_Dougu_List_002_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Dougu_List_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, CaptionPanel) == 0x000438, "Member 'UWBP_Menu_Dougu_List_002_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, ItemHighlightPanel) == 0x000440, "Member 'UWBP_Menu_Dougu_List_002_modern_C::ItemHighlightPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, ItemListPanelNE) == 0x000448, "Member 'UWBP_Menu_Dougu_List_002_modern_C::ItemListPanelNE' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Dougu_Soubi_000) == 0x000450, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Dougu_Soubi_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_0) == 0x000458, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_1) == 0x000460, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_2) == 0x000468, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_3) == 0x000470, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_4) == 0x000478, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_5) == 0x000480, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_6) == 0x000488, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_7) == 0x000490, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WBP_Menu_Parts_083_C_8) == 0x000498, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WBP_Menu_Parts_083_C_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, WindowFrameAll) == 0x0004A0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::WindowFrameAll' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, ItemListWindow105Ref) == 0x0004A8, "Member 'UWBP_Menu_Dougu_List_002_modern_C::ItemListWindow105Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MenuTargetCharName) == 0x0004B0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MenuTargetCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MenuCharName) == 0x0004C0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MenuCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MenuItemName) == 0x0004D0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MenuItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MenuItemCount) == 0x0004E0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MenuItemCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgMenuCharName) == 0x0004F0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgMenuCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgTargetCharName) == 0x000538, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgTargetCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgItemName) == 0x000580, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgItemCount) == 0x0005C8, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgItemCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgSwapItemName) == 0x000610, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgSwapItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, FromCommonEquipment) == 0x000658, "Member 'UWBP_Menu_Dougu_List_002_modern_C::FromCommonEquipment' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, FromCharacterEquipment) == 0x000668, "Member 'UWBP_Menu_Dougu_List_002_modern_C::FromCharacterEquipment' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, IndexInBag) == 0x000678, "Member 'UWBP_Menu_Dougu_List_002_modern_C::IndexInBag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, SaveBagSelectedType) == 0x00067C, "Member 'UWBP_Menu_Dougu_List_002_modern_C::SaveBagSelectedType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, HandednessIndex) == 0x000680, "Member 'UWBP_Menu_Dougu_List_002_modern_C::HandednessIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, EquipmentRegion) == 0x000684, "Member 'UWBP_Menu_Dougu_List_002_modern_C::EquipmentRegion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MainCommandWindowRef) == 0x000688, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MainCommandWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, PessedItemIndex) == 0x000690, "Member 'UWBP_Menu_Dougu_List_002_modern_C::PessedItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgAliveName) == 0x000698, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgAliveName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgCharName) == 0x0006E0, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgReleaseItemName) == 0x000728, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgReleaseItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, EquipmentResultData) == 0x000770, "Member 'UWBP_Menu_Dougu_List_002_modern_C::EquipmentResultData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, SoubiCharType) == 0x000788, "Member 'UWBP_Menu_Dougu_List_002_modern_C::SoubiCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgTargetBagName) == 0x000790, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgTargetBagName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MsgSelectBagName) == 0x0007D8, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MsgSelectBagName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, ActionItemId) == 0x000820, "Member 'UWBP_Menu_Dougu_List_002_modern_C::ActionItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, GettableCount) == 0x000828, "Member 'UWBP_Menu_Dougu_List_002_modern_C::GettableCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, PassItemCount) == 0x00082C, "Member 'UWBP_Menu_Dougu_List_002_modern_C::PassItemCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, QuantityWindowRef) == 0x000830, "Member 'UWBP_Menu_Dougu_List_002_modern_C::QuantityWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, ItemSyousaiRef) == 0x000838, "Member 'UWBP_Menu_Dougu_List_002_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, SoubiItemId) == 0x000840, "Member 'UWBP_Menu_Dougu_List_002_modern_C::SoubiItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, MessageArgList) == 0x000848, "Member 'UWBP_Menu_Dougu_List_002_modern_C::MessageArgList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, IsFocusEvent) == 0x000858, "Member 'UWBP_Menu_Dougu_List_002_modern_C::IsFocusEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_002_modern_C, SelectBagID) == 0x000860, "Member 'UWBP_Menu_Dougu_List_002_modern_C::SelectBagID' has a wrong offset!");

}

