#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_008_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C
// 0x00C0 (0x04D8 - 0x0418)
class UWBP_Menu_Sakusen_Settei_008_modern_C final : public UJackUMGHorizontalSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_232;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_515;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_087_modern_C*           WBP_Menu_Parts_087_autoidou;                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_087_modern_C*           WBP_Menu_Parts_087_tateidou;                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_087_modern_C*           WBP_Menu_Parts_087_yokoidou;                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_088_modern_C*           WBP_Menu_Parts_088_autoidounum;                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_088_modern_C*           WBP_Menu_Parts_088_hiroi;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_088_modern_C*           WBP_Menu_Parts_088_semai;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_1;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_2;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_3;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_4;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLineTate;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLineTate_1;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLineTate_2;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         InversH;                                           // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InversV;                                           // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AutoMove;                                          // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraSpeed;                                       // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraRoomSpeed;                                   // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraAutoSpeed;                                   // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     SnapSave;                                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_2(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void CustomEvent_1(class FName EventTag);
	void CustomEvent_0(class FName EventName, class UJackUMGItemBase* InItemBase);
	void SetTextInit();
	void GetCameraOptionData();
	void SetCameraOptionData();
	void GetAllValue();
	void SetAllValue();
	void AddSnap();
	void SetInfoText(class FName Selection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_Settei_008_modern_C">();
	}
	static class UWBP_Menu_Sakusen_Settei_008_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_Settei_008_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_Settei_008_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_Settei_008_modern_C");
static_assert(sizeof(UWBP_Menu_Sakusen_Settei_008_modern_C) == 0x0004D8, "Wrong size on UWBP_Menu_Sakusen_Settei_008_modern_C");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, UberGraphFrame) == 0x000418, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, ItemList) == 0x000420, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_000_C_1) == 0x000428, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_000_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_000_C_114) == 0x000430, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_000_C_232) == 0x000438, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_000_C_232' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_000_C_515) == 0x000440, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_000_C_515' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_087_autoidou) == 0x000448, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_087_autoidou' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_087_tateidou) == 0x000450, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_087_tateidou' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_087_yokoidou) == 0x000458, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_087_yokoidou' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_088_autoidounum) == 0x000460, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_088_autoidounum' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_088_hiroi) == 0x000468, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_088_hiroi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WBP_Menu_Parts_088_semai) == 0x000470, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WBP_Menu_Parts_088_semai' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowFrame) == 0x000478, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLine_1) == 0x000480, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLine_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLine_2) == 0x000488, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLine_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLine_3) == 0x000490, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLine_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLine_4) == 0x000498, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLine_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLineTate) == 0x0004A0, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLineTate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLineTate_1) == 0x0004A8, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLineTate_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, WindowLineTate_2) == 0x0004B0, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::WindowLineTate_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, InversH) == 0x0004B8, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::InversH' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, InversV) == 0x0004BC, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::InversV' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, AutoMove) == 0x0004C0, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::AutoMove' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, CameraSpeed) == 0x0004C4, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::CameraSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, CameraRoomSpeed) == 0x0004C8, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::CameraRoomSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, CameraAutoSpeed) == 0x0004CC, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::CameraAutoSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_008_modern_C, SnapSave) == 0x0004D0, "Member 'UWBP_Menu_Sakusen_Settei_008_modern_C::SnapSave' has a wrong offset!");

}

