#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Soubi_Window_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Soubi_Window_000_modern.WBP_Menu_Soubi_Window_000_modern_C
// 0x0148 (0x0548 - 0x0400)
class UWBP_Menu_Soubi_Window_000_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       OpenCloseAnim;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CommonButton;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SoubiName;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoubiNameBg;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StatusName;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StatusNum;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StatusPane;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_6;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_7;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_8;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_9;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_MitameName;                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_C_26;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      WBP_Menu_Soubi_Item_000_C_0;                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      WBP_Menu_Soubi_Item_000_C_1;                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      WBP_Menu_Soubi_Item_000_C_2;                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      WBP_Menu_Soubi_Item_000_C_3;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      WBP_Menu_Soubi_Item_000_C_4;                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_000_modern_C*      WBP_Menu_Soubi_Item_000_C_5;                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_List_000_modern_C*      WBP_Menu_Soubi_List_000;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_3;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackUMGItemData*                       CharSoubiData;                                     // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiList*                      SoubiList;                                         // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiState*                     SoubiState;                                        // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CharacterName;                                     // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsShowTokugi;                                      // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Soubi_Base_000_modern_C*      SoubiBaseRef;                                      // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Window_001_modern_C*    SoubiWindow001Ref;                                 // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOpenWidget;                                      // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimTimeScale;                                     // 0x0524(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCloseAnim;                                       // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           StatusNameTextIdList;                              // 0x0530(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	bool                                          IsClosePending;                                    // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Soubi_Window_000_modern(int32 EntryPoint);
	void SelectedCharType();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ResetCaptureCameraPosition();
	void HideDebugTargetSize();
	void HideDebugInfo();
	void ShowDebugTargetSize();
	void ShowDebugInfo();
	void WidgetNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void WodgetBGActionDelegate(class FName EventTag);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetDebugTargetSize(bool bVisible, const struct FVector2D& SlideTargetOrigin, const struct FVector2D& MaxSlideTargetSize, const struct FVector2D& MinSlideTargetSize);
	void ShowSoubiAndStatus();
	void SetBaseWindow(class UWBP_Menu_Soubi_Base_000_modern_C* InSoubiBaseRef);
	void UpdateSoubiList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Soubi_Window_000_modern_C">();
	}
	static class UWBP_Menu_Soubi_Window_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Soubi_Window_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Soubi_Window_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Soubi_Window_000_modern_C");
static_assert(sizeof(UWBP_Menu_Soubi_Window_000_modern_C) == 0x000548, "Wrong size on UWBP_Menu_Soubi_Window_000_modern_C");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, OpenCloseAnim) == 0x000408, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::OpenCloseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, CommonButton) == 0x000410, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::CommonButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, SoubiName) == 0x000418, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::SoubiName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, SoubiNameBg) == 0x000420, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::SoubiNameBg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, StatusName) == 0x000428, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::StatusName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, StatusNum) == 0x000430, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::StatusNum' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, StatusPane) == 0x000438, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::StatusPane' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_0) == 0x000440, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_1) == 0x000448, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_2) == 0x000450, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_3) == 0x000458, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_4) == 0x000460, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_5) == 0x000468, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_6) == 0x000470, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_7) == 0x000478, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_8) == 0x000480, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, TextBlock_9) == 0x000488, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::TextBlock_9' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Parts_001_MitameName) == 0x000490, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Parts_001_MitameName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Parts_008_C_26) == 0x000498, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Parts_008_C_26' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_Item_000_C_0) == 0x0004A0, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_Item_000_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_Item_000_C_1) == 0x0004A8, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_Item_000_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_Item_000_C_2) == 0x0004B0, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_Item_000_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_Item_000_C_3) == 0x0004B8, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_Item_000_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_Item_000_C_4) == 0x0004C0, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_Item_000_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_Item_000_C_5) == 0x0004C8, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_Item_000_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, WBP_Menu_Soubi_List_000) == 0x0004D0, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::WBP_Menu_Soubi_List_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, Window_Line_3) == 0x0004D8, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::Window_Line_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, CharSoubiData) == 0x0004E0, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::CharSoubiData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, SoubiList) == 0x0004E8, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::SoubiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, SoubiState) == 0x0004F0, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::SoubiState' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, CharacterName) == 0x0004F8, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, IsShowTokugi) == 0x000508, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::IsShowTokugi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, SoubiBaseRef) == 0x000510, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::SoubiBaseRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, SoubiWindow001Ref) == 0x000518, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::SoubiWindow001Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, IsOpenWidget) == 0x000520, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::IsOpenWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, AnimTimeScale) == 0x000524, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::AnimTimeScale' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, IsCloseAnim) == 0x000528, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::IsCloseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, StatusNameTextIdList) == 0x000530, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::StatusNameTextIdList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_000_modern_C, IsClosePending) == 0x000540, "Member 'UWBP_Menu_Soubi_Window_000_modern_C::IsClosePending' has a wrong offset!");

}

