#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Suuji3

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_Suuji3.WBP_Hud_Status_Suuji3_C.ExecuteUbergraph_WBP_Hud_Status_Suuji3
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, int32 ColorNum)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ColorNum;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Now;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Max;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_ColorType;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3) == 0x000008, "Wrong alignment on WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3");
static_assert(sizeof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3) == 0x000030, "Wrong size on WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, K2Node_CustomEvent_Index) == 0x000018, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, K2Node_CustomEvent_ColorNum) == 0x00001C, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::K2Node_CustomEvent_ColorNum' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, K2Node_CustomEvent_Now) == 0x000020, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::K2Node_CustomEvent_Now' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, K2Node_CustomEvent_Max) == 0x000024, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::K2Node_CustomEvent_Max' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3, K2Node_CustomEvent_ColorType) == 0x000028, "Member 'WBP_Hud_Status_Suuji3_C_ExecuteUbergraph_WBP_Hud_Status_Suuji3::K2Node_CustomEvent_ColorType' has a wrong offset!");

// Function WBP_Hud_Status_Suuji3.WBP_Hud_Status_Suuji3_C.InitValueHudStatusSuuji3
// 0x000C (0x000C - 0x0000)
struct WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3 final
{
public:
	int32                                         Now_0;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          ColorType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3) == 0x000004, "Wrong alignment on WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3");
static_assert(sizeof(WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3) == 0x00000C, "Wrong size on WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3, Now_0) == 0x000000, "Member 'WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3::Now_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3, Max) == 0x000004, "Member 'WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3::Max' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3, ColorType) == 0x000008, "Member 'WBP_Hud_Status_Suuji3_C_InitValueHudStatusSuuji3::ColorType' has a wrong offset!");

// Function WBP_Hud_Status_Suuji3.WBP_Hud_Status_Suuji3_C.ValueChangeDelegate_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColorNum;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event) == 0x000004, "Wrong alignment on WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event");
static_assert(sizeof(WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event) == 0x000008, "Wrong size on WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event, Index_0) == 0x000000, "Member 'WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event, ColorNum) == 0x000004, "Member 'WBP_Hud_Status_Suuji3_C_ValueChangeDelegate_Event::ColorNum' has a wrong offset!");

// Function WBP_Hud_Status_Suuji3.WBP_Hud_Status_Suuji3_C.SetColorTexture
// 0x0014 (0x0014 - 0x0000)
struct WBP_Hud_Status_Suuji3_C_SetColorTexture final
{
public:
	int32                                         Now_Value;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue2;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Suuji3_C_SetColorTexture) == 0x000004, "Wrong alignment on WBP_Hud_Status_Suuji3_C_SetColorTexture");
static_assert(sizeof(WBP_Hud_Status_Suuji3_C_SetColorTexture) == 0x000014, "Wrong size on WBP_Hud_Status_Suuji3_C_SetColorTexture");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_SetColorTexture, Now_Value) == 0x000000, "Member 'WBP_Hud_Status_Suuji3_C_SetColorTexture::Now_Value' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_SetColorTexture, CallFunc_Divide_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Hud_Status_Suuji3_C_SetColorTexture::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_SetColorTexture, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Hud_Status_Suuji3_C_SetColorTexture::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_SetColorTexture, CallFunc_Divide_IntInt_ReturnValue2) == 0x00000C, "Member 'WBP_Hud_Status_Suuji3_C_SetColorTexture::CallFunc_Divide_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Suuji3_C_SetColorTexture, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000010, "Member 'WBP_Hud_Status_Suuji3_C_SetColorTexture::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");

}

