#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Saving_002_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Saving_002_modern.WBP_Hud_Saving_002_modern_C.ExecuteUbergraph_WBP_Hud_Saving_002_modern
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern) == 0x000008, "Wrong alignment on WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern");
static_assert(sizeof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern) == 0x000050, "Wrong size on WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000008, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_GetEndTime_ReturnValue2) == 0x000024, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_GetEndTime_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_GetEndTime_ReturnValue3) == 0x00002C, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_GetEndTime_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000030, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, K2Node_CustomEvent_EventTag) == 0x000038, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000044, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000048, "Member 'WBP_Hud_Saving_002_modern_C_ExecuteUbergraph_WBP_Hud_Saving_002_modern::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");

// Function WBP_Hud_Saving_002_modern.WBP_Hud_Saving_002_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Hud_Saving_002_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Saving_002_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Hud_Saving_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Hud_Saving_002_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Hud_Saving_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Hud_Saving_002_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Hud_Saving_002_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

}

