#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Shibari_000_modern

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Shibari_000_modern.WBP_Hud_Shibari_000_modern_C.ExecuteUbergraph_WBP_Hud_Shibari_000_modern
// 0x0088 (0x0088 - 0x0000)
struct WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_InBattle;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_Text_Icon_080_modern_C*> K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_Text_Icon_080_modern_C* CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern) == 0x000008, "Wrong alignment on WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern");
static_assert(sizeof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern) == 0x000088, "Wrong size on WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, K2Node_Event_InDeltaTime) == 0x000044, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, CallFunc_IsInBattle_InBattle) == 0x00004C, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::CallFunc_IsInBattle_InBattle' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Hud_Shibari_000_modern_C_ExecuteUbergraph_WBP_Hud_Shibari_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Shibari_000_modern.WBP_Hud_Shibari_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Shibari_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Shibari_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Hud_Shibari_000_modern_C_Tick");
static_assert(sizeof(WBP_Hud_Shibari_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Hud_Shibari_000_modern_C_Tick");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Hud_Shibari_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Hud_Shibari_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Hud_Shibari_000_modern.WBP_Hud_Shibari_000_modern_C.IsInBattle
// 0x0018 (0x0018 - 0x0000)
struct WBP_Hud_Shibari_000_modern_C_IsInBattle final
{
public:
	bool                                          InBattle;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Shibari_000_modern_C_IsInBattle) == 0x000008, "Wrong alignment on WBP_Hud_Shibari_000_modern_C_IsInBattle");
static_assert(sizeof(WBP_Hud_Shibari_000_modern_C_IsInBattle) == 0x000018, "Wrong size on WBP_Hud_Shibari_000_modern_C_IsInBattle");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_IsInBattle, InBattle) == 0x000000, "Member 'WBP_Hud_Shibari_000_modern_C_IsInBattle::InBattle' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_IsInBattle, Result) == 0x000001, "Member 'WBP_Hud_Shibari_000_modern_C_IsInBattle::Result' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_IsInBattle, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'WBP_Hud_Shibari_000_modern_C_IsInBattle::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_IsInBattle, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_Hud_Shibari_000_modern_C_IsInBattle::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_IsInBattle, CallFunc_IsInBattle_ReturnValue) == 0x000011, "Member 'WBP_Hud_Shibari_000_modern_C_IsInBattle::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Shibari_000_modern.WBP_Hud_Shibari_000_modern_C.AdjustSibariList
// 0x0028 (0x0028 - 0x0000)
struct WBP_Hud_Shibari_000_modern_C_AdjustSibariList final
{
public:
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSibariplayList_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Shibari_000_modern_C_AdjustSibariList) == 0x000008, "Wrong alignment on WBP_Hud_Shibari_000_modern_C_AdjustSibariList");
static_assert(sizeof(WBP_Hud_Shibari_000_modern_C_AdjustSibariList) == 0x000028, "Wrong size on WBP_Hud_Shibari_000_modern_C_AdjustSibariList");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_AdjustSibariList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000000, "Member 'WBP_Hud_Shibari_000_modern_C_AdjustSibariList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_AdjustSibariList, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Hud_Shibari_000_modern_C_AdjustSibariList::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_AdjustSibariList, CallFunc_GetSibariplayList_ReturnValue) == 0x000010, "Member 'WBP_Hud_Shibari_000_modern_C_AdjustSibariList::CallFunc_GetSibariplayList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Shibari_000_modern_C_AdjustSibariList, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Hud_Shibari_000_modern_C_AdjustSibariList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

}

