#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_203

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_Syousai_203.WBP_Menu_Dougu_Syousai_203_C
// 0x0128 (0x0498 - 0x0370)
class UWBP_Menu_Dougu_Syousai_203_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           CharactorListPanel;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_0;               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_1;               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_2;               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_3;               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_4;               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_5;               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_6;               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_203_Icon_C*     WBP_Menu_Dougu_Syousai_203_Icon_C_7;               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Name1Position;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name2Position;                                     // 0x03E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name3Position;                                     // 0x03F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name4Position;                                     // 0x0408(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name5Position;                                     // 0x0418(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name6Position;                                     // 0x0428(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name7Position;                                     // 0x0438(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      Name8Position;                                     // 0x0448(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FVector2D>                      PositionList;                                      // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<EJackCharacter>                        CharacterList;                                     // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UJackUMGWidgetBase*>             CharactorWidgetList;                               // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UJackUMGWidgetBase*                     Syousai203IconRef;                                 // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CharaType;                                         // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203(int32 EntryPoint);
	void Construct();
	void DispItemFromSyousaiRef(class UJackUMGItemSyousai* InItemSyousaiRef);
	void JackOnWidgetNotificationDelegate_Event_0(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_Syousai_203_C">();
	}
	static class UWBP_Menu_Dougu_Syousai_203_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_Syousai_203_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_Syousai_203_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_Syousai_203_C");
static_assert(sizeof(UWBP_Menu_Dougu_Syousai_203_C) == 0x000498, "Wrong size on UWBP_Menu_Dougu_Syousai_203_C");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Dougu_Syousai_203_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, CharactorListPanel) == 0x000378, "Member 'UWBP_Menu_Dougu_Syousai_203_C::CharactorListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, InvalidationBox_0) == 0x000380, "Member 'UWBP_Menu_Dougu_Syousai_203_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, RootPanel) == 0x000388, "Member 'UWBP_Menu_Dougu_Syousai_203_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_0) == 0x000390, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_1) == 0x000398, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_2) == 0x0003A0, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_3) == 0x0003A8, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_4) == 0x0003B0, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_5) == 0x0003B8, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_6) == 0x0003C0, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, WBP_Menu_Dougu_Syousai_203_Icon_C_7) == 0x0003C8, "Member 'UWBP_Menu_Dougu_Syousai_203_C::WBP_Menu_Dougu_Syousai_203_Icon_C_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, ItemSyousaiRef) == 0x0003D0, "Member 'UWBP_Menu_Dougu_Syousai_203_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name1Position) == 0x0003D8, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name1Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name2Position) == 0x0003E8, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name2Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name3Position) == 0x0003F8, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name3Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name4Position) == 0x000408, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name4Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name5Position) == 0x000418, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name5Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name6Position) == 0x000428, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name6Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name7Position) == 0x000438, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name7Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Name8Position) == 0x000448, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Name8Position' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, PositionList) == 0x000458, "Member 'UWBP_Menu_Dougu_Syousai_203_C::PositionList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, CharacterList) == 0x000468, "Member 'UWBP_Menu_Dougu_Syousai_203_C::CharacterList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, CharactorWidgetList) == 0x000478, "Member 'UWBP_Menu_Dougu_Syousai_203_C::CharactorWidgetList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, Syousai203IconRef) == 0x000488, "Member 'UWBP_Menu_Dougu_Syousai_203_C::Syousai203IconRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_203_C, CharaType) == 0x000490, "Member 'UWBP_Menu_Dougu_Syousai_203_C::CharaType' has a wrong offset!");

}

