#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Arasuzi_Picture_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Arasuzi_Picture_000.WBP_Menu_Arasuzi_Picture_000_C
// 0x0070 (0x0240 - 0x01D0)
class UWBP_Menu_Arasuzi_Picture_000_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x01E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color;                                             // 0x01F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x01F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClossFadeTargetPicture;                            // 0x0200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Picture;                                           // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackgroundMaterial;                                // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimTimer;                                         // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimFactor;                                        // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SepiaRate;                                         // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClossFadeOpacity;                                  // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNowSepiaAnim;                                     // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNowClossFadeAnim;                                 // 0x0229(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNowAnim;                                          // 0x022A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ClossFadeTargetTexture;                            // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SepiaAnimTimeMax;                                  // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClossFadeAnimTimeMax;                              // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Arasuzi_Picture_000(int32 EntryPoint);
	void SkipAnimation(class UTexture2D* Texture);
	void PlayClossFadeAnim(float ClossFadeAnimTimeMax_0);
	void SetClossFadeTargetTexture(class UTexture2D* Texture);
	void ResetAnim();
	void PlayColorAnim(float SepiaAnimTimeMax_0);
	void SetTexture(class UTexture2D* Texture);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Arasuzi_Picture_000_C">();
	}
	static class UWBP_Menu_Arasuzi_Picture_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Arasuzi_Picture_000_C>();
	}
};
static_assert(alignof(UWBP_Menu_Arasuzi_Picture_000_C) == 0x000008, "Wrong alignment on UWBP_Menu_Arasuzi_Picture_000_C");
static_assert(sizeof(UWBP_Menu_Arasuzi_Picture_000_C) == 0x000240, "Wrong size on UWBP_Menu_Arasuzi_Picture_000_C");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, Default) == 0x0001D8, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, Out) == 0x0001E0, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, In) == 0x0001E8, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, Color) == 0x0001F0, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::Color' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, Base) == 0x0001F8, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, ClossFadeTargetPicture) == 0x000200, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::ClossFadeTargetPicture' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, Picture) == 0x000208, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::Picture' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, BackgroundMaterial) == 0x000210, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::BackgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, AnimTimer) == 0x000218, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::AnimTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, AnimFactor) == 0x00021C, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::AnimFactor' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, SepiaRate) == 0x000220, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::SepiaRate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, ClossFadeOpacity) == 0x000224, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::ClossFadeOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, bNowSepiaAnim) == 0x000228, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::bNowSepiaAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, bNowClossFadeAnim) == 0x000229, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::bNowClossFadeAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, bNowAnim) == 0x00022A, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::bNowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, ClossFadeTargetTexture) == 0x000230, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::ClossFadeTargetTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, SepiaAnimTimeMax) == 0x000238, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::SepiaAnimTimeMax' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Arasuzi_Picture_000_C, ClossFadeAnimTimeMax) == 0x00023C, "Member 'UWBP_Menu_Arasuzi_Picture_000_C::ClossFadeAnimTimeMax' has a wrong offset!");

}

