#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Npc_Icon_000

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Npc_Icon_000.WBP_Hud_Npc_Icon_000_C.ExecuteUbergraph_WBP_Hud_Npc_Icon_000
// 0x0028 (0x0028 - 0x0000)
struct WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGFukidasiIconData*               K2Node_CustomEvent_Data;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000) == 0x000008, "Wrong alignment on WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000");
static_assert(sizeof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000) == 0x000028, "Wrong size on WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000, EntryPoint) == 0x000000, "Member 'WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000004, "Member 'WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000, K2Node_CustomEvent_Data) == 0x000008, "Member 'WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000014, "Member 'WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Hud_Npc_Icon_000_C_ExecuteUbergraph_WBP_Hud_Npc_Icon_000::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Hud_Npc_Icon_000.WBP_Hud_Npc_Icon_000_C.UpdateData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Npc_Icon_000_C_UpdateData final
{
public:
	class UJackUMGFukidasiIconData*               Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Npc_Icon_000_C_UpdateData) == 0x000008, "Wrong alignment on WBP_Hud_Npc_Icon_000_C_UpdateData");
static_assert(sizeof(WBP_Hud_Npc_Icon_000_C_UpdateData) == 0x000008, "Wrong size on WBP_Hud_Npc_Icon_000_C_UpdateData");
static_assert(offsetof(WBP_Hud_Npc_Icon_000_C_UpdateData, Data) == 0x000000, "Member 'WBP_Hud_Npc_Icon_000_C_UpdateData::Data' has a wrong offset!");

}

