#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_000_modern
// 0x0178 (0x0178 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Cursor_000_C*        CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_Event_Key;                                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Pressed;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Released;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_Vector2;                        // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUIDisableCamera_Disabled;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0094(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_Vector;                         // 0x00C4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGAnimSet                        K2Node_MakeStruct_JackUMGAnimSet;                  // 0x00D8(0x0038)(NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAnimSet_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue2;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UWBP_Menu_WorldMap_Cursor_000_C*> K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern) == 0x000178, "Wrong size on WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_Event_MyGeometry) == 0x000014, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_CustomEvent_EventTag) == 0x000058, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000068, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_Event_Key) == 0x000070, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_Event_Key' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_Event_Pressed) == 0x000071, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_Event_Pressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_Event_Released) == 0x000072, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_Event_Released' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_CustomEvent_Vector2) == 0x000074, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_CustomEvent_Vector2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_VSize2D_ReturnValue) == 0x00007C, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000080, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000088, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetUIDisableCamera_Disabled) == 0x000090, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetUIDisableCamera_Disabled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000094, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_Event_DeltaTime) == 0x00009C, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_TestsWorldMapState_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_TestsWorldMapState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000A8, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_CustomEvent_Vector) == 0x0000C4, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_CustomEvent_Vector' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_MakeStruct_JackUMGAnimSet) == 0x0000D8, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_MakeStruct_JackUMGAnimSet' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000110, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_SetAnimSet_ReturnValue) == 0x000118, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_SetAnimSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetSoundSet_ReturnValue) == 0x000120, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000128, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000130, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetSoundSet_ReturnValue2) == 0x000138, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetSoundSet_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000140, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetTimeRange_MinTime) == 0x000150, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, CallFunc_GetTimeRange_MaxTime) == 0x000154, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000158, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern, K2Node_MakeArray_Array) == 0x000168, "Member 'WBP_Menu_WorldMap_000_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_000_modern::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.StickEventR
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_StickEventR final
{
public:
	struct FVector2D                              Vector;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_StickEventR) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_StickEventR");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_StickEventR) == 0x000008, "Wrong size on WBP_Menu_WorldMap_000_modern_C_StickEventR");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_StickEventR, Vector) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_StickEventR::Vector' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.UpdateWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_UpdateWidget final
{
public:
	float                                         DeltaTime_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_UpdateWidget) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_UpdateWidget");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_UpdateWidget) == 0x000004, "Wrong size on WBP_Menu_WorldMap_000_modern_C_UpdateWidget");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateWidget, DeltaTime_0) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateWidget::DeltaTime_0' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.StickEventL
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_StickEventL final
{
public:
	struct FVector2D                              Vector;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_StickEventL) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_StickEventL");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_StickEventL) == 0x000008, "Wrong size on WBP_Menu_WorldMap_000_modern_C_StickEventL");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_StickEventL, Vector) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_StickEventL::Vector' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.OnDetailedKeyEvent
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent final
{
public:
	EJackKeys                                     Key;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Released;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent) == 0x000003, "Wrong size on WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent, Key) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent::Key' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent, Pressed) == 0x000001, "Member 'WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent::Pressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent, Released) == 0x000002, "Member 'WBP_Menu_WorldMap_000_modern_C_OnDetailedKeyEvent::Released' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_WorldMap_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_WorldMap_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.Open
// 0x0100 (0x0100 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_Open final
{
public:
	ESlateVisibility                              FloorSelectorVisibility;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetJackPlayerCharacter_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x001C(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSekaitizu_Result;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackUMGMapResourceType>               K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_PushMenu_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Button_001_modern_C* K2Node_DynamicCast_AsWBP_Menu_World_Map_Button_001_Modern; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0064(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RequesterID)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Limits_Float_Max_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RequestFloorInfo_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0088(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMapResourceRequester*           CallFunc_SetRequesterAndUpdateLocationTitle_Requester; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Limits_Float_Min_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x00A4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_TransformToMapView_ReturnValue;           // 0x00B4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_WorldMap_Spacer_000_C*        K2Node_DynamicCast_AsWBP_Menu_World_Map_Spacer_000; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue4;                // 0x00E8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapOrigin_ReturnValue;                 // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_Open) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_Open");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_Open) == 0x000100, "Wrong size on WBP_Menu_WorldMap_000_modern_C_Open");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, FloorSelectorVisibility) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::FloorSelectorVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_GetJackPlayerCharacter_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_GetJackPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00001C, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_HasSekaitizu_Result) == 0x000034, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_HasSekaitizu_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, K2Node_MakeArray_Array) == 0x000040, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_PushMenu_ReturnValue) == 0x000050, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_PushMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, K2Node_DynamicCast_AsWBP_Menu_World_Map_Button_001_Modern) == 0x000058, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::K2Node_DynamicCast_AsWBP_Menu_World_Map_Button_001_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_MakeVector2D_ReturnValue) == 0x000064, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_Limits_Float_Max_ReturnValue) == 0x000080, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_Limits_Float_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_RequestFloorInfo_ReturnValue) == 0x000084, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_RequestFloorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_MakeVector2D_ReturnValue2) == 0x000088, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_SetRequesterAndUpdateLocationTitle_Requester) == 0x000090, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_SetRequesterAndUpdateLocationTitle_Requester' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakVector2D_X) == 0x000098, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakVector2D_Y) == 0x00009C, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_Limits_Float_Min_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_Limits_Float_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_MakeVector2D_ReturnValue3) == 0x0000A4, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakVector2D_X2) == 0x0000AC, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakVector2D_Y2) == 0x0000B0, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_TransformToMapView_ReturnValue) == 0x0000B4, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_TransformToMapView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakVector2D_X3) == 0x0000BC, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_BreakVector2D_Y3) == 0x0000C0, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_BreakVector2D_Y3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_FClamp_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, K2Node_DynamicCast_AsWBP_Menu_World_Map_Spacer_000) == 0x0000D8, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::K2Node_DynamicCast_AsWBP_Menu_World_Map_Spacer_000' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, K2Node_DynamicCast_bSuccess2) == 0x0000E0, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_FClamp_ReturnValue2) == 0x0000E4, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_MakeVector2D_ReturnValue4) == 0x0000E8, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_MakeVector2D_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Open, CallFunc_GetMapOrigin_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_WorldMap_000_modern_C_Open::CallFunc_GetMapOrigin_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.Close
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_Close final
{
public:
	class UJackUMGMainMapOverlayWidgetBase*       CallFunc_SetMapTextWidget_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMainMapOverlayWidgetBase*       CallFunc_GetMapTextWidget_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_Close) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_Close");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_Close) == 0x000020, "Wrong size on WBP_Menu_WorldMap_000_modern_C_Close");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Close, CallFunc_SetMapTextWidget_ReturnValue) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_Close::CallFunc_SetMapTextWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Close, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_000_modern_C_Close::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Close, CallFunc_GetMapTextWidget_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_000_modern_C_Close::CallFunc_GetMapTextWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_Close, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_000_modern_C_Close::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.UpdateFloorSpinnerStatus
// 0x0024 (0x0024 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus final
{
public:
	bool                                          CallFunc_IsChangingFloorEnabled_bEnabled;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFloorLevelCount_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExistsFloor_OutFloorKeyIndex;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExistsFloor_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExistsFloor_OutFloorKeyIndex2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExistsFloor_ReturnValue2;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus) == 0x000024, "Wrong size on WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_IsChangingFloorEnabled_bEnabled) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_IsChangingFloorEnabled_bEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_GetFloorLevelCount_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_GetFloorLevelCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_Add_IntInt_ReturnValue2) == 0x00000C, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_ExistsFloor_OutFloorKeyIndex) == 0x000014, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_ExistsFloor_OutFloorKeyIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_ExistsFloor_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_ExistsFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_ExistsFloor_OutFloorKeyIndex2) == 0x00001C, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_ExistsFloor_OutFloorKeyIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus, CallFunc_ExistsFloor_ReturnValue2) == 0x000020, "Member 'WBP_Menu_WorldMap_000_modern_C_UpdateFloorSpinnerStatus::CallFunc_ExistsFloor_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.OpenBoukenGuide
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide final
{
public:
	bool                                          CallFunc_GetBoukenGuideVisible_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide) == 0x000001, "Wrong size on WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide, CallFunc_GetBoukenGuideVisible_ReturnValue) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_OpenBoukenGuide::CallFunc_GetBoukenGuideVisible_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.SetMapBasePaper
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper final
{
public:
	EJackMapFieldType                             CallFunc_GetCurrentMapFieldType_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper) == 0x000002, "Wrong size on WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper, CallFunc_GetCurrentMapFieldType_ReturnValue) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper::CallFunc_GetCurrentMapFieldType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_Menu_WorldMap_000_modern_C_SetMapBasePaper::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.SetLocationName
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_SetLocationName final
{
public:
	class FString                                 LocationName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_SetLocationName) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_SetLocationName");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_SetLocationName) == 0x000028, "Wrong size on WBP_Menu_WorldMap_000_modern_C_SetLocationName");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_SetLocationName, LocationName) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_SetLocationName::LocationName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_SetLocationName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_000_modern_C_SetLocationName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_000_modern.WBP_Menu_WorldMap_000_modern_C.OnKeyChangeFloor
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor final
{
public:
	EJackKeys                                     Key;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NextFloorLevel;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PCMarkerColor;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackUMGMapResourceType>               K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsChangingFloorEnabled_bEnabled;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RequesterID)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_TestsWorldMapState_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RequestFloorInfo_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMapResourceRequester*           CallFunc_SetRequesterAndUpdateLocationTitle_Requester; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExistsFloor_OutFloorKeyIndex;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExistsFloor_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFloorLevelCount_ReturnValue;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor");
static_assert(sizeof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor) == 0x000080, "Wrong size on WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, Key) == 0x000000, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::Key' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, NextFloorLevel) == 0x000004, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::NextFloorLevel' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, PCMarkerColor) == 0x000008, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::PCMarkerColor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, CallFunc_IsChangingFloorEnabled_bEnabled) == 0x000030, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::CallFunc_IsChangingFloorEnabled_bEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, CallFunc_TestsWorldMapState_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::CallFunc_TestsWorldMapState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_WorldMap_000_modern_C_OnKeyChangeFloor::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
