#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_002_Steam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_List_002_Steam.WBP_Menu_Sakusen_List_002_Steam_C
// 0x0038 (0x0438 - 0x0400)
class UWBP_Menu_Sakusen_List_002_Steam_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_484;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_493;                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_List_002_Steam(int32 EntryPoint);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_List_002_Steam_C">();
	}
	static class UWBP_Menu_Sakusen_List_002_Steam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_List_002_Steam_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_List_002_Steam_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_List_002_Steam_C");
static_assert(sizeof(UWBP_Menu_Sakusen_List_002_Steam_C) == 0x000438, "Wrong size on UWBP_Menu_Sakusen_List_002_Steam_C");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, ItemList) == 0x000408, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, WBP_Menu_Parts_000) == 0x000410, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, WBP_Menu_Parts_000_484) == 0x000418, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::WBP_Menu_Parts_000_484' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, WBP_Menu_Parts_000_C_493) == 0x000420, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::WBP_Menu_Parts_000_C_493' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, WindowFrame) == 0x000428, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_Steam_C, WindowLine) == 0x000430, "Member 'UWBP_Menu_Sakusen_List_002_Steam_C::WindowLine' has a wrong offset!");

}

