#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Member_Change_Window_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Member_Change_Window_000_modern.WBP_Menu_Sakusen_Member_Change_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern
// 0x03F8 (0x03F8 - 0x0000)
struct WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemId_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetIrekaeKinsiList_OutKinsiList;          // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0070(0x0048)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetIrekaeKinsiList_OutKinsiList2;         // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x00E0(0x0048)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancelSelected_Canceled;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CancelSelected_Canceled2;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChangedMember_ReturnValue;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChangedMember_ReturnValue2;             // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x01D8(0x0048)()
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue2;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x0238(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0280(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_ChangeCharacterResource_ReturnValue;      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0294(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEndResourceReload_ReturnValue;          // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllDeadAfterMemberChange_ReturnValue;   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMemberNumber_ReturnValue;              // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExecCharactersNumber_ReturnValue;      // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue2;            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue2;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue3;            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue3;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountMember_ReturnValue;                  // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x03A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item3;                          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item4;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array3;                           // 0x03D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array4;                           // 0x03E8(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern) == 0x0003F8, "Wrong size on WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CustomEvent_EventTag) == 0x000018, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CustomEvent_EventName) == 0x000030, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CustomEvent_InItemBase) == 0x000038, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetItemId_ReturnValue) == 0x000040, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetDataIndex_ReturnValue) == 0x000048, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x00004C, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetIrekaeKinsiList_OutKinsiList) == 0x000050, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetIrekaeKinsiList_OutKinsiList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Array_Length_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000070, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetIrekaeKinsiList_OutKinsiList2) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetIrekaeKinsiList_OutKinsiList2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Array_Get_Item2) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000D8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0000E0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000128, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000129, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_SwitchName4_CmpSuccess) == 0x00012A, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x00012B, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_CancelSelected_Canceled) == 0x00012C, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_CancelSelected_Canceled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000130, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_CancelSelected_Canceled2) == 0x000138, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_CancelSelected_Canceled2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x000139, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00013A, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_BooleanAND_ReturnValue) == 0x00013B, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000140, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000150, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_int_Array_Index_Variable) == 0x000160, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000168, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsChangedMember_ReturnValue) == 0x000170, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsChangedMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsChangedMember_ReturnValue2) == 0x000171, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsChangedMember_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_struct_Variable) == 0x000178, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000188, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000190, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x0001A0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetBattleManager_ReturnValue) == 0x0001A8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsInBattle_ReturnValue) == 0x0001B0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x0001B8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0001C8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x0001D0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x0001D8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetJackCharacterFromType_ReturnValue2) == 0x000220, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetJackCharacterFromType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_MakeArray_Array) == 0x000228, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2) == 0x000238, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_MakeArray_Array2) == 0x000280, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_ChangeCharacterResource_ReturnValue) == 0x000290, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_ChangeCharacterResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_Event_MyGeometry) == 0x000294, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_Event_InDeltaTime) == 0x0002D0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsEndResourceReload_ReturnValue) == 0x0002D4, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsEndResourceReload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0002D8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_int_Loop_Counter_Variable) == 0x0002E8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0002EC, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x0002F0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0002F8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsAllDeadAfterMemberChange_ReturnValue) == 0x000300, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsAllDeadAfterMemberChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000308, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetSoundSet_ReturnValue) == 0x000310, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetMemberNumber_ReturnValue) == 0x000318, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetMemberNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x00031C, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_int_Loop_Counter_Variable2) == 0x000320, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000328, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetExecCharactersNumber_ReturnValue) == 0x000330, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetExecCharactersNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000334, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x000338, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_byte_Variable) == 0x00033C, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetBattleManager_ReturnValue2) == 0x000340, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetBattleManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsInBattle_ReturnValue2) == 0x000348, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsInBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CustomEvent_InKeyType) == 0x000349, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_CustomEvent_bIsPressed) == 0x00034A, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00034B, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetBattleManager_ReturnValue3) == 0x000350, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetBattleManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000358, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_IsInBattle_ReturnValue3) == 0x000360, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_IsInBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x000368, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000370, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_CountMember_ReturnValue) == 0x000378, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_CountMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000380, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000388, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000390, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000398, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_int_Array_Index_Variable2) == 0x0003A0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_byte_Variable2) == 0x0003A4, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_bool_Variable) == 0x0003A5, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, K2Node_Select_Default) == 0x0003A6, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_byte_Variable3) == 0x0003A7, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_byte_Variable4) == 0x0003A8, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, Temp_bool_Variable2) == 0x0003A9, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern, CallFunc_Array_Get_Item3) == 0x0003B0, "Member 'WBP_Menu_Sakusen_Member_Change_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Member_Change_Window_000_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
