#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.ExecuteUbergraph_WBP_Menu_Title_000_modern
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_PairingProfile_003_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Pairing_Profile_003_Modern; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackMusicManager*                      CallFunc_GetMusicManager_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable;                              // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable2;                             // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item2;                          // 0x0098(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue2;                     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackMusicManager*                      CallFunc_GetMusicManager_ReturnValue2;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsWaitingNewBGM_ReturnValue;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SpecificLevelRemoteEvent_ReturnValue;     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackStoreManager*                      CallFunc_GetStoreManager_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrial_ReturnValue2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenDuoAppStore_ReturnValue;              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsTitleFadeColorWhite_ReturnValue;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetFadeColor_ReturnValue;                 // 0x011C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeWhite_WhiteFade;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0138(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTitleFadeColorWhite_ReturnValue2;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIPlatformType                           CallFunc_GetUIPlatformType_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_PairingProfile_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Pairing_Profile_000_Modern; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGWidgetFromName_ReturnValue;          // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern) == 0x0001D0, "Wrong size on WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000010, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_DynamicCast_AsWBP_Menu_Pairing_Profile_003_Modern) == 0x000018, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_DynamicCast_AsWBP_Menu_Pairing_Profile_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_OpenMenu_ReturnValue) == 0x000038, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000058, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetMusicManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetMusicManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_CustomEvent_InKeyType) == 0x000068, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_CustomEvent_bIsPressed) == 0x000069, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00006A, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, Temp_struct_Variable) == 0x000070, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, Temp_struct_Variable2) == 0x000080, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_Array_Get_Item2) == 0x000098, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_StopBGM_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_StopBGM_ReturnValue2) == 0x0000A1, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_StopBGM_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetMusicManager_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetMusicManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsWaitingNewBGM_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsWaitingNewBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x0000D8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_SpecificLevelRemoteEvent_ReturnValue) == 0x0000D9, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_SpecificLevelRemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x0000DA, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsTrial_ReturnValue) == 0x0000DB, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000E0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetStoreManager_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetStoreManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsTrial_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsTrial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_OpenDuoAppStore_ReturnValue) == 0x0000F9, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_OpenDuoAppStore_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000100, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000108, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsTitleFadeColorWhite_ReturnValue) == 0x000118, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsTitleFadeColorWhite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetFadeColor_ReturnValue) == 0x00011C, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetFadeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsFadeWhite_WhiteFade) == 0x00012C, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsFadeWhite_WhiteFade' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000130, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_Event_MyGeometry) == 0x000138, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_Event_InDeltaTime) == 0x000174, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000178, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsTitleFadeColorWhite_ReturnValue2) == 0x000180, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsTitleFadeColorWhite_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x000188, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x000190, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUIPlatformType_ReturnValue) == 0x000198, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUIPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue10) == 0x0001A0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0001A8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x0001B0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_GetUMGManager_ReturnValue11) == 0x0001B8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_GetUMGManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_DynamicCast_AsWBP_Menu_Pairing_Profile_000_Modern) == 0x0001C0, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_DynamicCast_AsWBP_Menu_Pairing_Profile_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, K2Node_DynamicCast_bSuccess2) == 0x0001C8, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern, CallFunc_IsUMGWidgetFromName_ReturnValue) == 0x0001C9, "Member 'WBP_Menu_Title_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_000_modern::CallFunc_IsUMGWidgetFromName_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Title_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Title_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Title_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Title_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Title_000_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Title_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Title_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Title_000_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.SetTitleBg
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Title_000_modern_C_SetTitleBg final
{
public:
	int32                                         TitleIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClearedScenario_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearedScenario_ReturnValue2;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearedScenario_ReturnValue3;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearedScenario_ReturnValue4;           // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearedScenario_ReturnValue5;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearedScenario_ReturnValue6;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClearedScenario_ReturnValue7;           // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue8;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue9;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_SetTitleBg) == 0x000008, "Wrong alignment on WBP_Menu_Title_000_modern_C_SetTitleBg");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_SetTitleBg) == 0x000078, "Wrong size on WBP_Menu_Title_000_modern_C_SetTitleBg");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, TitleIndex) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::TitleIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000014, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000018, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue) == 0x000020, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue2) == 0x000021, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue3) == 0x000022, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue4) == 0x000023, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue5) == 0x000024, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue6) == 0x000025, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_IsClearedScenario_ReturnValue7) == 0x000026, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_IsClearedScenario_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000028, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000040, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000048, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000050, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x000058, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue8) == 0x000060, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_AddUMGMenuWidget_ReturnValue9) == 0x000068, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_AddUMGMenuWidget_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SetTitleBg, CallFunc_GetUMGManager_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Title_000_modern_C_SetTitleBg::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.SelectMode
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Title_000_modern_C_SelectMode final
{
public:
	bool                                          IsUp;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Title_Push_000_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Title_Push_000_Modern; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_SelectMode) == 0x000008, "Wrong alignment on WBP_Menu_Title_000_modern_C_SelectMode");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_SelectMode) == 0x000038, "Wrong size on WBP_Menu_Title_000_modern_C_SelectMode");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, IsUp) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::IsUp' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, Temp_bool_Variable) == 0x000001, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, Temp_int_Variable2) == 0x000008, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, K2Node_Select_Default) == 0x000018, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000020, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, K2Node_DynamicCast_AsWBP_Menu_Title_Push_000_Modern) == 0x000028, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::K2Node_DynamicCast_AsWBP_Menu_Title_Push_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_SelectMode, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Title_000_modern_C_SelectMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Title_000_modern.WBP_Menu_Title_000_modern_C.IsFadeWhite
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Title_000_modern_C_IsFadeWhite final
{
public:
	bool                                          WhiteFade;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCameraFadeZLayer                         CallFunc_GetCameraFadeInfo_OutFadeLayer;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetCameraFadeInfo_OutFadeColor;           // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCameraFadeInfo_OutFadeAlpha;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCameraFadeInfo_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue3;     // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue4;     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Title_000_modern_C_IsFadeWhite) == 0x000004, "Wrong alignment on WBP_Menu_Title_000_modern_C_IsFadeWhite");
static_assert(sizeof(WBP_Menu_Title_000_modern_C_IsFadeWhite) == 0x000020, "Wrong size on WBP_Menu_Title_000_modern_C_IsFadeWhite");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_IsFadeWhite, WhiteFade) == 0x000000, "Member 'WBP_Menu_Title_000_modern_C_IsFadeWhite::WhiteFade' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_IsFadeWhite, CallFunc_GetCameraFadeInfo_OutFadeLayer) == 0x000001, "Member 'WBP_Menu_Title_000_modern_C_IsFadeWhite::CallFunc_GetCameraFadeInfo_OutFadeLayer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_000_modern_C_IsFadeWhite, CallFunc_GetCameraFadeInfo_OutFadeColor) == 0x000004, "Member 'WBP_Menu_Title_000_modern_C_IsFadeWhite::CallFunc_GetCameraFadeInfo_OutFadeColor' has a wrong offset!");
