#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tuyosa_List_001_modern.WBP_Menu_Tuyosa_List_001_modern_C.PageControllKeyEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature final
{
public:
	bool                                          bIsRemove;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsRight;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNextPage;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPrevPage;                                         // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bIsRemove) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bIsRemove' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bIsRight) == 0x000001, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bIsRight' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bNextPage) == 0x000002, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bNextPage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bPrevPage) == 0x000003, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bPrevPage' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_001_modern.WBP_Menu_Tuyosa_List_001_modern_C.ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern
// 0x05F0 (0x05F0 - 0x0000)
struct WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable13;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable14;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTuyosaPage                               Temp_byte_Variable15;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable6;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable7;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTuyosaPage                               Temp_byte_Variable16;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable9;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable17;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable18;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable10;                              // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGWindowCursorMoveMode                  Temp_byte_Variable19;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGWindowCursorMoveMode                  Temp_byte_Variable20;                              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable11;                              // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable21;                              // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable22;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable12;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable23;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable24;                              // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable13;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable25;                              // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable26;                              // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable27;                              // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable28;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable14;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable29;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable30;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable31;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable15;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B8(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable32;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMemberDataInTuyosa*     K2Node_CustomEvent_TuyosaData;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackTuyosaPage                               K2Node_CustomEvent_PageType;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PageIndex;                      // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PageMoveInput;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CursorVerticalPos;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetActionItemListAtPageIndex_DisplayItemList; // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetActionItemListAtPageIndex_PageTitleSub; // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActionItemListAtPageIndex_UsedSkillPoint; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActionItemListAtPageIndex_VerticalItemCount; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select6_Default;                            // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select7_Default;                            // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select8_Default;                            // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select9_Default;                            // 0x01B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select10_Default;                           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select11_Default;                           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_Event_InSelectedItem;                       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MoveDirection;                        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGItemData*                       K2Node_CustomEvent_Target;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemContainer_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x01E0(0x0050)()
	bool                                          CallFunc_HasItemContainer_ReturnValue2;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGTuyosaRenkeiData*               K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data;   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select12_Default;                           // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue2;            // 0x0248(0x0050)()
	bool                                          CallFunc_HasItemContainer_ReturnValue3;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue3;            // 0x02A0(0x0050)()
	bool                                          CallFunc_HasItemContainer_ReturnValue4;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue4;            // 0x02F8(0x0050)()
	ESlateVisibility                              K2Node_Select13_Default;                           // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0368(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select14_Default;                           // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasItemContainer_ReturnValue5;            // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue5;            // 0x0388(0x0050)()
	bool                                          CallFunc_HasItemContainer_ReturnValue6;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue6;            // 0x03F0(0x0050)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable33;                              // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable34;                              // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable16;                              // 0x0443(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select15_Default;                           // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0450(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable35;                              // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0464(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x046C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable17;                              // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select16_Default;                           // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x048C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue3;            // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGWindowCursorMoveMode                  K2Node_Select17_Default;                           // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable36;                              // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue4;         // 0x04A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_TextHyphenationForTextBlock_OutLineTextArray; // 0x04B0(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x04D0(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue4;           // 0x04F8(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue3;                     // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue5;           // 0x0520(0x0018)()
	ESlateVisibility                              Temp_byte_Variable37;                              // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_TextHyphenationForTextBlock_OutLineTextArray2; // 0x0540(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue2;             // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable18;                              // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue6;           // 0x0568(0x0018)()
	ESlateVisibility                              K2Node_Select18_Default;                           // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOneLine_Result;                         // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583[0x5];                                      // 0x0583(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue4;            // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue2;                     // 0x0590(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select19_Default;                           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X2;                         // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRootPanelSizeX_Result;                 // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable38;                              // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue4;                // 0x05AC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable39;                              // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable19;                              // 0x05B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable40;                              // 0x05B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select20_Default;                           // 0x05B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackHUD*                               CallFunc_GetHUD_ReturnValue;                       // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnterButtonReverse_ReturnValue;         // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CD[0x3];                                      // 0x05CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable41;                              // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable20;                              // 0x05D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select21_Default;                           // 0x05D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x05D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable42;                              // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select22_Default;                           // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DB[0x5];                                      // 0x05DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array;                            // 0x05E0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern");
static_assert(sizeof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern) == 0x0005F0, "Wrong size on WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable2) == 0x000005, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable) == 0x000006, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable2) == 0x000007, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable3) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable3) == 0x000009, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable4) == 0x00000A, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable4) == 0x00000B, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable5) == 0x00000C, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable6) == 0x00000D, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable5) == 0x00000E, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable7) == 0x00000F, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, K2Node_Select_Default) == 0x000010, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable8) == 0x000011, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable6) == 0x000012, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable9) == 0x000013, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable10) == 0x000014, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable7) == 0x000038, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable11) == 0x000039, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable12) == 0x00003A, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable8) == 0x00003B, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable13) == 0x000050, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable14) == 0x000051, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable15) == 0x000052, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable) == 0x000058, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable2) == 0x000060, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable3) == 0x000068, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable4) == 0x000070, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable5) == 0x000078, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable6) == 0x000080, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_name_Variable7) == 0x000088, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_name_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable16) == 0x000090, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_int_Variable) == 0x000094, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_int_Variable2) == 0x000098, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_int_Variable3) == 0x00009C, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable9) == 0x0000A0, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable17) == 0x0000A1, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable18) == 0x0000A2, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable10) == 0x0000A3, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable19) == 0x0000A4, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable20) == 0x0000A5, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable20' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable11) == 0x0000A6, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable21) == 0x0000A7, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable21' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable22) == 0x0000A8, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable22' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable12) == 0x0000A9, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable23) == 0x0000AA, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable23' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable24) == 0x0000AB, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable24' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable13) == 0x0000AC, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable25) == 0x0000AD, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable25' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable26) == 0x0000AE, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable26' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable27) == 0x0000AF, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable27' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable28) == 0x0000B0, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable28' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable14) == 0x0000B1, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable29) == 0x0000B2, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable29' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable30) == 0x0000B3, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable30' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_byte_Variable31) == 0x0000B4, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_byte_Variable31' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, Temp_bool_Variable15) == 0x0000B5, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::Temp_bool_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern, K2Node_Select2_Default) == 0x0000B6, "Member 'WBP_Menu_Tuyosa_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_001_modern::K2Node_Select2_Default' has a wrong offset!");
