#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_080_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_080_modern.WBP_Menu_Parts_080_modern_C.ExecuteUbergraph_WBP_Menu_Parts_080_modern
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UImage*>                         K2Node_MakeArray_Array2;                           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UImage*>                         K2Node_MakeArray_Array3;                           // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PlayMEFromMEID_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern");
static_assert(sizeof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern) == 0x000040, "Wrong size on WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern");
static_assert(offsetof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern, K2Node_MakeArray_Array2) == 0x000018, "Member 'WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern, K2Node_MakeArray_Array3) == 0x000028, "Member 'WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern, CallFunc_PlayMEFromMEID_ReturnValue) == 0x000038, "Member 'WBP_Menu_Parts_080_modern_C_ExecuteUbergraph_WBP_Menu_Parts_080_modern::CallFunc_PlayMEFromMEID_ReturnValue' has a wrong offset!");

}

