#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Settei_000_Steam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Namae_Settei_000_Steam.WBP_Menu_Namae_Settei_000_Steam_C
// 0x0058 (0x0488 - 0x0430)
class UWBP_Menu_Namae_Settei_000_Steam_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_121;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_123;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_125;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_178;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern_C_0;                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     SnapSave;                                          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Namae_Settei_000_Steam(int32 EntryPoint);
	void KetteiSettei(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void Construct();
	void SetInfoText(class FName Selection);
	void AddSnap();
	void RemoveSnap();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Namae_Settei_000_Steam_C">();
	}
	static class UWBP_Menu_Namae_Settei_000_Steam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Namae_Settei_000_Steam_C>();
	}
};
static_assert(alignof(UWBP_Menu_Namae_Settei_000_Steam_C) == 0x000008, "Wrong alignment on UWBP_Menu_Namae_Settei_000_Steam_C");
static_assert(sizeof(UWBP_Menu_Namae_Settei_000_Steam_C) == 0x000488, "Wrong size on UWBP_Menu_Namae_Settei_000_Steam_C");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, ItemList) == 0x000438, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WBP_Menu_Parts_000_C_114) == 0x000440, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WBP_Menu_Parts_000_C_121) == 0x000448, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WBP_Menu_Parts_000_C_121' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WBP_Menu_Parts_000_C_123) == 0x000450, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WBP_Menu_Parts_000_C_123' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WBP_Menu_Parts_000_C_125) == 0x000458, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WBP_Menu_Parts_000_C_125' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WBP_Menu_Parts_000_C_178) == 0x000460, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WBP_Menu_Parts_000_C_178' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WBP_Menu_Parts_000_modern_C_0) == 0x000468, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WBP_Menu_Parts_000_modern_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WindowFrame) == 0x000470, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, WindowLine) == 0x000478, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::WindowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Settei_000_Steam_C, SnapSave) == 0x000480, "Member 'UWBP_Menu_Namae_Settei_000_Steam_C::SnapSave' has a wrong offset!");

}

