#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Location_Message_001_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Location_Message_001_modern.WBP_Hud_Location_Message_001_modern_C.ExecuteUbergraph_WBP_Hud_Location_Message_001_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetMapVolumeID_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern) == 0x000008, "Wrong alignment on WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern");
static_assert(sizeof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern) == 0x000048, "Wrong size on WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, CallFunc_GetEndTime_ReturnValue2) == 0x000008, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::CallFunc_GetEndTime_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, K2Node_CustomEvent_EventTag) == 0x000010, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000030, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern, CallFunc_GetMapVolumeID_ReturnValue) == 0x000040, "Member 'WBP_Hud_Location_Message_001_modern_C_ExecuteUbergraph_WBP_Hud_Location_Message_001_modern::CallFunc_GetMapVolumeID_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Location_Message_001_modern.WBP_Hud_Location_Message_001_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Hud_Location_Message_001_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Location_Message_001_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Hud_Location_Message_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Hud_Location_Message_001_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Hud_Location_Message_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Hud_Location_Message_001_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Hud_Location_Message_001_modern.WBP_Hud_Location_Message_001_modern_C.SetLocationTitle
// 0x0070 (0x0070 - 0x0000)
struct WBP_Hud_Location_Message_001_modern_C_SetLocationTitle final
{
public:
	class FName                                   InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMiddleLocationTitle_ReturnValue;       // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
};
static_assert(alignof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle) == 0x000008, "Wrong alignment on WBP_Hud_Location_Message_001_modern_C_SetLocationTitle");
static_assert(sizeof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle) == 0x000070, "Wrong size on WBP_Hud_Location_Message_001_modern_C_SetLocationTitle");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, InputPin) == 0x000000, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::InputPin' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, Temp_text_Variable) == 0x000008, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, Temp_bool_Variable) == 0x000021, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, CallFunc_GetAccessorCommon_ReturnValue) == 0x000028, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, CallFunc_GetMiddleLocationTitle_ReturnValue) == 0x000030, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::CallFunc_GetMiddleLocationTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_SetLocationTitle, K2Node_Select_Default) == 0x000058, "Member 'WBP_Hud_Location_Message_001_modern_C_SetLocationTitle::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Hud_Location_Message_001_modern.WBP_Hud_Location_Message_001_modern_C.NotifySmallLocationTitle
// 0x0030 (0x0030 - 0x0000)
struct WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle final
{
public:
	bool                                          bIsOpenLocationTitle;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle) == 0x000008, "Wrong alignment on WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle");
static_assert(sizeof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle) == 0x000030, "Wrong size on WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, bIsOpenLocationTitle) == 0x000000, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::bIsOpenLocationTitle' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, Temp_bool_Variable) == 0x000001, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, Temp_name_Variable) == 0x000008, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, Temp_name_Variable2) == 0x000010, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000020, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle, K2Node_Select_Default) == 0x000028, "Member 'WBP_Hud_Location_Message_001_modern_C_NotifySmallLocationTitle::K2Node_Select_Default' has a wrong offset!");

}

