#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_009_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C
// 0x00F0 (0x04F0 - 0x0400)
class UWBP_Menu_Battle_List_009_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1465;                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_380;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_381;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_383;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_386;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           WBP_Menu_Parts_001_C_390;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_56;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJackUMGItemData*                       SoubiStatusRef;                                    // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoubiList*                      SoubiListRef;                                      // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousiRef;                                     // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_003_modern_C*  CommonSetumeWindowRef;                             // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Status_000_modern_C*    DouguStatusWindowRef;                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CasterCharType;                                    // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          SelectRegionType;                                  // 0x0499(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x6];                                      // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Battle_List_010_modern_C*     BattleList010Ref;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGItemListInfo>           ItemSyousaiList;                                   // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsBouguSibari;                                     // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectIndex;                                       // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectRegionIndex;                                 // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               ItemList;                                          // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         DisableStartTime;                                  // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinWaitTime;                                       // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   DouguSyousai100Ref;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_009_modern(int32 EntryPoint);
	void ItemindexNotification_Event_0(int32 OutItemIndex);
	void ChangedItemIndex();
	void WidgetOpenEvent();
	void CustomEvent_0(EJackKeys InKeyType, bool bIsPressed);
	void JackOnWidgetNotificationDelegate_Event_0(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void ItemListControlEvent(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void UpdateRegionList();
	void AddSoubiDataList(const struct FJackUMGSoubiData& JackUMGSoubiData);
	void OpenSetumeiWindow();
	void CloseSetumeiWindow();
	void GetSelectedRegionitemInfo(int32 SelectedRegionIndex);
	void DisableMenu(bool bIsDisable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_009_modern_C">();
	}
	static class UWBP_Menu_Battle_List_009_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_009_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_009_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_009_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_009_modern_C) == 0x0004F0, "Wrong size on UWBP_Menu_Battle_List_009_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Battle_List_009_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Battle_List_009_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, ItemListPanel) == 0x000410, "Member 'UWBP_Menu_Battle_List_009_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, RootPanel) == 0x000418, "Member 'UWBP_Menu_Battle_List_009_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_000_C_1465) == 0x000420, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_000_C_1465' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_001) == 0x000428, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_001_C_380) == 0x000430, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_001_C_380' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_001_C_381) == 0x000438, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_001_C_381' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_001_C_383) == 0x000440, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_001_C_383' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_001_C_386) == 0x000448, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_001_C_386' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_001_C_390) == 0x000450, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_001_C_390' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WBP_Menu_Parts_008_56) == 0x000458, "Member 'UWBP_Menu_Battle_List_009_modern_C::WBP_Menu_Parts_008_56' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WindowFrame) == 0x000460, "Member 'UWBP_Menu_Battle_List_009_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, WindowLine) == 0x000468, "Member 'UWBP_Menu_Battle_List_009_modern_C::WindowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, SoubiStatusRef) == 0x000470, "Member 'UWBP_Menu_Battle_List_009_modern_C::SoubiStatusRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, SoubiListRef) == 0x000478, "Member 'UWBP_Menu_Battle_List_009_modern_C::SoubiListRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, ItemSyousiRef) == 0x000480, "Member 'UWBP_Menu_Battle_List_009_modern_C::ItemSyousiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, CommonSetumeWindowRef) == 0x000488, "Member 'UWBP_Menu_Battle_List_009_modern_C::CommonSetumeWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, DouguStatusWindowRef) == 0x000490, "Member 'UWBP_Menu_Battle_List_009_modern_C::DouguStatusWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, CasterCharType) == 0x000498, "Member 'UWBP_Menu_Battle_List_009_modern_C::CasterCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, SelectRegionType) == 0x000499, "Member 'UWBP_Menu_Battle_List_009_modern_C::SelectRegionType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, BattleList010Ref) == 0x0004A0, "Member 'UWBP_Menu_Battle_List_009_modern_C::BattleList010Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, ItemSyousaiList) == 0x0004A8, "Member 'UWBP_Menu_Battle_List_009_modern_C::ItemSyousaiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, IsBouguSibari) == 0x0004B8, "Member 'UWBP_Menu_Battle_List_009_modern_C::IsBouguSibari' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, SelectIndex) == 0x0004BC, "Member 'UWBP_Menu_Battle_List_009_modern_C::SelectIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, SelectRegionIndex) == 0x0004C0, "Member 'UWBP_Menu_Battle_List_009_modern_C::SelectRegionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, ItemList) == 0x0004C8, "Member 'UWBP_Menu_Battle_List_009_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, DisableStartTime) == 0x0004D8, "Member 'UWBP_Menu_Battle_List_009_modern_C::DisableStartTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, DelayTime) == 0x0004DC, "Member 'UWBP_Menu_Battle_List_009_modern_C::DelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, MinWaitTime) == 0x0004E0, "Member 'UWBP_Menu_Battle_List_009_modern_C::MinWaitTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_009_modern_C, DouguSyousai100Ref) == 0x0004E8, "Member 'UWBP_Menu_Battle_List_009_modern_C::DouguSyousai100Ref' has a wrong offset!");

}

