#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_006_modern

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_List_006_modern.WBP_Menu_Shop_List_006_modern_C.ExecuteUbergraph_WBP_Menu_Shop_List_006_modern
// 0x0098 (0x0098 - 0x0000)
struct WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0004(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_031_modern_C*           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x005C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetMemberListInKyoukai_ReturnValue;       // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern");
static_assert(sizeof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern) == 0x000098, "Wrong size on WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, K2Node_MakeStruct_Anchors) == 0x000004, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_GetChildrenCount_ReturnValue) == 0x000030, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000048, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000054, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_MakeVector2D_ReturnValue) == 0x00005C, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000068, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_GetMemberListInKyoukai_ReturnValue) == 0x000070, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_GetMemberListInKyoukai_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000084, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Array_Length_ReturnValue2) == 0x000090, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'WBP_Menu_Shop_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_006_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

