#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shortcut_List_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Shortcut_List_000_modern.WBP_Menu_Shortcut_List_000_modern_C
// 0x00F8 (0x0528 - 0x0430)
class UWBP_Menu_Shortcut_List_000_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemList;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_01;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_02;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_03;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_04;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_05;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_06;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_07;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_001_modern_C*           Parts000_08;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   UseItemId;                                         // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               ValidData;                                         // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UJackUMGItemData*>               InvalidData;                                       // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   ExistItemId;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId_FusigiKazi;                                 // 0x04D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId_Baumuren;                                   // 0x04D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId_Uma;                                        // 0x04E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId_Ketos;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId_JyounoAi;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MenuParts;                                         // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CaptionTextId;                                     // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ErrMsgId;                                          // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_001_modern_C*>   ItemPartsArray;                                    // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UTexture2D*                             IconTexture;                                       // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Shortcut_List_000_modern(int32 EntryPoint);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void CustomEvent_0(bool bIsCustomFlow);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void SetShortcutCommandActiveAboutItemId(class FName ItemID, class FName TextID);
	void SetInfoText(class FName Selection);
	void CloseMiniMap();
	void OpenMiniMap();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Shortcut_List_000_modern_C">();
	}
	static class UWBP_Menu_Shortcut_List_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Shortcut_List_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Shortcut_List_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Shortcut_List_000_modern_C");
static_assert(sizeof(UWBP_Menu_Shortcut_List_000_modern_C) == 0x000528, "Wrong size on UWBP_Menu_Shortcut_List_000_modern_C");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemList) == 0x000438, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_01) == 0x000440, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_02) == 0x000448, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_03) == 0x000450, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_04) == 0x000458, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_05) == 0x000460, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_06) == 0x000468, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_07) == 0x000470, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, Parts000_08) == 0x000478, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::Parts000_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, RootPanel) == 0x000480, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, WBP_Menu_Parts_000_C_114) == 0x000488, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, WindowFrame) == 0x000490, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, WindowLine) == 0x000498, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::WindowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, UseItemId) == 0x0004A0, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::UseItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ValidData) == 0x0004A8, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ValidData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, InvalidData) == 0x0004B8, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::InvalidData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ExistItemId) == 0x0004C8, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ExistItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemId_FusigiKazi) == 0x0004D0, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemId_FusigiKazi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemId_Baumuren) == 0x0004D8, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemId_Baumuren' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemId_Uma) == 0x0004E0, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemId_Uma' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemId_Ketos) == 0x0004E8, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemId_Ketos' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemId_JyounoAi) == 0x0004F0, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemId_JyounoAi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, MenuParts) == 0x0004F8, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::MenuParts' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, CaptionTextId) == 0x000500, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::CaptionTextId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ErrMsgId) == 0x000508, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ErrMsgId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, ItemPartsArray) == 0x000510, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::ItemPartsArray' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shortcut_List_000_modern_C, IconTexture) == 0x000520, "Member 'UWBP_Menu_Shortcut_List_000_modern_C::IconTexture' has a wrong offset!");

}

