#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Syuurenjou_RewardInfo_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Syuurenjou_RewardInfo_modern.WBP_Menu_Syuurenjou_RewardInfo_modern_C.ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern
// 0x0110 (0x0110 - 0x0000)
struct WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemIndex;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGSyuurenjouItemData*             K2Node_CustomEvent_Data;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSyuurenjouRewardData*           CallFunc_GetSyuurenjouRewardData_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue; // 0x0048(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGSyuurenjouRewardData*           CallFunc_GetSyuurenjouRewardData_ReturnValue2;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSyuurenjouRewardData*           CallFunc_GetSyuurenjouRewardData_ReturnValue3;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSyuurenjouRewardData*           CallFunc_GetSyuurenjouRewardData_ReturnValue4;     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemIndex2;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern) == 0x000008, "Wrong alignment on WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern");
static_assert(sizeof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern) == 0x000110, "Wrong size on WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_CustomEvent_ItemIndex) == 0x000004, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_CustomEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GetText_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_CustomEvent_Data) == 0x000030, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_Min_ReturnValue) == 0x000038, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GetSyuurenjouRewardData_ReturnValue) == 0x000040, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GetSyuurenjouRewardData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue) == 0x000048, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_MakeArray_Array) == 0x000090, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_ReplaceMessageTag_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_ReplaceMessageTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GetSyuurenjouRewardData_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GetSyuurenjouRewardData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GetSyuurenjouRewardData_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GetSyuurenjouRewardData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_GetSyuurenjouRewardData_ReturnValue4) == 0x0000C8, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_GetSyuurenjouRewardData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, Temp_bool_Variable) == 0x0000D0, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_CustomEvent_ItemIndex2) == 0x0000E8, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_CustomEvent_ItemIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x000108, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ExecuteUbergraph_WBP_Menu_Syuurenjou_RewardInfo_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Syuurenjou_RewardInfo_modern.WBP_Menu_Syuurenjou_RewardInfo_modern_C.PlayCheckInAnim
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim) == 0x000004, "Wrong alignment on WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim");
static_assert(sizeof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim) == 0x000004, "Wrong size on WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim, ItemIndex) == 0x000000, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_PlayCheckInAnim::ItemIndex' has a wrong offset!");

// Function WBP_Menu_Syuurenjou_RewardInfo_modern.WBP_Menu_Syuurenjou_RewardInfo_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData final
{
public:
	class UJackUMGSyuurenjouItemData*             Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData, Data) == 0x000000, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_SetData::Data' has a wrong offset!");

// Function WBP_Menu_Syuurenjou_RewardInfo_modern.WBP_Menu_Syuurenjou_RewardInfo_modern_C.ShowCheck
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck) == 0x000004, "Wrong alignment on WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck");
static_assert(sizeof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck) == 0x000004, "Wrong size on WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck");
static_assert(offsetof(WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck, ItemIndex) == 0x000000, "Member 'WBP_Menu_Syuurenjou_RewardInfo_modern_C_ShowCheck::ItemIndex' has a wrong offset!");

}

