#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_101_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_Syousai_101_modern.WBP_Menu_Dougu_Syousai_101_modern_C
// 0x00E8 (0x0458 - 0x0370)
class UWBP_Menu_Dougu_Syousai_101_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CategoryPanel;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Equipment_000;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Goodness_List;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Goodness_List_Base;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GoodnessPanel;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IM_Category_Icon;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NamePanel;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RankPanel;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RarityPanel;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTextureRef;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecipeTitle;                                     // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NameText;                                          // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CategoryText;                                      // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RarityText;                                        // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RankText;                                          // 0x0418(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EMarkText;                                         // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   DouguSyousai100Ref;                                // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaouNoKenPictorialBookNo;                          // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Dougu_Syousai_101_modern(int32 EntryPoint);
	void Construct();
	void JackOnWidgetNotificationDelegate_Event_0(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void DispItemFromSyousaiRef(class UJackUMGItemSyousai* InItemSyousaiRef);
	void SetRecipeTitle(bool IsRecipeTitle_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_Syousai_101_modern_C">();
	}
	static class UWBP_Menu_Dougu_Syousai_101_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_Syousai_101_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_Syousai_101_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_Syousai_101_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_Syousai_101_modern_C) == 0x000458, "Wrong size on UWBP_Menu_Dougu_Syousai_101_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, CategoryPanel) == 0x000378, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::CategoryPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, Equipment_000) == 0x000380, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::Equipment_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, Goodness_List) == 0x000388, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::Goodness_List' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, Goodness_List_Base) == 0x000390, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::Goodness_List_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, GoodnessPanel) == 0x000398, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::GoodnessPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, IM_Category_Icon) == 0x0003A0, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::IM_Category_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, NamePanel) == 0x0003A8, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::NamePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, RankPanel) == 0x0003B0, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::RankPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, RarityPanel) == 0x0003B8, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::RarityPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, IconTextureRef) == 0x0003C0, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::IconTextureRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, IsRecipeTitle) == 0x0003C8, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::IsRecipeTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, NameText) == 0x0003D0, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, CategoryText) == 0x0003E8, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::CategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, RarityText) == 0x000400, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::RarityText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, RankText) == 0x000418, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::RankText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, EMarkText) == 0x000430, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::EMarkText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, DouguSyousai100Ref) == 0x000448, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::DouguSyousai100Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_101_modern_C, MaouNoKenPictorialBookNo) == 0x000450, "Member 'UWBP_Menu_Dougu_Syousai_101_modern_C::MaouNoKenPictorialBookNo' has a wrong offset!");

}

