#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_010_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_010_modern.WBP_Menu_Battle_List_010_modern_C
// 0x0140 (0x0570 - 0x0430)
class UWBP_Menu_Battle_List_010_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleTextPanel;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_0;                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_1;                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_2;                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_3;                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_4;                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_5;                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_18;                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Battle_Item_010_modern_C*     WBP_Menu_Battle_Item_010_C_19;                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_002_modern_C*           WBP_Menu_Parts_002;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_003_modern_C*  SetumeiWindowRef;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemSortType                          SortType;                                          // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Button_000_modern_C*   CommonButtonWindow;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Status_000_modern_C*    StatusWindowRef;                                   // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnter;                                           // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SaveDataNumber;                                    // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 SelectBagType;                                     // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OnPagerCommonPosition;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OffPagerCommonPosition;                            // 0x04F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CasterCharaType;                                   // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CasterBagType;                                     // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502[0x2];                                      // 0x0502(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CasterItemIndex;                                   // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               EquipmentItemList;                                 // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	EJackEquipmentRegion                          SelectRegionType;                                  // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Common_Setumei_006_modern_C*  CommonSetumeiWindowRef;                            // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGItemListInfo>           ItemSyousaiList;                                   // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsBouguSibari;                                     // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SaveRemoveItemId;                                  // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          ReleaseRegionType;                                 // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReleaseItemId;                                     // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 SaveSelectedBagType;                               // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SaveSelectedItemIndex;                             // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   DouguSyousai100Ref;                                // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumListColumn;                                     // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_010_modern(int32 EntryPoint);
	void ItemindexNotification_Event_0(int32 OutItemIndex);
	void WidgetBPActionDelegate(class FName EventTag);
	void ChangedItemIndex();
	void Construct();
	void CustomEvent_0(EJackKeys InKeyType, bool bIsPressed);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void UpdateBrowserList();
	void RemoveSetumeiAndStatus();
	class FName GetRegionTextId();
	void ReturnToMenuBattleList009();
	void SetupFirstItemList(TArray<class UJackUMGItemData*>& InItemDataList);
	void SaveRemoveItem();
	void SelectedItemIndex(class UJackUMGItemBase* InItemBase);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_010_modern_C">();
	}
	static class UWBP_Menu_Battle_List_010_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_010_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_010_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_010_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_010_modern_C) == 0x000570, "Wrong size on UWBP_Menu_Battle_List_010_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Battle_List_010_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Battle_List_010_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_Battle_List_010_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, RootPanel) == 0x000448, "Member 'UWBP_Menu_Battle_List_010_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, TitleTextPanel) == 0x000450, "Member 'UWBP_Menu_Battle_List_010_modern_C::TitleTextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_0) == 0x000458, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_1) == 0x000460, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_2) == 0x000468, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_3) == 0x000470, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_4) == 0x000478, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_5) == 0x000480, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_18) == 0x000488, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Battle_Item_010_C_19) == 0x000490, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Battle_Item_010_C_19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Parts_002) == 0x000498, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Parts_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WBP_Menu_Parts_008) == 0x0004A0, "Member 'UWBP_Menu_Battle_List_010_modern_C::WBP_Menu_Parts_008' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WindowFrame) == 0x0004A8, "Member 'UWBP_Menu_Battle_List_010_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, WindowLine) == 0x0004B0, "Member 'UWBP_Menu_Battle_List_010_modern_C::WindowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SetumeiWindowRef) == 0x0004B8, "Member 'UWBP_Menu_Battle_List_010_modern_C::SetumeiWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SortType) == 0x0004C0, "Member 'UWBP_Menu_Battle_List_010_modern_C::SortType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, CommonButtonWindow) == 0x0004C8, "Member 'UWBP_Menu_Battle_List_010_modern_C::CommonButtonWindow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, StatusWindowRef) == 0x0004D0, "Member 'UWBP_Menu_Battle_List_010_modern_C::StatusWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, IsEnter) == 0x0004D8, "Member 'UWBP_Menu_Battle_List_010_modern_C::IsEnter' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SaveDataNumber) == 0x0004DC, "Member 'UWBP_Menu_Battle_List_010_modern_C::SaveDataNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SelectBagType) == 0x0004E0, "Member 'UWBP_Menu_Battle_List_010_modern_C::SelectBagType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, ItemSyousaiRef) == 0x0004E8, "Member 'UWBP_Menu_Battle_List_010_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, OnPagerCommonPosition) == 0x0004F0, "Member 'UWBP_Menu_Battle_List_010_modern_C::OnPagerCommonPosition' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, OffPagerCommonPosition) == 0x0004F8, "Member 'UWBP_Menu_Battle_List_010_modern_C::OffPagerCommonPosition' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, CasterCharaType) == 0x000500, "Member 'UWBP_Menu_Battle_List_010_modern_C::CasterCharaType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, CasterBagType) == 0x000501, "Member 'UWBP_Menu_Battle_List_010_modern_C::CasterBagType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, CasterItemIndex) == 0x000504, "Member 'UWBP_Menu_Battle_List_010_modern_C::CasterItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, EquipmentItemList) == 0x000508, "Member 'UWBP_Menu_Battle_List_010_modern_C::EquipmentItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SelectRegionType) == 0x000518, "Member 'UWBP_Menu_Battle_List_010_modern_C::SelectRegionType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, CommonSetumeiWindowRef) == 0x000520, "Member 'UWBP_Menu_Battle_List_010_modern_C::CommonSetumeiWindowRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, ItemSyousaiList) == 0x000528, "Member 'UWBP_Menu_Battle_List_010_modern_C::ItemSyousaiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, IsBouguSibari) == 0x000538, "Member 'UWBP_Menu_Battle_List_010_modern_C::IsBouguSibari' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SaveRemoveItemId) == 0x000540, "Member 'UWBP_Menu_Battle_List_010_modern_C::SaveRemoveItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, ReleaseRegionType) == 0x000548, "Member 'UWBP_Menu_Battle_List_010_modern_C::ReleaseRegionType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, ReleaseItemId) == 0x000550, "Member 'UWBP_Menu_Battle_List_010_modern_C::ReleaseItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SaveSelectedBagType) == 0x000558, "Member 'UWBP_Menu_Battle_List_010_modern_C::SaveSelectedBagType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, SaveSelectedItemIndex) == 0x00055C, "Member 'UWBP_Menu_Battle_List_010_modern_C::SaveSelectedItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, DouguSyousai100Ref) == 0x000560, "Member 'UWBP_Menu_Battle_List_010_modern_C::DouguSyousai100Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_010_modern_C, NumListColumn) == 0x000568, "Member 'UWBP_Menu_Battle_List_010_modern_C::NumListColumn' has a wrong offset!");

}

