#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_006_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_006_modern.WBP_Menu_Sakusen_Settei_006_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern) == 0x000068, "Wrong size on WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_CustomEvent_EventName) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_CustomEvent_InItemBase) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_SwitchName2_CmpSuccess) == 0x000021, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_SwitchName3_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_modern.WBP_Menu_Sakusen_Settei_006_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_modern.WBP_Menu_Sakusen_Settei_006_modern_C.EventOnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_EventOnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_modern.WBP_Menu_Sakusen_Settei_006_modern_C.SetInfoText
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText) == 0x000040, "Wrong size on WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, InName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::InName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, CallFunc_GetSibariManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, CallFunc_GetValue_ReturnValue) == 0x000034, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SetInfoText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_modern.WBP_Menu_Sakusen_Settei_006_modern_C.SelectTextSet
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSibariPlayDisplayFlag_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet) == 0x000020, "Wrong size on WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet, Temp_bool_Variable) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet, Temp_int_Variable2) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet, CallFunc_GetSibariManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet, CallFunc_IsSibariPlayDisplayFlag_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet::CallFunc_IsSibariPlayDisplayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Menu_Sakusen_Settei_006_modern_C_SelectTextSet::K2Node_Select_Default' has a wrong offset!");

}

