#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_ScrollContent_005_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_ScrollContent_005_modern.WBP_Menu_Common_ScrollContent_005_modern_C.ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern
// 0x0058 (0x0058 - 0x0000)
struct WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0040(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern) == 0x000008, "Wrong alignment on WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern");
static_assert(sizeof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern) == 0x000058, "Wrong size on WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern");
static_assert(offsetof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern, CallFunc_GetText_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Common_ScrollContent_005_modern_C_ExecuteUbergraph_WBP_Menu_Common_ScrollContent_005_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");

}

