#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WorldMap_List_001_modern.WBP_Menu_WorldMap_List_001_modern_C
// 0x0088 (0x04B8 - 0x0430)
class UWBP_Menu_WorldMap_List_001_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1175;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_002_modern_C*           WBP_Menu_Parts_002_C_46;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_064_modern_C*           WBP_Menu_Parts_064;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_064_modern_C*           WBP_Menu_Parts_064_C_2;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_064_modern_C*           WBP_Menu_Parts_064_C_3;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_064_modern_C*           WBP_Menu_Parts_064_C_4;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Setumei_001_modern_C* WBP_Menu_WorldMap_Setumei_001;                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TempY;                                             // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BottomMagin;                                       // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_Setumei_001_modern_C*   SetumeiWindow001;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextLabelList;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_WorldMap_List_001_modern(int32 EntryPoint);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void SetParamSetumei(int32 ItemIndex, bool* IsEmpty);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WorldMap_List_001_modern_C">();
	}
	static class UWBP_Menu_WorldMap_List_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WorldMap_List_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_WorldMap_List_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_WorldMap_List_001_modern_C");
static_assert(sizeof(UWBP_Menu_WorldMap_List_001_modern_C) == 0x0004B8, "Wrong size on UWBP_Menu_WorldMap_List_001_modern_C");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, RootPanel) == 0x000448, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_Parts_000_C_1175) == 0x000450, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_Parts_000_C_1175' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_Parts_002_C_46) == 0x000458, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_Parts_002_C_46' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_Parts_064) == 0x000460, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_Parts_064' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_Parts_064_C_2) == 0x000468, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_Parts_064_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_Parts_064_C_3) == 0x000470, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_Parts_064_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_Parts_064_C_4) == 0x000478, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_Parts_064_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WBP_Menu_WorldMap_Setumei_001) == 0x000480, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WBP_Menu_WorldMap_Setumei_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, Window_Line) == 0x000488, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::Window_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, WindowFrame) == 0x000490, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, TempY) == 0x000498, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::TempY' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, BottomMagin) == 0x00049C, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::BottomMagin' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, SetumeiWindow001) == 0x0004A0, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::SetumeiWindow001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_001_modern_C, TextLabelList) == 0x0004A8, "Member 'UWBP_Menu_WorldMap_List_001_modern_C::TextLabelList' has a wrong offset!");

}

