#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Location_Message_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Location_Message_001_modern.WBP_Hud_Location_Message_001_modern_C
// 0x0068 (0x03D8 - 0x0370)
class UWBP_Hud_Location_Message_001_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       InOut;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Shadow;                                       // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5544;                                    // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x03C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Hud_Location_Message_001_modern(int32 EntryPoint);
	void CustomEvent_0(class FName EventTag);
	void Construct();
	void SetLocationTitle(class FName InputPin);
	void NotifySmallLocationTitle(bool bIsOpenLocationTitle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Location_Message_001_modern_C">();
	}
	static class UWBP_Hud_Location_Message_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Location_Message_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Location_Message_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Location_Message_001_modern_C");
static_assert(sizeof(UWBP_Hud_Location_Message_001_modern_C) == 0x0003D8, "Wrong size on UWBP_Hud_Location_Message_001_modern_C");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Location_Message_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, Out) == 0x000378, "Member 'UWBP_Hud_Location_Message_001_modern_C::Out' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, In) == 0x000380, "Member 'UWBP_Hud_Location_Message_001_modern_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, InOut) == 0x000388, "Member 'UWBP_Hud_Location_Message_001_modern_C::InOut' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, BG) == 0x000390, "Member 'UWBP_Hud_Location_Message_001_modern_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, Frame_1) == 0x000398, "Member 'UWBP_Hud_Location_Message_001_modern_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, Frame_2) == 0x0003A0, "Member 'UWBP_Hud_Location_Message_001_modern_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, InvalidationBox_0) == 0x0003A8, "Member 'UWBP_Hud_Location_Message_001_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, Text_Shadow) == 0x0003B0, "Member 'UWBP_Hud_Location_Message_001_modern_C::Text_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, TextBlock_5544) == 0x0003B8, "Member 'UWBP_Hud_Location_Message_001_modern_C::TextBlock_5544' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_001_modern_C, CaptionText) == 0x0003C0, "Member 'UWBP_Hud_Location_Message_001_modern_C::CaptionText' has a wrong offset!");

}

