#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_004_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tuyosa_List_004_modern.WBP_Menu_Tuyosa_List_004_modern_C
// 0x0098 (0x0408 - 0x0370)
class UWBP_Menu_Tuyosa_List_004_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_10;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_11;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_00;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_01;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_02;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_03;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_04;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_05;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_06;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_07;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_08;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_09;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           WBP_Menu_Parts_007;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PageControllKeyEvent;                              // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UJackUMGItemBase*>               ItemList;                                          // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void PageControllKeyEvent__DelegateSignature(bool bIsRemove, bool bNextPage, bool bPrevPage);
	void ExecuteUbergraph_WBP_Menu_Tuyosa_List_004_modern(int32 EntryPoint);
	void SetData(class UJackUMGAccessorMemberDataInTuyosa* TuyosaData, int32 PageMoveInput);
	void WidgetBPActionDelegate(class FName EventTag);
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tuyosa_List_004_modern_C">();
	}
	static class UWBP_Menu_Tuyosa_List_004_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tuyosa_List_004_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tuyosa_List_004_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tuyosa_List_004_modern_C");
static_assert(sizeof(UWBP_Menu_Tuyosa_List_004_modern_C) == 0x000408, "Wrong size on UWBP_Menu_Tuyosa_List_004_modern_C");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, ItemListPanel) == 0x000378, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_10) == 0x000380, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_11) == 0x000388, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_00) == 0x000390, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_01) == 0x000398, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_02) == 0x0003A0, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_03) == 0x0003A8, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_04) == 0x0003B0, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_05) == 0x0003B8, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_06) == 0x0003C0, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_07) == 0x0003C8, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_08) == 0x0003D0, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_000_09) == 0x0003D8, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_000_09' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, WBP_Menu_Parts_007) == 0x0003E0, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::WBP_Menu_Parts_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, PageControllKeyEvent) == 0x0003E8, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::PageControllKeyEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_004_modern_C, ItemList) == 0x0003F8, "Member 'UWBP_Menu_Tuyosa_List_004_modern_C::ItemList' has a wrong offset!");

}

