#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Fukkatu_Input_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Fukkatu_Input_000_modern.WBP_Menu_Namae_Fukkatu_Input_000_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDecodeInfo                        CallFunc_FukkatunojumonDecode_OutDecodeInfo;       // 0x0020(0x0068)()
	TArray<struct FJackScenarioTitleInfo>         CallFunc_FukkatunojumonDecode_OutScenarioTitleInfoList; // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_FukkatunojumonDecode_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable;                              // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_InFukkatuNoJumon;                     // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_Achievement                   K2Node_MakeStruct_JackLDT_Achievement;             // 0x0160(0x0010)(NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackLDT_Achievement                   K2Node_MakeStruct_JackLDT_Achievement2;            // 0x0178(0x0010)(NoDestructor)
	bool                                          CallFunc_IsAcquiredAchievement_ReturnValue;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue2;    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern");
static_assert(sizeof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern) == 0x0001E8, "Wrong size on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetAchievementManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_FukkatunojumonDecode_OutDecodeInfo) == 0x000020, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_FukkatunojumonDecode_OutDecodeInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_FukkatunojumonDecode_OutScenarioTitleInfoList) == 0x000088, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_FukkatunojumonDecode_OutScenarioTitleInfoList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_FukkatunojumonDecode_ReturnValue) == 0x000098, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_FukkatunojumonDecode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CustomEvent_EventTag) == 0x0000A0, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_SwitchName_CmpSuccess) == 0x0000A8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CustomEvent_EventName) == 0x0000B0, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CustomEvent_InItemBase) == 0x0000B8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000C0, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, Temp_struct_Variable) == 0x0000D8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, Temp_struct_Variable2) == 0x0000E8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000100, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000118, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000120, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000128, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000138, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000140, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_Event_InFukkatuNoJumon) == 0x000148, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_Event_InFukkatuNoJumon' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_MakeStruct_JackLDT_Achievement) == 0x000160, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_MakeStruct_JackLDT_Achievement' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_StopBGM_ReturnValue) == 0x000170, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_MakeStruct_JackLDT_Achievement2) == 0x000178, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_MakeStruct_JackLDT_Achievement2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_IsAcquiredAchievement_ReturnValue) == 0x000188, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_IsAcquiredAchievement_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000190, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x0001A0, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0001A8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0001B8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue2) == 0x0001C0, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x0001C8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern, K2Node_CreateDelegate_OutputDelegate6) == 0x0001D8, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Fukkatu_Input_000_modern::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");

// Function WBP_Menu_Namae_Fukkatu_Input_000_modern.WBP_Menu_Namae_Fukkatu_Input_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Fukkatu_Input_000_modern.WBP_Menu_Namae_Fukkatu_Input_000_modern_C.SetCheatFukkatuNoJumon
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon final
{
public:
	class FString                                 InFukkatuNoJumon;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon");
static_assert(sizeof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon) == 0x000010, "Wrong size on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon, InFukkatuNoJumon) == 0x000000, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_SetCheatFukkatuNoJumon::InFukkatuNoJumon' has a wrong offset!");

// Function WBP_Menu_Namae_Fukkatu_Input_000_modern.WBP_Menu_Namae_Fukkatu_Input_000_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Fukkatu_Input_000_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

}

