#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_083_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C
// 0x0070 (0x0440 - 0x03D0)
class UWBP_Menu_Parts_083_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FaceIconPanel;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBGNormalPanel;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OrderNumPanel;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Buff_000_C*             WBP_Menu_Parts_Buff_000;                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NumberText;                                        // 0x0408(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsNumberVisivility;                                // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       ItemDataBase;                                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCharacter;                                      // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NumberImageRef;                                    // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_083_modern(int32 EntryPoint);
	void NotificationItemBase(const class FName& NotifyTag, class UJackUMGItemData* InItemData, class UObject* Object, int32 Value);
	void DrawItemBase(class UJackUMGItemData* InItemData);
	void Construct();
	void SetNumber(int32 InNumber);
	void SetNumberAndCaption(const class FText& CaptionText_0, int32 InValue, ESlateVisibility NumberVisibility);
	void SetVisibilityParts(bool InBuffVisibility, bool InNumberVisibility);
	void SetStatusDeadColor(EJackCharacter InCharType);
	void SetOddEffectType(class FName InOddEffectId);
	void SetStatusRateColor(float HPRate);
	void SetOddEffectId(class FName InOddEffectId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_083_modern_C">();
	}
	static class UWBP_Menu_Parts_083_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_083_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_083_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_083_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_083_modern_C) == 0x000440, "Wrong size on UWBP_Menu_Parts_083_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_083_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, CaptionPanel) == 0x0003D8, "Member 'UWBP_Menu_Parts_083_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, FaceIconPanel) == 0x0003E0, "Member 'UWBP_Menu_Parts_083_modern_C::FaceIconPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, HorizontalBox_0) == 0x0003E8, "Member 'UWBP_Menu_Parts_083_modern_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, ItemBGNormalPanel) == 0x0003F0, "Member 'UWBP_Menu_Parts_083_modern_C::ItemBGNormalPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, OrderNumPanel) == 0x0003F8, "Member 'UWBP_Menu_Parts_083_modern_C::OrderNumPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, WBP_Menu_Parts_Buff_000) == 0x000400, "Member 'UWBP_Menu_Parts_083_modern_C::WBP_Menu_Parts_Buff_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, NumberText) == 0x000408, "Member 'UWBP_Menu_Parts_083_modern_C::NumberText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, IsNumberVisivility) == 0x000420, "Member 'UWBP_Menu_Parts_083_modern_C::IsNumberVisivility' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, ItemDataBase) == 0x000428, "Member 'UWBP_Menu_Parts_083_modern_C::ItemDataBase' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, bIsCharacter) == 0x000430, "Member 'UWBP_Menu_Parts_083_modern_C::bIsCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_083_modern_C, NumberImageRef) == 0x000438, "Member 'UWBP_Menu_Parts_083_modern_C::NumberImageRef' has a wrong offset!");

}

