#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_057_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_057_modern.WBP_Menu_Parts_057_modern_C.ExecuteUbergraph_WBP_Menu_Parts_057_modern
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern) == 0x000004, "Wrong alignment on WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern");
static_assert(sizeof(WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern) == 0x000004, "Wrong size on WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_057_modern_C_ExecuteUbergraph_WBP_Menu_Parts_057_modern::EntryPoint' has a wrong offset!");

// Function WBP_Menu_Parts_057_modern.WBP_Menu_Parts_057_modern_C.SetPercentValue
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Parts_057_modern_C_SetPercentValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisiblePercent;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0018(0x0018)()
	class FText                                   CallFunc_GetRealText_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_057_modern_C_SetPercentValue) == 0x000008, "Wrong alignment on WBP_Menu_Parts_057_modern_C_SetPercentValue");
static_assert(sizeof(WBP_Menu_Parts_057_modern_C_SetPercentValue) == 0x000048, "Wrong size on WBP_Menu_Parts_057_modern_C_SetPercentValue");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, InValue) == 0x000000, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, IsVisiblePercent) == 0x000004, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::IsVisiblePercent' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, Temp_bool_Variable) == 0x000007, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, K2Node_Select_Default) == 0x000010, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_057_modern_C_SetPercentValue, CallFunc_GetRealText_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_057_modern_C_SetPercentValue::CallFunc_GetRealText_ReturnValue' has a wrong offset!");

}

