#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_009_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Shop_List_009_modern.WBP_Menu_Shop_List_009_modern_C
// 0x00B0 (0x04B0 - 0x0400)
class UWBP_Menu_Shop_List_009_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_0;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_1;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_2;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_3;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_4;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_5;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_C_6;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UJackUMGItemBase*>               MenuItemList;                                      // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWBP_Menu_Common_Setumei_005_modern_C*  SetumeiWidget;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnCancel;                                          // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EJackSibari                                   SelectedSibariType;                                // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackSibari>                           SibariTypeList;                                    // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnEnter;                                           // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnCancel__DelegateSignature();
	void OnEnter__DelegateSignature(EJackSibari SibariType);
	void ExecuteUbergraph_WBP_Menu_Shop_List_009_modern(int32 EntryPoint);
	void Cancel(bool bFromExternal);
	void SetupMenuItem();
	void SetVisible(bool bVisible);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void RemoveMenuItemIfNeeded(EJackSibari Type, class UJackUMGItemBase* RemoveTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Shop_List_009_modern_C">();
	}
	static class UWBP_Menu_Shop_List_009_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Shop_List_009_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Shop_List_009_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Shop_List_009_modern_C");
static_assert(sizeof(UWBP_Menu_Shop_List_009_modern_C) == 0x0004B0, "Wrong size on UWBP_Menu_Shop_List_009_modern_C");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Shop_List_009_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Shop_List_009_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, ItemList) == 0x000410, "Member 'UWBP_Menu_Shop_List_009_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, RootPanel) == 0x000418, "Member 'UWBP_Menu_Shop_List_009_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062) == 0x000420, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_0) == 0x000428, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_1) == 0x000430, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_2) == 0x000438, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_3) == 0x000440, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_4) == 0x000448, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_5) == 0x000450, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, WBP_Menu_Parts_062_C_6) == 0x000458, "Member 'UWBP_Menu_Shop_List_009_modern_C::WBP_Menu_Parts_062_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, MenuItemList) == 0x000460, "Member 'UWBP_Menu_Shop_List_009_modern_C::MenuItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, SetumeiWidget) == 0x000470, "Member 'UWBP_Menu_Shop_List_009_modern_C::SetumeiWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, OnCancel) == 0x000478, "Member 'UWBP_Menu_Shop_List_009_modern_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, SelectedSibariType) == 0x000488, "Member 'UWBP_Menu_Shop_List_009_modern_C::SelectedSibariType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, SibariTypeList) == 0x000490, "Member 'UWBP_Menu_Shop_List_009_modern_C::SibariTypeList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_009_modern_C, OnEnter) == 0x0004A0, "Member 'UWBP_Menu_Shop_List_009_modern_C::OnEnter' has a wrong offset!");

}

