#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Value_002_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_Value_002_modern.WBP_Menu_Parts_Value_002_modern_C.ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Value;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0018(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0030(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern");
static_assert(sizeof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern) == 0x000048, "Wrong size on WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern, K2Node_CustomEvent_Value) == 0x000010, "Member 'WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern, K2Node_CustomEvent_MaxValue) == 0x000014, "Member 'WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern::K2Node_CustomEvent_MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Parts_Value_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Value_002_modern::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Parts_Value_002_modern.WBP_Menu_Parts_Value_002_modern_C.SetValueData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_Value_002_modern_C_SetValueData final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Value_002_modern_C_SetValueData) == 0x000004, "Wrong alignment on WBP_Menu_Parts_Value_002_modern_C_SetValueData");
static_assert(sizeof(WBP_Menu_Parts_Value_002_modern_C_SetValueData) == 0x000008, "Wrong size on WBP_Menu_Parts_Value_002_modern_C_SetValueData");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_SetValueData, Value) == 0x000000, "Member 'WBP_Menu_Parts_Value_002_modern_C_SetValueData::Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_SetValueData, MaxValue) == 0x000004, "Member 'WBP_Menu_Parts_Value_002_modern_C_SetValueData::MaxValue' has a wrong offset!");

// Function WBP_Menu_Parts_Value_002_modern.WBP_Menu_Parts_Value_002_modern_C.IntToEmNumbers
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers final
{
public:
	int32                                         InVal;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Str;                                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Val;                                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RetStr;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers");
static_assert(sizeof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers) == 0x000080, "Wrong size on WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, InVal) == 0x000000, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::InVal' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, Str) == 0x000008, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::Str' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, Val) == 0x000018, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::Val' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, RetStr) == 0x000020, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::RetStr' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_Divide_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000034, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_Percent_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_BooleanOR_ReturnValue) == 0x00003D, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_MakeLiteralString_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'WBP_Menu_Parts_Value_002_modern_C_IntToEmNumbers::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

}

