#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_004_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_List_004_modern.WBP_Menu_Shop_List_004_modern_C.ExecuteUbergraph_WBP_Menu_Shop_List_004_modern
// 0x0480 (0x0480 - 0x0000)
struct WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue2;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 Temp_byte_Variable2;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBagTargetItemIndex_ReturnValue;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId3;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue3;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId4;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue4;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActionItemCount_ReturnValue;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId5;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue5;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId6;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue6;             // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStoreBagName_NewParam;                 // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0188(0x0048)()
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue12;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGShopItemSyousai*                CallFunc_GetItemSyousaiShop_ReturnValue;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue13;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue14;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGShopResult                            CallFunc_GetShopResult_ReturnValue;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Shop_List_003_modern_C*       K2Node_DynamicCast_AsWBP_Menu_Shop_List_003_Modern; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue15;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveTargetCharacter_bIsAlive;       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGShopItemSyousai*                CallFunc_GetItemSyousaiShop_ReturnValue2;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue16;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue17;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBagOverflow_ReturnValue;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue18;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue19;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue20;            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 K2Node_Select_Default;                             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue21;            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue22;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue23;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagTargetItemIndex_ReturnValue2;       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_ActionItem_ReturnValue2;                  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue24;            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue25;            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindNoEquipmentItemFromInBag_ReturnValue; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 Temp_byte_Variable3;                               // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue26;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue3;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue27;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGShopItemSyousai*                CallFunc_GetItemSyousaiShop_ReturnValue3;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCursorIndexInPage_ReturnValue;         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue28;            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagTargetItemIndex_ReturnValue3;       // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue2;            // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStoreBagName_NewParam2;                // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select2_Default;                            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x0358(0x0048)()
	class FName                                   CallFunc_GetShopTalkText_OutShopMessageId7;        // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShopTalkText_ReturnValue7;             // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array4;                           // 0x03B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue29;            // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 Temp_byte_Variable4;                               // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue30;            // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue4;                  // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue31;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetItemUIActionInfo_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue2;   // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue32;            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue33;            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue2;          // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackUMGItemListInfo>           CallFunc_GetItemSyousaiList_ReturnValue;           // 0x0448(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 K2Node_Select3_Default;                            // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern");
static_assert(sizeof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern) == 0x000480, "Wrong size on WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000018, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_byte_Variable) == 0x000020, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId) == 0x000028, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue) == 0x000030, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000048, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId2) == 0x000060, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_bool_Variable) == 0x000078, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000080, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_byte_Variable2) == 0x000088, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetBagTargetItemIndex_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetBagTargetItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetBagTargetType_ReturnValue) == 0x000090, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetBagTargetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x000098, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId3) == 0x0000A0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue3) == 0x0000A8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x0000B8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId4) == 0x0000C0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue4) == 0x0000C8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x0000D8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x0000E0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetActionItemCount_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetActionItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId5) == 0x0000F0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue5) == 0x0000F8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetActionItemId_ReturnValue) == 0x000108, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetActionItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue9) == 0x000110, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CustomEvent_InKeyType) == 0x000118, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CustomEvent_bIsPressed) == 0x000119, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00011A, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x000120, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000128, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue10) == 0x000138, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetBagSelectedChar_ReturnValue) == 0x000140, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_CanBeEquippedItemInChar_ReturnValue) == 0x000141, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_CanBeEquippedItemInChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_MakeArray_Array2) == 0x000148, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue11) == 0x000158, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId6) == 0x000160, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue6) == 0x000168, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetStoreBagName_NewParam) == 0x000178, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetStoreBagName_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000188, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0001D0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_MakeArray_Array3) == 0x0001E0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue12) == 0x0001F0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetItemSyousaiShop_ReturnValue) == 0x0001F8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetItemSyousaiShop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue13) == 0x000200, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue14) == 0x000208, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopResult_ReturnValue) == 0x000210, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000211, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000218, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000220, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_DynamicCast_AsWBP_Menu_Shop_List_003_Modern) == 0x000228, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_DynamicCast_AsWBP_Menu_Shop_List_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue15) == 0x000238, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_IsUMGAliveTargetCharacter_bIsAlive) == 0x000240, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_IsUMGAliveTargetCharacter_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CustomEvent_EventName) == 0x000248, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CustomEvent_InItemBase) == 0x000250, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_name_Variable) == 0x000258, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetItemSyousaiShop_ReturnValue2) == 0x000260, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetItemSyousaiShop_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_SwitchName_CmpSuccess) == 0x000268, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue16) == 0x000270, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue17) == 0x000278, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_IsBagOverflow_ReturnValue) == 0x000280, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_IsBagOverflow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue18) == 0x000288, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue19) == 0x000290, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue20) == 0x000298, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue20' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_Select_Default) == 0x0002A0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_ActionItem_ReturnValue) == 0x0002A4, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue21) == 0x0002A8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue21' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_name_Variable2) == 0x0002B0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue22) == 0x0002B8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue22' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue23) == 0x0002C0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue23' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetBagTargetItemIndex_ReturnValue2) == 0x0002C8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetBagTargetItemIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0002D0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_ActionItem_ReturnValue2) == 0x0002E0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_ActionItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue24) == 0x0002E8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue24' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue25) == 0x0002F0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue25' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_FindNoEquipmentItemFromInBag_ReturnValue) == 0x0002F8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_FindNoEquipmentItemFromInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_Max_ReturnValue) == 0x0002FC, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_byte_Variable3) == 0x000300, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue26) == 0x000308, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue26' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_ActionItem_ReturnValue3) == 0x000310, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_ActionItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue27) == 0x000318, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue27' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetItemSyousaiShop_ReturnValue3) == 0x000320, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetItemSyousaiShop_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetCursorIndexInPage_ReturnValue) == 0x000328, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetCursorIndexInPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00032C, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue28) == 0x000330, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue28' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetBagTargetItemIndex_ReturnValue3) == 0x000338, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetBagTargetItemIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetBagTargetType_ReturnValue2) == 0x00033C, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetBagTargetType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_bool_Variable2) == 0x00033D, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetStoreBagName_NewParam2) == 0x000340, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetStoreBagName_NewParam2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_Select2_Default) == 0x000350, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x000358, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_OutShopMessageId7) == 0x0003A0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_OutShopMessageId7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetShopTalkText_ReturnValue7) == 0x0003A8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetShopTalkText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_MakeArray_Array4) == 0x0003B8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue29) == 0x0003C8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue29' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, Temp_byte_Variable4) == 0x0003D0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue30) == 0x0003D8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue30' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_ActionItem_ReturnValue4) == 0x0003E0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_ActionItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetAccessorItem_ReturnValue31) == 0x0003E8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetAccessorItem_ReturnValue31' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_CustomEvent_EventTag) == 0x0003F0, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, K2Node_SwitchName2_CmpSuccess) == 0x0003F8, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetItemUIActionInfo_ReturnValue) == 0x000400, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetItemUIActionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000408, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000410, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000418, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern, CallFunc_GetSerifuWindowController_ReturnValue2) == 0x000420, "Member 'WBP_Menu_Shop_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_004_modern::CallFunc_GetSerifuWindowController_ReturnValue2' has a wrong offset!");
