#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_017_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_017_modern
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 InListOffset)>           K2Node_CreateDelegate_OutputDelegate4;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsPhotoMode)>            K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountMember_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxJoutaiIjouNumber_ReturnValue;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InListOffset;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxJoutaiIjouNumber_ReturnValue2;      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPhotoMode;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern) == 0x0000E8, "Wrong size on WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000038, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, Temp_bool_Variable) == 0x000048, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x000050, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, Temp_byte_Variable) == 0x000060, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, Temp_byte_Variable2) == 0x000061, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_EventTag) == 0x000068, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_SwitchName_CmpSuccess) == 0x000070, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_InKeyType) == 0x000071, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_bIsPressed) == 0x000072, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000073, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000078, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_CountMember_ReturnValue) == 0x000080, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_CountMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_EventName) == 0x000088, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_InItemBase) == 0x000090, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_SwitchName2_CmpSuccess) == 0x000098, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetMaxJoutaiIjouNumber_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetMaxJoutaiIjouNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_InListOffset) == 0x0000B4, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_InListOffset' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x0000B8, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetMaxJoutaiIjouNumber_ReturnValue2) == 0x0000C0, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetMaxJoutaiIjouNumber_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_Not_PreBool_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_CustomEvent_bIsPhotoMode) == 0x0000E0, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_CustomEvent_bIsPhotoMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern, K2Node_Select_Default) == 0x0000E1, "Member 'WBP_Menu_Battle_List_017_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_017_modern::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.PhotoModeEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent final
{
public:
	bool                                          bIsPhotoMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent) == 0x000001, "Wrong size on WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent, bIsPhotoMode) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_PhotoModeEvent::bIsPhotoMode' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.CustomEvent_1
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_CustomEvent_1 final
{
public:
	int32                                         InListOffset;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_CustomEvent_1) == 0x000004, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_CustomEvent_1) == 0x000004, "Wrong size on WBP_Menu_Battle_List_017_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_CustomEvent_1, InListOffset) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_CustomEvent_1::InListOffset' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_017_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_017_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.WidgetKeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_017_modern_C_WidgetKeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_017_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Battle_List_017_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.ResetWindow
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_ResetWindow final
{
public:
	class UTexture2D*                             CallFunc_SetFaceAndName_FaceTexture;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_SetFaceAndName_CharacterType;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFaceAndName_Valid;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_SetFaceAndName_FaceTexture2;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_SetFaceAndName_CharacterType2;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFaceAndName_Valid2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_SetFaceAndName_FaceTexture3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_SetFaceAndName_CharacterType3;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFaceAndName_Valid3;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_SetFaceAndName_FaceTexture4;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_SetFaceAndName_CharacterType4;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFaceAndName_Valid4;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetJoutaiIjouParts_ReturnValue;           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetJoutaiIjouParts_ReturnValue2;          // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetJoutaiIjouParts_ReturnValue3;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetJoutaiIjouParts_ReturnValue4;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_ResetWindow) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_ResetWindow");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_ResetWindow) == 0x000078, "Wrong size on WBP_Menu_Battle_List_017_modern_C_ResetWindow");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_FaceTexture) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_FaceTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_CharacterType) == 0x000008, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_CharacterType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_Valid) == 0x000009, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_Valid' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_FaceTexture2) == 0x000010, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_FaceTexture2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_CharacterType2) == 0x000018, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_CharacterType2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_Valid2) == 0x000019, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_Valid2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_FaceTexture3) == 0x000020, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_FaceTexture3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_CharacterType3) == 0x000028, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_CharacterType3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_Valid3) == 0x000029, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_Valid3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_FaceTexture4) == 0x000030, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_FaceTexture4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_CharacterType4) == 0x000038, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_CharacterType4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetFaceAndName_Valid4) == 0x000039, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetFaceAndName_Valid4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetJoutaiIjouParts_ReturnValue) == 0x00003A, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetJoutaiIjouParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetJoutaiIjouParts_ReturnValue2) == 0x00003B, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetJoutaiIjouParts_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetJoutaiIjouParts_ReturnValue3) == 0x00003C, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetJoutaiIjouParts_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_SetJoutaiIjouParts_ReturnValue4) == 0x00003D, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_SetJoutaiIjouParts_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_GetAccessorMembers_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_Array_Length_ReturnValue2) == 0x00004C, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, K2Node_SwitchInteger_CmpSuccess) == 0x000054, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_ResetWindow, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Battle_List_017_modern_C_ResetWindow::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.SetFaceAndName
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_SetFaceAndName final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           Parts000;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceTexture;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CharacterType;                                     // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGJoutaiMiruMember               CallFunc_Array_Get_Item;                           // 0x0038(0x0020)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_SetFaceAndName");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName) == 0x000068, "Wrong size on WBP_Menu_Battle_List_017_modern_C_SetFaceAndName");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, InIndex) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::InIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, Parts000) == 0x000008, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::Parts000' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, FaceTexture) == 0x000010, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::FaceTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CharacterType) == 0x000018, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CharacterType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, Valid) == 0x000019, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::Valid' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CallFunc_GetAccessorMembers_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetFaceAndName, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000060, "Member 'WBP_Menu_Battle_List_017_modern_C_SetFaceAndName::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.SetOddEffectIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon final
{
public:
	TArray<class UJackUMGItemBase*>               ItemBase;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_063_Modern;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon) == 0x000040, "Wrong size on WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, ItemBase) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::ItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, K2Node_DynamicCast_AsWBP_Menu_Parts_063_Modern) == 0x000028, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::K2Node_DynamicCast_AsWBP_Menu_Parts_063_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, CallFunc_GetDataIndex_ReturnValue) == 0x000034, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_List_017_modern_C_SetOddEffectIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.SetDiscription
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_SetDiscription final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOddEffectSetumei_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_SetDiscription) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_SetDiscription");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_SetDiscription) == 0x000020, "Wrong size on WBP_Menu_Battle_List_017_modern_C_SetDiscription");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetDiscription, InName) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_SetDiscription::InName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetDiscription, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_017_modern_C_SetDiscription::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetDiscription, CallFunc_GetOddEffectSetumei_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_017_modern_C_SetDiscription::CallFunc_GetOddEffectSetumei_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_017_modern.WBP_Menu_Battle_List_017_modern_C.SetScroll
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Battle_List_017_modern_C_SetScroll final
{
public:
	int32                                         CallFunc_GetJoutaiMiruListOffset_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_017_modern_C_SetScroll) == 0x000004, "Wrong alignment on WBP_Menu_Battle_List_017_modern_C_SetScroll");
static_assert(sizeof(WBP_Menu_Battle_List_017_modern_C_SetScroll) == 0x000004, "Wrong size on WBP_Menu_Battle_List_017_modern_C_SetScroll");
static_assert(offsetof(WBP_Menu_Battle_List_017_modern_C_SetScroll, CallFunc_GetJoutaiMiruListOffset_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_017_modern_C_SetScroll::CallFunc_GetJoutaiMiruListOffset_ReturnValue' has a wrong offset!");

}

