#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_Command_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_Command_000_modern.WBP_Menu_Battle_Command_000_modern_C
// 0x0118 (0x0548 - 0x0430)
class UWBP_Menu_Battle_Command_000_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NormalListPanel;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RenkeiListPanel;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_Button_000_modern_C*           WBP_Hud_Button_000;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_0;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_1;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_2;                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_3;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_4;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_18;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_420;                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_421;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_422;                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_423;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_424;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_425;                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumJumon;                                          // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableJumon;                                       // 0x04D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableTokugi;                                      // 0x04D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableRenkei;                                      // 0x04D6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableDougu;                                       // 0x04D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UJackUMGItemData*                       NewCommandItemData;                                // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContainerTagFName;                                 // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CommandItemDataList;                               // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgCharName;                                       // 0x04F8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UJackUMGUIActionInfo*                   UIActionInfoRef;                                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_Command_000_modern(int32 EntryPoint);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void WidgetKeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void SetBattleCommandCursorSave(class UJackUMGItemBase* InputPin);
	class FName GetBattleCommandCursorSave();
	void UpdateTokugijumonCommand();
	void CheckSingleActionFlow(class UJackUMGItemActionStatus* InUIActionStatus, class UJackUMGUIActionInfo* InUIActionInfo, class FName* OutTextId);
	void CheckAllActionFlow(TArray<class UJackUMGItemData*>& Array, class UJackUMGUIActionInfo* InUIActionInfo, class FName* OutTextId);
	void CheckDamageTypeAction(EJackActionDamageType Selection, class UJackUMGItemActionStatus* InputPin, bool* DoAction);
	void CheckSingleActionFlow2(class UJackUMGUIActionInfo* InUIActionInfo, class UJackUMGItemActionStatus* InActionStatus, class FName* OutTextId);
	void CheckAllActionFlow2(class UJackUMGUIActionInfo* InUIActionInfo, class UJackUMGItemActionStatus* UIActionStatus, class FName* OutTextId);
	void EnableCommands();
	void CreateCommandItemList();
	void SetTopMenuOpenFlag(bool Opened);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_Command_000_modern_C">();
	}
	static class UWBP_Menu_Battle_Command_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_Command_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_Command_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_Command_000_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_Command_000_modern_C) == 0x000548, "Wrong size on UWBP_Menu_Battle_Command_000_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Battle_Command_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Battle_Command_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, NormalListPanel) == 0x000440, "Member 'UWBP_Menu_Battle_Command_000_modern_C::NormalListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, RenkeiListPanel) == 0x000448, "Member 'UWBP_Menu_Battle_Command_000_modern_C::RenkeiListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, RootPanel) == 0x000450, "Member 'UWBP_Menu_Battle_Command_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Hud_Button_000) == 0x000458, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Hud_Button_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000) == 0x000460, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_0) == 0x000468, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_1) == 0x000470, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_2) == 0x000478, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_3) == 0x000480, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_4) == 0x000488, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_18) == 0x000490, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_420) == 0x000498, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_420' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_421) == 0x0004A0, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_421' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_422) == 0x0004A8, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_422' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_423) == 0x0004B0, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_423' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_424) == 0x0004B8, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_424' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WBP_Menu_Parts_000_C_425) == 0x0004C0, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WBP_Menu_Parts_000_C_425' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, WindowFrame) == 0x0004C8, "Member 'UWBP_Menu_Battle_Command_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, NumJumon) == 0x0004D0, "Member 'UWBP_Menu_Battle_Command_000_modern_C::NumJumon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, EnableJumon) == 0x0004D4, "Member 'UWBP_Menu_Battle_Command_000_modern_C::EnableJumon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, EnableTokugi) == 0x0004D5, "Member 'UWBP_Menu_Battle_Command_000_modern_C::EnableTokugi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, EnableRenkei) == 0x0004D6, "Member 'UWBP_Menu_Battle_Command_000_modern_C::EnableRenkei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, EnableDougu) == 0x0004D7, "Member 'UWBP_Menu_Battle_Command_000_modern_C::EnableDougu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, NewCommandItemData) == 0x0004D8, "Member 'UWBP_Menu_Battle_Command_000_modern_C::NewCommandItemData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, ContainerTagFName) == 0x0004E0, "Member 'UWBP_Menu_Battle_Command_000_modern_C::ContainerTagFName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, CommandItemDataList) == 0x0004E8, "Member 'UWBP_Menu_Battle_Command_000_modern_C::CommandItemDataList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, MsgCharName) == 0x0004F8, "Member 'UWBP_Menu_Battle_Command_000_modern_C::MsgCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_Command_000_modern_C, UIActionInfoRef) == 0x000540, "Member 'UWBP_Menu_Battle_Command_000_modern_C::UIActionInfoRef' has a wrong offset!");

}

