#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_QuestRewardBase

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_QuestRewardBase.WBP_Menu_Parts_QuestRewardBase_C.ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase
// 0x0200 (0x0200 - 0x0000)
struct WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackQuestReward                       K2Node_CustomEvent_QuestRewardData;                // 0x0020(0x0020)(NoDestructor)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue2;                     // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetQuestRewardEventItemData_ItemName;     // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetQuestRewardEventItemData_IconTexture;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestRewardEventItemData_ItemCount;    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetQuestRewardEventItemData_UnitNameId;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestRewardEventItemData_Gold;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQuestRewardEventItemData_bIsMedal;     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetQuestRewardEventItemData_bIsRecipeBook; // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetQuestRewardEventItemData_ItemName2;    // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetQuestRewardEventItemData_IconTexture2; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestRewardEventItemData_ItemCount2;   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetQuestRewardEventItemData_UnitNameId2;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestRewardEventItemData_Gold2;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQuestRewardEventItemData_bIsMedal2;    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetQuestRewardEventItemData_bIsRecipeBook2; // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue; // 0x00F8(0x0048)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0170(0x0018)()
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select3_Default;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue3;                     // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x01B0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue4;           // 0x01C8(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x01E8(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase) == 0x000008, "Wrong alignment on WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase");
static_assert(sizeof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase) == 0x000200, "Wrong size on WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_bool_Variable) == 0x000005, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_object_Variable) == 0x000008, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_bool_Variable2) == 0x000010, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable2) == 0x000011, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable3) == 0x000012, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_bool_Variable3) == 0x000013, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable4) == 0x000014, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable5) == 0x000015, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_bool_Variable4) == 0x000016, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable6) == 0x000017, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable7) == 0x000018, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_byte_Variable8) == 0x000019, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_CustomEvent_QuestRewardData) == 0x000020, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_CustomEvent_QuestRewardData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetText_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetText_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, Temp_bool_Variable5) == 0x000080, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetUMGManager_ReturnValue) == 0x000088, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000090, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_ItemName) == 0x000098, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_ItemName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_IconTexture) == 0x0000A8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_ItemCount) == 0x0000B0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_ItemCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_UnitNameId) == 0x0000B8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_UnitNameId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_Gold) == 0x0000C0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_Gold' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_bIsMedal) == 0x0000C4, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_bIsMedal' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_bIsRecipeBook) == 0x0000C5, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_bIsRecipeBook' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_ItemName2) == 0x0000C8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_ItemName2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_IconTexture2) == 0x0000D8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_IconTexture2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_ItemCount2) == 0x0000E0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_ItemCount2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_UnitNameId2) == 0x0000E8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_UnitNameId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_Gold2) == 0x0000F0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_Gold2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_bIsMedal2) == 0x0000F4, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_bIsMedal2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetQuestRewardEventItemData_bIsRecipeBook2) == 0x0000F5, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetQuestRewardEventItemData_bIsRecipeBook2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_MakeJackMessageArgumentDataAtIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_MakeArray_Array) == 0x000148, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_ReplaceMessageTag_ReturnValue) == 0x000158, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_ReplaceMessageTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_Select_Default) == 0x000168, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_Conv_StringToText_ReturnValue2) == 0x000170, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_Select2_Default) == 0x000188, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_Select3_Default) == 0x000190, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_Select4_Default) == 0x000199, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, K2Node_Select5_Default) == 0x00019A, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetText_ReturnValue3) == 0x0001A0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_Conv_StringToText_ReturnValue3) == 0x0001B0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_Conv_StringToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_Conv_StringToText_ReturnValue4) == 0x0001C8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_Conv_StringToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetUMGManager_ReturnValue2) == 0x0001E0, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase, CallFunc_GetDecMenuText_ReturnValue) == 0x0001E8, "Member 'WBP_Menu_Parts_QuestRewardBase_C_ExecuteUbergraph_WBP_Menu_Parts_QuestRewardBase::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_QuestRewardBase.WBP_Menu_Parts_QuestRewardBase_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Parts_QuestRewardBase_C_SetData final
{
public:
	struct FJackQuestReward                       QuestRewardData;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_QuestRewardBase_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_QuestRewardBase_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_QuestRewardBase_C_SetData) == 0x000020, "Wrong size on WBP_Menu_Parts_QuestRewardBase_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_QuestRewardBase_C_SetData, QuestRewardData) == 0x000000, "Member 'WBP_Menu_Parts_QuestRewardBase_C_SetData::QuestRewardData' has a wrong offset!");

}

