#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_022_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_022_modern.WBP_Menu_Parts_022_modern_C
// 0x0040 (0x0410 - 0x03D0)
class UWBP_Menu_Parts_022_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Equipment_s_000;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIconPanel;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024_C_61;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPriceMode;                                       // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_022_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(class FName EventTag);
	void UpdateContainerDelegate(const struct FJackUMGItemContainer& ItemContainer);
	void SetPriceMode(bool IsPriceMode_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_022_modern_C">();
	}
	static class UWBP_Menu_Parts_022_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_022_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_022_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_022_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_022_modern_C) == 0x000410, "Wrong size on UWBP_Menu_Parts_022_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_022_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, CaptionPanel) == 0x0003D8, "Member 'UWBP_Menu_Parts_022_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, Equipment_s_000) == 0x0003E0, "Member 'UWBP_Menu_Parts_022_modern_C::Equipment_s_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, ItemIconPanel) == 0x0003E8, "Member 'UWBP_Menu_Parts_022_modern_C::ItemIconPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, WBP_Menu_Parts_024_C_61) == 0x0003F0, "Member 'UWBP_Menu_Parts_022_modern_C::WBP_Menu_Parts_024_C_61' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, IconTexture) == 0x0003F8, "Member 'UWBP_Menu_Parts_022_modern_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, ItemSyousaiRef) == 0x000400, "Member 'UWBP_Menu_Parts_022_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_022_modern_C, IsPriceMode) == 0x000408, "Member 'UWBP_Menu_Parts_022_modern_C::IsPriceMode' has a wrong offset!");

}

