#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_008_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern) == 0x0000A8, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CustomEvent_EventName) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CustomEvent_InItemBase) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_SwitchName2_CmpSuccess) == 0x000031, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_SwitchName3_CmpSuccess) == 0x000032, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_SwitchName4_CmpSuccess) == 0x000033, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, Temp_struct_Variable) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CustomEvent_Sender) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CustomEvent_CurrentTextID) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_SwitchInteger_CmpSuccess) == 0x00007C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_008_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.CustomEvent_2
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_2::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_1::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.CustomEvent_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_CustomEvent_0::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.GetCameraOptionData
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCameraSpeed                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable9;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable11;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable13;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable14;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable15;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable16;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable17;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable18;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCameraSpeed                              Temp_byte_Variable2;                               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable19;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable20;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable21;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable22;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable23;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable24;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable25;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable26;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable27;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable28;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable29;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable30;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable31;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable32;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable33;                               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable34;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable35;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable36;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCameraSpeed                              Temp_byte_Variable3;                               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInversHorizontalCamera_ReturnValue;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCameraSpeed                              CallFunc_GetCameraSpeedAuto_ReturnValue;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCameraSpeed                              CallFunc_GetCameraSpeedRoom_ReturnValue;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCameraSpeed                              CallFunc_GetCameraSpeed_ReturnValue;               // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select3_Default;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select4_Default;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAutoFollowCamera_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInversVerticalCamera_ReturnValue;       // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select5_Default;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select6_Default;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData) == 0x0000E0, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable2) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable3) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable4) == 0x00000C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable5) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable6) == 0x000014, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable7) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable8) == 0x00001C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_byte_Variable) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable9) == 0x000024, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable10) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable11) == 0x00002C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable12) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable13) == 0x000034, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable14) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable15) == 0x00003C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable16) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable17) == 0x000044, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable18) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_byte_Variable2) == 0x00004C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable19) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable20) == 0x000054, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable20' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable21) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable21' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable22) == 0x00005C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable22' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable23) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable23' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable24) == 0x000064, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable24' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable25) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable25' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable26) == 0x00006C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable26' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable27) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable27' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable28) == 0x000074, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable28' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_bool_Variable) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable29) == 0x00007C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable29' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable30) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable30' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_bool_Variable2) == 0x000084, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable31) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable31' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable32) == 0x00008C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable32' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_bool_Variable3) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable33) == 0x000094, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable33' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable34) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable34' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable35) == 0x00009C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable35' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_int_Variable36) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_int_Variable36' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, Temp_byte_Variable3) == 0x0000A4, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_GetUMGManager_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_IsInversHorizontalCamera_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_IsInversHorizontalCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_GetCameraSpeedAuto_ReturnValue) == 0x0000B9, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_GetCameraSpeedAuto_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, K2Node_Select_Default) == 0x0000BC, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, K2Node_Select2_Default) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_GetCameraSpeedRoom_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_GetCameraSpeedRoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_GetCameraSpeed_ReturnValue) == 0x0000C5, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_GetCameraSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, K2Node_Select3_Default) == 0x0000C8, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, K2Node_Select4_Default) == 0x0000CC, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_IsAutoFollowCamera_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_IsAutoFollowCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, CallFunc_IsInversVerticalCamera_ReturnValue) == 0x0000D1, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::CallFunc_IsInversVerticalCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, K2Node_Select5_Default) == 0x0000D4, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData, K2Node_Select6_Default) == 0x0000D8, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetCameraOptionData::K2Node_Select6_Default' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.SetCameraOptionData
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue3;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue2;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue3;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData) == 0x000020, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_Conv_IntToByte_ReturnValue) == 0x000001, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_GetValidValue_ReturnValue) == 0x000002, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000003, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_Conv_IntToByte_ReturnValue2) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_Conv_IntToByte_ReturnValue3) == 0x000005, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_Conv_IntToByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_GetValidValue_ReturnValue2) == 0x000006, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_GetValidValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_GetValidValue_ReturnValue3) == 0x000007, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_GetValidValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetCameraOptionData::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.GetAllValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue final
{
public:
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue2;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue3;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue4;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue5;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue6;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue, CallFunc_GetValue_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue, CallFunc_GetValue_ReturnValue2) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue::CallFunc_GetValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue, CallFunc_GetValue_ReturnValue3) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue::CallFunc_GetValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue, CallFunc_GetValue_ReturnValue4) == 0x00000C, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue::CallFunc_GetValue_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue, CallFunc_GetValue_ReturnValue5) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue::CallFunc_GetValue_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue, CallFunc_GetValue_ReturnValue6) == 0x000014, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_GetAllValue::CallFunc_GetValue_ReturnValue6' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.AddSnap
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_AddSnap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_008_modern.WBP_Menu_Sakusen_Settei_008_modern_C.SetInfoText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_GetItemBaseFromItemId_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText, Selection) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText::Selection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_008_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
