#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_004_modern

#include "Basic.hpp"

#include "ENUM_Menu_ActionFlowResult_structs.hpp"
#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_004_modern.WBP_Menu_Battle_List_004_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_004_modern
// 0x0428 (0x0428 - 0x0000)
struct WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable;                                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_013_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable2;                               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetNearTargetCharacter_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_001_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable3;                               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable4;                               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable5;                               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable6;                               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue12;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue13;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue14;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue15;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable7;                               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionMember_ReturnValue;               // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable8;                               // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable9;                               // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionMember_ReturnValue2;              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    Temp_byte_Variable10;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue16;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_003_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue17;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_InsertUMGMenuWithSnap_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Status_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue18;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue2;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedItem_ReturnValue;               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue2;     // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue3;          // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue4;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue3;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateBrowserList_NumData;                // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateBrowserList_NumData2;               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateBrowserList_NumData3;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x0298(0x0050)()
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPage_ReturnValue;                   // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayUseItemMessage_ReturnValue;        // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFieldUseItemCommonActionResult_bValidCommonAction; // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFieldUseItemCommonActionResult_bSuccess; // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue9;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue10;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0368(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetFirstTargetCharacter_ReturnValue;      // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue;        // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue2;       // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    K2Node_Select2_Default;                            // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    K2Node_Select3_Default;                            // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue3;       // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x2];                                      // 0x038A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue4;       // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    K2Node_Select4_Default;                            // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue5;       // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Menu_ActionFlowResult                    K2Node_Select5_Default;                            // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_Menu_ActionFlowResult                    K2Node_Select6_Default;                            // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x039E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x039F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate4;             // 0x03B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue4;          // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackUMGItemListInfo>           CallFunc_GetItemSyousaiList_ReturnValue;           // 0x03F0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue19;              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0408(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0418(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern");
static_assert(sizeof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern) == 0x000428, "Wrong size on WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_bool_Variable) == 0x000018, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_ActionItem_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_ActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_ActionItem_ReturnValue2) == 0x00004C, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_ActionItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000050, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x000051, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable) == 0x000052, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern) == 0x000060, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable2) == 0x000069, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000078, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000080, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000088, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_bool_Variable2) == 0x000090, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetNearTargetCharacter_ReturnValue) == 0x000098, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetNearTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000A0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0000A8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x0000B8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x0000C0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetBagTargetChar_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetBagTargetChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern) == 0x0000E0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_bSuccess2) == 0x0000E8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable3) == 0x0000E9, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x0000F0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0000F8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x000100, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x000108, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x000110, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x000118, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable4) == 0x000120, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x000128, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable5) == 0x000130, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_bool_Variable3) == 0x000131, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetBattleManager_ReturnValue) == 0x000138, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_IsInBattle_ReturnValue) == 0x000140, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue10) == 0x000148, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue11) == 0x000150, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable6) == 0x000158, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue12) == 0x000160, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue13) == 0x000168, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue14) == 0x000170, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue15) == 0x000178, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_bool_Variable4) == 0x000180, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000188, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable7) == 0x000190, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_IsActionMember_ReturnValue) == 0x000191, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_IsActionMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable8) == 0x000192, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x000198, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable9) == 0x0001A0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_IsActionMember_ReturnValue2) == 0x0001A1, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_IsActionMember_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x0001A8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetBagSelectedChar_ReturnValue) == 0x0001B0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_CanBeEquippedItemInChar_ReturnValue) == 0x0001B1, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_CanBeEquippedItemInChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_CustomEvent_EventTag) == 0x0001B8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, Temp_byte_Variable10) == 0x0001C0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_SwitchName_CmpSuccess) == 0x0001C1, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_CustomEvent_EventName) == 0x0001C8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_CustomEvent_InItemBase) == 0x0001D0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_SwitchName2_CmpSuccess) == 0x0001D8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue16) == 0x0001E0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x0001E8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern) == 0x0001F0, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_bSuccess3) == 0x0001F8, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000200, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue17) == 0x000210, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_InsertUMGMenuWithSnap_ReturnValue) == 0x000218, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_InsertUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern) == 0x000220, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, K2Node_DynamicCast_bSuccess4) == 0x000228, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetUMGManager_ReturnValue18) == 0x000230, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetUMGManager_ReturnValue18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x000238, "Member 'WBP_Menu_Battle_List_004_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_004_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
