#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Face_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.ExecuteUbergraph_WBP_Hud_Status_Face_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackCharacter Type, EJackUIFaceIcon InIconType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EJackCharacter Type, EJackUIFaceIcon InIconType)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	EJackCharacter                                K2Node_CustomEvent_Type2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIFaceIcon                               K2Node_CustomEvent_InIconType2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                K2Node_CustomEvent_Type;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIFaceIcon                               K2Node_CustomEvent_InIconType;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern) == 0x000008, "Wrong alignment on WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern) == 0x000048, "Wrong size on WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_CustomEvent_Type2) == 0x000028, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_CustomEvent_Type2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_CustomEvent_InIconType2) == 0x000029, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_CustomEvent_InIconType2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000030, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000038, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_CustomEvent_Type) == 0x000040, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern, K2Node_CustomEvent_InIconType) == 0x000041, "Member 'WBP_Hud_Status_Face_modern_C_ExecuteUbergraph_WBP_Hud_Status_Face_modern::K2Node_CustomEvent_InIconType' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.CustomEvent_1
// 0x0002 (0x0002 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_CustomEvent_1 final
{
public:
	EJackCharacter                                Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIFaceIcon                               InIconType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_CustomEvent_1) == 0x000001, "Wrong alignment on WBP_Hud_Status_Face_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_CustomEvent_1) == 0x000002, "Wrong size on WBP_Hud_Status_Face_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_CustomEvent_1, Type) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_CustomEvent_1::Type' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_CustomEvent_1, InIconType) == 0x000001, "Member 'WBP_Hud_Status_Face_modern_C_CustomEvent_1::InIconType' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_CustomEvent_0 final
{
public:
	EJackCharacter                                Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIFaceIcon                               InIconType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Hud_Status_Face_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Hud_Status_Face_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_CustomEvent_0, Type) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_CustomEvent_0::Type' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_CustomEvent_0, InIconType) == 0x000001, "Member 'WBP_Hud_Status_Face_modern_C_CustomEvent_0::InIconType' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.SetZoneFaceTexture
// 0x0060 (0x0060 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture final
{
public:
	EJackCharacter                                Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerSenaShortHair_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item3;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue3;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue4;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item4;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture) == 0x000008, "Wrong alignment on WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture) == 0x000060, "Wrong size on WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, Character) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::Character' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, Index_0) == 0x000004, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_GetAccessorMembers_ReturnValue) == 0x000010, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_IsPlayerSenaShortHair_ReturnValue) == 0x000018, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_IsPlayerSenaShortHair_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_Array_Get_Item2) == 0x000030, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_Array_Get_Item3) == 0x000038, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000040, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_GetDynamicMaterial_ReturnValue3) == 0x000048, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_GetDynamicMaterial_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_GetDynamicMaterial_ReturnValue4) == 0x000050, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_GetDynamicMaterial_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture, CallFunc_Array_Get_Item4) == 0x000058, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneFaceTexture::CallFunc_Array_Get_Item4' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.SetZoneVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_SetZoneVisibility final
{
public:
	bool                                          InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_SetZoneVisibility) == 0x000001, "Wrong alignment on WBP_Hud_Status_Face_modern_C_SetZoneVisibility");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_SetZoneVisibility) == 0x000001, "Wrong size on WBP_Hud_Status_Face_modern_C_SetZoneVisibility");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetZoneVisibility, InVisibility) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_SetZoneVisibility::InVisibility' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.SetFaceAnimation
// 0x0018 (0x0018 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_SetFaceAnimation final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       InAnimation;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_SetFaceAnimation) == 0x000008, "Wrong alignment on WBP_Hud_Status_Face_modern_C_SetFaceAnimation");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_SetFaceAnimation) == 0x000018, "Wrong size on WBP_Hud_Status_Face_modern_C_SetFaceAnimation");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetFaceAnimation, InVisibility) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_SetFaceAnimation::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetFaceAnimation, InAnimation) == 0x000008, "Member 'WBP_Hud_Status_Face_modern_C_SetFaceAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetFaceAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'WBP_Hud_Status_Face_modern_C_SetFaceAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.SetSenaHairStyle
// 0x0018 (0x0018 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_SetSenaHairStyle final
{
public:
	bool                                          IsShort;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUIFaceIcon                               IconType_0;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_SetSenaHairStyle) == 0x000008, "Wrong alignment on WBP_Hud_Status_Face_modern_C_SetSenaHairStyle");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_SetSenaHairStyle) == 0x000018, "Wrong size on WBP_Hud_Status_Face_modern_C_SetSenaHairStyle");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetSenaHairStyle, IsShort) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_SetSenaHairStyle::IsShort' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetSenaHairStyle, IconType_0) == 0x000001, "Member 'WBP_Hud_Status_Face_modern_C_SetSenaHairStyle::IconType_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetSenaHairStyle, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Hud_Status_Face_modern_C_SetSenaHairStyle::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetSenaHairStyle, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000010, "Member 'WBP_Hud_Status_Face_modern_C_SetSenaHairStyle::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Status_Face_modern.WBP_Hud_Status_Face_modern_C.SetFaceEffect
// 0x0003 (0x0003 - 0x0000)
struct WBP_Hud_Status_Face_modern_C_SetFaceEffect final
{
public:
	EJackUIFaceIcon                               IconType_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CharacterType;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Status_Face_modern_C_SetFaceEffect) == 0x000001, "Wrong alignment on WBP_Hud_Status_Face_modern_C_SetFaceEffect");
static_assert(sizeof(WBP_Hud_Status_Face_modern_C_SetFaceEffect) == 0x000003, "Wrong size on WBP_Hud_Status_Face_modern_C_SetFaceEffect");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetFaceEffect, IconType_0) == 0x000000, "Member 'WBP_Hud_Status_Face_modern_C_SetFaceEffect::IconType_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetFaceEffect, CharacterType) == 0x000001, "Member 'WBP_Hud_Status_Face_modern_C_SetFaceEffect::CharacterType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Face_modern_C_SetFaceEffect, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_Hud_Status_Face_modern_C_SetFaceEffect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

