#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_085_Steam2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_085_Steam2.WBP_Menu_Parts_085_Steam2_C.ExecuteUbergraph_WBP_Menu_Parts_085_Steam2
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2) == 0x000008, "Wrong alignment on WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2");
static_assert(sizeof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2) == 0x000038, "Wrong size on WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_Array_Add_ReturnValue2) == 0x00001C, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_Array_Add_ReturnValue3) == 0x000020, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_Array_Add_ReturnValue4) == 0x000024, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_Array_Add_ReturnValue5) == 0x000028, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_Array_Add_ReturnValue6) == 0x00002C, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2, CallFunc_SpawnSound2D_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_085_Steam2_C_ExecuteUbergraph_WBP_Menu_Parts_085_Steam2::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_085_Steam2.WBP_Menu_Parts_085_Steam2_C.AdjustItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Parts_085_Steam2_C_AdjustItem final
{
public:
	int32                                         LeavCount;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_085_Steam2_C_AdjustItem) == 0x000008, "Wrong alignment on WBP_Menu_Parts_085_Steam2_C_AdjustItem");
static_assert(sizeof(WBP_Menu_Parts_085_Steam2_C_AdjustItem) == 0x000030, "Wrong size on WBP_Menu_Parts_085_Steam2_C_AdjustItem");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, LeavCount) == 0x000000, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::LeavCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_Array_Length_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_085_Steam2_C_AdjustItem, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Parts_085_Steam2_C_AdjustItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

