#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Settei_001_Steam

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam
// 0x0190 (0x0190 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_000_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_000_Steam; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeyboardType                             Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_SlideTargetOrigin;                    // 0x00AC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MaxSlideTargetSize;                   // 0x00B4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MinSlideTargetSize;                   // 0x00BC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_002_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_002_Steam; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeyboardType                             CallFunc_SelectKeyboard_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeyboardType                             CallFunc_SelectKeyboard_ReturnValue2;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeyboardType                             CallFunc_GetSelectedKeyboard_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChangeKeyboard_ReturnValue;             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeyboardType                             CallFunc_SetSelectedKeyboard_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeyboardType                             CallFunc_SetDefaultKeyboard_ReturnValue;           // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam) == 0x000190, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_000_Steam) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_000_Steam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_struct_Variable) == 0x000038, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_byte_Variable) == 0x000049, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_int_Variable) == 0x00004C, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_int_Variable2) == 0x000050, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_int_Variable3) == 0x000054, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_int_Variable4) == 0x000058, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_int_Variable5) == 0x00005C, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_int_Variable6) == 0x000060, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, Temp_struct_Variable2) == 0x000068, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000088, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_WaitMessageEndFromBP_Result) == 0x000090, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_Event_bVisible) == 0x0000A8, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_Event_SlideTargetOrigin) == 0x0000AC, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_Event_SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_Event_MaxSlideTargetSize) == 0x0000B4, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_Event_MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_Event_MinSlideTargetSize) == 0x0000BC, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_Event_MinSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_EventTag) == 0x0000C8, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_InKeyType) == 0x0000D0, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_bIsPressed) == 0x0000D1, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_SwitchName_CmpSuccess) == 0x0000D2, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_SwitchEnum_CmpSuccess) == 0x0000D3, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetUMGManager_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetUMGManager_ReturnValue3) == 0x0000E8, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_002_Steam) == 0x0000F0, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_002_Steam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000100, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_SelectKeyboard_ReturnValue) == 0x000108, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_SelectKeyboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_SelectKeyboard_ReturnValue2) == 0x000109, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_SelectKeyboard_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000110, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetSelectedKeyboard_ReturnValue) == 0x000118, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetSelectedKeyboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_IsChangeKeyboard_ReturnValue) == 0x000119, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_IsChangeKeyboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_Select_Default) == 0x00011C, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_Sender) == 0x000120, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_CurrentTextID) == 0x000128, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_SelectDialogIndex) == 0x000130, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_Array_Get_Item) == 0x000138, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_SwitchInteger_CmpSuccess) == 0x000140, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000150, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_SetSelectedKeyboard_ReturnValue) == 0x000158, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_SetSelectedKeyboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_EventName) == 0x000160, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CustomEvent_InItemBase) == 0x000168, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x000170, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000178, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, CallFunc_SetDefaultKeyboard_ReturnValue) == 0x000179, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::CallFunc_SetDefaultKeyboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam, K2Node_CreateDelegate_OutputDelegate4) == 0x000180, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.ChangeKeyboardYN
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN) == 0x000018, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN, Sender) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_ChangeKeyboardYN::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.KeyEventDelegate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate) == 0x000001, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate) == 0x000002, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate, InKeyType) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate, bIsPressed) == 0x000001, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_KeyEventDelegate::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.SetDebugTargetSize
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlideTargetOrigin;                                 // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxSlideTargetSize;                                // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinSlideTargetSize;                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize) == 0x000004, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize) == 0x00001C, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize, bVisible) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize, SlideTargetOrigin) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize::SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize, MaxSlideTargetSize) == 0x00000C, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize::MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize, MinSlideTargetSize) == 0x000014, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetDebugTargetSize::MinSlideTargetSize' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.SetKeyboardTexture
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture final
{
public:
	EJackKeyboardType                             InKeyboardType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeyboardType                             Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture) == 0x000038, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, InKeyboardType) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::InKeyboardType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_int_Variable2) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_int_Variable3) == 0x00000C, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_int_Variable4) == 0x000010, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_int_Variable5) == 0x000014, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_int_Variable6) == 0x000018, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, Temp_byte_Variable) == 0x00001C, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, K2Node_Select_Default) == 0x000020, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture, CallFunc_Array_Get_Item2) == 0x000030, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetKeyboardTexture::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C.SetFocus000
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000 final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_000_Steam_C* K2Node_DynamicCast_AsWBP_Menu_Keyconfig_Settei_000_Steam; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000");
static_assert(sizeof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000) == 0x000020, "Wrong size on WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000008, "Member 'WBP_Menu_Keyconfig_Settei_001_Steam_C_SetFocus000::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
