#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Syuurenjou_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Syuurenjou_003_modern.WBP_Menu_Syuurenjou_003_modern_C
// 0x0060 (0x0490 - 0x0430)
class UWBP_Menu_Syuurenjou_003_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UWBP_Menu_Common_Button_000_modern_C*   CommonButton000;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HousyuuList;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts000_Title;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_059_modern_C*           Parts059_Pager;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_071_modern_C*           Parts071_00;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_071_modern_C*           Parts071_01;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_071_modern_C*           Parts071_02;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_071_modern_C*           Parts071_03;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnInFocus;                                         // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnInFocus__DelegateSignature();
	void ExecuteUbergraph_WBP_Menu_Syuurenjou_003_modern(int32 EntryPoint);
	void SetData(const TArray<class UJackUMGItemData*>& RewardItemDataList);
	void ItemIndexDelegate(int32 OutItemIndex);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void KeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void CustomEvent_0(class FName EventTag);
	void GetItemSyousaiItemIdList(TArray<class FName>* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Syuurenjou_003_modern_C">();
	}
	static class UWBP_Menu_Syuurenjou_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Syuurenjou_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Syuurenjou_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Syuurenjou_003_modern_C");
static_assert(sizeof(UWBP_Menu_Syuurenjou_003_modern_C) == 0x000490, "Wrong size on UWBP_Menu_Syuurenjou_003_modern_C");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, CommonButton000) == 0x000438, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::CommonButton000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, HousyuuList) == 0x000440, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::HousyuuList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, Parts000_Title) == 0x000448, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::Parts000_Title' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, Parts059_Pager) == 0x000450, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::Parts059_Pager' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, Parts071_00) == 0x000458, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::Parts071_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, Parts071_01) == 0x000460, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::Parts071_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, Parts071_02) == 0x000468, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::Parts071_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, Parts071_03) == 0x000470, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::Parts071_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, RootPanel) == 0x000478, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_003_modern_C, OnInFocus) == 0x000480, "Member 'UWBP_Menu_Syuurenjou_003_modern_C::OnInFocus' has a wrong offset!");

}

