#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Setumei_007_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemInBag_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountItemInBag_ReturnValue2;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_InItemSyousaiRef;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemInBag_ReturnValue3;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGShopItemSyousai*                K2Node_CustomEvent_InShopItemSyousaiRef;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0068(0x0018)()
	float                                         Temp_float_Variable;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_ItemSyousaiRef;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bValue;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInValue;                       // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLoaddedTextureFromId_ReturnValue;      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00CC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00D4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00DC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern) == 0x0000E8, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_CountItemInBag_ReturnValue) == 0x000004, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_CountItemInBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_CountItemInBag_ReturnValue2) == 0x00000C, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_CountItemInBag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000010, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_InItemSyousaiRef) == 0x000018, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_InItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_CountItemInBag_ReturnValue3) == 0x000028, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_CountItemInBag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x00002C, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_InResultCode) == 0x000038, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_InLoaddedObject) == 0x000040, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_InLoadInfo) == 0x000048, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_InShopItemSyousaiRef) == 0x000050, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_InShopItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000068, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, Temp_float_Variable) == 0x000080, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_ItemSyousaiRef) == 0x000088, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_bValue) == 0x000090, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_bValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000091, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000098, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_GetPosition_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000A8, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_CustomEvent_bInValue) == 0x0000BC, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_CustomEvent_bInValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, Temp_float_Variable2) == 0x0000C0, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_SetLoaddedTextureFromId_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_SetLoaddedTextureFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, Temp_bool_Variable) == 0x0000C5, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_MakeVector2D_ReturnValue) == 0x0000CC, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000D4, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000DC, "Member 'WBP_Menu_Common_Setumei_007_modern_C_ExecuteUbergraph_WBP_Menu_Common_Setumei_007_modern::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetEnableControl
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl final
{
public:
	bool                                          bInValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl) == 0x000001, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl) == 0x000001, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl, bInValue) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetEnableControl::bInValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetSellItemMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode) == 0x000001, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode) == 0x000001, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode, bValue) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSellItemMode::bValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetShopMenuDescription2
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2 final
{
public:
	class UJackUMGItemSyousai*                    ItemSyousaiRef_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2, ItemSyousaiRef_0) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription2::ItemSyousaiRef_0' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetShopMenuDescription1
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1 final
{
public:
	class UJackUMGShopItemSyousai*                InShopItemSyousaiRef;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1, InShopItemSyousaiRef) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetShopMenuDescription1::InShopItemSyousaiRef' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.LoaddedMenuItemIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon) == 0x000018, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon, InResultCode) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Common_Setumei_007_modern_C_LoaddedMenuItemIcon::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetDouguMenuDescription1
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1 final
{
public:
	class UJackUMGItemSyousai*                    InItemSyousaiRef;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1, InItemSyousaiRef) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetDouguMenuDescription1::InItemSyousaiRef' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetSetumei
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetSetumei final
{
public:
	class FText                                   InCategory;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDescription;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   InCountCaption;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCountValue;                                      // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InCountUnit;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0068(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetSetumei");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei) == 0x000080, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetSetumei");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, InCategory) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::InCategory' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, InDescription) == 0x000018, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::InDescription' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, InCountCaption) == 0x000030, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::InCountCaption' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, InCountValue) == 0x000038, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::InCountValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, InCountUnit) == 0x000040, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::InCountUnit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, CallFunc_NotEqual_NameName_ReturnValue) == 0x000048, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, CallFunc_GetUMGManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetSetumei, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000068, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetSetumei::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetWindowFrameWidth
// 0x002C (0x002C - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth final
{
public:
	float                                         FrameWidth;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FrameSize;                                         // 0x0004(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth) == 0x000004, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth) == 0x00002C, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, FrameWidth) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::FrameWidth' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, FrameSize) == 0x000004, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::FrameSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, CallFunc_GetPanelSize_ReturnValue) == 0x000014, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, CallFunc_BreakVector2D_X) == 0x00001C, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth, CallFunc_MakeVector2D_ReturnValue2) == 0x000024, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetWindowFrameWidth::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.CancelLoadTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture) == 0x000008, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_CancelLoadTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Common_Setumei_007_modern.WBP_Menu_Common_Setumei_007_modern_C.SetItemSyousai
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai final
{
public:
	class UJackUMGItemSyousai*                    InItemSyousaiRef;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCountValue;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai) == 0x000008, "Wrong alignment on WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai");
static_assert(sizeof(WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai) == 0x000010, "Wrong size on WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai, InItemSyousaiRef) == 0x000000, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai::InItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai, InCountValue) == 0x000008, "Member 'WBP_Menu_Common_Setumei_007_modern_C_SetItemSyousai::InCountValue' has a wrong offset!");

}

