#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tutorial_Window_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern
// 0x0200 (0x0200 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGamePaused_ReturnValue2;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGTabiNoKokoroePageData          K2Node_CustomEvent_Key2;                           // 0x0050(0x0050)()
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGTabiNoKokoroePageData          CallFunc_Array_Get_Item;                           // 0x00B0(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Key;                                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackUMGTabiNoKokoroePageData>  CallFunc_GetTabiNoKokoroePageDataList_OutPageDataList; // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	TScriptInterface<class IBP_IF_Menu_Tutorial_C> K2Node_Event_EventListener;                        // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Key;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsAnimation;                   // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsLoading;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsLoading)>              K2Node_CreateDelegate_OutputDelegate3;             // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue2;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue3;                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGTabiNoKokoroePageData          CallFunc_Array_Get_Item2;                          // 0x01B0(0x0050)()
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern) == 0x000200, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_EventTag) == 0x000030, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_InKeyType) == 0x000039, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_bIsPressed) == 0x00003A, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00003B, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_SetGamePaused_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_Event_Animation) == 0x000040, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000049, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_SetGamePaused_ReturnValue2) == 0x00004A, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_SetGamePaused_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_Key2) == 0x000050, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_Key2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetAccessorCommon_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x0000AC, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Array_Length_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x000104, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000108, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x00010C, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_Event_Key) == 0x000110, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_Event_Key' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetTabiNoKokoroePageDataList_OutPageDataList) == 0x000120, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetTabiNoKokoroePageDataList_OutPageDataList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_Event_EventListener) == 0x000130, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_Event_EventListener' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000140, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_Key) == 0x000148, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_BooleanOR_ReturnValue) == 0x000150, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, Temp_bool_Variable) == 0x000151, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_bIsAnimation) == 0x000152, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_bIsAnimation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_Select_Default) == 0x000158, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CustomEvent_bIsLoading) == 0x000160, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CustomEvent_bIsLoading' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_BooleanOR_ReturnValue2) == 0x000161, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Array_Length_ReturnValue3) == 0x000164, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000168, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000170, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000180, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetSoundSet_ReturnValue) == 0x000188, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000190, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetSoundSet_ReturnValue2) == 0x000198, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetSoundSet_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0001A0, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_GetSoundSet_ReturnValue3) == 0x0001A8, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_GetSoundSet_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern, CallFunc_Array_Get_Item2) == 0x0001B0, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Tutorial_Window_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.SetIsLoading
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading final
{
public:
	bool                                          bIsLoading_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading) == 0x000001, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading) == 0x000001, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading, bIsLoading_0) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_SetIsLoading::bIsLoading_0' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.SetIsAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation final
{
public:
	bool                                          bIsAnimation_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation) == 0x000001, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation) == 0x000001, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation, bIsAnimation_0) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_SetIsAnimation::bIsAnimation_0' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.PlayInAnim
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim) == 0x000008, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim, Key) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_PlayInAnim::Key' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.SetCloseEventListener
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener final
{
public:
	TScriptInterface<class IBP_IF_Menu_Tutorial_C> EventListener;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener) == 0x000010, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener, EventListener) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_SetCloseEventListener::EventListener' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.SetMainData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tutorial_Window_000_modern_C_SetMainData final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_SetMainData) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_SetMainData");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_SetMainData) == 0x000008, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_SetMainData");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_SetMainData, Key) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_SetMainData::Key' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.SetPageData
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_SetPageData final
{
public:
	struct FJackUMGTabiNoKokoroePageData          Key;                                               // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_SetPageData) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_SetPageData");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_SetPageData) == 0x000050, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_SetPageData");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_SetPageData, Key) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_SetPageData::Key' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.OnWidgetKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_OnWidgetKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Tutorial_Window_000_modern.WBP_Menu_Tutorial_Window_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Tutorial_Window_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

}

