#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_104_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_104_modern.WBP_Menu_Dougu_Syousai_104_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_NewVar_0;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern) == 0x000048, "Wrong size on WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_CustomEvent_InEventTag) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_CustomEvent_InObject) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_CustomEvent_NewVar_0) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_CustomEvent_NewVar_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_SwitchName_CmpSuccess) == 0x000031, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000032, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_104_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_104_modern.WBP_Menu_Dougu_Syousai_104_modern_C.DispItemFromSyousaiRef
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef final
{
public:
	class UJackUMGItemSyousai*                    NewVar_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong size on WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef, NewVar_0) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_DispItemFromSyousaiRef::NewVar_0' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_104_modern.WBP_Menu_Dougu_Syousai_104_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_104_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

}

