#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Parts_000_Steam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Keyconfig_Parts_000_Steam.WBP_Menu_Keyconfig_Parts_000_Steam_C.ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0018(0x0050)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam");
static_assert(sizeof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam) == 0x000070, "Wrong size on WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam, K2Node_CustomEvent_ItemContainer) == 0x000018, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam, K2Node_SwitchName_CmpSuccess) == 0x000068, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam, CallFunc_Conv_IntToByte_ReturnValue) == 0x000069, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam, CallFunc_GetValidValue_ReturnValue) == 0x00006A, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_ExecuteUbergraph_WBP_Menu_Keyconfig_Parts_000_Steam::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Parts_000_Steam.WBP_Menu_Keyconfig_Parts_000_Steam_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Parts_000_Steam.WBP_Menu_Keyconfig_Parts_000_Steam_C.SetKeyListColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUMGPresetColor_ReturnValue;            // 0x0010(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUMGPresetColor_ReturnValue2;           // 0x0020(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor");
static_assert(sizeof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor) == 0x000030, "Wrong size on WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor, Enable) == 0x000000, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor::Enable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor, CallFunc_GetUMGPresetColor_ReturnValue) == 0x000010, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor::CallFunc_GetUMGPresetColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor, CallFunc_GetUMGPresetColor_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetKeyListColor::CallFunc_GetUMGPresetColor_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Parts_000_Steam.WBP_Menu_Keyconfig_Parts_000_Steam_C.SetTextureAndCaption
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption");
static_assert(sizeof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption) == 0x000020, "Wrong size on WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption, InTexture) == 0x000000, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption::InTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption, InText) == 0x000008, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetTextureAndCaption::InText' has a wrong offset!");

// Function WBP_Menu_Keyconfig_Parts_000_Steam.WBP_Menu_Keyconfig_Parts_000_Steam_C.SetButtonTexture
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture) == 0x000008, "Wrong alignment on WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture");
static_assert(sizeof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture) == 0x000010, "Wrong size on WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture, InTexture) == 0x000000, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture::InTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000008, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x00000D, "Member 'WBP_Menu_Keyconfig_Parts_000_Steam_C_SetButtonTexture::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");

}

