#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_077_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_077_modern.WBP_Menu_Parts_077_modern_C.ExecuteUbergraph_WBP_Menu_Parts_077_modern
// 0x0098 (0x0098 - 0x0000)
struct WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_MessageScript;                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ApplyTextLabelFromExternal_ReturnValue;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array2;                           // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern");
static_assert(sizeof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern) == 0x000098, "Wrong size on WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_GetPanelSize_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, K2Node_CustomEvent_MessageScript) == 0x000040, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::K2Node_CustomEvent_MessageScript' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000068, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_Array_Length_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_ApplyTextLabelFromExternal_ReturnValue) == 0x000078, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_ApplyTextLabelFromExternal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern, K2Node_MakeArray_Array2) == 0x000088, "Member 'WBP_Menu_Parts_077_modern_C_ExecuteUbergraph_WBP_Menu_Parts_077_modern::K2Node_MakeArray_Array2' has a wrong offset!");

// Function WBP_Menu_Parts_077_modern.WBP_Menu_Parts_077_modern_C.SetMessageScript
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Parts_077_modern_C_SetMessageScript final
{
public:
	class FString                                 MessageScript;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_077_modern_C_SetMessageScript) == 0x000008, "Wrong alignment on WBP_Menu_Parts_077_modern_C_SetMessageScript");
static_assert(sizeof(WBP_Menu_Parts_077_modern_C_SetMessageScript) == 0x000010, "Wrong size on WBP_Menu_Parts_077_modern_C_SetMessageScript");
static_assert(offsetof(WBP_Menu_Parts_077_modern_C_SetMessageScript, MessageScript) == 0x000000, "Member 'WBP_Menu_Parts_077_modern_C_SetMessageScript::MessageScript' has a wrong offset!");

}

