#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.ExecuteUbergraph_WBP_Menu_Parts_001_modern
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBackgroundColor                       Temp_byte_Variable7;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable8;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable9;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable10;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable11;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBackgroundColor                       Temp_byte_Variable12;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable13;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable14;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable15;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable16;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable17;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable18;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0030(0x0050)()
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGTuyosaRenkeiData*               K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable19;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGSoubiData                      K2Node_CustomEvent_Data;                           // 0x00B0(0x0070)()
	EJackUMGBackgroundColor                       K2Node_CustomEvent_BgType;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select2_Default;                            // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_CaptionText;                    // 0x0128(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_IconTexture;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_InColorType2;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select3_Default;                            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select4_Default;                            // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select6_Default;                            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_Select7_Default;                            // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_ItemSyousaiData;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable7;                               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGTuyosaRenkeiData*               K2Node_CustomEvent_RenkeiData;                     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array4;                           // 0x01A0(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              K2Node_Select8_Default;                            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B8(0x0018)()
	struct FJackUMGSoubiData                      K2Node_CustomEvent_JackUMGSoubiData;               // 0x01D0(0x0070)(ConstParm)
	EJackUMGTextColorSet                          K2Node_CustomEvent_InColorType;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0258(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0270(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x0288(0x0018)()
	class FText                                   K2Node_Select9_Default;                            // 0x02A0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue4;                      // 0x02B8(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select10_Default;                           // 0x02D8(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern) == 0x0002F0, "Wrong size on WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable) == 0x000018, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable2) == 0x000019, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable) == 0x00001A, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable3) == 0x00001B, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable4) == 0x00001C, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable2) == 0x00001D, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable5) == 0x00001E, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable6) == 0x00001F, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable7) == 0x000020, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable8) == 0x000021, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable9) == 0x000022, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable10) == 0x000023, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable11) == 0x000024, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable12) == 0x000025, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable13) == 0x000026, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable14) == 0x000027, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable15) == 0x000028, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable3) == 0x000029, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable16) == 0x00002A, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable17) == 0x00002B, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable4) == 0x00002C, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable5) == 0x00002D, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable18) == 0x00002E, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_ItemContainer) == 0x000030, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_EventTag) == 0x000080, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data) == 0x000088, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_DynamicCast_AsJack_UMGTuyosa_Renkei_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000091, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000098, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_DynamicCast_bSuccess2) == 0x0000A0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000A1, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000A2, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_GetValidValue_ReturnValue) == 0x0000A3, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select_Default) == 0x0000A4, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0000A5, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000A6, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable6) == 0x0000A7, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_byte_Variable19) == 0x0000A8, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_Data) == 0x0000B0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_BgType) == 0x000120, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_BgType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select2_Default) == 0x000121, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_CaptionText) == 0x000128, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_CaptionText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_IconTexture) == 0x000140, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_InColorType2) == 0x000148, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_InColorType2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select3_Default) == 0x000149, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_IsValid_ReturnValue) == 0x00014A, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select4_Default) == 0x00014B, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select5_Default) == 0x00014C, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Less_IntInt_ReturnValue) == 0x00014D, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_int_Variable) == 0x000150, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select6_Default) == 0x000154, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select7_Default) == 0x000155, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_ItemSyousaiData) == 0x000158, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_ItemSyousaiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_MakeArray_Array2) == 0x000160, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_MakeArray_Array3) == 0x000170, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, Temp_bool_Variable7) == 0x000180, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000188, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_RenkeiData) == 0x000198, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_RenkeiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_MakeArray_Array4) == 0x0001A0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select8_Default) == 0x0001B0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select8_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B8, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_JackUMGSoubiData) == 0x0001D0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_JackUMGSoubiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CustomEvent_InColorType) == 0x000240, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CustomEvent_InColorType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000248, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Format_ReturnValue) == 0x000258, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Format_ReturnValue2) == 0x000270, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Format_ReturnValue3) == 0x000288, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Format_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select9_Default) == 0x0002A0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select9_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Format_ReturnValue4) == 0x0002B8, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Format_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0002D0, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0002D1, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern, K2Node_Select10_Default) == 0x0002D8, "Member 'WBP_Menu_Parts_001_modern_C_ExecuteUbergraph_WBP_Menu_Parts_001_modern::K2Node_Select10_Default' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetSoubiDataImpl
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl final
{
public:
	struct FJackUMGSoubiData                      JackUMGSoubiData;                                  // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EJackUMGTextColorSet                          InColorType;                                       // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl) == 0x000078, "Wrong size on WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl, JackUMGSoubiData) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl::JackUMGSoubiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl, InColorType) == 0x000070, "Member 'WBP_Menu_Parts_001_modern_C_SetSoubiDataImpl::InColorType' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetRenkeiData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetRenkeiData final
{
public:
	class UJackUMGTuyosaRenkeiData*               RenkeiData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetRenkeiData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetRenkeiData");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetRenkeiData) == 0x000008, "Wrong size on WBP_Menu_Parts_001_modern_C_SetRenkeiData");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetRenkeiData, RenkeiData) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetRenkeiData::RenkeiData' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetItemSyousaiData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetItemSyousaiData final
{
public:
	class UJackUMGItemSyousai*                    ItemSyousaiData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetItemSyousaiData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetItemSyousaiData");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetItemSyousaiData) == 0x000008, "Wrong size on WBP_Menu_Parts_001_modern_C_SetItemSyousaiData");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetItemSyousaiData, ItemSyousaiData) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetItemSyousaiData::ItemSyousaiData' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetData final
{
public:
	class FText                                   CaptionText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             IconTexture_0;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          InColorType;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetData) == 0x000028, "Wrong size on WBP_Menu_Parts_001_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetData, CaptionText_0) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetData::CaptionText_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetData, IconTexture_0) == 0x000018, "Member 'WBP_Menu_Parts_001_modern_C_SetData::IconTexture_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetData, InColorType) == 0x000020, "Member 'WBP_Menu_Parts_001_modern_C_SetData::InColorType' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetSoubiData
// 0x0078 (0x0078 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetSoubiData final
{
public:
	struct FJackUMGSoubiData                      Data;                                              // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	EJackUMGBackgroundColor                       BgType;                                            // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetSoubiData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetSoubiData");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetSoubiData) == 0x000078, "Wrong size on WBP_Menu_Parts_001_modern_C_SetSoubiData");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetSoubiData, Data) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetSoubiData::Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetSoubiData, BgType) == 0x000070, "Member 'WBP_Menu_Parts_001_modern_C_SetSoubiData::BgType' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_001_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.UpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_UpdateContainerDelegate::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetCharacterSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetCharacterSpacing final
{
public:
	float                                         InCharacterSpacing;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetCharacterSpacing) == 0x000004, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetCharacterSpacing");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetCharacterSpacing) == 0x000004, "Wrong size on WBP_Menu_Parts_001_modern_C_SetCharacterSpacing");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetCharacterSpacing, InCharacterSpacing) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetCharacterSpacing::InCharacterSpacing' has a wrong offset!");

// Function WBP_Menu_Parts_001_modern.WBP_Menu_Parts_001_modern_C.SetTextColor
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_001_modern_C_SetTextColor final
{
public:
	EJackUMGTextColorSet                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_001_modern_C_SetTextColor) == 0x000001, "Wrong alignment on WBP_Menu_Parts_001_modern_C_SetTextColor");
static_assert(sizeof(WBP_Menu_Parts_001_modern_C_SetTextColor) == 0x000001, "Wrong size on WBP_Menu_Parts_001_modern_C_SetTextColor");
static_assert(offsetof(WBP_Menu_Parts_001_modern_C_SetTextColor, NewParam) == 0x000000, "Member 'WBP_Menu_Parts_001_modern_C_SetTextColor::NewParam' has a wrong offset!");

}

