#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Question_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Question_000.WBP_Hud_Question_000_C
// 0x0050 (0x0220 - 0x01D0)
class UWBP_Hud_Question_000_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       In;                                                // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Question_New;                                      // 0x01E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture*>                       T_Miss;                                            // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UTexture*>                       T_Balloon;                                         // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Number_Col;                                        // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Balloon_0_Col;                                     // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Balloon_1_Col;                                     // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Miss_Col;                                          // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NumberOffset;                                      // 0x0218(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Hud_Question_000(int32 EntryPoint);
	void InitData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Question_000_C">();
	}
	static class UWBP_Hud_Question_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Question_000_C>();
	}
};
static_assert(alignof(UWBP_Hud_Question_000_C) == 0x000008, "Wrong alignment on UWBP_Hud_Question_000_C");
static_assert(sizeof(UWBP_Hud_Question_000_C) == 0x000220, "Wrong size on UWBP_Hud_Question_000_C");
static_assert(offsetof(UWBP_Hud_Question_000_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Hud_Question_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, In) == 0x0001D8, "Member 'UWBP_Hud_Question_000_C::In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, Question_New) == 0x0001E0, "Member 'UWBP_Hud_Question_000_C::Question_New' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, T_Miss) == 0x0001E8, "Member 'UWBP_Hud_Question_000_C::T_Miss' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, T_Balloon) == 0x0001F8, "Member 'UWBP_Hud_Question_000_C::T_Balloon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, Number_Col) == 0x000208, "Member 'UWBP_Hud_Question_000_C::Number_Col' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, Balloon_0_Col) == 0x00020C, "Member 'UWBP_Hud_Question_000_C::Balloon_0_Col' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, Balloon_1_Col) == 0x000210, "Member 'UWBP_Hud_Question_000_C::Balloon_1_Col' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, Miss_Col) == 0x000214, "Member 'UWBP_Hud_Question_000_C::Miss_Col' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Question_000_C, NumberOffset) == 0x000218, "Member 'UWBP_Hud_Question_000_C::NumberOffset' has a wrong offset!");

}

