#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_002_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.ExecuteUbergraph_WBP_Menu_Parts_002_modern
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDigit_Digit;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDigit_Digit2;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Numerator2;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Denominator2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0048(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0060(0x0018)()
	bool                                          K2Node_CustomEvent_bIsRight;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Input;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Numerator;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Denominator;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue3;             // 0x00A0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue4;             // 0x00C0(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern) == 0x0000E0, "Wrong size on WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, Temp_byte_Variable2) == 0x000018, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, Temp_bool_Variable) == 0x000019, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, Temp_byte_Variable3) == 0x00001A, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, Temp_byte_Variable4) == 0x00001B, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetDigit_Digit) == 0x00001C, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetDigit_Digit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetDigit_Digit2) == 0x000020, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetDigit_Digit2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_Numerator2) == 0x000034, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_Numerator2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_Denominator2) == 0x000038, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_Denominator2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x000048, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000060, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_bIsRight) == 0x000078, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_bIsRight' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_Input) == 0x00007C, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_Input' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000080, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_Numerator) == 0x000084, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_Numerator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_CustomEvent_Denominator) == 0x000088, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_CustomEvent_Denominator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000090, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000098, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetAsciiDecText_ReturnValue3) == 0x0000A0, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetAsciiDecText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, CallFunc_GetAsciiDecText_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::CallFunc_GetAsciiDecText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, Temp_bool_Variable2) == 0x0000D8, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern, K2Node_Select2_Default) == 0x0000D9, "Member 'WBP_Menu_Parts_002_modern_C_ExecuteUbergraph_WBP_Menu_Parts_002_modern::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.SetPager
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_002_modern_C_SetPager final
{
public:
	int32                                         Numerator;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Denominator;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_SetPager) == 0x000004, "Wrong alignment on WBP_Menu_Parts_002_modern_C_SetPager");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_SetPager) == 0x000008, "Wrong size on WBP_Menu_Parts_002_modern_C_SetPager");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_SetPager, Numerator) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_SetPager::Numerator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_SetPager, Denominator) == 0x000004, "Member 'WBP_Menu_Parts_002_modern_C_SetPager::Denominator' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.PlayArrowAnimAtInputValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue final
{
public:
	int32                                         Input;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue) == 0x000004, "Wrong alignment on WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue) == 0x000004, "Wrong size on WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue, Input) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_PlayArrowAnimAtInputValue::Input' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.PlayArrowAnimation
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_002_modern_C_PlayArrowAnimation final
{
public:
	bool                                          bIsRight;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_PlayArrowAnimation) == 0x000001, "Wrong alignment on WBP_Menu_Parts_002_modern_C_PlayArrowAnimation");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_PlayArrowAnimation) == 0x000001, "Wrong size on WBP_Menu_Parts_002_modern_C_PlayArrowAnimation");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_PlayArrowAnimation, bIsRight) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_PlayArrowAnimation::bIsRight' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.SetNumber
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_002_modern_C_SetNumber final
{
public:
	int32                                         Numerator;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Denominator;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_SetNumber) == 0x000004, "Wrong alignment on WBP_Menu_Parts_002_modern_C_SetNumber");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_SetNumber) == 0x000008, "Wrong size on WBP_Menu_Parts_002_modern_C_SetNumber");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_SetNumber, Numerator) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_SetNumber::Numerator' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_SetNumber, Denominator) == 0x000004, "Member 'WBP_Menu_Parts_002_modern_C_SetNumber::Denominator' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_002_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Parts_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.Setup
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_002_modern_C_Setup final
{
public:
	TArray<struct FVector2D>                      NewLocalVar_0;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item2;                          // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item3;                          // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item4;                          // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item5;                          // 0x0044(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_Setup) == 0x000008, "Wrong alignment on WBP_Menu_Parts_002_modern_C_Setup");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_Setup) == 0x000050, "Wrong size on WBP_Menu_Parts_002_modern_C_Setup");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, NewLocalVar_0) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_Setup::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_Menu_Parts_002_modern_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Parts_002_modern_C_Setup::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_Menu_Parts_002_modern_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, CallFunc_Array_Get_Item2) == 0x00002C, "Member 'WBP_Menu_Parts_002_modern_C_Setup::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, CallFunc_Array_Get_Item3) == 0x000034, "Member 'WBP_Menu_Parts_002_modern_C_Setup::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, CallFunc_Array_Get_Item4) == 0x00003C, "Member 'WBP_Menu_Parts_002_modern_C_Setup::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_Setup, CallFunc_Array_Get_Item5) == 0x000044, "Member 'WBP_Menu_Parts_002_modern_C_Setup::CallFunc_Array_Get_Item5' has a wrong offset!");

// Function WBP_Menu_Parts_002_modern.WBP_Menu_Parts_002_modern_C.GetDigit
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_Parts_002_modern_C_GetDigit final
{
public:
	int32                                         InVar;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Digit;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempVar;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_002_modern_C_GetDigit) == 0x000004, "Wrong alignment on WBP_Menu_Parts_002_modern_C_GetDigit");
static_assert(sizeof(WBP_Menu_Parts_002_modern_C_GetDigit) == 0x00001C, "Wrong size on WBP_Menu_Parts_002_modern_C_GetDigit");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, InVar) == 0x000000, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::InVar' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, Digit) == 0x000004, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::Digit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, Count) == 0x000008, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::Count' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, TempVar) == 0x00000C, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::TempVar' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, CallFunc_Divide_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_002_modern_C_GetDigit, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_002_modern_C_GetDigit::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

