#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_019

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_019.WBP_Menu_Parts_019_C.ExecuteUbergraph_WBP_Menu_Parts_019
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0020(0x0050)()
};
static_assert(alignof(WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019) == 0x000008, "Wrong alignment on WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019");
static_assert(sizeof(WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019) == 0x000070, "Wrong size on WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019");
static_assert(offsetof(WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019, K2Node_CustomEvent_ItemContainer) == 0x000020, "Member 'WBP_Menu_Parts_019_C_ExecuteUbergraph_WBP_Menu_Parts_019::K2Node_CustomEvent_ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_019.WBP_Menu_Parts_019_C.CustomEvent_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_019_C_CustomEvent_0 final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_019_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Parts_019_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Parts_019_C_CustomEvent_0) == 0x000050, "Wrong size on WBP_Menu_Parts_019_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Parts_019_C_CustomEvent_0, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_019_C_CustomEvent_0::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_019.WBP_Menu_Parts_019_C.SetButtonAndCaption
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Parts_019_C_SetButtonAndCaption final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCommonButtonIcon_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_019_C_SetButtonAndCaption) == 0x000008, "Wrong alignment on WBP_Menu_Parts_019_C_SetButtonAndCaption");
static_assert(sizeof(WBP_Menu_Parts_019_C_SetButtonAndCaption) == 0x000018, "Wrong size on WBP_Menu_Parts_019_C_SetButtonAndCaption");
static_assert(offsetof(WBP_Menu_Parts_019_C_SetButtonAndCaption, InKeyType) == 0x000000, "Member 'WBP_Menu_Parts_019_C_SetButtonAndCaption::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_019_C_SetButtonAndCaption, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_019_C_SetButtonAndCaption::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_019_C_SetButtonAndCaption, CallFunc_GetCommonButtonIcon_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_019_C_SetButtonAndCaption::CallFunc_GetCommonButtonIcon_ReturnValue' has a wrong offset!");

}

