#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_Command_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C.ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNigeruEnable_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSibariPlayFlag_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableIrekae_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UJackUMGItemData*>               CallFunc_GetBattleSakusenCommandList_ReturnValue;  // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Sakusen_Member_Change_Window_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Sakusen_Member_Change_Window_000_Modern; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSyuurenjou_ReturnValue;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array2;                           // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern");
static_assert(sizeof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern) == 0x0001A8, "Wrong size on WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, Temp_struct_Variable2) == 0x000018, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, Temp_struct_Variable3) == 0x000038, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, Temp_struct_Variable4) == 0x000048, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetBattleManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_IsNigeruEnable_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_IsNigeruEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000070, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000080, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_OpenMenu_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000098, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_CustomEvent_EventName) == 0x0000A0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_CustomEvent_InItemBase) == 0x0000A8, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_SwitchName_CmpSuccess) == 0x0000B4, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000B5, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_CustomEvent_EventTag) == 0x0000B8, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_SwitchName3_CmpSuccess) == 0x0000C8, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetSoundSet_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetSibariManager_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_IsSibariPlayFlag_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_IsSibariPlayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_IsEnableIrekae_ReturnValue) == 0x0000E9, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_IsEnableIrekae_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0000F0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000F8, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetBattleSakusenCommandList_ReturnValue) == 0x000108, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetBattleSakusenCommandList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000118, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000120, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000128, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000130, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_DynamicCast_AsWBP_Menu_Sakusen_Member_Change_Window_000_Modern) == 0x000138, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_DynamicCast_AsWBP_Menu_Sakusen_Member_Change_Window_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, Temp_struct_Variable5) == 0x000148, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x000158, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_IsSyuurenjou_ReturnValue) == 0x000160, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_IsSyuurenjou_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_MakeArray_Array) == 0x000168, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000178, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, K2Node_MakeArray_Array2) == 0x000180, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000190, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000198, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x0001A0, "Member 'WBP_Menu_Battle_Command_003_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Command_003_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_Command_003_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_Command_003_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Command_003_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_003_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_Command_003_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_Command_003_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_Command_003_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_Command_003_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C.SetVisibilityWindow
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow) == 0x000001, "Wrong alignment on WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow");
static_assert(sizeof(WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow) == 0x000001, "Wrong size on WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow, IsVisible_0) == 0x000000, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetVisibilityWindow::IsVisible_0' has a wrong offset!");

// Function WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C.SetIrekaeTextColor
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           PartsIrekae;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSyuurenjou_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackCharacter>                        CallFunc_GetFriendJoinedAfterList_ReturnValue;     // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Parts_000_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor");
static_assert(sizeof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor) == 0x000050, "Wrong size on WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, PartsIrekae) == 0x000000, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::PartsIrekae' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_IsSyuurenjou_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_IsSyuurenjou_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_GetItemFromTextId_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_GetItemFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_GetFriendJoinedAfterList_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_GetFriendJoinedAfterList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern) == 0x000038, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetIrekaeTextColor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_Command_003_modern.WBP_Menu_Battle_Command_003_modern_C.SetNigeruTextColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           PartsNigeru;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNigeruEnable_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor");
static_assert(sizeof(WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor) == 0x000030, "Wrong size on WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor, PartsNigeru) == 0x000000, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor::PartsNigeru' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor, CallFunc_GetItemFromTextId_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_Command_003_modern_C_SetNigeruTextColor::CallFunc_GetItemFromTextId_ReturnValue' has a wrong offset!");
