#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_072_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_072_modern.WBP_Menu_Parts_072_modern_C.ExecuteUbergraph_WBP_Menu_Parts_072_modern
// 0x0060 (0x0060 - 0x0000)
struct WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_TextID;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Caption;                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetUMGMenuStringFromTextId_ReturnValue;   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ApplyTextLabelFromExternal_ReturnValue;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern");
static_assert(sizeof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern) == 0x000060, "Wrong size on WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, K2Node_CustomEvent_TextID) == 0x000018, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::K2Node_CustomEvent_TextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, K2Node_CustomEvent_Caption) == 0x000020, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::K2Node_CustomEvent_Caption' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, CallFunc_GetUMGMenuStringFromTextId_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::CallFunc_GetUMGMenuStringFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000050, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern, CallFunc_ApplyTextLabelFromExternal_ReturnValue) == 0x000058, "Member 'WBP_Menu_Parts_072_modern_C_ExecuteUbergraph_WBP_Menu_Parts_072_modern::CallFunc_ApplyTextLabelFromExternal_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_072_modern.WBP_Menu_Parts_072_modern_C.SetCaptionData
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Parts_072_modern_C_SetCaptionData final
{
public:
	class FString                                 Caption;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_072_modern_C_SetCaptionData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_072_modern_C_SetCaptionData");
static_assert(sizeof(WBP_Menu_Parts_072_modern_C_SetCaptionData) == 0x000010, "Wrong size on WBP_Menu_Parts_072_modern_C_SetCaptionData");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetCaptionData, Caption) == 0x000000, "Member 'WBP_Menu_Parts_072_modern_C_SetCaptionData::Caption' has a wrong offset!");

// Function WBP_Menu_Parts_072_modern.WBP_Menu_Parts_072_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_072_modern_C_SetData final
{
public:
	class FName                                   TextID_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_072_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_072_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_072_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Parts_072_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetData, TextID_0) == 0x000000, "Member 'WBP_Menu_Parts_072_modern_C_SetData::TextID_0' has a wrong offset!");

// Function WBP_Menu_Parts_072_modern.WBP_Menu_Parts_072_modern_C.SetTopPosition
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Parts_072_modern_C_SetTopPosition final
{
public:
	float                                         Position_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_072_modern_C_SetTopPosition) == 0x000008, "Wrong alignment on WBP_Menu_Parts_072_modern_C_SetTopPosition");
static_assert(sizeof(WBP_Menu_Parts_072_modern_C_SetTopPosition) == 0x000018, "Wrong size on WBP_Menu_Parts_072_modern_C_SetTopPosition");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetTopPosition, Position_0) == 0x000000, "Member 'WBP_Menu_Parts_072_modern_C_SetTopPosition::Position_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetTopPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'WBP_Menu_Parts_072_modern_C_SetTopPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetTopPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_072_modern_C_SetTopPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_072_modern.WBP_Menu_Parts_072_modern_C.SetPartsList
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Menu_Parts_072_modern_C_SetPartsList final
{
public:
	TArray<class UTextBlock*>                     InTextBlockList;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UImage*>                         InImageList;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue;             // 0x0050(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BitShiftRight_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue2;           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x006C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item2;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue2;            // 0x0084(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0098(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_072_modern_C_SetPartsList) == 0x000008, "Wrong alignment on WBP_Menu_Parts_072_modern_C_SetPartsList");
static_assert(sizeof(WBP_Menu_Parts_072_modern_C_SetPartsList) == 0x0000A0, "Wrong size on WBP_Menu_Parts_072_modern_C_SetPartsList");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, InTextBlockList) == 0x000000, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::InTextBlockList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, InImageList) == 0x000010, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::InImageList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000028, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, Temp_int_Array_Index_Variable2) == 0x00003C, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, Temp_int_Loop_Counter_Variable2) == 0x000040, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_GetPanelPosition_ReturnValue) == 0x000050, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_GetPanelPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Add_IntInt_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_BreakVector2D_X) == 0x00005C, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_BreakVector2D_Y) == 0x000060, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_BitShiftRight_ReturnValue) == 0x000064, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_BitShiftRight_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Multiply_IntFloat_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Multiply_IntFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_MakeVector2D_ReturnValue) == 0x00006C, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Array_Get_Item2) == 0x000078, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Array_Length_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_GetPanelPosition_ReturnValue2) == 0x000084, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_GetPanelPosition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_Less_IntInt_ReturnValue2) == 0x00008C, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_BreakVector2D_X2) == 0x000090, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_BreakVector2D_Y2) == 0x000094, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_072_modern_C_SetPartsList, CallFunc_MakeVector2D_ReturnValue2) == 0x000098, "Member 'WBP_Menu_Parts_072_modern_C_SetPartsList::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");

}

