#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_203_Icon

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_203_Icon.WBP_Menu_Dougu_Syousai_203_Icon_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                K2Node_CustomEvent_InputPin;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon) == 0x000020, "Wrong size on WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon, K2Node_CustomEvent_InputPin) == 0x000004, "Member 'WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon, CallFunc_GetAccessorMembers_ReturnValue) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_203_Icon_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_203_Icon::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_203_Icon.WBP_Menu_Dougu_Syousai_203_Icon_C.SetCharacterType
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType final
{
public:
	EJackCharacter                                InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType) == 0x000001, "Wrong size on WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType, InputPin) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_203_Icon_C_SetCharacterType::InputPin' has a wrong offset!");

}

