#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_MP3

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_MP3.WBP_Hud_Status_MP3_C.ExecuteUbergraph_WBP_Hud_Status_MP3
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, int32 ColorNum)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Now;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Max;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_ColorType;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ColorNum;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3) == 0x000008, "Wrong alignment on WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3");
static_assert(sizeof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3) == 0x000038, "Wrong size on WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, K2Node_CustomEvent_Now) == 0x000018, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::K2Node_CustomEvent_Now' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, K2Node_CustomEvent_Max) == 0x00001C, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::K2Node_CustomEvent_Max' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, K2Node_CustomEvent_ColorType) == 0x000020, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::K2Node_CustomEvent_ColorType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, K2Node_CustomEvent_Index) == 0x000024, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, K2Node_CustomEvent_ColorNum) == 0x000028, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::K2Node_CustomEvent_ColorNum' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WBP_Hud_Status_MP3_C_ExecuteUbergraph_WBP_Hud_Status_MP3::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Status_MP3.WBP_Hud_Status_MP3_C.ValueChangeDelegate_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColorNum;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event) == 0x000004, "Wrong alignment on WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event");
static_assert(sizeof(WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event) == 0x000008, "Wrong size on WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event, Index_0) == 0x000000, "Member 'WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event, ColorNum) == 0x000004, "Member 'WBP_Hud_Status_MP3_C_ValueChangeDelegate_Event::ColorNum' has a wrong offset!");

// Function WBP_Hud_Status_MP3.WBP_Hud_Status_MP3_C.InitValueHudStatusMp
// 0x000C (0x000C - 0x0000)
struct WBP_Hud_Status_MP3_C_InitValueHudStatusMp final
{
public:
	int32                                         Now;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          ColorType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_MP3_C_InitValueHudStatusMp) == 0x000004, "Wrong alignment on WBP_Hud_Status_MP3_C_InitValueHudStatusMp");
static_assert(sizeof(WBP_Hud_Status_MP3_C_InitValueHudStatusMp) == 0x00000C, "Wrong size on WBP_Hud_Status_MP3_C_InitValueHudStatusMp");
static_assert(offsetof(WBP_Hud_Status_MP3_C_InitValueHudStatusMp, Now) == 0x000000, "Member 'WBP_Hud_Status_MP3_C_InitValueHudStatusMp::Now' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_InitValueHudStatusMp, Max) == 0x000004, "Member 'WBP_Hud_Status_MP3_C_InitValueHudStatusMp::Max' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_MP3_C_InitValueHudStatusMp, ColorType) == 0x000008, "Member 'WBP_Hud_Status_MP3_C_InitValueHudStatusMp::ColorType' has a wrong offset!");

}

