#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Gold_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Gold_000_modern.WBP_Menu_Gold_000_modern_C.ExecuteUbergraph_WBP_Menu_Gold_000_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsPhotoMode)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGold_ReturnValue;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0068(0x0018)()
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPhotoMode;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern");
static_assert(sizeof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern) == 0x000090, "Wrong size on WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, Temp_bool_Variable) == 0x000028, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, Temp_byte_Variable) == 0x000029, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, Temp_byte_Variable2) == 0x00002A, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_CustomEvent_InEventTag) == 0x000030, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000038, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_CustomEvent_InObject) == 0x000040, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, CallFunc_GetAccessorCommon_ReturnValue) == 0x000050, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, CallFunc_GetGold_ReturnValue) == 0x000060, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::CallFunc_GetGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, CallFunc_GetDecMenuText_ReturnValue) == 0x000068, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000080, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_CustomEvent_bIsPhotoMode) == 0x000088, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_CustomEvent_bIsPhotoMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern, K2Node_Select_Default) == 0x000089, "Member 'WBP_Menu_Gold_000_modern_C_ExecuteUbergraph_WBP_Menu_Gold_000_modern::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Gold_000_modern.WBP_Menu_Gold_000_modern_C.PhotoModeEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Gold_000_modern_C_PhotoModeEvent final
{
public:
	bool                                          bIsPhotoMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Gold_000_modern_C_PhotoModeEvent) == 0x000001, "Wrong alignment on WBP_Menu_Gold_000_modern_C_PhotoModeEvent");
static_assert(sizeof(WBP_Menu_Gold_000_modern_C_PhotoModeEvent) == 0x000001, "Wrong size on WBP_Menu_Gold_000_modern_C_PhotoModeEvent");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_PhotoModeEvent, bIsPhotoMode) == 0x000000, "Member 'WBP_Menu_Gold_000_modern_C_PhotoModeEvent::bIsPhotoMode' has a wrong offset!");

// Function WBP_Menu_Gold_000_modern.WBP_Menu_Gold_000_modern_C.CustomEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Gold_000_modern_C_CustomEvent_1 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Gold_000_modern_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Gold_000_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Gold_000_modern_C_CustomEvent_1) == 0x000018, "Wrong size on WBP_Menu_Gold_000_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_CustomEvent_1, InEventTag) == 0x000000, "Member 'WBP_Menu_Gold_000_modern_C_CustomEvent_1::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_CustomEvent_1, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Gold_000_modern_C_CustomEvent_1::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Gold_000_modern_C_CustomEvent_1, InObject) == 0x000010, "Member 'WBP_Menu_Gold_000_modern_C_CustomEvent_1::InObject' has a wrong offset!");

}

