#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_Push_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Title_Push_000_modern.WBP_Menu_Title_Push_000_modern_C.ExecuteUbergraph_WBP_Menu_Title_Push_000_modern
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReplacePlatformSpecificTextTags_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUIPlatformType                           CallFunc_GetUIPlatformType_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern");
static_assert(sizeof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern) == 0x000080, "Wrong size on WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000008, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_IsTrial_ReturnValue) == 0x000020, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_ReplacePlatformSpecificTextTags_ReturnValue) == 0x000038, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_ReplacePlatformSpecificTextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, K2Node_CustomEvent_EventTag) == 0x000048, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000068, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_GetUIPlatformType_ReturnValue) == 0x000069, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_GetUIPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Title_Push_000_modern_C_ExecuteUbergraph_WBP_Menu_Title_Push_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Title_Push_000_modern.WBP_Menu_Title_Push_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Title_Push_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Title_Push_000_modern.WBP_Menu_Title_Push_000_modern_C.SelectTitleMode
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Title_Push_000_modern_C_SelectTitleMode final
{
public:
	int32                                         InMode;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Title_Push_000_modern_C_SelectTitleMode) == 0x000004, "Wrong alignment on WBP_Menu_Title_Push_000_modern_C_SelectTitleMode");
static_assert(sizeof(WBP_Menu_Title_Push_000_modern_C_SelectTitleMode) == 0x000008, "Wrong size on WBP_Menu_Title_Push_000_modern_C_SelectTitleMode");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_SelectTitleMode, InMode) == 0x000000, "Member 'WBP_Menu_Title_Push_000_modern_C_SelectTitleMode::InMode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Title_Push_000_modern_C_SelectTitleMode, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_Menu_Title_Push_000_modern_C_SelectTitleMode::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

