#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_077_modern

#include "Basic.hpp"

#include "WBP_Menu_Parts_Text_000_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_077_modern.WBP_Menu_Parts_077_modern_C
// 0x0060 (0x0430 - 0x03D0)
class UWBP_Menu_Parts_077_modern_C final : public UWBP_Menu_Parts_Text_000_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_00;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_01;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_02;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_03;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_04;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_05;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_06;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_07;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_08;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextBlockList;                                     // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_077_modern(int32 EntryPoint);
	void Construct();
	void SetMessageScript(const class FString& MessageScript);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_077_modern_C">();
	}
	static class UWBP_Menu_Parts_077_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_077_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_077_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_077_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_077_modern_C) == 0x000430, "Wrong size on UWBP_Menu_Parts_077_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_077_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_00) == 0x0003D8, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_01) == 0x0003E0, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_02) == 0x0003E8, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_03) == 0x0003F0, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_04) == 0x0003F8, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_05) == 0x000400, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_06) == 0x000408, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_07) == 0x000410, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlock_08) == 0x000418, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlock_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_077_modern_C, TextBlockList) == 0x000420, "Member 'UWBP_Menu_Parts_077_modern_C::TextBlockList' has a wrong offset!");

}

