#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_004_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_Settei_004_modern.WBP_Menu_Sakusen_Settei_004_modern_C
// 0x0078 (0x0490 - 0x0418)
class UWBP_Menu_Sakusen_Settei_004_modern_C final : public UJackUMGHorizontalSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_114;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_606;                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_052_modern_C*           WBP_Menu_Parts_052_00;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_091_modern_C*           WBP_Menu_Parts_091;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_1;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLine_2;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowLineTate;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EJackBattleCameraMode                         CameraMode;                                        // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NewVar_0;                                          // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     SnapSave;                                          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBattleSpeedMode                          BattleSpeedMode;                                   // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_Settei_004_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void SelectTextSet();
	void SaveAndBack();
	void IntToMode(int32 InMode, EJackBattleCameraMode* OutMode);
	void GetValue();
	void SetValue();
	void SetInfoText(class FName InName);
	void RemoveSnap();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_Settei_004_modern_C">();
	}
	static class UWBP_Menu_Sakusen_Settei_004_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_Settei_004_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_Settei_004_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_Settei_004_modern_C");
static_assert(sizeof(UWBP_Menu_Sakusen_Settei_004_modern_C) == 0x000490, "Wrong size on UWBP_Menu_Sakusen_Settei_004_modern_C");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, UberGraphFrame) == 0x000418, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, InvalidationBox_0) == 0x000420, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, ItemList) == 0x000428, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WBP_Menu_Parts_000_C_114) == 0x000430, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WBP_Menu_Parts_000_C_114' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WBP_Menu_Parts_000_C_606) == 0x000438, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WBP_Menu_Parts_000_C_606' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WBP_Menu_Parts_052_00) == 0x000440, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WBP_Menu_Parts_052_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WBP_Menu_Parts_091) == 0x000448, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WBP_Menu_Parts_091' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WindowFrame) == 0x000450, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WindowLine_1) == 0x000458, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WindowLine_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WindowLine_2) == 0x000460, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WindowLine_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, WindowLineTate) == 0x000468, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::WindowLineTate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, CameraMode) == 0x000470, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::CameraMode' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, NewVar_0) == 0x000478, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, SnapSave) == 0x000480, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::SnapSave' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_Settei_004_modern_C, BattleSpeedMode) == 0x000488, "Member 'UWBP_Menu_Sakusen_Settei_004_modern_C::BattleSpeedMode' has a wrong offset!");

}

