#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_Aikotoba_Window_000_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_Aikotoba_Window_000_modern.WBP_Menu_Senreki_Aikotoba_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetYochiDataList_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYochiCount_AllCount;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYochiCount_ClearCount;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern");
static_assert(sizeof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern) == 0x000080, "Wrong size on WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_GetYochiDataList_ReturnValue) == 0x000030, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_GetYochiDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_Array_Length_ReturnValue2) == 0x000044, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_GetYochiCount_AllCount) == 0x000050, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_GetYochiCount_AllCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, CallFunc_GetYochiCount_ClearCount) == 0x000054, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::CallFunc_GetYochiCount_ClearCount' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_CustomEvent_EventName) == 0x000058, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_CustomEvent_InItemBase) == 0x000060, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000068, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_CustomEvent_EventTag) == 0x000070, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_Aikotoba_Window_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Senreki_Aikotoba_Window_000_modern.WBP_Menu_Senreki_Aikotoba_Window_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_Aikotoba_Window_000_modern.WBP_Menu_Senreki_Aikotoba_Window_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_Aikotoba_Window_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

}

