#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_List_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_List_003_modern.WBP_Menu_Dougu_List_003_modern_C
// 0x0220 (0x0650 - 0x0430)
class UWBP_Menu_Dougu_List_003_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionTextPanel;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanelWithIcon;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_32;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_33;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_34;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_35;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_36;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_37;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_38;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_39;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBP_Menu_Parts_Text_080_All;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBP_Menu_Parts_Text_080_Skill;                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FJackMessageArgumentData               MsgItemName;                                       // 0x04B8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgSelectCharName;                                 // 0x0500(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               MsgTargetCharName;                                 // 0x0548(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	EJackCharacter                                TargetCharType;                                    // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DataNumber;                                        // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_001_modern_C*  CommonSetumeiWindow;                               // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   UIActionInfoRef;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsJumonAction;                                    // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               ActionStatus;                                      // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoActionFlag;                                      // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     ReturnWidgetRef;                                   // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAction;                                         // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               ActionStatusRef;                                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAlive;                                           // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               MsgTargetCharName2;                                // 0x05E8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsVisibleNumber;                                   // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsVisibleBuffIcon;                                 // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               UIActionStatusRef;                                 // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnItemList;                                      // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DouguListWidgetName;                               // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Dougu_List_003_modern(int32 EntryPoint);
	void CustomEvent_1(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void BPActionDelegate(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void GetDataNames();
	void UpdateMembarList(bool* IsList);
	void UpdateCommonSetumei();
	int32 CountItemRemain();
	void SetupItemActionList(class UJackUMGUIActionInfo* InActionInfo);
	EJackUMGUIActionFlow GetUIFlow();
	void SetupJumonActionList(class UJackUMGUIActionInfo* UIActionInfo);
	void GetCharacterStatus(EJackCharacter InCharType, class UJackUMGItemActionStatus** AsJack_UMGItem_Action_Status);
	void DoItemActionFlag(class UJackUMGItemActionStatus* InActionStatusRef, bool* IsAction);
	void CheckSingleActionFlow1(class FName* OutTextId);
	void CheckAllActionFlow1(class FName* OutTextId);
	void GetMsgTargetCharName(struct FJackMessageArgumentData* JackMessageArgumentData);
	void GetMsgActionName(bool bInJumon, struct FJackMessageArgumentData* JackMessageArgumentData);
	int32 GetCasterMP();
	void CheckDamageTypeAction(EJackActionDamageType Selection, bool* DoAction);
	void GetMsgTargetCharName2(struct FJackMessageArgumentData* JackMessageArgumentData);
	void GetMsgItemUseCharName(bool bInJumon, struct FJackMessageArgumentData* JackMessageArgumentData);
	void GetMsgActionCharName(struct FJackMessageArgumentData* JackMessageArgumentData);
	void SetVisibleParts034BuffIcon(bool InBuffVisibility, class FName InOddEffectId);
	void CheckBuffIcon(bool* OutIsDisplayIcon);
	void CheckSingleActionFlow2(bool bInJumon, class FName* OutTextId);
	void CheckAllActionFlow2(class FName* OutTextId);
	void UpdateDouguList000();
	void FindDeadCharacter(int32* Array_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_List_003_modern_C">();
	}
	static class UWBP_Menu_Dougu_List_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_List_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_List_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_List_003_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_List_003_modern_C) == 0x000650, "Wrong size on UWBP_Menu_Dougu_List_003_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Dougu_List_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, CaptionTextPanel) == 0x000438, "Member 'UWBP_Menu_Dougu_List_003_modern_C::CaptionTextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, InvalidationBox_0) == 0x000440, "Member 'UWBP_Menu_Dougu_List_003_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, ItemListPanelWithIcon) == 0x000448, "Member 'UWBP_Menu_Dougu_List_003_modern_C::ItemListPanelWithIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, RootPanel) == 0x000450, "Member 'UWBP_Menu_Dougu_List_003_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_32) == 0x000458, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_32' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_33) == 0x000460, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_33' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_34) == 0x000468, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_34' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_35) == 0x000470, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_35' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_36) == 0x000478, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_36' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_37) == 0x000480, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_37' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_38) == 0x000488, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_38' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_034_C_39) == 0x000490, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_034_C_39' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_Text_080_All) == 0x000498, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_Text_080_All' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WBP_Menu_Parts_Text_080_Skill) == 0x0004A0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WBP_Menu_Parts_Text_080_Skill' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, Window_Line) == 0x0004A8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::Window_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, WindowFrame) == 0x0004B0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, MsgItemName) == 0x0004B8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::MsgItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, MsgSelectCharName) == 0x000500, "Member 'UWBP_Menu_Dougu_List_003_modern_C::MsgSelectCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, MsgTargetCharName) == 0x000548, "Member 'UWBP_Menu_Dougu_List_003_modern_C::MsgTargetCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, TargetCharType) == 0x000590, "Member 'UWBP_Menu_Dougu_List_003_modern_C::TargetCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, DataNumber) == 0x000594, "Member 'UWBP_Menu_Dougu_List_003_modern_C::DataNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, CommonSetumeiWindow) == 0x000598, "Member 'UWBP_Menu_Dougu_List_003_modern_C::CommonSetumeiWindow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, ItemSyousaiRef) == 0x0005A0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, UIActionInfoRef) == 0x0005A8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::UIActionInfoRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, bIsJumonAction) == 0x0005B0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::bIsJumonAction' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, ActionStatus) == 0x0005B8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::ActionStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, DoActionFlag) == 0x0005C0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::DoActionFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, ReturnWidgetRef) == 0x0005C8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::ReturnWidgetRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, HasAction) == 0x0005D0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::HasAction' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, ActionStatusRef) == 0x0005D8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::ActionStatusRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, IsAlive) == 0x0005E0, "Member 'UWBP_Menu_Dougu_List_003_modern_C::IsAlive' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, MsgTargetCharName2) == 0x0005E8, "Member 'UWBP_Menu_Dougu_List_003_modern_C::MsgTargetCharName2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, IsVisibleNumber) == 0x000630, "Member 'UWBP_Menu_Dougu_List_003_modern_C::IsVisibleNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, IsVisibleBuffIcon) == 0x000631, "Member 'UWBP_Menu_Dougu_List_003_modern_C::IsVisibleBuffIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, UIActionStatusRef) == 0x000638, "Member 'UWBP_Menu_Dougu_List_003_modern_C::UIActionStatusRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, IsOnItemList) == 0x000640, "Member 'UWBP_Menu_Dougu_List_003_modern_C::IsOnItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_List_003_modern_C, DouguListWidgetName) == 0x000648, "Member 'UWBP_Menu_Dougu_List_003_modern_C::DouguListWidgetName' has a wrong offset!");

}

