#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_102_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_Syousai_102_modern.WBP_Menu_Dougu_Syousai_102_modern_C
// 0x0048 (0x03B8 - 0x0370)
class UWBP_Menu_Dougu_Syousai_102_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow_Down;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Up;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IM_Item_Base_Color;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IM_Item_Icon;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ValueCursorPanel;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnSetText;                                         // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LoadUniqueId;                                      // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSetText__DelegateSignature(const class FText& Text);
	void ExecuteUbergraph_WBP_Menu_Dougu_Syousai_102_modern(int32 EntryPoint);
	void JackOnWidgetNotificationDelegate_Event_0(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void ASyncLoadCompleteDelegate(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo);
	void DispItemFromSyousaiRef(class UJackUMGItemSyousai* InItemSyousaiRef);
	void Construct();
	void UpDownAnimation(int32 NewParam);
	void EnableUpDown(bool IsUpDown);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_Syousai_102_modern_C">();
	}
	static class UWBP_Menu_Dougu_Syousai_102_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_Syousai_102_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_Syousai_102_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_Syousai_102_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_Syousai_102_modern_C) == 0x0003B8, "Wrong size on UWBP_Menu_Dougu_Syousai_102_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, Arrow_Down) == 0x000378, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::Arrow_Down' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, Arrow_Up) == 0x000380, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::Arrow_Up' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, IM_Item_Base_Color) == 0x000388, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::IM_Item_Base_Color' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, IM_Item_Icon) == 0x000390, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::IM_Item_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, ValueCursorPanel) == 0x000398, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::ValueCursorPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, OnSetText) == 0x0003A0, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::OnSetText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Syousai_102_modern_C, LoadUniqueId) == 0x0003B0, "Member 'UWBP_Menu_Dougu_Syousai_102_modern_C::LoadUniqueId' has a wrong offset!");

}

