#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_007_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_List_007_modern.WBP_Menu_Shop_List_007_modern_C.OnSelect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature final
{
public:
	class UJackUMGItemBase*                       ItemBase;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature");
static_assert(sizeof(WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature, ItemBase) == 0x000000, "Member 'WBP_Menu_Shop_List_007_modern_C_OnSelect__DelegateSignature::ItemBase' has a wrong offset!");

// Function WBP_Menu_Shop_List_007_modern.WBP_Menu_Shop_List_007_modern_C.ExecuteUbergraph_WBP_Menu_Shop_List_007_modern
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKyoukaiEffectEventType                   K2Node_CustomEvent_EventType;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_031_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_031_Modern;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetMemberListInKyoukai_ReturnValue;       // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetMemberListInKyoukai_ReturnValue2;      // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_CountMember_ReturnValue;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern");
static_assert(sizeof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern) == 0x0000D0, "Wrong size on WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_CustomEvent_EventTag) == 0x000030, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_SwitchName_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_CustomEvent_EventName) == 0x000040, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_CustomEvent_InItemBase) == 0x000048, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_SwitchName2_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_CustomEvent_EventType) == 0x000051, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_DynamicCast_AsWBP_Menu_Parts_031_Modern) == 0x000068, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_DynamicCast_AsWBP_Menu_Parts_031_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000078, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000080, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GetMemberListInKyoukai_ReturnValue) == 0x000088, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GetMemberListInKyoukai_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x0000B0, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GetMemberListInKyoukai_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GetMemberListInKyoukai_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_CountMember_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_CountMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'WBP_Menu_Shop_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Shop_List_007_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Shop_List_007_modern.WBP_Menu_Shop_List_007_modern_C.ShowOddEffectIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon final
{
public:
	EJackKyoukaiEffectEventType                   EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon) == 0x000001, "Wrong alignment on WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon");
static_assert(sizeof(WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon) == 0x000001, "Wrong size on WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon, EventType) == 0x000000, "Member 'WBP_Menu_Shop_List_007_modern_C_ShowOddEffectIcon::EventType' has a wrong offset!");

// Function WBP_Menu_Shop_List_007_modern.WBP_Menu_Shop_List_007_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Shop_List_007_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_007_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_007_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Shop_List_007_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Shop_List_007_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Shop_List_007_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Shop_List_007_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Shop_List_007_modern.WBP_Menu_Shop_List_007_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Shop_List_007_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

}

