#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_041

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_041.WBP_Menu_Title_BG_041_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_Menu_Title_BG_041_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           RootPanel;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Waterfall_000;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WaterfallRoot;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               NewVar_0;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Title_BG_041(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_041_C">();
	}
	static class UWBP_Menu_Title_BG_041_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_041_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_041_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_041_C");
static_assert(sizeof(UWBP_Menu_Title_BG_041_C) == 0x000398, "Wrong size on UWBP_Menu_Title_BG_041_C");
static_assert(offsetof(UWBP_Menu_Title_BG_041_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_041_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_041_C, RootPanel) == 0x000378, "Member 'UWBP_Menu_Title_BG_041_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_041_C, Waterfall_000) == 0x000380, "Member 'UWBP_Menu_Title_BG_041_C::Waterfall_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_041_C, WaterfallRoot) == 0x000388, "Member 'UWBP_Menu_Title_BG_041_C::WaterfallRoot' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_041_C, NewVar_0) == 0x000390, "Member 'UWBP_Menu_Title_BG_041_C::NewVar_0' has a wrong offset!");

}

