#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_006_Steam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x008C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam) == 0x0000F0, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_CheckPoint4) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CustomEvent_EventTag) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_Sender2) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_CheckPoint3) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_CheckRusult) == 0x000061, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_SwitchName_CmpSuccess) == 0x000062, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CustomEvent_EventName) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CustomEvent_InItemBase) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_SwitchName2_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_SwitchName3_CmpSuccess) == 0x000079, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_SwitchName4_CmpSuccess) == 0x00007A, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, CallFunc_GetUMGManager_ReturnValue) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_CheckPoint2) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_Result) == 0x000089, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, CallFunc_GetPanelSize_ReturnValue) == 0x00008C, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, CallFunc_GetUMGManager_ReturnValue2) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_Sender) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_Event_CheckPoint) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_Event_CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CustomEvent_Sender) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CustomEvent_CurrentTextID) == 0x0000C8, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CustomEvent_SelectDialogIndex) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_SwitchInteger_CmpSuccess) == 0x0000D4, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E0, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_006_Steam::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck) == 0x000002, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck, Result) == 0x000001, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_OnFinishSaveDataCheck::Result' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.SelectTextSet
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScreenPercentage_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet, CallFunc_GetScreenPercentage_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SelectTextSet::CallFunc_GetScreenPercentage_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.SaveAndBack
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack, CallFunc_GetValue_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SaveAndBack::CallFunc_GetValue_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_006_Steam.WBP_Menu_Sakusen_Settei_006_Steam_C.SetScreenPercentageBalue
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue final
{
public:
	float                                         CallFunc_GetVarRate_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScreenPercentage_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue) == 0x000038, "Wrong size on WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue, CallFunc_GetVarRate_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue::CallFunc_GetVarRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue, CallFunc_BreakVector2D_X) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_006_Steam_C_SetScreenPercentageBalue::CallFunc_BreakVector2D_X' has a wrong offset!");
