#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Jumon_List_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern
// 0x03B8 (0x03B8 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountRuraList_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetPrevPageWidget_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_GetMsgCasterCharaName_JackMessageArgumentData; // 0x0080(0x0048)()
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_List_003_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Dougu_List_003_Modern; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   CallFunc_GetUIActionInfo_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   CallFunc_GetUIActionInfo_ReturnValue2;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetActionName_JackMessageArgumentData;    // 0x0120(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue2;         // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue4;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplayUseJumonMessage_ReturnValue;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue5;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue3;         // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               CallFunc_GetActionStatusFromType_ReturnValue;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue6;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue7;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue4;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue5;         // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive;             // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_GetMsgCasterCharaName_JackMessageArgumentData2; // 0x01F0(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionMember_ReturnValue;               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_List_000_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Jumon_List_000_Modern; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_GetMsgCasterCharaName_JackMessageArgumentData3; // 0x0290(0x0048)()
	struct FJackMessageArgumentData               CallFunc_GetActionName_JackMessageArgumentData2;   // 0x02D8(0x0048)()
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue8;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	EJackCharacter                                CallFunc_GetFirstMembarCharacterType_ReturnValue;  // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue9;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue6;         // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEventByLevel_Result;                // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               CallFunc_GetActionStatusFromType_ReturnValue2;     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0380(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern) == 0x0003B8, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000018, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000020, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_CountRuraList_ReturnValue) == 0x000028, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_CountRuraList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_CustomEvent_EventName) == 0x000030, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_CustomEvent_InItemBase) == 0x000038, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetDataIndex_ReturnValue) == 0x00004C, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000058, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetPrevPageWidget_ReturnValue) == 0x000060, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetPrevPageWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, Temp_struct_Variable2) == 0x000068, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_VerifyDataTableRowName_ReturnValue) == 0x000078, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_VerifyDataTableRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetMsgCasterCharaName_JackMessageArgumentData) == 0x000080, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetMsgCasterCharaName_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_List_003_Modern) == 0x0000D8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_List_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUIActionInfo_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUIActionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUIActionInfo_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUIActionInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000108, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000110, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetSelectedCharType_ReturnValue) == 0x000118, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetSelectedCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetActionName_JackMessageArgumentData) == 0x000120, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetActionName_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_MakeArray_Array) == 0x000168, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, Temp_struct_Variable3) == 0x000178, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000188, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000190, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x000198, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_SwitchName3_CmpSuccess) == 0x0001A0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetSelectedCharType_ReturnValue2) == 0x0001A1, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetSelectedCharType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue4) == 0x0001A8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_DisplayUseJumonMessage_ReturnValue) == 0x0001B0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_DisplayUseJumonMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue5) == 0x0001B8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_IsValid_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetSelectedCharType_ReturnValue3) == 0x0001C1, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetSelectedCharType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetActionStatusFromType_ReturnValue) == 0x0001C8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetActionStatusFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x0001D0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue6) == 0x0001D8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue7) == 0x0001E0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetSelectedCharType_ReturnValue4) == 0x0001E8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetSelectedCharType_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetSelectedCharType_ReturnValue5) == 0x0001E9, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetSelectedCharType_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_IsUMGAliveCharacter_bIsAlive) == 0x0001EA, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_IsUMGAliveCharacter_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetMsgCasterCharaName_JackMessageArgumentData2) == 0x0001F0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetMsgCasterCharaName_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_MakeArray_Array2) == 0x000238, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000248, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_IsActionMember_ReturnValue) == 0x000250, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_IsActionMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000258, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000260, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000268, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Jumon_List_000_Modern) == 0x000270, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Jumon_List_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_DynamicCast_bSuccess2) == 0x000278, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x00027C, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000280, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000288, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetMsgCasterCharaName_JackMessageArgumentData3) == 0x000290, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetMsgCasterCharaName_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetActionName_JackMessageArgumentData2) == 0x0002D8, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetActionName_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue8) == 0x000320, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_MakeArray_Array3) == 0x000328, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetFirstMembarCharacterType_ReturnValue) == 0x000338, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetFirstMembarCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue9) == 0x000340, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetSelectedCharType_ReturnValue6) == 0x000348, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetSelectedCharType_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_RemoteEventByLevel_Result) == 0x000349, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_RemoteEventByLevel_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetActionStatusFromType_ReturnValue2) == 0x000350, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetActionStatusFromType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000358, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000360, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000368, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern) == 0x000370, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_DynamicCast_AsWBP_Menu_Jumon_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_DynamicCast_bSuccess3) == 0x000378, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000380, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000390, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000398, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0003A0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern, CallFunc_OpenMenu_ReturnValue) == 0x0003B0, "Member 'WBP_Menu_Jumon_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Jumon_List_001_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Jumon_List_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.UpdateJumonList
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList final
{
public:
	EJackCharacter                                InType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetJumonListAtGameCharacter_ReturnValue;  // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList) == 0x000028, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList, InType) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList::InType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList, ItemIndex) == 0x000004, "Member 'WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000010, "Member 'WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList, CallFunc_GetJumonListAtGameCharacter_ReturnValue) == 0x000018, "Member 'WBP_Menu_Jumon_List_001_modern_C_UpdateJumonList::CallFunc_GetJumonListAtGameCharacter_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.SetParamSetumei
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei final
{
public:
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   SetumeiWindow;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x0008(0x0050)()
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue2; // 0x0058(0x0050)()
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMPFromMemberCharType_ReturnValue;      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei) == 0x0000C8, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, SetumeiWindow) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::SetumeiWindow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, CallFunc_GetItemContainerFromSelected_ReturnValue) == 0x000008, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::CallFunc_GetItemContainerFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, CallFunc_GetItemContainerFromSelected_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::CallFunc_GetItemContainerFromSelected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, CallFunc_GetSelectedCharType_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::CallFunc_GetSelectedCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei, CallFunc_GetMPFromMemberCharType_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetParamSetumei::CallFunc_GetMPFromMemberCharType_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.SetJumonName
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_SetJumonName final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x0018(0x0050)()
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_SetJumonName) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_SetJumonName");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_SetJumonName) == 0x000068, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_SetJumonName");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetJumonName, Index_0) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetJumonName::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetJumonName, CallFunc_GetAccessorMembers_ReturnValue) == 0x000008, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetJumonName::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetJumonName, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetJumonName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetJumonName, CallFunc_GetItemContainer_ReturnValue) == 0x000018, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetJumonName::CallFunc_GetItemContainer_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.GetActionName
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_GetActionName final
{
public:
	struct FJackMessageArgumentData               JackMessageArgumentData;                           // 0x0000(0x0048)(Parm, OutParm)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0048(0x0048)()
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_GetActionName) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_GetActionName");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_GetActionName) == 0x000090, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_GetActionName");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_GetActionName, JackMessageArgumentData) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_GetActionName::JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_GetActionName, K2Node_MakeStruct_JackMessageArgumentData) == 0x000048, "Member 'WBP_Menu_Jumon_List_001_modern_C_GetActionName::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.SetEnableBenriButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InJumonId;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton) == 0x000008, "Wrong alignment on WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton");
static_assert(sizeof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton) == 0x000028, "Wrong size on WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, IsEnable) == 0x000000, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::IsEnable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, InJumonId) == 0x000008, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::InJumonId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_VerifyDataTableRowName_ReturnValue) == 0x000010, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_VerifyDataTableRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_GetJackGamePlayer_ReturnValue) == 0x000018, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_GetJackGamePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000022, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_BooleanAND_ReturnValue2) == 0x000023, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'WBP_Menu_Jumon_List_001_modern_C_SetEnableBenriButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Jumon_List_001_modern.WBP_Menu_Jumon_List_001_modern_C.GetMsgCasterCharaName
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Menu_Jumon_List_001_modern_C_GetMsgCasterCharaName final
{
public:
	struct FJackMessageArgumentData               JackMessageArgumentData;                           // 0x0000(0x0048)(Parm, OutParm)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetSelectedCharType_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0060(0x0048)()
};
