#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Mode_Select_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern
// 0x0188 (0x0188 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SlotIndex;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_CustomEvent_SaveLoadResult;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_DynamicCast_AsBP_IF_Save_Data_Check;        // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> CallFunc_ExecuteSaveDataCheckResult_Sender_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable2;                             // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable3;                             // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item2;                          // 0x00FC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_StopBGM_ReturnValue2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex, EJackSaveLoadResult SaveLoadResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSaveData*                          CallFunc_GetSaveData_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern) == 0x000188, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_CustomEvent_SlotIndex) == 0x000010, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_CustomEvent_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_CustomEvent_SaveLoadResult) == 0x000014, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_CustomEvent_SaveLoadResult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_CheckPoint4) == 0x000020, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_Result) == 0x000021, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_DynamicCast_AsBP_IF_Save_Data_Check) == 0x000028, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_DynamicCast_AsBP_IF_Save_Data_Check' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_ExecuteSaveDataCheckResult_Sender_CastInput) == 0x000040, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_ExecuteSaveDataCheckResult_Sender_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000060, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000068, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_OpenMenu_ReturnValue) == 0x000070, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_CheckPoint3) == 0x000078, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_CustomEvent_EventTag) == 0x000080, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, Temp_struct_Variable) == 0x000090, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, Temp_struct_Variable2) == 0x0000A0, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, Temp_struct_Variable3) == 0x0000B0, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x0000C0, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_StopBGM_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_Sender2) == 0x0000E8, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_CheckPoint2) == 0x0000F8, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_CheckRusult) == 0x0000F9, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_Array_Get_Item2) == 0x0000FC, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, Temp_struct_Variable4) == 0x000108, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_StopBGM_ReturnValue2) == 0x000118, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_StopBGM_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_MakeLiteralName_ReturnValue) == 0x000120, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_Sender) == 0x000128, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_Event_CheckPoint) == 0x000138, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_Event_CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000140, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000148, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x000160, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000168, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetAccessorSaveData_ReturnValue6) == 0x000178, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetAccessorSaveData_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern, CallFunc_GetSaveData_ReturnValue) == 0x000180, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Mode_Select_001_modern::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck) == 0x000002, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck, Result) == 0x000001, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_OnFinishSaveDataCheck::Result' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.FinishSaveAsync
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           SaveLoadResult;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync) == 0x000004, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync) == 0x000008, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync, SlotIndex) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync::SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync, SaveLoadResult) == 0x000004, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_FinishSaveAsync::SaveLoadResult' has a wrong offset!");

// Function WBP_Menu_Namae_Mode_Select_001_modern.WBP_Menu_Namae_Mode_Select_001_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Mode_Select_001_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

}

