#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_CS_Skip_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_CS_Skip_001_modern.WBP_Hud_CS_Skip_001_modern_C.ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern
// 0x0058 (0x0058 - 0x0000)
struct WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern) == 0x000008, "Wrong alignment on WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern");
static_assert(sizeof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern) == 0x000058, "Wrong size on WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, Temp_bool_Variable) == 0x000028, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, Temp_byte_Variable) == 0x000029, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, Temp_byte_Variable2) == 0x00002A, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CustomEvent_InKeyType) == 0x00002B, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CustomEvent_bIsPressed) == 0x00002C, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_Select_Default) == 0x00002D, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00002E, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CustomEvent_InEventTag) == 0x000030, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000038, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_CustomEvent_InObject) == 0x000040, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Hud_CS_Skip_001_modern_C_ExecuteUbergraph_WBP_Hud_CS_Skip_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Hud_CS_Skip_001_modern.WBP_Hud_CS_Skip_001_modern_C.OnWidgetNotification
// 0x0018 (0x0018 - 0x0000)
struct WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification) == 0x000008, "Wrong alignment on WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification");
static_assert(sizeof(WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification) == 0x000018, "Wrong size on WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification, InEventTag) == 0x000000, "Member 'WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification, InCallWidgetBase) == 0x000008, "Member 'WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification, InObject) == 0x000010, "Member 'WBP_Hud_CS_Skip_001_modern_C_OnWidgetNotification::InObject' has a wrong offset!");

// Function WBP_Hud_CS_Skip_001_modern.WBP_Hud_CS_Skip_001_modern_C.OnKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent) == 0x000001, "Wrong alignment on WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent");
static_assert(sizeof(WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent) == 0x000002, "Wrong size on WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Hud_CS_Skip_001_modern_C_OnKeyEvent::bIsPressed' has a wrong offset!");

}

