#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_006_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_006_modern
// 0x0208 (0x0208 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableIrekae_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsNigeruEnable_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSibariPlayFlag_ReturnValue;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSyuurenjou_ReturnValue;                 // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReturnedIrekae_ReturnValue;             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSakusenMemberList_ReturnValue;         // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue4;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountMember_ReturnValue;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array;                            // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackUMGItemBase*>               K2Node_MakeArray_Array2;                           // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern) == 0x000208, "Wrong size on WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CustomEvent_InKeyType) == 0x000004, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CustomEvent_bIsPressed) == 0x000005, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_OpenMenu_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000028, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CustomEvent_EventTag) == 0x000038, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_SwitchName_CmpSuccess) == 0x000041, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CustomEvent_EventName) == 0x000050, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CustomEvent_InItemBase) == 0x000058, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_SwitchName2_CmpSuccess) == 0x000060, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_SwitchName3_CmpSuccess) == 0x000061, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000068, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000070, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000078, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_IsEnableIrekae_ReturnValue) == 0x000080, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_IsEnableIrekae_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetBattleManager_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_IsNigeruEnable_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_IsNigeruEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, Temp_struct_Variable) == 0x0000B0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, Temp_struct_Variable2) == 0x0000D0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, Temp_struct_Variable3) == 0x0000E8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, Temp_struct_Variable4) == 0x0000F8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000108, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000110, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000120, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000130, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000138, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000140, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_IsSibariPlayFlag_ReturnValue) == 0x000150, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_IsSibariPlayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_IsSyuurenjou_ReturnValue) == 0x000151, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_IsSyuurenjou_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000158, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x000160, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x000168, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_IsReturnedIrekae_ReturnValue) == 0x000170, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_IsReturnedIrekae_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x000178, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetSakusenMemberList_ReturnValue) == 0x000180, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetSakusenMemberList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, Temp_struct_Variable5) == 0x000190, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetAccessorMembers_ReturnValue4) == 0x0001A0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetAccessorMembers_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0001A8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_CountMember_ReturnValue) == 0x0001B0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_CountMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x0001B8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x0001C0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x0001C8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x0001D0, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_MakeArray_Array) == 0x0001D8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, K2Node_MakeArray_Array2) == 0x0001E8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x0001F8, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x000200, "Member 'WBP_Menu_Battle_List_006_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_006_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Battle_List_006_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_006_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_006_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_006_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.AICheck
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_AICheck final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivePlayerAI_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x0030(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_GetControlCharacter_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_AICheck) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_AICheck");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_AICheck) == 0x0000B0, "Wrong size on WBP_Menu_Battle_List_006_modern_C_AICheck");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_GetAccessorMembers_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_IsActivePlayerAI_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_IsActivePlayerAI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_GetItemContainer_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_GetItemContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_GetBattleManager_ReturnValue) == 0x000088, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_GetControlCharacter_ReturnValue) == 0x000098, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_GetControlCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_IsInBattle_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_IsInBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_GetCharacterType_ReturnValue) == 0x0000A1, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A4, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AICheck, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'WBP_Menu_Battle_List_006_modern_C_AICheck::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.IsOperational
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_IsOperational final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TempResult;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperationalWithIgnoreOddEffectIDs_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_IsOperational) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_IsOperational");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_IsOperational) == 0x000030, "Wrong size on WBP_Menu_Battle_List_006_modern_C_IsOperational");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, Result) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, TempResult) == 0x000001, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::TempResult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, CallFunc_GetAccessorBattle_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_IsOperational, CallFunc_IsOperationalWithIgnoreOddEffectIDs_ReturnValue) == 0x000029, "Member 'WBP_Menu_Battle_List_006_modern_C_IsOperational::CallFunc_IsOperationalWithIgnoreOddEffectIDs_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.SetVisibilityWindow
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow) == 0x000001, "Wrong size on WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow, IsVisible_0) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_SetVisibilityWindow::IsVisible_0' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.CreateMenu
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_CreateMenu final
{
public:
	TArray<class UJackUMGItemData*>               MenuItemDataList;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackCharacter>                        CallFunc_GetFriendJoinedAfterList_ReturnValue;     // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_CreateMenu) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_CreateMenu");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_CreateMenu) == 0x000030, "Wrong size on WBP_Menu_Battle_List_006_modern_C_CreateMenu");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CreateMenu, MenuItemDataList) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_CreateMenu::MenuItemDataList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CreateMenu, CallFunc_GetAccessorMembers_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_006_modern_C_CreateMenu::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CreateMenu, CallFunc_GetFriendJoinedAfterList_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_006_modern_C_CreateMenu::CallFunc_GetFriendJoinedAfterList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CreateMenu, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_006_modern_C_CreateMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_CreateMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Battle_List_006_modern_C_CreateMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.AddMenuCommand
// 0x0058 (0x0058 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_AddMenuCommand final
{
public:
	TArray<class UJackUMGItemData*>               TargetArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FName                                   InItemId;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       NewLocalVar_1;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_CreateItemData_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0040(0x0018)()
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_AddMenuCommand");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand) == 0x000058, "Wrong size on WBP_Menu_Battle_List_006_modern_C_AddMenuCommand");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, TargetArray) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::TargetArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, InItemId) == 0x000010, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::InItemId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, NewLocalVar_1) == 0x000018, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, CallFunc_CreateItemData_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::CallFunc_CreateItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, CallFunc_GetUMGManager_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, CallFunc_MakeLiteralName_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_AddMenuCommand, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000040, "Member 'WBP_Menu_Battle_List_006_modern_C_AddMenuCommand::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.SetNigeruTextColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           PartsNigeru;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackBattleManager*                     CallFunc_GetBattleManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNigeruEnable_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor");
static_assert(sizeof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor) == 0x000030, "Wrong size on WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor, PartsNigeru) == 0x000000, "Member 'WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor::PartsNigeru' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor, CallFunc_GetItemFromTextId_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor::CallFunc_GetItemFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor, K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern) == 0x000010, "Member 'WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor::K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor, CallFunc_GetBattleManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor, CallFunc_IsNigeruEnable_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_006_modern_C_SetNigeruTextColor::CallFunc_IsNigeruEnable_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_006_modern.WBP_Menu_Battle_List_006_modern_C.SetIrekaeTextColor
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Battle_List_006_modern_C_SetIrekaeTextColor final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           PartsIrekae;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           K2Node_DynamicCast_AsWBP_Menu_Parts_000_Modern;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSyuurenjou_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackCharacter>                        CallFunc_GetFriendJoinedAfterList_ReturnValue;     // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_006_modern_C_SetIrekaeTextColor) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_006_modern_C_SetIrekaeTextColor");
