#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_BG_051

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_BG_051.WBP_Menu_Title_BG_051_C
// 0x0090 (0x0400 - 0x0370)
class UWBP_Menu_Title_BG_051_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_000;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_000_1;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_001;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_002;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_003;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_003_1;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_004;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_005;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_005_1;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_006;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_006_1;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_007;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_008;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightshaft_009;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleRoot;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Title_BG_051(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_BG_051_C">();
	}
	static class UWBP_Menu_Title_BG_051_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_BG_051_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_BG_051_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_BG_051_C");
static_assert(sizeof(UWBP_Menu_Title_BG_051_C) == 0x000400, "Wrong size on UWBP_Menu_Title_BG_051_C");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_BG_051_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_BG_051_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_000) == 0x000380, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_000_1) == 0x000388, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_000_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_001) == 0x000390, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_002) == 0x000398, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_003) == 0x0003A0, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_003_1) == 0x0003A8, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_003_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_004) == 0x0003B0, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_005) == 0x0003B8, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_005' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_005_1) == 0x0003C0, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_005_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_006) == 0x0003C8, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_006_1) == 0x0003D0, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_006_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_007) == 0x0003D8, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_008) == 0x0003E0, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_008' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, Lightshaft_009) == 0x0003E8, "Member 'UWBP_Menu_Title_BG_051_C::Lightshaft_009' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, RootPanel) == 0x0003F0, "Member 'UWBP_Menu_Title_BG_051_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_BG_051_C, TitleRoot) == 0x0003F8, "Member 'UWBP_Menu_Title_BG_051_C::TitleRoot' has a wrong offset!");

}

