#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Loading_002_modern

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Loading_002_modern.WBP_Hud_Loading_002_modern_C.ExecuteUbergraph_WBP_Hud_Loading_002_modern
// 0x0080 (0x0080 - 0x0000)
struct WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGWidgetFromName_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGWidgetFromName_ReturnValue2;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGWidgetFromName_ReturnValue3;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern) == 0x000008, "Wrong alignment on WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern");
static_assert(sizeof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern) == 0x000080, "Wrong size on WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, Temp_bool_Variable) == 0x000006, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, Temp_byte_Variable3) == 0x000007, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, Temp_byte_Variable4) == 0x000008, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, Temp_bool_Variable2) == 0x000009, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, K2Node_Select_Default) == 0x00000A, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, K2Node_Event_Animation) == 0x000050, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000059, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x00005A, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000060, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x000068, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000070, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_IsUMGWidgetFromName_ReturnValue) == 0x000078, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_IsUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_IsUMGWidgetFromName_ReturnValue2) == 0x000079, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_IsUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_IsUMGWidgetFromName_ReturnValue3) == 0x00007A, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_IsUMGWidgetFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_BooleanOR_ReturnValue) == 0x00007B, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_BooleanOR_ReturnValue2) == 0x00007C, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_BooleanOR_ReturnValue3) == 0x00007D, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, CallFunc_Not_PreBool_ReturnValue) == 0x00007E, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern, K2Node_Select2_Default) == 0x00007F, "Member 'WBP_Hud_Loading_002_modern_C_ExecuteUbergraph_WBP_Hud_Loading_002_modern::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Hud_Loading_002_modern.WBP_Hud_Loading_002_modern_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Loading_002_modern_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Loading_002_modern_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Hud_Loading_002_modern_C_OnAnimationFinished");
static_assert(sizeof(WBP_Hud_Loading_002_modern_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Hud_Loading_002_modern_C_OnAnimationFinished");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Hud_Loading_002_modern_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Hud_Loading_002_modern.WBP_Hud_Loading_002_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Loading_002_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Loading_002_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Hud_Loading_002_modern_C_Tick");
static_assert(sizeof(WBP_Hud_Loading_002_modern_C_Tick) == 0x000040, "Wrong size on WBP_Hud_Loading_002_modern_C_Tick");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Hud_Loading_002_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Loading_002_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Hud_Loading_002_modern_C_Tick::InDeltaTime' has a wrong offset!");

}

