#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Scenario_List_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Scenario_List_000_modern.WBP_Menu_Scenario_List_000_modern_C.ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern
// 0x05C0 (0x05C0 - 0x0000)
struct WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackModeChangeManager*                 CallFunc_GetModeChangeManager_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOutofDontGoArea_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Scenario_Window_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCleaedScenarioList_OutScenarioTitleList; // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           CallFunc_GetCleaedScenarioList_OutScenarioIdList;  // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackDecodeInfo                        CallFunc_FukkatunojumonDecode_OutDecodeInfo;       // 0x00B0(0x0068)()
	TArray<struct FJackScenarioTitleInfo>         CallFunc_FukkatunojumonDecode_OutScenarioTitleInfoList; // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_FukkatunojumonDecode_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackScenarioTitleInfo                 CallFunc_Array_Get_Item;                           // 0x0130(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0170(0x0048)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x01C8(0x0048)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue2;    // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDecodeInfo                        CallFunc_FukkatunojumonDecodeInfoResetting_OutDecodeInfo; // 0x0270(0x0068)()
	EJackPlayGoMenuResult                         CallFunc_GetPlayGoResult_ReturnValue;              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenFukkatuNoJumonPlayGo_ReturnValue;   // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayGoMenuId_ReturnValue;              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02F8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0320(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0348(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender3;                        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID3;                 // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex3;             // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue3;    // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_MakeFukkatuItemList_ReturnValue;          // 0x0398(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue4;    // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item2;                          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFukkatunojumonManager*             CallFunc_GetFukkatunojumonManager_ReturnValue5;    // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Scenario_Window_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern2; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue3;        // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Scenario_Window_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern3; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0410(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorShop*                   CallFunc_GetAccessorShop_ReturnValue;              // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackDataTableChurch                   CallFunc_GetKyoukaiData_KyoukaiData;               // 0x0428(0x0030)()
	bool                                          CallFunc_GetKyoukaiData_ReturnValue;               // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0460(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender2;                        // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID2;                 // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex2;             // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x04B8(0x0048)()
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable4;                             // 0x0500(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0510(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item3;                          // 0x0528(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackModeChangeManager*                 CallFunc_GetModeChangeManager_ReturnValue2;        // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0560(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate5;             // 0x0578(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue3;           // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue4;           // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackModeChangeManager*                 CallFunc_GetModeChangeManager_ReturnValue3;        // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue7;         // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayGoInstallRemainTime_ReturnValue;   // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x05BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern");
static_assert(sizeof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern) == 0x0005C0, "Wrong size on WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetModeChangeManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetModeChangeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x000010, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000030, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_IsOutofDontGoArea_ReturnValue) == 0x000038, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_IsOutofDontGoArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00003A, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x00003B, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x00003C, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000048, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000058, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern) == 0x000060, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue) == 0x000070, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetCleaedScenarioList_OutScenarioTitleList) == 0x000078, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetCleaedScenarioList_OutScenarioTitleList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetCleaedScenarioList_OutScenarioIdList) == 0x000088, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetCleaedScenarioList_OutScenarioIdList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Length_ReturnValue2) == 0x00009C, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Divide_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_FukkatunojumonDecode_OutDecodeInfo) == 0x0000B0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_FukkatunojumonDecode_OutDecodeInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_FukkatunojumonDecode_OutScenarioTitleInfoList) == 0x000118, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_FukkatunojumonDecode_OutScenarioTitleInfoList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_FukkatunojumonDecode_ReturnValue) == 0x000128, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_FukkatunojumonDecode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Get_Item) == 0x000130, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Length_ReturnValue3) == 0x000158, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Add_ReturnValue) == 0x00015C, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Conv_IntToString_ReturnValue) == 0x000160, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000170, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Conv_IntToString_ReturnValue2) == 0x0001B8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0001C8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000210, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_MakeArray_Array) == 0x000218, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000228, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000230, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_EventName) == 0x000238, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_InItemBase) == 0x000240, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000248, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000250, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000258, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue2) == 0x000260, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x000268, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_FukkatunojumonDecodeInfoResetting_OutDecodeInfo) == 0x000270, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_FukkatunojumonDecodeInfoResetting_OutDecodeInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetPlayGoResult_ReturnValue) == 0x0002D8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetPlayGoResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0002D9, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_IsOpenFukkatuNoJumonPlayGo_ReturnValue) == 0x0002DA, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_IsOpenFukkatuNoJumonPlayGo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetPlayGoMenuId_ReturnValue) == 0x0002E0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetPlayGoMenuId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_OpenMenu_ReturnValue) == 0x0002E8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0002F0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x0002F8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000300, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x000310, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorSaveData_ReturnValue6) == 0x000318, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorSaveData_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, Temp_struct_Variable) == 0x000320, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000330, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000340, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, Temp_struct_Variable2) == 0x000348, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x000358, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x000360, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000368, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_Sender3) == 0x000370, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_Sender3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_CurrentTextID3) == 0x000378, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_CurrentTextID3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_SelectDialogIndex3) == 0x000380, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_SelectDialogIndex3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000384, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue3) == 0x000388, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000390, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_MakeFukkatuItemList_ReturnValue) == 0x000398, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_MakeFukkatuItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Add_ReturnValue2) == 0x0003A8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue4) == 0x0003B0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_LastIndex_ReturnValue) == 0x0003B8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Get_Item2) == 0x0003C0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetFukkatunojumonManager_ReturnValue5) == 0x0003C8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetFukkatunojumonManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0003D0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue2) == 0x0003D8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern2) == 0x0003E0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_DynamicCast_bSuccess2) == 0x0003E8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x0003F0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue3) == 0x0003F8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern3) == 0x000400, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_DynamicCast_AsWBP_Menu_Scenario_Window_000_Modern3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_DynamicCast_bSuccess3) == 0x000408, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000410, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetAccessorShop_ReturnValue) == 0x000420, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetAccessorShop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetKyoukaiData_KyoukaiData) == 0x000428, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetKyoukaiData_KyoukaiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_GetKyoukaiData_ReturnValue) == 0x000458, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_GetKyoukaiData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, Temp_struct_Variable3) == 0x000460, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x000470, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_Sender2) == 0x000478, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_CurrentTextID2) == 0x000480, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_CurrentTextID2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_SelectDialogIndex2) == 0x000488, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_SelectDialogIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000490, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x000498, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_Sender) == 0x0004A0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_CurrentTextID) == 0x0004A8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x0004B0, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_SwitchInteger3_CmpSuccess) == 0x0004B4, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_MakeStruct_JackMessageArgumentData3) == 0x0004B8, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_MakeStruct_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, Temp_struct_Variable4) == 0x000500, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, K2Node_MakeArray_Array2) == 0x000510, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5) == 0x000520, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern, CallFunc_Array_Get_Item3) == 0x000528, "Member 'WBP_Menu_Scenario_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Scenario_List_000_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
