#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Soubi_Window_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Soubi_Window_002_modern.WBP_Menu_Soubi_Window_002_modern_C
// 0x0110 (0x0540 - 0x0430)
class UWBP_Menu_Soubi_Window_002_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemFullPage_In_Out;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CommonButtonPane;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemHighlightPanel;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ModernPaper;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SoubiItemPane;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SoubiListItemPanel;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoubiSentakuTitleFramePanel;                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_007_modern_C*  WBP_Menu_Common_Setumei_007;                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_1553;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_002_modern_C*           WBP_Menu_Parts_002;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_C_0;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_008_modern_C*           WBP_Menu_Parts_008_C_26;                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_0;                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_1;                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_2;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_3;                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_4;                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_5;                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_6;                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Soubi_Item_002_modern_C*      WBP_Menu_Soubi_Item_002_C_7;                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EJackItem_Bag                                 BagType;                                           // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     SoubiWindow001Ref;                                 // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EJackUMGItemSortType>                  SortSoubiTable;                                    // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         DispSortIndex;                                     // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IndexInBag;                                        // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGItemListInfo>           ItemSyousaiList;                                   // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         NextSortIndex;                                     // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   DouguSyousai100Ref;                                // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SoubiWindow002ZOrder;                              // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackEquipmentRegion                          SelectItemRegion;                                  // 0x053C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWeapon;                                         // 0x053D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsCloseAnim;                                      // 0x053E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Soubi_Window_002_modern(int32 EntryPoint);
	void ItemindexNotification_Event_0(int32 OutItemIndex);
	void WidgetKeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void OnItemListControlEvent_Event_0(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void SetupItemList(class UJackUMGWidgetBase* InSoubiWindow000Ref, EJackItem_Bag InBagType, EJackEquipmentRegion InSelectRegion, bool IsWeapon);
	void ChangeNextSort();
	void UpdateSortCommonCaption();
	void InitSort();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Soubi_Window_002_modern_C">();
	}
	static class UWBP_Menu_Soubi_Window_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Soubi_Window_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Soubi_Window_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Soubi_Window_002_modern_C");
static_assert(sizeof(UWBP_Menu_Soubi_Window_002_modern_C) == 0x000540, "Wrong size on UWBP_Menu_Soubi_Window_002_modern_C");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, ItemFullPage_In_Out) == 0x000438, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::ItemFullPage_In_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, Black) == 0x000440, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::Black' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, CommonButtonPane) == 0x000448, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::CommonButtonPane' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, ItemHighlightPanel) == 0x000450, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::ItemHighlightPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, ModernPaper) == 0x000458, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::ModernPaper' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SoubiItemPane) == 0x000460, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SoubiItemPane' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SoubiListItemPanel) == 0x000468, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SoubiListItemPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SoubiSentakuTitleFramePanel) == 0x000470, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SoubiSentakuTitleFramePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Common_Setumei_007) == 0x000478, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Common_Setumei_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Parts_000) == 0x000480, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Parts_000_1553) == 0x000488, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Parts_000_1553' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Parts_002) == 0x000490, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Parts_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Parts_008_C_0) == 0x000498, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Parts_008_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Parts_008_C_26) == 0x0004A0, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Parts_008_C_26' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_0) == 0x0004A8, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_1) == 0x0004B0, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_2) == 0x0004B8, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_3) == 0x0004C0, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_4) == 0x0004C8, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_5) == 0x0004D0, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_6) == 0x0004D8, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, WBP_Menu_Soubi_Item_002_C_7) == 0x0004E0, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::WBP_Menu_Soubi_Item_002_C_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, BagType) == 0x0004E8, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::BagType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, ItemSyousaiRef) == 0x0004F0, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SoubiWindow001Ref) == 0x0004F8, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SoubiWindow001Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SortSoubiTable) == 0x000500, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SortSoubiTable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, DispSortIndex) == 0x000510, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::DispSortIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, IndexInBag) == 0x000514, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::IndexInBag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, ItemSyousaiList) == 0x000518, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::ItemSyousaiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, NextSortIndex) == 0x000528, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::NextSortIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, DouguSyousai100Ref) == 0x000530, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::DouguSyousai100Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SoubiWindow002ZOrder) == 0x000538, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SoubiWindow002ZOrder' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, SelectItemRegion) == 0x00053C, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::SelectItemRegion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, bIsWeapon) == 0x00053D, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::bIsWeapon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Soubi_Window_002_modern_C, bIsCloseAnim) == 0x00053E, "Member 'UWBP_Menu_Soubi_Window_002_modern_C::bIsCloseAnim' has a wrong offset!");

}

