#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_MonsterZukan_Window_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_MonsterZukan_Window_002_modern.WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern
// 0x0118 (0x0118 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCaption_ReturnValue;                   // 0x0030(0x0018)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue; // 0x0078(0x0018)()
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue5;              // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue6;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue7;              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue8;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue9;              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue11;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue10;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue11;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue12;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue13;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue12;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue13;             // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern) == 0x000118, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_CustomEvent_EventName) == 0x000018, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_CustomEvent_InItemBase) == 0x000020, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_GetCaption_ReturnValue) == 0x000030, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_GetCaption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000058, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue) == 0x000078, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000090, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_CustomEvent_EventTag) == 0x000098, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000A0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000C0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000C4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue3) == 0x0000C9, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue4) == 0x0000CC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue5) == 0x0000D0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue4) == 0x0000D4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue5) == 0x0000D5, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue6) == 0x0000D8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue7) == 0x0000DC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue6) == 0x0000E0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue7) == 0x0000E1, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue8) == 0x0000E4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue9) == 0x0000E8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue8) == 0x0000EC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue9) == 0x0000ED, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue10) == 0x0000F0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue11) == 0x0000F4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue10) == 0x0000F8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue11) == 0x0000F9, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue12) == 0x0000FC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Array_Length_ReturnValue13) == 0x000100, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Array_Length_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue12) == 0x000104, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Greater_IntInt_ReturnValue13) == 0x000105, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Greater_IntInt_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000110, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_002_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_002_modern.WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_002_modern.WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_002_modern.WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C.SelectCategory
// 0x0120 (0x0120 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory final
{
public:
	class UJackTextMacroReplaceManager*           CallFunc_GetTextMacroReplaceManager_ReturnValue;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue; // 0x0040(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue2;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0068(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MacroReplaceBP_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue11;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue12;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory) == 0x000120, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_GetTextMacroReplaceManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_GetTextMacroReplaceManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue) == 0x000040, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Conv_TextToString_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Conv_TextToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, K2Node_MakeStruct_JackMessageArgumentData) == 0x000068, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, K2Node_MakeArray_Array) == 0x0000B0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_MacroReplaceBP_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_MacroReplaceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue2) == 0x0000F0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue3) == 0x0000F4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue4) == 0x0000F8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue5) == 0x0000FC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue6) == 0x000100, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue7) == 0x000104, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue8) == 0x000108, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue9) == 0x00010C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue10) == 0x000110, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue11) == 0x000114, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, CallFunc_Array_Length_ReturnValue12) == 0x000118, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::CallFunc_Array_Length_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory, K2Node_SwitchName_CmpSuccess) == 0x00011C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SelectCategory::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_002_modern.WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C.SetMonsterList
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList) == 0x000010, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_002_modern_C_SetMonsterList::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
