#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Settei_000_Steam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Keyconfig_Settei_000_Steam.WBP_Menu_Keyconfig_Settei_000_Steam_C
// 0x01E0 (0x0610 - 0x0430)
class UWBP_Menu_Keyconfig_Settei_000_Steam_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Box;                                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Caption_000;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Caption_001;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Back;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Circle;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Circle2;                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Cross_Bottom;                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Cross_Left;                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Cross_Right;                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Cross_Top;                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Cube;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L1;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L2;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L_Stick_Bottom;                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L_Stick_L3;                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L_Stick_Left;                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L_Stick_Right;                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_L_Stick_Top;                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R1;                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R2;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R_Stick_Bottom;                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R_Stick_Left;                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R_Stick_R3;                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R_Stick_Right;                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_R_Stick_Top;                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Start;                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_Triangle;                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_X;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Gamepad_X2;                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList_1;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Keyconfig_List;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_1;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_2;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_3;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_4;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_5;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_6;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_7;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Parts_000_Steam_C*  KeyconfigParts_8;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line1;                                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line2;                                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line3;                                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           Parts037_TitleText;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_Caption_000;                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_Title_Gamepad;                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_Title_Keyboard;                          // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_044_C*                  WBP_Menu_Parts_044;                                // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_002_Steam_C* KeyConfigSettei002;                                // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageLoopMode;                                      // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KeyListMax;                                        // 0x05CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Keyconfig_Parts_000_Steam_C*> ItemPartsList;                                     // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UImage*>                         ButtonImageList;                                   // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWBP_Menu_Keyconfig_Settei_003_Steam_C* KeyConfigSettei003;                                // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_001_Steam_C* KeyConfigSettei001;                                // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         NewVar_0;                                          // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_000_Steam(int32 EntryPoint);
	void ChangedCancelYN(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void KeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void CustomEvent_1(class FName EventTag);
	void CustomEvent(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void SetDebugTargetSize(bool bVisible, const struct FVector2D& SlideTargetOrigin, const struct FVector2D& MaxSlideTargetSize, const struct FVector2D& MinSlideTargetSize);
	void HideDebugTargetSize();
	void ShowDebugTargetSize();
	void HideDebugInfo();
	void ShowDebugInfo();
	void ResetCaptureCameraPosition();
	void InitText();
	void SetArray();
	void SetCursorOffset(bool IsActive);
	void ReFocusWidget(bool IsInUp);
	void SetIconTexture();
	void SetGamePadButtonVisible(int32 VisibleIndex);
	void PageChange(bool IsUp);
	void SetKeyListColor(bool Enable);
	void SetSelectedTextureAndCaption(int32 InIndex);
	void UpdateItemList();
	void SetFocusColor000(bool IsFocus);
	void IsNoChangedKeyList(bool* NoChanges);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Keyconfig_Settei_000_Steam_C">();
	}
	static class UWBP_Menu_Keyconfig_Settei_000_Steam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Keyconfig_Settei_000_Steam_C>();
	}
};
static_assert(alignof(UWBP_Menu_Keyconfig_Settei_000_Steam_C) == 0x000008, "Wrong alignment on UWBP_Menu_Keyconfig_Settei_000_Steam_C");
static_assert(sizeof(UWBP_Menu_Keyconfig_Settei_000_Steam_C) == 0x000610, "Wrong size on UWBP_Menu_Keyconfig_Settei_000_Steam_C");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, BG) == 0x000438, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, Box) == 0x000440, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::Box' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Caption_000) == 0x000448, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Caption_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Caption_001) == 0x000450, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Caption_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad) == 0x000458, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Back) == 0x000460, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Back' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Circle) == 0x000468, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Circle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Circle2) == 0x000470, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Circle2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Cross_Bottom) == 0x000478, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Cross_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Cross_Left) == 0x000480, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Cross_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Cross_Right) == 0x000488, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Cross_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Cross_Top) == 0x000490, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Cross_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Cube) == 0x000498, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Cube' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L1) == 0x0004A0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L2) == 0x0004A8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L_Stick_Bottom) == 0x0004B0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L_Stick_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L_Stick_L3) == 0x0004B8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L_Stick_L3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L_Stick_Left) == 0x0004C0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L_Stick_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L_Stick_Right) == 0x0004C8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L_Stick_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_L_Stick_Top) == 0x0004D0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_L_Stick_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R1) == 0x0004D8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R2) == 0x0004E0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R_Stick_Bottom) == 0x0004E8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R_Stick_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R_Stick_Left) == 0x0004F0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R_Stick_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R_Stick_R3) == 0x0004F8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R_Stick_R3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R_Stick_Right) == 0x000500, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R_Stick_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_R_Stick_Top) == 0x000508, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_R_Stick_Top' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Start) == 0x000510, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_Triangle) == 0x000518, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_Triangle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_X) == 0x000520, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_X' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ImagePanel_Gamepad_X2) == 0x000528, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ImagePanel_Gamepad_X2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ItemList_1) == 0x000530, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ItemList_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, Keyconfig_List) == 0x000538, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::Keyconfig_List' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_1) == 0x000540, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_2) == 0x000548, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_3) == 0x000550, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_4) == 0x000558, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_5) == 0x000560, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_6) == 0x000568, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_7) == 0x000570, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyconfigParts_8) == 0x000578, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyconfigParts_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, Line1) == 0x000580, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::Line1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, Line2) == 0x000588, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::Line2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, Line3) == 0x000590, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::Line3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, Parts037_TitleText) == 0x000598, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::Parts037_TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, TextPanel_Caption_000) == 0x0005A0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::TextPanel_Caption_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, TextPanel_Title_Gamepad) == 0x0005A8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::TextPanel_Title_Gamepad' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, TextPanel_Title_Keyboard) == 0x0005B0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::TextPanel_Title_Keyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, WBP_Menu_Parts_044) == 0x0005B8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::WBP_Menu_Parts_044' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyConfigSettei002) == 0x0005C0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyConfigSettei002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, PageLoopMode) == 0x0005C8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::PageLoopMode' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyListMax) == 0x0005CC, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyListMax' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ItemPartsList) == 0x0005D0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ItemPartsList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, ButtonImageList) == 0x0005E0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::ButtonImageList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyConfigSettei003) == 0x0005F0, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyConfigSettei003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, KeyConfigSettei001) == 0x0005F8, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::KeyConfigSettei001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_000_Steam_C, NewVar_0) == 0x000600, "Member 'UWBP_Menu_Keyconfig_Settei_000_Steam_C::NewVar_0' has a wrong offset!");

}

