#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Message_Window_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Message_Window_000_modern.WBP_Menu_Message_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Message_Window_000_modern
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShow3;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TextLength;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShow2;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_DisplayName;                          // 0x0018(0x0018)()
	struct FVector2D                              K2Node_Event_NameSize;                             // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x004C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShow;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array2;                           // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern");
static_assert(sizeof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern) == 0x0000B0, "Wrong size on WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_bool_Variable2) == 0x000007, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_byte_Variable3) == 0x000008, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_byte_Variable4) == 0x000009, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_bool_Variable3) == 0x00000A, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_byte_Variable5) == 0x00000B, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, Temp_byte_Variable6) == 0x00000C, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Event_bIsShow3) == 0x00000D, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Event_bIsShow3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Event_TextLength) == 0x000010, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Event_TextLength' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Event_bIsShow2) == 0x000014, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Event_bIsShow2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Event_DisplayName) == 0x000018, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Event_DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Event_NameSize) == 0x000030, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Event_NameSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_BreakVector2D_X) == 0x000038, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_BreakVector2D_Y) == 0x00003C, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_MathExpression_ReturnValue) == 0x000048, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_GetPosition_ReturnValue) == 0x00004C, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000054, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_BreakVector2D_X2) == 0x000058, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_BreakVector2D_Y2) == 0x00005C, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Select_Default) == 0x000068, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Select2_Default) == 0x00006A, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Event_bIsShow) == 0x00006B, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Event_bIsShow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_Select3_Default) == 0x00006C, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000070, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000078, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_GetZOrder_ReturnValue) == 0x000080, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, K2Node_MakeArray_Array2) == 0x000098, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Message_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Message_Window_000_modern::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Message_Window_000_modern.WBP_Menu_Message_Window_000_modern_C.ChengePageMarkerShowState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState final
{
public:
	bool                                          bIsShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState) == 0x000001, "Wrong alignment on WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState");
static_assert(sizeof(WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState) == 0x000001, "Wrong size on WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState, bIsShow) == 0x000000, "Member 'WBP_Menu_Message_Window_000_modern_C_ChengePageMarkerShowState::bIsShow' has a wrong offset!");

// Function WBP_Menu_Message_Window_000_modern.WBP_Menu_Message_Window_000_modern_C.SetupNameWindow
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Message_Window_000_modern_C_SetupNameWindow final
{
public:
	bool                                          bIsShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector2D                              NameSize;                                          // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Message_Window_000_modern_C_SetupNameWindow) == 0x000008, "Wrong alignment on WBP_Menu_Message_Window_000_modern_C_SetupNameWindow");
static_assert(sizeof(WBP_Menu_Message_Window_000_modern_C_SetupNameWindow) == 0x000028, "Wrong size on WBP_Menu_Message_Window_000_modern_C_SetupNameWindow");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_SetupNameWindow, bIsShow) == 0x000000, "Member 'WBP_Menu_Message_Window_000_modern_C_SetupNameWindow::bIsShow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_SetupNameWindow, DisplayName) == 0x000008, "Member 'WBP_Menu_Message_Window_000_modern_C_SetupNameWindow::DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_SetupNameWindow, NameSize) == 0x000020, "Member 'WBP_Menu_Message_Window_000_modern_C_SetupNameWindow::NameSize' has a wrong offset!");

// Function WBP_Menu_Message_Window_000_modern.WBP_Menu_Message_Window_000_modern_C.SetupChoicesWindowShowMode
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode final
{
public:
	bool                                          bIsShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TextLength;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode) == 0x000004, "Wrong alignment on WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode");
static_assert(sizeof(WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode) == 0x000008, "Wrong size on WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode, bIsShow) == 0x000000, "Member 'WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode::bIsShow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode, TextLength) == 0x000004, "Member 'WBP_Menu_Message_Window_000_modern_C_SetupChoicesWindowShowMode::TextLength' has a wrong offset!");

}

