#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_083_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.ExecuteUbergraph_WBP_Menu_Parts_083_modern
// 0x0098 (0x0098 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_GetBagType_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue2;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       K2Node_Event_InItemData2;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_NotifyTag;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Object;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Value;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                Temp_byte_Variable3;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBagIconFromType_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBagName_ReturnValue;                   // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	int32                                         K2Node_Select2_Default;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                K2Node_Select3_Default;                            // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern) == 0x000098, "Wrong size on WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_GetBagType_ReturnValue) == 0x000005, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_GetBagType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_byte_Variable) == 0x000006, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_BagTypeToCharType_ReturnValue) == 0x000007, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_BagTypeToCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_BagTypeToCharType_ReturnValue2) == 0x000008, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_BagTypeToCharType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_byte_Variable2) == 0x000009, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_bool_Variable2) == 0x00000A, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_int_Variable) == 0x00000C, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_bool_Variable3) == 0x000010, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Event_InItemData2) == 0x000018, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Event_InItemData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_SetOddEffectId_Debuff) == 0x000020, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Event_NotifyTag) == 0x000028, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Event_InItemData) == 0x000030, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Event_Object) == 0x000038, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Event_Object' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Event_Value) == 0x000040, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, Temp_byte_Variable3) == 0x000044, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_Conv_IntToBool_ReturnValue) == 0x000045, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000046, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_SwitchName_CmpSuccess) == 0x000047, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Select_Default) == 0x000048, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000050, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_GetBagIconFromType_ReturnValue) == 0x000058, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_GetBagIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_GetBagName_ReturnValue) == 0x000068, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_GetBagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Select2_Default) == 0x000090, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000094, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern, K2Node_Select3_Default) == 0x000095, "Member 'WBP_Menu_Parts_083_modern_C_ExecuteUbergraph_WBP_Menu_Parts_083_modern::K2Node_Select3_Default' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.NotificationItemBase
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_NotificationItemBase final
{
public:
	class FName                                   NotifyTag;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       InItemData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_NotificationItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_NotificationItemBase");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_NotificationItemBase) == 0x000020, "Wrong size on WBP_Menu_Parts_083_modern_C_NotificationItemBase");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_NotificationItemBase, NotifyTag) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_NotificationItemBase::NotifyTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_NotificationItemBase, InItemData) == 0x000008, "Member 'WBP_Menu_Parts_083_modern_C_NotificationItemBase::InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_NotificationItemBase, Object) == 0x000010, "Member 'WBP_Menu_Parts_083_modern_C_NotificationItemBase::Object' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_NotificationItemBase, Value) == 0x000018, "Member 'WBP_Menu_Parts_083_modern_C_NotificationItemBase::Value' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Parts_083_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_DrawItemBase::InItemData' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetNumber
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_SetNumber final
{
public:
	int32                                         InNumber;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCharaNumberIcon_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharaNumberIcon_ReturnValue2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetNumber) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetNumber");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetNumber) == 0x000030, "Wrong size on WBP_Menu_Parts_083_modern_C_SetNumber");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumber, InNumber) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetNumber::InNumber' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumber, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_083_modern_C_SetNumber::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumber, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_083_modern_C_SetNumber::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumber, CallFunc_GetCharaNumberIcon_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_083_modern_C_SetNumber::CallFunc_GetCharaNumberIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumber, CallFunc_GetAccessorItem_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Parts_083_modern_C_SetNumber::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumber, CallFunc_GetCharaNumberIcon_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Parts_083_modern_C_SetNumber::CallFunc_GetCharaNumberIcon_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetNumberAndCaption
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_SetNumberAndCaption final
{
public:
	class FText                                   CaptionText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InValue;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              NumberVisibility;                                  // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetNumberAndCaption) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetNumberAndCaption");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetNumberAndCaption) == 0x000020, "Wrong size on WBP_Menu_Parts_083_modern_C_SetNumberAndCaption");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumberAndCaption, CaptionText_0) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetNumberAndCaption::CaptionText_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumberAndCaption, InValue) == 0x000018, "Member 'WBP_Menu_Parts_083_modern_C_SetNumberAndCaption::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetNumberAndCaption, NumberVisibility) == 0x00001C, "Member 'WBP_Menu_Parts_083_modern_C_SetNumberAndCaption::NumberVisibility' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetVisibilityParts
// 0x000A (0x000A - 0x0000)
struct WBP_Menu_Parts_083_modern_C_SetVisibilityParts final
{
public:
	bool                                          InBuffVisibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InNumberVisibility;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts) == 0x000001, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetVisibilityParts");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts) == 0x00000A, "Wrong size on WBP_Menu_Parts_083_modern_C_SetVisibilityParts");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, InBuffVisibility) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::InBuffVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, InNumberVisibility) == 0x000001, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::InNumberVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, Temp_byte_Variable) == 0x000002, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, Temp_byte_Variable2) == 0x000003, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, Temp_byte_Variable3) == 0x000005, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, Temp_byte_Variable4) == 0x000006, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, K2Node_Select_Default) == 0x000007, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, Temp_bool_Variable2) == 0x000008, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetVisibilityParts, K2Node_Select2_Default) == 0x000009, "Member 'WBP_Menu_Parts_083_modern_C_SetVisibilityParts::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetStatusDeadColor
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_SetStatusDeadColor final
{
public:
	EJackCharacter                                InCharType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          TextFontColor;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor) == 0x000001, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetStatusDeadColor");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor) == 0x000008, "Wrong size on WBP_Menu_Parts_083_modern_C_SetStatusDeadColor");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, InCharType) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::InCharType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, TextFontColor) == 0x000001, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::TextFontColor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, Temp_byte_Variable) == 0x000002, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, CallFunc_IsUMGAliveCharacter_bIsAlive) == 0x000004, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::CallFunc_IsUMGAliveCharacter_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, Temp_bool_Variable) == 0x000006, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusDeadColor, K2Node_Select_Default) == 0x000007, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusDeadColor::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetOddEffectType
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_083_modern_C_SetOddEffectType final
{
public:
	class FName                                   InOddEffectId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetOddEffectType) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetOddEffectType");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetOddEffectType) == 0x000010, "Wrong size on WBP_Menu_Parts_083_modern_C_SetOddEffectType");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetOddEffectType, InOddEffectId) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetOddEffectType::InOddEffectId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetOddEffectType, CallFunc_SetOddEffectId_Debuff) == 0x000008, "Member 'WBP_Menu_Parts_083_modern_C_SetOddEffectType::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetStatusRateColor
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_083_modern_C_SetStatusRateColor final
{
public:
	float                                         HPRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetStatusRateColor) == 0x000004, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetStatusRateColor");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetStatusRateColor) == 0x000004, "Wrong size on WBP_Menu_Parts_083_modern_C_SetStatusRateColor");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetStatusRateColor, HPRate) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetStatusRateColor::HPRate' has a wrong offset!");

// Function WBP_Menu_Parts_083_modern.WBP_Menu_Parts_083_modern_C.SetOddEffectId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_083_modern_C_SetOddEffectId final
{
public:
	class FName                                   InOddEffectId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_083_modern_C_SetOddEffectId) == 0x000008, "Wrong alignment on WBP_Menu_Parts_083_modern_C_SetOddEffectId");
static_assert(sizeof(WBP_Menu_Parts_083_modern_C_SetOddEffectId) == 0x000010, "Wrong size on WBP_Menu_Parts_083_modern_C_SetOddEffectId");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetOddEffectId, InOddEffectId) == 0x000000, "Member 'WBP_Menu_Parts_083_modern_C_SetOddEffectId::InOddEffectId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_083_modern_C_SetOddEffectId, CallFunc_SetOddEffectId_Debuff) == 0x000008, "Member 'WBP_Menu_Parts_083_modern_C_SetOddEffectId::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");

}

