#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_Item_000_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_Item_000_modern.WBP_Menu_Battle_Item_000_modern_C.ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGeneralValue_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   CallFunc_GetUIActionInfo_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetActionIcon_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern");
static_assert(sizeof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern) == 0x000038, "Wrong size on WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, K2Node_Event_InItemData) == 0x000008, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, CallFunc_GetGeneralValue_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::CallFunc_GetGeneralValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, CallFunc_GetUIActionInfo_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::CallFunc_GetUIActionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern, CallFunc_GetActionIcon_ReturnValue) == 0x000030, "Member 'WBP_Menu_Battle_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Battle_Item_000_modern::CallFunc_GetActionIcon_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_Item_000_modern.WBP_Menu_Battle_Item_000_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Battle_Item_000_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Item_000_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Battle_Item_000_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Battle_Item_000_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Battle_Item_000_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Battle_Item_000_modern_C_DrawItemBase::InItemData' has a wrong offset!");

// Function WBP_Menu_Battle_Item_000_modern.WBP_Menu_Battle_Item_000_modern_C.SetCharacterSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing final
{
public:
	float                                         InCharacterSpacing;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing) == 0x000004, "Wrong alignment on WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing");
static_assert(sizeof(WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing) == 0x000004, "Wrong size on WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing");
static_assert(offsetof(WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing, InCharacterSpacing) == 0x000000, "Member 'WBP_Menu_Battle_Item_000_modern_C_SetCharacterSpacing::InCharacterSpacing' has a wrong offset!");

}

