#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Effect_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_Effect_000.WBP_Hud_Status_Effect_000_C
// 0x0060 (0x03D0 - 0x0370)
class UWBP_Hud_Status_Effect_000_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Healing000_in;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EffectRoot;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flare000_1;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flare000_2;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Healing000;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine000;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine001_1;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine001_2;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine001_3;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine002_1;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_Effect_000(int32 EntryPoint);
	void Construct();
	void StartAnim();
	void EndAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_Effect_000_C">();
	}
	static class UWBP_Hud_Status_Effect_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_Effect_000_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_Effect_000_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_Effect_000_C");
static_assert(sizeof(UWBP_Hud_Status_Effect_000_C) == 0x0003D0, "Wrong size on UWBP_Hud_Status_Effect_000_C");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Status_Effect_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Healing000_in) == 0x000378, "Member 'UWBP_Hud_Status_Effect_000_C::Healing000_in' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, EffectRoot) == 0x000380, "Member 'UWBP_Hud_Status_Effect_000_C::EffectRoot' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Flare000_1) == 0x000388, "Member 'UWBP_Hud_Status_Effect_000_C::Flare000_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Flare000_2) == 0x000390, "Member 'UWBP_Hud_Status_Effect_000_C::Flare000_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Healing000) == 0x000398, "Member 'UWBP_Hud_Status_Effect_000_C::Healing000' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, RootPanel) == 0x0003A0, "Member 'UWBP_Hud_Status_Effect_000_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Shine000) == 0x0003A8, "Member 'UWBP_Hud_Status_Effect_000_C::Shine000' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Shine001_1) == 0x0003B0, "Member 'UWBP_Hud_Status_Effect_000_C::Shine001_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Shine001_2) == 0x0003B8, "Member 'UWBP_Hud_Status_Effect_000_C::Shine001_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Shine001_3) == 0x0003C0, "Member 'UWBP_Hud_Status_Effect_000_C::Shine001_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Effect_000_C, Shine002_1) == 0x0003C8, "Member 'UWBP_Hud_Status_Effect_000_C::Shine002_1' has a wrong offset!");

}

