#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_List_101_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_List_101_modern.WBP_Menu_Dougu_List_101_modern_C.KinkoActionFinishEvent__DelegateSignature
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature final
{
public:
	bool                                          bFinish;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bContinue;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnd;                                              // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature) == 0x000003, "Wrong size on WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature, bFinish) == 0x000000, "Member 'WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature::bFinish' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature, bContinue) == 0x000001, "Member 'WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature::bContinue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature, bEnd) == 0x000002, "Member 'WBP_Menu_Dougu_List_101_modern_C_KinkoActionFinishEvent__DelegateSignature::bEnd' has a wrong offset!");

// Function WBP_Menu_Dougu_List_101_modern.WBP_Menu_Dougu_List_101_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern
// 0x0880 (0x0880 - 0x0000)
struct WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemClassRefineType                   CallFunc_Array_Get_Item;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue2;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue2;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue2;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue8;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemActionCommand                     CallFunc_GetActionCommandType_ReturnValue;         // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable5;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateItemBrowserList_NumData;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable6;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetFirstMembarCharacterType_ReturnValue;  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_CharTypeToBagType_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue9;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue10;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateItemBrowserList_NumData2;           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue11;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetItemList_Output_Get;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemSortType                          CallFunc_Array_Get_Item2;                          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SortBagItemListByBagType_ReturnValue;     // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue12;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGItemActionCommand                     CallFunc_GetActionCommandType_ReturnValue2;        // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x1];                                      // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateItemBrowserList_NumData3;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue13;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ValueLooper_ReturnValue;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue14;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetPrevPageWidget_ReturnValue;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue15;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue16;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackUMGDouguSeiriResult NewParam, int32 InResult)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetCursorIndexInPage_CursorIndex;         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateItemBrowserList_NumData4;           // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_List_101_modern_C*      K2Node_DynamicCast_AsWBP_Menu_Dougu_List_101_Modern; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocusWidget_ReturnValue;                // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0240(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue17;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select2_Default;                            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountInBag_ReturnValue;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateItemBrowserList_NumData5;           // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue18;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGItemActionCommand                     CallFunc_GetActionCommandType_ReturnValue3;        // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataIndex_ReturnValue2;                // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable7;                               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateItemBrowserList_NumData6;           // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate5;             // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGDouguSeiriResult                      K2Node_CustomEvent_NewParam;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InResult;                       // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable8;                               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue19;            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DE[0x2];                                      // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x02F0(0x0048)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0340(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue2;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Main_Command_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Main_Command_000_Modern; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable9;                               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue20;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackUMGItemListInfo>           CallFunc_GetItemSyousaiList_ReturnValue;           // 0x0388(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue21;            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemClassRefineTextId_ReturnValue;     // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextIdInList_ReturnValue; // 0x03C0(0x0018)()
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate6;             // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue22;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue23;            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue24;            // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue25;            // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagSelectedItemIndex_ReturnValue;      // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue3;          // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetItemEquipmentInfo_ReturnValue;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0428(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_Menu_Dougu_Command_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Command_000_Modern; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue26;            // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue27;            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemIdFromBagIndex_ReturnValue;        // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagTargetItemIndex_ReturnValue;        // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue28;            // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue29;            // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue30;            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemIdFromBagIndex_ReturnValue2;       // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue31;            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemIdFromBagIndex_ReturnValue3;       // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ActionItem_ReturnValue;                   // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate8;             // 0x04A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x04B0(0x0048)()
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue32;            // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x0500(0x0048)()
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue4;          // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable10;                              // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue33;            // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue5;          // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x0570(0x0048)()
	class FString                                 CallFunc_GetBagName_ReturnValue;                   // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue3;            // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData4;        // 0x05D0(0x0048)()
	class UJackGameCharacter*                     CallFunc_GetBagCharacter_ReturnValue;              // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue;             // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x0628(0x0048)()
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive;             // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0678(0x0010)(ZeroConstructor, ReferenceParm)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue2;          // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue2;            // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive2;            // 0x068A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive3;            // 0x068B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue3;          // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive4;            // 0x068E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68F[0x1];                                      // 0x068F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 CallFunc_GetBagTargetType_ReturnValue4;            // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select4_Default;                            // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetBagCharacter_ReturnValue2;             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue6;          // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue3; // 0x06B8(0x0048)()
	class UJackGameCharacter*                     CallFunc_GetBagCharacter_ReturnValue3;             // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue4; // 0x0708(0x0048)()
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData5;        // 0x0750(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0798(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable6;                               // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue34;            // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 K2Node_Select5_Default;                            // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue35;            // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue; // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue;            // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D2[0x6];                                      // 0x07D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGBagText_NewParam;                   // 0x07D8(0x0018)()
	class FText                                   K2Node_Select6_Default;                            // 0x07F0(0x0018)()
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0808(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue36;            // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable11;                              // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountInBag_ReturnValue2;                  // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x082D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x082E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x082F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackItem_Bag                                 K2Node_Select7_Default;                            // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue2; // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue37;            // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindItemFromInBag_ReturnValue;            // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateItemBrowserList_NumData7;           // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousaiFromBagTypeAndItemIndex_ReturnValue3; // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0858(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGDouguSeiriResult                      Temp_byte_Variable;                                // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select8_Default;                            // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern");
static_assert(sizeof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern) == 0x000880, "Wrong size on WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000038, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_name_Variable2) == 0x000040, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_bool_Variable) == 0x000060, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_name_Variable3) == 0x000070, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000080, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetBagTargetType_ReturnValue) == 0x000088, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetBagTargetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetBagSelectedType_ReturnValue) == 0x000089, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000090, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_struct_Variable) == 0x000098, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetSoundSet_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetSoundSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000B0, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_name_Variable4) == 0x0000B8, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetSoundSet_ReturnValue2) == 0x0000C0, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetSoundSet_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x0000C8, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetBagTargetType_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetBagTargetType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetBagSelectedType_ReturnValue2) == 0x0000D1, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetBagSelectedType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x0000D8, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_CustomEvent_EventTag) == 0x0000E0, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x0000E8, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_SwitchName_CmpSuccess) == 0x0000F0, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_CustomEvent_EventName) == 0x0000F8, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_CustomEvent_InItemBase) == 0x000100, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, Temp_bool_Variable2) == 0x000108, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetDataIndex_ReturnValue) == 0x00010C, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetDataIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_SwitchName2_CmpSuccess) == 0x000110, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, CallFunc_GetAccessorItem_ReturnValue8) == 0x000118, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::CallFunc_GetAccessorItem_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern, K2Node_CustomEvent_InKeyType) == 0x000120, "Member 'WBP_Menu_Dougu_List_101_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_List_101_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
