#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Present_List_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.PageControllKeyEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature final
{
public:
	bool                                          bIsRemove;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsRight;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNextPage;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPrevPage;                                         // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bIsRemove) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bIsRemove' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bIsRight) == 0x000001, "Member 'WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bIsRight' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bNextPage) == 0x000002, "Member 'WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bNextPage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature, bPrevPage) == 0x000003, "Member 'WBP_Menu_Present_List_001_modern_C_PageControllKeyEvent__DelegateSignature::bPrevPage' has a wrong offset!");

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.ExecuteUbergraph_WBP_Menu_Present_List_001_modern
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue2;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentPage_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern) == 0x0000C8, "Wrong size on WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_CustomEvent_EventTag) == 0x000008, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_CustomEvent_EventName) == 0x000018, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_CustomEvent_InItemBase) == 0x000020, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000028, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_GetItemPresentManager_ReturnValue) == 0x000030, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_GetItemPresentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, Temp_struct_Variable) == 0x000038, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000048, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, Temp_struct_Variable2) == 0x000050, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000060, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000068, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x000070, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_GetItemPresentManager_ReturnValue2) == 0x000088, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_GetItemPresentManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_GetCurrentPage_ReturnValue) == 0x000090, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_GetCurrentPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000098, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B0, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Present_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Present_List_001_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.CustomEvent_1
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Present_List_001_modern_C_CustomEvent_1 final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_CustomEvent_1) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_CustomEvent_1) == 0x000010, "Wrong size on WBP_Menu_Present_List_001_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_CustomEvent_1, EventName) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_CustomEvent_1::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_CustomEvent_1, InItemBase) == 0x000008, "Member 'WBP_Menu_Present_List_001_modern_C_CustomEvent_1::InItemBase' has a wrong offset!");

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Present_List_001_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Present_List_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.SetPresentList
// 0x0148 (0x0148 - 0x0000)
struct WBP_Menu_Present_List_001_modern_C_SetPresentList final
{
public:
	class FName                                   DlcId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_000_modern_C*>   K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_024_modern_C*>   K2Node_MakeArray_Array2;                           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_024_modern_C*           CallFunc_Array_Get_Item2;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           CallFunc_Array_Get_Item3;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item4;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           CallFunc_Array_Get_Item5;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           CallFunc_Array_Get_Item6;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackItemPresentPackage                CallFunc_GetItemPresentPackage_OutPackage;         // 0x00A8(0x0048)()
	bool                                          CallFunc_GetItemPresentPackage_ReturnValue;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackItemPresent                       CallFunc_Array_Get_Item7;                          // 0x00F8(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemName_ReturnValue;                  // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_SetPresentList) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_SetPresentList");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_SetPresentList) == 0x000148, "Wrong size on WBP_Menu_Present_List_001_modern_C_SetPresentList");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, DlcId) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::DlcId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, Temp_int_Loop_Counter_Variable2) == 0x000014, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Add_IntInt_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, Temp_int_Array_Index_Variable2) == 0x00001C, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, K2Node_MakeArray_Array2) == 0x000030, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Length_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, Temp_int_Loop_Counter_Variable3) == 0x000058, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, Temp_int_Array_Index_Variable3) == 0x00005C, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Less_IntInt_ReturnValue2) == 0x000060, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item2) == 0x000068, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Add_IntInt_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Add_IntInt_ReturnValue4) == 0x000074, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_GetItemManager_ReturnValue) == 0x000078, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_GetItemManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item3) == 0x000080, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item4) == 0x000088, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item5) == 0x000090, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item6) == 0x000098, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_GetItemPresentManager_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_GetItemPresentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_GetItemPresentPackage_OutPackage) == 0x0000A8, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_GetItemPresentPackage_OutPackage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_GetItemPresentPackage_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_GetItemPresentPackage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Get_Item7) == 0x0000F8, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Array_Length_ReturnValue3) == 0x000108, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Less_IntInt_ReturnValue3) == 0x00010C, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_GetItemName_ReturnValue) == 0x000110, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000120, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_SetPresentList, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000140, "Member 'WBP_Menu_Present_List_001_modern_C_SetPresentList::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.ResetPresentList
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Present_List_001_modern_C_ResetPresentList final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetPresentItemList_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_ResetPresentList) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_ResetPresentList");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_ResetPresentList) == 0x000030, "Wrong size on WBP_Menu_Present_List_001_modern_C_ResetPresentList");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ResetPresentList, Page) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_ResetPresentList::Page' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ResetPresentList, Index_0) == 0x000004, "Member 'WBP_Menu_Present_List_001_modern_C_ResetPresentList::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ResetPresentList, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Menu_Present_List_001_modern_C_ResetPresentList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ResetPresentList, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Present_List_001_modern_C_ResetPresentList::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ResetPresentList, CallFunc_GetAccessorItem_ReturnValue) == 0x000018, "Member 'WBP_Menu_Present_List_001_modern_C_ResetPresentList::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ResetPresentList, CallFunc_GetPresentItemList_ReturnValue) == 0x000020, "Member 'WBP_Menu_Present_List_001_modern_C_ResetPresentList::CallFunc_GetPresentItemList_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Present_List_001_modern.WBP_Menu_Present_List_001_modern_C.ClearPresentList000Param
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Present_List_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Present_List_000_Modern; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param) == 0x000008, "Wrong alignment on WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param");
static_assert(sizeof(WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param) == 0x000020, "Wrong size on WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000008, "Member 'WBP_Menu_Present_List_001_modern_C_ClearPresentList000Param::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
