#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Suuji3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_Suuji3.WBP_Hud_Status_Suuji3_C
// 0x0038 (0x0500 - 0x04C8)
class UWBP_Hud_Status_Suuji3_C final : public UJackUMGHudStatusBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Num_0;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Num_1;                                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Num_2;                                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Suuji3_List;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Now;                                               // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_Suuji3(int32 EntryPoint);
	void InitValueHudStatusSuuji3(int32 Now_0, int32 Max, EJackUMGTextColorSet ColorType);
	void ValueChangeDelegate_Event(int32 Index_0, int32 ColorNum);
	void Construct();
	void SetColorTexture(int32 Now_Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_Suuji3_C">();
	}
	static class UWBP_Hud_Status_Suuji3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_Suuji3_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_Suuji3_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_Suuji3_C");
static_assert(sizeof(UWBP_Hud_Status_Suuji3_C) == 0x000500, "Wrong size on UWBP_Hud_Status_Suuji3_C");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Hud_Status_Suuji3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, Num_0) == 0x0004D0, "Member 'UWBP_Hud_Status_Suuji3_C::Num_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, Num_1) == 0x0004D8, "Member 'UWBP_Hud_Status_Suuji3_C::Num_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, Num_2) == 0x0004E0, "Member 'UWBP_Hud_Status_Suuji3_C::Num_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, RootPanel) == 0x0004E8, "Member 'UWBP_Hud_Status_Suuji3_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, Suuji3_List) == 0x0004F0, "Member 'UWBP_Hud_Status_Suuji3_C::Suuji3_List' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Suuji3_C, Now) == 0x0004F8, "Member 'UWBP_Hud_Status_Suuji3_C::Now' has a wrong offset!");

}

