#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_007_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_007_modern.WBP_Menu_Battle_List_007_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_007_modern
// 0x0690 (0x0690 - 0x0000)
struct WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetNumPage_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetRenkeiList_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x00B8(0x0050)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue2;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue2; // 0x0158(0x0050)()
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x01A8(0x0048)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackRenkeiSpectacleShowStatus                CallFunc_GetSpectacleShowStatus_ReturnValue;       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue9;           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue10;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRenkei_ReturnValue;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue3;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackRenkeiSpectacleShowStatus                Temp_byte_Variable;                                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue11;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x02A8(0x0010)(ZeroConstructor, ReferenceParm)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue12;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue13;          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue14;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue15;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_TextHyphenationForTextBlock_OutLineTextArray; // 0x02F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue16;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0320(0x0018)()
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue17;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue4;      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue18;          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnOddEffectStatusByParty_ReturnValue;   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     CallFunc_GetNearTargetCharacter_ReturnValue;       // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue5;      // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue19;          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGameCharacter*                     CallFunc_GetFirstTargetCharacter_ReturnValue;      // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue6;      // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue3;           // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnOddEffectStatusByParty_ReturnValue2;  // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_396[0x2];                                      // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_005_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_005_Modern; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x03B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Battle_List_001_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_013_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue3; // 0x0410(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue2;           // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue4; // 0x0480(0x0050)()
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue5; // 0x04D0(0x0050)()
	class UJackUMGUIActionInfo*                   K2Node_DynamicCast_AsJack_UMGUIAction_Info;        // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue20;          // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x0540(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x0588(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate3;             // 0x05A0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x05C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue3;           // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x05F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0610(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue4;           // 0x0628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_TextHyphenationForTextBlock_OutLineTextArray2; // 0x0640(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_JoinStringArray_ReturnValue2;             // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue3;           // 0x0660(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern");
static_assert(sizeof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern) == 0x000690, "Wrong size on WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetNumPage_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetNumPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000058, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CustomEvent_EventName) == 0x000060, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CustomEvent_InItemBase) == 0x000068, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CustomEvent_EventTag) == 0x000070, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_SwitchName_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_SwitchName2_CmpSuccess) == 0x000079, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Array_Length_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Divide_IntInt_ReturnValue) == 0x000084, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_VerifyDataTableRowName_ReturnValue) == 0x000098, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_VerifyDataTableRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetRenkeiList_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetRenkeiList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetItemContainerFromSelected_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetItemContainerFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x000108, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x000120, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000128, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x000130, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_MakeLiteralName_ReturnValue) == 0x000138, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x000140, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_VerifyDataTableRowName_ReturnValue2) == 0x000148, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_VerifyDataTableRowName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue7) == 0x000150, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetItemContainerFromSelected_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetItemContainerFromSelected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x0001A8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001F0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_MakeArray_Array) == 0x0001F8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetValidValue_ReturnValue) == 0x000208, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue8) == 0x000210, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetSpectacleShowStatus_ReturnValue) == 0x000218, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetSpectacleShowStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue9) == 0x000220, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000228, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_struct_Variable2) == 0x000230, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_name_Variable) == 0x000240, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_name_Variable2) == 0x000248, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue10) == 0x000250, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_CanRenkei_ReturnValue) == 0x000258, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_CanRenkei_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x000259, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_VerifyDataTableRowName_ReturnValue3) == 0x000260, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_VerifyDataTableRowName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_NotEqual_NameName_ReturnValue) == 0x000268, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_name_Variable3) == 0x000270, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_name_Variable4) == 0x000278, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_name_Variable5) == 0x000280, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_byte_Variable) == 0x000288, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000289, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_Select_Default) == 0x000290, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue11) == 0x000298, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetCharacterType_ReturnValue) == 0x0002A0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_struct_Variable3) == 0x0002A8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CustomEvent_InKeyType) == 0x0002B8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CustomEvent_bIsPressed) == 0x0002B9, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_int_Variable) == 0x0002BC, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002C0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue12) == 0x0002C8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue13) == 0x0002D0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue14) == 0x0002D8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue15) == 0x0002E0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0002E8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_bool_Variable) == 0x0002F0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_TextHyphenationForTextBlock_OutLineTextArray) == 0x0002F8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_TextHyphenationForTextBlock_OutLineTextArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue16) == 0x000308, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_JoinStringArray_ReturnValue) == 0x000310, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000320, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x000338, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue17) == 0x000340, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_VerifyDataTableRowName_ReturnValue4) == 0x000348, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_VerifyDataTableRowName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue18) == 0x000350, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_IsOnOddEffectStatusByParty_ReturnValue) == 0x000358, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_IsOnOddEffectStatusByParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetNearTargetCharacter_ReturnValue) == 0x000360, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetNearTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_VerifyDataTableRowName_ReturnValue5) == 0x000368, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_VerifyDataTableRowName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x000370, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000374, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetAccessorBattle_ReturnValue19) == 0x000378, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetAccessorBattle_ReturnValue19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_GetFirstTargetCharacter_ReturnValue) == 0x000380, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_GetFirstTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_VerifyDataTableRowName_ReturnValue6) == 0x000388, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_VerifyDataTableRowName_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_BattleCommandMenu_ReturnValue3) == 0x000390, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_BattleCommandMenu_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_IsOnOddEffectStatusByParty_ReturnValue2) == 0x000394, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_IsOnOddEffectStatusByParty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000395, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000398, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_005_Modern) == 0x0003A0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_005_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_DynamicCast_bSuccess) == 0x0003A8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0003B0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, Temp_struct_Variable4) == 0x0003B8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern) == 0x0003C8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_001_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_DynamicCast_bSuccess2) == 0x0003D0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0003D8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern) == 0x0003E0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_013_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_DynamicCast_bSuccess3) == 0x0003E8, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0003F0, "Member 'WBP_Menu_Battle_List_007_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_007_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
