#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_MonsterZukan_Window_004_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.MonsterIndexNotification__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature final
{
public:
	int32                                         OutMonsterIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature) == 0x000004, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature, OutMonsterIndex) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_MonsterIndexNotification__DelegateSignature::OutMonsterIndex' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug2; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug3; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_CharachterCaptureDebug_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug4; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C0(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayOpnCloseAnim_ReturnValue;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayOpnCloseAnim_ReturnValue2;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_CharachterCapture_C> K2Node_DynamicCast_AsBP_IF_Charachter_Capture;     // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackHUD*                               CallFunc_GetHUD_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnterButtonReverse_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackHUD*                               CallFunc_GetHUD_ReturnValue2;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_SlideTargetOrigin;                    // 0x01AC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MaxSlideTargetSize;                   // 0x01B4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_MinSlideTargetSize;                   // 0x01BC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern) == 0x0001C8, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_EventTag) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_InKeyType) == 0x000021, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_bIsPressed) == 0x000022, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug) == 0x000040, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug2) == 0x000058, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug3) == 0x000070, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_bSuccess3) == 0x000080, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug4) == 0x000088, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture_Debug4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_bSuccess4) == 0x000098, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_MyGeometry) == 0x0000C0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_InDeltaTime) == 0x0000FC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_Animation) == 0x000100, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_PlayOpnCloseAnim_ReturnValue) == 0x000108, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_PlayOpnCloseAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000110, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_PlayOpnCloseAnim_ReturnValue2) == 0x000118, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_PlayOpnCloseAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000120, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_AsBP_IF_Charachter_Capture) == 0x000128, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_AsBP_IF_Charachter_Capture' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_bSuccess5) == 0x000138, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetHUD_ReturnValue) == 0x000140, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_IsEnterButtonReverse_ReturnValue) == 0x000148, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_IsEnterButtonReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000150, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetHUD_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000160, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000168, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x000170, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_InResultCode) == 0x000174, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_InLoaddedObject) == 0x000178, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_InLoadInfo) == 0x000180, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_AsTexture_2D) == 0x000188, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_DynamicCast_bSuccess6) == 0x000190, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_EventName) == 0x000198, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_CustomEvent_InItemBase) == 0x0001A0, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_SwitchName2_CmpSuccess) == 0x0001A8, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_bVisible) == 0x0001A9, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_SlideTargetOrigin) == 0x0001AC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_MaxSlideTargetSize) == 0x0001B4, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern, K2Node_Event_MinSlideTargetSize) == 0x0001BC, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_MonsterZukan_Window_004_modern::K2Node_Event_MinSlideTargetSize' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.SetDebugTargetSize
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SlideTargetOrigin;                                 // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxSlideTargetSize;                                // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinSlideTargetSize;                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize) == 0x00001C, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize, bVisible) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize, SlideTargetOrigin) == 0x000004, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize::SlideTargetOrigin' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize, MaxSlideTargetSize) == 0x00000C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize::MaxSlideTargetSize' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize, MinSlideTargetSize) == 0x000014, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetDebugTargetSize::MinSlideTargetSize' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.CustomEvent_2
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2 final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2) == 0x000018, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2, InResultCode) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_2::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.CustomEvent_1
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1) == 0x000001, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1) == 0x000002, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1, InKeyType) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1, bIsPressed) == 0x000001, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_1::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.SetMonster
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                CallFunc_GetZukan2DMonsterTexture_ReturnValue;     // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster) == 0x000040, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster, InIndex) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster::InIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster, CallFunc_GetZukan2DMonsterTexture_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster::CallFunc_GetZukan2DMonsterTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonster::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.KeyLeft
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonsterCountInSyousaiList_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft) == 0x000030, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_GetMonsterCountInSyousaiList_ReturnValue) == 0x000014, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_GetMonsterCountInSyousaiList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000019, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_Subtract_IntInt_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyLeft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.KeyRight
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonsterCountInSyousaiList_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight");
static_assert(sizeof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight) == 0x000030, "Wrong size on WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_GetMonsterCountInSyousaiList_ReturnValue) == 0x000014, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_GetMonsterCountInSyousaiList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_KeyRight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_MonsterZukan_Window_004_modern.WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C.SetMonsterData
// 0x0460 (0x0460 - 0x0000)
struct WBP_Menu_Senreki_MonsterZukan_Window_004_modern_C_SetMonsterData final
{
public:
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOpenMonsterCount_MonsterCount;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOpenMonsterNumber_Number;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackTextMacroReplaceManager*           CallFunc_GetTextMacroReplaceManager_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue4;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0040(0x0018)()
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue5;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue6;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemManager*                       CallFunc_GetItemManager_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackMonsterDatabase*                   CallFunc_GetMonsterDatabase_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue7;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x0090(0x0050)()
	class FString                                 CallFunc_GetZukanMemo_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonsterCountPlusEventBattle_ReturnValue; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetMonsterMapIdList_ReturnValue;          // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLocationTitle_ReturnValue;             // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
