#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Name_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Name_000_modern.WBP_Hud_Name_000_modern_C.ExecuteUbergraph_WBP_Hud_Name_000_modern
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPhotoModeActivated_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMG3DWidgetData*                   K2Node_CustomEvent_Data2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMonsterNamePlateData*           K2Node_DynamicCast_AsJack_UMGMonster_Name_Plate_Data; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item2;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOddEffectId_Debuff;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMG3DWidgetData*                   K2Node_CustomEvent_Data;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMonsterNamePlateData*           K2Node_DynamicCast_AsJack_UMGMonster_Name_Plate_Data2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MeasureText_ReturnValue;                  // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPhotoMode;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsPhotoMode)>            K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern) == 0x000008, "Wrong alignment on WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern");
static_assert(sizeof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern) == 0x0000D8, "Wrong size on WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000008, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, Temp_bool_Variable) == 0x000010, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_IsPhotoModeActivated_ReturnValue) == 0x000011, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_IsPhotoModeActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, Temp_float_Variable) == 0x000014, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, Temp_float_Variable2) == 0x000018, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_CustomEvent_Data2) == 0x000020, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_CustomEvent_Data2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_DynamicCast_AsJack_UMGMonster_Name_Plate_Data) == 0x000030, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_DynamicCast_AsJack_UMGMonster_Name_Plate_Data' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_GetPosition_ReturnValue) == 0x00003C, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_BreakVector2D_X) == 0x000044, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_Array_Get_Item2) == 0x000058, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_SetOddEffectId_Debuff) == 0x00005D, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_SetOddEffectId_Debuff' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_CustomEvent_Data) == 0x000060, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_DynamicCast_AsJack_UMGMonster_Name_Plate_Data2) == 0x000068, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_DynamicCast_AsJack_UMGMonster_Name_Plate_Data2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_MeasureText_ReturnValue) == 0x000074, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_MeasureText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_BreakVector2D_X2) == 0x000098, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_BreakVector2D_Y2) == 0x00009C, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x0000A8, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B0, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_CustomEvent_bIsPhotoMode) == 0x0000B4, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_CustomEvent_bIsPhotoMode' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x0000B8, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_Select_Default) == 0x0000C0, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'WBP_Hud_Name_000_modern_C_ExecuteUbergraph_WBP_Hud_Name_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Hud_Name_000_modern.WBP_Hud_Name_000_modern_C.ChangePhotoModeDelegate_Event_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0 final
{
public:
	bool                                          bIsPhotoMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0) == 0x000001, "Wrong alignment on WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0");
static_assert(sizeof(WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0) == 0x000001, "Wrong size on WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0, bIsPhotoMode) == 0x000000, "Member 'WBP_Hud_Name_000_modern_C_ChangePhotoModeDelegate_Event_0::bIsPhotoMode' has a wrong offset!");

// Function WBP_Hud_Name_000_modern.WBP_Hud_Name_000_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Name_000_modern_C_SetData final
{
public:
	class UJackUMG3DWidgetData*                   Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Name_000_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Hud_Name_000_modern_C_SetData");
static_assert(sizeof(WBP_Hud_Name_000_modern_C_SetData) == 0x000008, "Wrong size on WBP_Hud_Name_000_modern_C_SetData");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_SetData, Data) == 0x000000, "Member 'WBP_Hud_Name_000_modern_C_SetData::Data' has a wrong offset!");

// Function WBP_Hud_Name_000_modern.WBP_Hud_Name_000_modern_C.Update
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Name_000_modern_C_Update final
{
public:
	class UJackUMG3DWidgetData*                   Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Name_000_modern_C_Update) == 0x000008, "Wrong alignment on WBP_Hud_Name_000_modern_C_Update");
static_assert(sizeof(WBP_Hud_Name_000_modern_C_Update) == 0x000008, "Wrong size on WBP_Hud_Name_000_modern_C_Update");
static_assert(offsetof(WBP_Hud_Name_000_modern_C_Update, Data) == 0x000000, "Member 'WBP_Hud_Name_000_modern_C_Update::Data' has a wrong offset!");

}

