#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.PageControllKeyEvent__DelegateSignature
// 0x0003 (0x0003 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature final
{
public:
	bool                                          bIsRemove;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNextPage;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPrevPage;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature) == 0x000003, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature, bIsRemove) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature::bIsRemove' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature, bNextPage) == 0x000001, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature::bNextPage' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature, bPrevPage) == 0x000002, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_PageControllKeyEvent__DelegateSignature::bPrevPage' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern
// 0x02D0 (0x02D0 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMemberDataInTuyosa*     K2Node_CustomEvent_TuyosaData;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PageMoveInput;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackGameCharacterParameters           CallFunc_GetPassiveCorrectParameters_ReturnValue;  // 0x0034(0x004C)(NoDestructor)
	struct FJackGameCharacterParameters           CallFunc_GetSeedCorrectParameters_ReturnValue;     // 0x0080(0x004C)(NoDestructor)
	struct FJackGameCharacterParameters           CallFunc_GetBasedParameters_ReturnValue;           // 0x00CC(0x004C)(NoDestructor)
	struct FJackGameCharacterParameters           CallFunc_GetEquippedParameters_ReturnValue;        // 0x0118(0x004C)(NoDestructor)
	bool                                          CallFunc_IsNitouryuu_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackGameCharacterParameters           CallFunc_GetEquippedParameters_ReturnValue2;       // 0x0168(0x004C)(NoDestructor)
	struct FJackGameCharacterParameters           CallFunc_GetBasedParameters_ReturnValue2;          // 0x01B4(0x004C)(NoDestructor)
	TArray<struct FJackGameCharacterEquippedItem> CallFunc_GetEquippedItems_ReturnValue;             // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackGameCharacterParameters           CallFunc_GetEquippedParametersWith_ReturnValue;    // 0x0210(0x004C)(NoDestructor)
	struct FJackGameCharacterParameters           CallFunc_GetEquippedParametersWith_ReturnValue2;   // 0x025C(0x004C)(NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x02B8(0x0010)(ZeroConstructor, ReferenceParm)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern) == 0x0002D0, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CustomEvent_EventTag) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CustomEvent_TuyosaData) == 0x000028, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CustomEvent_TuyosaData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CustomEvent_PageMoveInput) == 0x000030, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CustomEvent_PageMoveInput' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetPassiveCorrectParameters_ReturnValue) == 0x000034, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetPassiveCorrectParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetSeedCorrectParameters_ReturnValue) == 0x000080, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetSeedCorrectParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetBasedParameters_ReturnValue) == 0x0000CC, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetBasedParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetEquippedParameters_ReturnValue) == 0x000118, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetEquippedParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_IsNitouryuu_ReturnValue) == 0x000164, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_IsNitouryuu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetEquippedParameters_ReturnValue2) == 0x000168, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetEquippedParameters_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetBasedParameters_ReturnValue2) == 0x0001B4, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetBasedParameters_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetEquippedItems_ReturnValue) == 0x000200, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetEquippedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetEquippedParametersWith_ReturnValue) == 0x000210, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetEquippedParametersWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, CallFunc_GetEquippedParametersWith_ReturnValue2) == 0x00025C, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::CallFunc_GetEquippedParametersWith_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0002A8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_MakeArray_Array) == 0x0002B8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CustomEvent_InKeyType) == 0x0002C8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_CustomEvent_bIsPressed) == 0x0002C9, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0002CA, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Tuyosa_List_003_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_SetData final
{
public:
	class UJackUMGAccessorMemberDataInTuyosa*     TuyosaData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageMoveInput;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_SetData) == 0x000010, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_SetData, TuyosaData) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_SetData::TuyosaData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_SetData, PageMoveInput) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_SetData::PageMoveInput' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.OnKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_OnKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.UpdateTitleText
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText final
{
public:
	class UJackGameCharacter*                     GameCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           WorkTextIdList;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FName                                   WorkTextId;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 WorkText;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNitouryuu_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGSouthpaw_IsSouthpaw;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_Select2_Default;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText) == 0x0000E0, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, GameCharacter) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::GameCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, WorkTextIdList) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::WorkTextIdList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, WorkTextId) == 0x000018, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::WorkTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, WorkText) == 0x000020, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::WorkText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_IsNitouryuu_ReturnValue) == 0x000030, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_IsNitouryuu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_GetCharacterType_ReturnValue) == 0x000031, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_IsUMGSouthpaw_IsSouthpaw) == 0x000032, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_IsUMGSouthpaw_IsSouthpaw' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_Not_PreBool_ReturnValue) == 0x000033, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_bool_Variable) == 0x000034, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_name_Variable) == 0x000038, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_name_Variable2) == 0x000040, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_bool_Variable2) == 0x000048, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, K2Node_Select_Default) == 0x000050, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_name_Variable3) == 0x000058, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_name_Variable4) == 0x000060, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, K2Node_Select2_Default) == 0x000078, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, Temp_int_Variable) == 0x000080, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, K2Node_SwitchInteger_CmpSuccess) == 0x000084, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000085, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_GetText_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateTitleText::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.UpdateParamText
// 0x0190 (0x0190 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText final
{
public:
	class UTextBlock*                             ParamText;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             InvalidParamText;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackGameCharacterParameters           JackGameCharacterParameters;                       // 0x0010(0x004C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         KougekiTe;                                         // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNitouryuu;                                      // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bMainParam;                                        // 0x0061(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WorkInvalidText;                                   // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WorkText;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 WorkValueList;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x00F8(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText) == 0x000190, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, ParamText) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::ParamText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, InvalidParamText) == 0x000008, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::InvalidParamText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, JackGameCharacterParameters) == 0x000010, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::JackGameCharacterParameters' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, KougekiTe) == 0x00005C, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::KougekiTe' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, bIsNitouryuu) == 0x000060, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::bIsNitouryuu' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, bMainParam) == 0x000061, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::bMainParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, WorkInvalidText) == 0x000068, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::WorkInvalidText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, WorkText) == 0x000078, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::WorkText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, WorkValueList) == 0x000088, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::WorkValueList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, Temp_int_Loop_Counter_Variable) == 0x0000BC, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, Temp_int_Array_Index_Variable) == 0x0000C4, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000E8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Conv_StringToText_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_GetText_ReturnValue) == 0x000110, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue3) == 0x000120, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Array_Get_Item) == 0x000130, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue4) == 0x000138, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Greater_IntInt_ReturnValue) == 0x000148, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_BooleanOR_ReturnValue) == 0x000149, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_GetAsciiDecText_ReturnValue) == 0x000150, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue5) == 0x000160, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Concat_StrStr_ReturnValue6) == 0x000178, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText, CallFunc_Less_IntInt_ReturnValue) == 0x000188, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_UpdateParamText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Tuyosa_List_003_modern.WBP_Menu_Tuyosa_List_003_modern_C.InitText
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Menu_Tuyosa_List_003_modern_C_InitText final
{
public:
	TArray<class UTextBlock*>                     WorkTextBlockList;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FName>                           WorkTextIdList;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array2;                           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array3;                           // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Tuyosa_List_003_modern_C_InitText) == 0x000008, "Wrong alignment on WBP_Menu_Tuyosa_List_003_modern_C_InitText");
static_assert(sizeof(WBP_Menu_Tuyosa_List_003_modern_C_InitText) == 0x0000A8, "Wrong size on WBP_Menu_Tuyosa_List_003_modern_C_InitText");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_InitText, WorkTextBlockList) == 0x000000, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_InitText::WorkTextBlockList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_InitText, WorkTextIdList) == 0x000010, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_InitText::WorkTextIdList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tuyosa_List_003_modern_C_InitText, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_Menu_Tuyosa_List_003_modern_C_InitText::K2Node_MakeArray_Array' has a wrong offset!");
