#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_081_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_081_modern.WBP_Menu_Parts_081_modern_C.ExecuteUbergraph_WBP_Menu_Parts_081_modern
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0018(0x0050)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern");
static_assert(sizeof(WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern) == 0x000070, "Wrong size on WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern");
static_assert(offsetof(WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern, K2Node_CustomEvent_ItemContainer) == 0x000018, "Member 'WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern, K2Node_SwitchName_CmpSuccess) == 0x000068, "Member 'WBP_Menu_Parts_081_modern_C_ExecuteUbergraph_WBP_Menu_Parts_081_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Parts_081_modern.WBP_Menu_Parts_081_modern_C.DrawUpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_081_modern_C_DrawUpdateContainerDelegate::ItemContainer' has a wrong offset!");

}

