#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tuyosa_List_006_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Tuyosa_List_006_modern.WBP_Menu_Tuyosa_List_006_modern_C
// 0x0068 (0x03D8 - 0x0370)
class UWBP_Menu_Tuyosa_List_006_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           Panel_1;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_2;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_3;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_4;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_5;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_6;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_7;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_8;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   CloseEvent;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UCanvasPanel*>                   PanelList;                                         // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void CloseEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Menu_Tuyosa_List_006_modern(int32 EntryPoint);
	void SetData(const TArray<class UJackUMGItemData*>& ItemDataList);
	void Construct();
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Tuyosa_List_006_modern_C">();
	}
	static class UWBP_Menu_Tuyosa_List_006_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Tuyosa_List_006_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Tuyosa_List_006_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Tuyosa_List_006_modern_C");
static_assert(sizeof(UWBP_Menu_Tuyosa_List_006_modern_C) == 0x0003D8, "Wrong size on UWBP_Menu_Tuyosa_List_006_modern_C");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_1) == 0x000378, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_2) == 0x000380, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_3) == 0x000388, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_4) == 0x000390, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_5) == 0x000398, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_6) == 0x0003A0, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_7) == 0x0003A8, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, Panel_8) == 0x0003B0, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::Panel_8' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, CloseEvent) == 0x0003B8, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::CloseEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Tuyosa_List_006_modern_C, PanelList) == 0x0003C8, "Member 'UWBP_Menu_Tuyosa_List_006_modern_C::PanelList' has a wrong offset!");

}

