#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Balloon_002

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.ExecuteUbergraph_WBP_Hud_Balloon_002
// 0x0054 (0x0054 - 0x0000)
struct WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002");
static_assert(sizeof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002) == 0x000054, "Wrong size on WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002");
static_assert(offsetof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002, EntryPoint) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002, CallFunc_GetPanelSize_ReturnValue) == 0x000004, "Member 'WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002, K2Node_Event_MyGeometry) == 0x000014, "Member 'WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_Hud_Balloon_002_C_ExecuteUbergraph_WBP_Hud_Balloon_002::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Hud_Balloon_002_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_Tick) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_002_C_Tick");
static_assert(sizeof(WBP_Hud_Balloon_002_C_Tick) == 0x000040, "Wrong size on WBP_Hud_Balloon_002_C_Tick");
static_assert(offsetof(WBP_Hud_Balloon_002_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Hud_Balloon_002_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.SetAppearAnimation
// 0x000C (0x000C - 0x0000)
struct WBP_Hud_Balloon_002_C_SetAppearAnimation final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_SetAppearAnimation) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_002_C_SetAppearAnimation");
static_assert(sizeof(WBP_Hud_Balloon_002_C_SetAppearAnimation) == 0x00000C, "Wrong size on WBP_Hud_Balloon_002_C_SetAppearAnimation");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetAppearAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_SetAppearAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetAppearAnimation, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_Hud_Balloon_002_C_SetAppearAnimation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetAppearAnimation, CallFunc_GetEndTime_ReturnValue2) == 0x000008, "Member 'WBP_Hud_Balloon_002_C_SetAppearAnimation::CallFunc_GetEndTime_ReturnValue2' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.SetVisibleParts
// 0x0018 (0x0018 - 0x0000)
struct WBP_Hud_Balloon_002_C_SetVisibleParts final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x000C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_SetVisibleParts) == 0x000008, "Wrong alignment on WBP_Hud_Balloon_002_C_SetVisibleParts");
static_assert(sizeof(WBP_Hud_Balloon_002_C_SetVisibleParts) == 0x000018, "Wrong size on WBP_Hud_Balloon_002_C_SetVisibleParts");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetVisibleParts, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_SetVisibleParts::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetVisibleParts, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_Hud_Balloon_002_C_SetVisibleParts::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetVisibleParts, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WBP_Hud_Balloon_002_C_SetVisibleParts::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetVisibleParts, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Balloon_002_C_SetVisibleParts::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.SetTextureNumber
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Balloon_002_C_SetTextureNumber final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_SetTextureNumber) == 0x000001, "Wrong alignment on WBP_Hud_Balloon_002_C_SetTextureNumber");
static_assert(sizeof(WBP_Hud_Balloon_002_C_SetTextureNumber) == 0x000001, "Wrong size on WBP_Hud_Balloon_002_C_SetTextureNumber");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTextureNumber, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_SetTextureNumber::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.SetTexture
// 0x0060 (0x0060 - 0x0000)
struct WBP_Hud_Balloon_002_C_SetTexture final
{
public:
	float                                         CallFunc_GetNumberTexture_BlockIndex;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberTexture_BlockIndex2;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberTexture_BlockIndex3;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberTexture_BlockIndex4;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberTexture_BlockIndex5;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue3;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue4;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue5;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue6;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Array_Get_Item2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue7;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_SetTexture) == 0x000008, "Wrong alignment on WBP_Hud_Balloon_002_C_SetTexture");
static_assert(sizeof(WBP_Hud_Balloon_002_C_SetTexture) == 0x000060, "Wrong size on WBP_Hud_Balloon_002_C_SetTexture");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetNumberTexture_BlockIndex) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetNumberTexture_BlockIndex' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetNumberTexture_BlockIndex2) == 0x000004, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetNumberTexture_BlockIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetNumberTexture_BlockIndex3) == 0x000008, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetNumberTexture_BlockIndex3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetNumberTexture_BlockIndex4) == 0x00000C, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetNumberTexture_BlockIndex4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetNumberTexture_BlockIndex5) == 0x000010, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetNumberTexture_BlockIndex5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000020, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue3) == 0x000028, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue4) == 0x000030, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue5) == 0x000038, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue6) == 0x000040, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_Array_Get_Item2) == 0x000050, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetTexture, CallFunc_GetDynamicMaterial_ReturnValue7) == 0x000058, "Member 'WBP_Hud_Balloon_002_C_SetTexture::CallFunc_GetDynamicMaterial_ReturnValue7' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.GetNumberTexture
// 0x0034 (0x0034 - 0x0000)
struct WBP_Hud_Balloon_002_C_GetNumberTexture final
{
public:
	int32                                         Digit;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlockIndex;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempIndex;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_GetNumberTexture) == 0x000004, "Wrong alignment on WBP_Hud_Balloon_002_C_GetNumberTexture");
static_assert(sizeof(WBP_Hud_Balloon_002_C_GetNumberTexture) == 0x000034, "Wrong size on WBP_Hud_Balloon_002_C_GetNumberTexture");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, Digit) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::Digit' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, BlockIndex) == 0x000004, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::BlockIndex' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, TempIndex) == 0x000008, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::TempIndex' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000010, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000014, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x000024, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00002C, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Balloon_002_C_GetNumberTexture, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000030, "Member 'WBP_Hud_Balloon_002_C_GetNumberTexture::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");

// Function WBP_Hud_Balloon_002.WBP_Hud_Balloon_002_C.SetAdjustScale
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_Balloon_002_C_SetAdjustScale final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Hud_Balloon_002_C_SetAdjustScale) == 0x000001, "Wrong alignment on WBP_Hud_Balloon_002_C_SetAdjustScale");
static_assert(sizeof(WBP_Hud_Balloon_002_C_SetAdjustScale) == 0x000001, "Wrong size on WBP_Hud_Balloon_002_C_SetAdjustScale");
static_assert(offsetof(WBP_Hud_Balloon_002_C_SetAdjustScale, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_Hud_Balloon_002_C_SetAdjustScale::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

