#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_008_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Shop_List_008_modern.WBP_Menu_Shop_List_008_modern_C
// 0x0088 (0x04B8 - 0x0430)
class UWBP_Menu_Shop_List_008_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MembarTextPanel;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MemberPanel;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_0;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_3;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_4;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_6;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_9;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_13;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_18;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_032_modern_C*           WBP_Menu_Parts_032_C_24;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowImagePanel;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ItemID;                                            // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     WindowTextureList;                                 // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Shop_List_008_modern(int32 EntryPoint);
	void Construct();
	void UpdateStateWindow(class FName InItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Shop_List_008_modern_C">();
	}
	static class UWBP_Menu_Shop_List_008_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Shop_List_008_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Shop_List_008_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Shop_List_008_modern_C");
static_assert(sizeof(UWBP_Menu_Shop_List_008_modern_C) == 0x0004B8, "Wrong size on UWBP_Menu_Shop_List_008_modern_C");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Shop_List_008_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Shop_List_008_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, ItemList) == 0x000440, "Member 'UWBP_Menu_Shop_List_008_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, MembarTextPanel) == 0x000448, "Member 'UWBP_Menu_Shop_List_008_modern_C::MembarTextPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, MemberPanel) == 0x000450, "Member 'UWBP_Menu_Shop_List_008_modern_C::MemberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_0) == 0x000458, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_3) == 0x000460, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_4) == 0x000468, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_6) == 0x000470, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_9) == 0x000478, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_9' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_13) == 0x000480, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_13' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_18) == 0x000488, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_18' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WBP_Menu_Parts_032_C_24) == 0x000490, "Member 'UWBP_Menu_Shop_List_008_modern_C::WBP_Menu_Parts_032_C_24' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WindowImagePanel) == 0x000498, "Member 'UWBP_Menu_Shop_List_008_modern_C::WindowImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, ItemID) == 0x0004A0, "Member 'UWBP_Menu_Shop_List_008_modern_C::ItemID' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_008_modern_C, WindowTextureList) == 0x0004A8, "Member 'UWBP_Menu_Shop_List_008_modern_C::WindowTextureList' has a wrong offset!");

}

