#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_List_005_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Shop_List_005_modern.WBP_Menu_Shop_List_005_modern_C
// 0x0160 (0x0560 - 0x0400)
class UWBP_Menu_Shop_List_005_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_00_Oinori;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_01_Otuge;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_02_Revive;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_03_Detox;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_04_Dispel;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_05_SkillReset;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_06_SibariReset;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_07_FukkatuJumon;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_08_2DMode;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_09_Quit;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SaveDataIndex;                                     // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KyoukaiOtugeIndex;                                 // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     PartyParamInfoWidget;                              // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               MemberData;                                        // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UJackUMGItemBase*                       SelectedMemberItem;                                // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  CommandInfoWidget;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Shop_List_007_modern_C*       MemberSelectWidget;                                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Namae_Save_data_002_modern_C* SaveSlotSelectWidget;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_Saving_000_C*                  SavingWidget;                                      // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UMG_Root_Widget_modern_C*          RootWidget;                                        // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   MakePartyParamInfo;                                // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   RemovePartyParamInfo;                              // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ExecuteSave;                                       // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UJackUMGItemBase*>               MenuItemList;                                      // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWBP_Menu_Shop_List_009_modern_C*       SibariInfoWidget;                                  // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   RemoveEvent;                                       // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsValidKyoukaiData;                               // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EJackKyoukaiEffectEventType                   EventType;                                         // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstFukkatunojumon;                            // 0x051A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51B[0x5];                                      // 0x051B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   ShowPartyParamInfo;                                // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FJackDataTableChurch                   KyoukaiData;                                       // 0x0530(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void MakePartyParamInfo__DelegateSignature();
	void RemovePartyParamInfo__DelegateSignature();
	void ExecuteSave__DelegateSignature();
	void RemoveEvent__DelegateSignature();
	void ShowPartyParamInfo__DelegateSignature(bool bShow);
	void ExecuteUbergraph_WBP_Menu_Shop_List_005_modern(int32 EntryPoint);
	void OnSibariReset(EJackSibari SibariType);
	void OnSelect(class UJackUMGItemBase* ItemBase);
	void TenseiYN(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void SetupCommandInfoWidget();
	void OnCancelSibariWidget();
	void OnCancelMemberSelect();
	void OnCancel();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SendTokugiPanelMessage(class FName Message);
	void SetMenuMode();
	void PlayAnimData(const struct FJackUMGTokugiPanelAnimData& AnimData);
	void SetCharacterItemData(class UJackUMGItemData* ItemData);
	void SetPanelData(class UJackUMGTokugiPanelData* PanelData);
	void PlayAnimationNameArg(class FName Arg);
	void PlayAnimationIntArg(int32 Arg);
	void OnEndAnim(class UUserWidget* Sender);
	void SetEndAnimEventListener(TScriptInterface<class IBP_IF_TokugiPanel_Item_C> Listener);
	void PlayDefaultAnimation();
	void OnTokugiPanelWindowDestruct();
	void SetResetMode();
	void SetBattleResultMode(EJackCharacter CharacterType);
	void OnTokugiPanelWindowCancel();
	void SetCancelEventListener(TScriptInterface<class IBP_IF_TokugiPanel_Item_C> CancelEventListener);
	void SetBackGroundScroll(const struct FVector2D& BgScroll);
	void SetDisplayScale(float DisplayScale);
	void SetDisplayData(const struct FVector2D& Position_0, float Scale_0, const struct FVector2D& BgScroll);
	void SetDrawPos(const struct FVector2D& Position_0);
	void ExistsDeadMember(bool* Result);
	void ExistsDokuMember(bool* Result);
	void ExistsNoroiMember(bool* Result);
	void RemovePartyParamInfoWidget();
	void ShowGoldAndPartyParamWidget(bool bShow);
	void FixupFukkatunojumon(const class FString& Base, class FString* Result);
	void SetGoldPanelColor(EJackUMGTextColorSet InColorSet);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Shop_List_005_modern_C">();
	}
	static class UWBP_Menu_Shop_List_005_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Shop_List_005_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Shop_List_005_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Shop_List_005_modern_C");
static_assert(sizeof(UWBP_Menu_Shop_List_005_modern_C) == 0x000560, "Wrong size on UWBP_Menu_Shop_List_005_modern_C");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Shop_List_005_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Shop_List_005_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, ItemListPanel) == 0x000410, "Member 'UWBP_Menu_Shop_List_005_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_00_Oinori) == 0x000418, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_00_Oinori' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_01_Otuge) == 0x000420, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_01_Otuge' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_02_Revive) == 0x000428, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_02_Revive' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_03_Detox) == 0x000430, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_03_Detox' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_04_Dispel) == 0x000438, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_04_Dispel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_05_SkillReset) == 0x000440, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_05_SkillReset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_06_SibariReset) == 0x000448, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_06_SibariReset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_07_FukkatuJumon) == 0x000450, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_07_FukkatuJumon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_08_2DMode) == 0x000458, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_08_2DMode' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, Parts_000_09_Quit) == 0x000460, "Member 'UWBP_Menu_Shop_List_005_modern_C::Parts_000_09_Quit' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, RootPanel) == 0x000468, "Member 'UWBP_Menu_Shop_List_005_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, SaveDataIndex) == 0x000470, "Member 'UWBP_Menu_Shop_List_005_modern_C::SaveDataIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, KyoukaiOtugeIndex) == 0x000474, "Member 'UWBP_Menu_Shop_List_005_modern_C::KyoukaiOtugeIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, PartyParamInfoWidget) == 0x000478, "Member 'UWBP_Menu_Shop_List_005_modern_C::PartyParamInfoWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, MemberData) == 0x000480, "Member 'UWBP_Menu_Shop_List_005_modern_C::MemberData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, SelectedMemberItem) == 0x000490, "Member 'UWBP_Menu_Shop_List_005_modern_C::SelectedMemberItem' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, CommandInfoWidget) == 0x000498, "Member 'UWBP_Menu_Shop_List_005_modern_C::CommandInfoWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, MemberSelectWidget) == 0x0004A0, "Member 'UWBP_Menu_Shop_List_005_modern_C::MemberSelectWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, SaveSlotSelectWidget) == 0x0004A8, "Member 'UWBP_Menu_Shop_List_005_modern_C::SaveSlotSelectWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, SavingWidget) == 0x0004B0, "Member 'UWBP_Menu_Shop_List_005_modern_C::SavingWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, RootWidget) == 0x0004B8, "Member 'UWBP_Menu_Shop_List_005_modern_C::RootWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, MakePartyParamInfo) == 0x0004C0, "Member 'UWBP_Menu_Shop_List_005_modern_C::MakePartyParamInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, RemovePartyParamInfo) == 0x0004D0, "Member 'UWBP_Menu_Shop_List_005_modern_C::RemovePartyParamInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, ExecuteSave) == 0x0004E0, "Member 'UWBP_Menu_Shop_List_005_modern_C::ExecuteSave' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, MenuItemList) == 0x0004F0, "Member 'UWBP_Menu_Shop_List_005_modern_C::MenuItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, SibariInfoWidget) == 0x000500, "Member 'UWBP_Menu_Shop_List_005_modern_C::SibariInfoWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, RemoveEvent) == 0x000508, "Member 'UWBP_Menu_Shop_List_005_modern_C::RemoveEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, bIsValidKyoukaiData) == 0x000518, "Member 'UWBP_Menu_Shop_List_005_modern_C::bIsValidKyoukaiData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, EventType) == 0x000519, "Member 'UWBP_Menu_Shop_List_005_modern_C::EventType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, bIsFirstFukkatunojumon) == 0x00051A, "Member 'UWBP_Menu_Shop_List_005_modern_C::bIsFirstFukkatunojumon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, ShowPartyParamInfo) == 0x000520, "Member 'UWBP_Menu_Shop_List_005_modern_C::ShowPartyParamInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Shop_List_005_modern_C, KyoukaiData) == 0x000530, "Member 'UWBP_Menu_Shop_List_005_modern_C::KyoukaiData' has a wrong offset!");

}

