#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StaffRollWindow_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_StaffRollWindowBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StaffRollWindow_modern.WBP_StaffRollWindow_modern_C
// 0x00E0 (0x0638 - 0x0558)
class UWBP_StaffRollWindow_modern_C final : public UWBP_StaffRollWindowBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_StaffRollWindow_modern_C;       // 0x0558(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CenterName2Text;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CenterNameText;                                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CenterPostText;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CompanyPanelObj;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CompanyTextPoolPanel;                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CopyrightTextPoolPanel;                            // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fade;                                              // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeCompanyPanelObj;                               // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeThreeRowsCenterPanelObj;                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeThreeRowsLeftPanelObj;                         // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeThreeRowsRightPanelObj;                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeTwoRowsLeftPanelObj;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeTwoRowsRightPanelObj;                          // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ImagePoollPanel;                                   // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NormalTextPoolPanel;                               // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ScrollCanvasPanel;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SectionTextPoolPanel;                              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SpecialNormalTextPoolPanel;                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SpecialSectionTextPoolPanel;                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ThreeRowsCenterPanelObj;                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ThreeRowsLeftPanelObj;                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ThreeRowsRightPanelObj;                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleCopyrightTextPoolPanel;                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TwoRowsLeftPanelObj;                               // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TwoRowsRightPanelObj;                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ProgressTimer;                                     // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_StaffRollWindow_modern(int32 EntryPoint);
	void StartStaffRoll(bool bPlayThroughSecond);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PoolChildTextBlock(class UPanelWidget* TargetPanel, class FName FontTypeKey);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StaffRollWindow_modern_C">();
	}
	static class UWBP_StaffRollWindow_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StaffRollWindow_modern_C>();
	}
};
static_assert(alignof(UWBP_StaffRollWindow_modern_C) == 0x000008, "Wrong alignment on UWBP_StaffRollWindow_modern_C");
static_assert(sizeof(UWBP_StaffRollWindow_modern_C) == 0x000638, "Wrong size on UWBP_StaffRollWindow_modern_C");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, UberGraphFrame_WBP_StaffRollWindow_modern_C) == 0x000558, "Member 'UWBP_StaffRollWindow_modern_C::UberGraphFrame_WBP_StaffRollWindow_modern_C' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, Background) == 0x000560, "Member 'UWBP_StaffRollWindow_modern_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, CenterName2Text) == 0x000568, "Member 'UWBP_StaffRollWindow_modern_C::CenterName2Text' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, CenterNameText) == 0x000570, "Member 'UWBP_StaffRollWindow_modern_C::CenterNameText' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, CenterPostText) == 0x000578, "Member 'UWBP_StaffRollWindow_modern_C::CenterPostText' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, CompanyPanelObj) == 0x000580, "Member 'UWBP_StaffRollWindow_modern_C::CompanyPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, CompanyTextPoolPanel) == 0x000588, "Member 'UWBP_StaffRollWindow_modern_C::CompanyTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, CopyrightTextPoolPanel) == 0x000590, "Member 'UWBP_StaffRollWindow_modern_C::CopyrightTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, Fade) == 0x000598, "Member 'UWBP_StaffRollWindow_modern_C::Fade' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, FadeCompanyPanelObj) == 0x0005A0, "Member 'UWBP_StaffRollWindow_modern_C::FadeCompanyPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, FadeThreeRowsCenterPanelObj) == 0x0005A8, "Member 'UWBP_StaffRollWindow_modern_C::FadeThreeRowsCenterPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, FadeThreeRowsLeftPanelObj) == 0x0005B0, "Member 'UWBP_StaffRollWindow_modern_C::FadeThreeRowsLeftPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, FadeThreeRowsRightPanelObj) == 0x0005B8, "Member 'UWBP_StaffRollWindow_modern_C::FadeThreeRowsRightPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, FadeTwoRowsLeftPanelObj) == 0x0005C0, "Member 'UWBP_StaffRollWindow_modern_C::FadeTwoRowsLeftPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, FadeTwoRowsRightPanelObj) == 0x0005C8, "Member 'UWBP_StaffRollWindow_modern_C::FadeTwoRowsRightPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, ImagePoollPanel) == 0x0005D0, "Member 'UWBP_StaffRollWindow_modern_C::ImagePoollPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, NormalTextPoolPanel) == 0x0005D8, "Member 'UWBP_StaffRollWindow_modern_C::NormalTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, ScrollCanvasPanel) == 0x0005E0, "Member 'UWBP_StaffRollWindow_modern_C::ScrollCanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, SectionTextPoolPanel) == 0x0005E8, "Member 'UWBP_StaffRollWindow_modern_C::SectionTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, SpecialNormalTextPoolPanel) == 0x0005F0, "Member 'UWBP_StaffRollWindow_modern_C::SpecialNormalTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, SpecialSectionTextPoolPanel) == 0x0005F8, "Member 'UWBP_StaffRollWindow_modern_C::SpecialSectionTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, ThreeRowsCenterPanelObj) == 0x000600, "Member 'UWBP_StaffRollWindow_modern_C::ThreeRowsCenterPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, ThreeRowsLeftPanelObj) == 0x000608, "Member 'UWBP_StaffRollWindow_modern_C::ThreeRowsLeftPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, ThreeRowsRightPanelObj) == 0x000610, "Member 'UWBP_StaffRollWindow_modern_C::ThreeRowsRightPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, TitleCopyrightTextPoolPanel) == 0x000618, "Member 'UWBP_StaffRollWindow_modern_C::TitleCopyrightTextPoolPanel' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, TwoRowsLeftPanelObj) == 0x000620, "Member 'UWBP_StaffRollWindow_modern_C::TwoRowsLeftPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, TwoRowsRightPanelObj) == 0x000628, "Member 'UWBP_StaffRollWindow_modern_C::TwoRowsRightPanelObj' has a wrong offset!");
static_assert(offsetof(UWBP_StaffRollWindow_modern_C, ProgressTimer) == 0x000630, "Member 'UWBP_StaffRollWindow_modern_C::ProgressTimer' has a wrong offset!");

}

