#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_062_modern

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.ExecuteUbergraph_WBP_Menu_Parts_062_modern
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0008(0x0050)()
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  K2Node_Event_InJustification;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_CustomEvent_CaptionText;                    // 0x0090(0x0018)()
	bool                                          K2Node_CustomEvent_bIsCheck;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow;                          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern) == 0x0000B0, "Wrong size on WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, Temp_bool_Variable) == 0x000004, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, Temp_byte_Variable) == 0x000005, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CustomEvent_ItemContainer) == 0x000008, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000069, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x00006A, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_SwitchInteger_CmpSuccess) == 0x00006B, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_SwitchName_CmpSuccess) == 0x00006C, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CustomEvent_EventTag) == 0x000070, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_SwitchName2_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_Event_InJustification) == 0x000079, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_Event_InJustification' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000080, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CustomEvent_CaptionText) == 0x000090, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CustomEvent_CaptionText' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CustomEvent_bIsCheck) == 0x0000A8, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CustomEvent_bIsCheck' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_Select_Default) == 0x0000A9, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, Temp_byte_Variable3) == 0x0000AA, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, Temp_byte_Variable4) == 0x0000AB, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_CustomEvent_bShow) == 0x0000AC, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_CustomEvent_bShow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, Temp_bool_Variable2) == 0x0000AD, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern, K2Node_Select2_Default) == 0x0000AE, "Member 'WBP_Menu_Parts_062_modern_C_ExecuteUbergraph_WBP_Menu_Parts_062_modern::K2Node_Select2_Default' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.ShowCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_ShowCheck final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_ShowCheck) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_ShowCheck");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_ShowCheck) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_ShowCheck");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_ShowCheck, bShow) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_ShowCheck::bShow' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetData final
{
public:
	class FText                                   CaptionText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bIsCheck;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetData) == 0x000020, "Wrong size on WBP_Menu_Parts_062_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetData, CaptionText_0) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetData::CaptionText_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetData, bIsCheck) == 0x000018, "Member 'WBP_Menu_Parts_062_modern_C_SetData::bIsCheck' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetTextJustification
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetTextJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetTextJustification) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetTextJustification");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetTextJustification) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetTextJustification");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetTextJustification, InJustification) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetTextJustification::InJustification' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.DrawUpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_DrawUpdateContainerDelegate::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetCaptionJustification
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetCaptionJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetCaptionJustification) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetCaptionJustification");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetCaptionJustification) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetCaptionJustification");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetCaptionJustification, InJustification) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetCaptionJustification::InJustification' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetCharacterSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetCharacterSpacing final
{
public:
	float                                         InCharacterSpacing;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetCharacterSpacing) == 0x000004, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetCharacterSpacing");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetCharacterSpacing) == 0x000004, "Wrong size on WBP_Menu_Parts_062_modern_C_SetCharacterSpacing");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetCharacterSpacing, InCharacterSpacing) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetCharacterSpacing::InCharacterSpacing' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetActive) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetActive");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetActive) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetActive");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetActive, IsActive) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetActive::IsActive' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetSibariKey
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetSibariKey final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetSibariKey) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetSibariKey");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetSibariKey) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetSibariKey");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetSibariKey, Active) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetSibariKey::Active' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetAchievementStar
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetAchievementStar final
{
public:
	bool                                          Clear;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetAchievementStar) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetAchievementStar");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetAchievementStar) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetAchievementStar");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetAchievementStar, Clear) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetAchievementStar::Clear' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetCheckMark
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetCheckMark final
{
public:
	bool                                          Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetCheckMark) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetCheckMark");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetCheckMark) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetCheckMark");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetCheckMark, Visibility_0) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetCheckMark::Visibility_0' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetActiveBlue
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetActiveBlue final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetActiveBlue) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetActiveBlue");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetActiveBlue) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetActiveBlue");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetActiveBlue, IsActive) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetActiveBlue::IsActive' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetTextActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetTextActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetTextActive) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetTextActive");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetTextActive) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetTextActive");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetTextActive, IsActive) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetTextActive::IsActive' has a wrong offset!");

// Function WBP_Menu_Parts_062_modern.WBP_Menu_Parts_062_modern_C.SetSibariTasseiStar
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar final
{
public:
	bool                                          InTassei;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar) == 0x000001, "Wrong alignment on WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar");
static_assert(sizeof(WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar) == 0x000001, "Wrong size on WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar");
static_assert(offsetof(WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar, InTassei) == 0x000000, "Member 'WBP_Menu_Parts_062_modern_C_SetSibariTasseiStar::InTassei' has a wrong offset!");

}

