#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tokugi_SkillInfoBase_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.OnSetText__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature, Text) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetText__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.OnSetVisible__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature) == 0x000001, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature, IsVisible_0) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_OnSetVisible__DelegateSignature::IsVisible_0' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern
// 0x0150 (0x0150 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGTokugiPanelData*                K2Node_CustomEvent_PanelData;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     CallFunc_GetExecutableWeaponIconList_ReturnValue;  // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsLimitedExecutableWeapon_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackTokugiType                               CallFunc_GetSkillType_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSealedOrLock_ReturnValue;               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetUseMp_ReturnValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUseMp_ReturnValue2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDescription_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGTokugiPanelSkillLineData*       K2Node_CustomEvent_SkillLineData;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0080(0x0048)()
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x00C8(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReplaceMessageTag_ReturnValue;            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_InColorType;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern) == 0x000150, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_bool_Variable) == 0x000005, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable3) == 0x000007, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable4) == 0x000008, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_Select_Default) == 0x000009, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_bool_Variable2) == 0x00000A, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_CustomEvent_PanelData) == 0x000010, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_CustomEvent_PanelData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_GetExecutableWeaponIconList_ReturnValue) == 0x000018, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_GetExecutableWeaponIconList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsLimitedExecutableWeapon_ReturnValue) == 0x000028, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsLimitedExecutableWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_GetSkillType_ReturnValue) == 0x000029, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_GetSkillType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsSealedOrLock_ReturnValue) == 0x00002B, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsSealedOrLock_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_GetUseMp_ReturnValue) == 0x00002C, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_GetUseMp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_GetUseMp_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_GetUseMp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_GetDescription_ReturnValue) == 0x000038, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsValid_ReturnValue2) == 0x000069, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsValid_ReturnValue3) == 0x00006A, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_CustomEvent_SkillLineData) == 0x000070, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_CustomEvent_SkillLineData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable5) == 0x000078, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000080, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0000C8, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_MakeArray_Array) == 0x000110, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_GetText_ReturnValue) == 0x000120, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_ReplaceMessageTag_ReturnValue) == 0x000130, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_ReplaceMessageTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_CustomEvent_InColorType) == 0x000140, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_CustomEvent_InColorType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable6) == 0x000141, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_CustomEvent_IsVisible) == 0x000142, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable7) == 0x000143, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsValid_ReturnValue4) == 0x000144, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsValid_ReturnValue5) == 0x000145, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, CallFunc_IsValid_ReturnValue6) == 0x000146, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_bool_Variable3) == 0x000147, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_Select2_Default) == 0x000148, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_bool_Variable4) == 0x000149, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, Temp_byte_Variable8) == 0x00014A, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_Select3_Default) == 0x00014B, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern, K2Node_Select4_Default) == 0x00014C, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfoBase_modern::K2Node_Select4_Default' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.SetSkillInfoVisible
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible) == 0x000001, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible, IsVisible_0) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfoVisible::IsVisible_0' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.InitTextFontColor
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor final
{
public:
	EJackUMGTextColorSet                          InColorType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor) == 0x000001, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor, InColorType) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_InitTextFontColor::InColorType' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData final
{
public:
	class UJackUMGTokugiPanelData*                PanelData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData, PanelData) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetData::PanelData' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.SetSkillInfo002Widget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget final
{
public:
	class UWBP_Menu_Tokugi_SkillInfo_002_modern_C* SkillInfo002;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget) == 0x000008, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget, SkillInfo002) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_SetSkillInfo002Widget::SkillInfo002' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfoBase_modern.WBP_Menu_Tokugi_SkillInfoBase_modern_C.ShowInfoTextInSkillReset
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset final
{
public:
	class UJackUMGTokugiPanelSkillLineData*       SkillLineData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset) == 0x000008, "Wrong size on WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset, SkillLineData) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfoBase_modern_C_ShowInfoTextInSkillReset::SkillLineData' has a wrong offset!");

}

