#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Location_Message_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Location_Message_000_modern.WBP_Hud_Location_Message_000_modern_C
// 0x0068 (0x03D8 - 0x0370)
class UWBP_Hud_Location_Message_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitAnim;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Shadow;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5544;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x03A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsShow;                                            // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsShowRequest;                                     // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHideMenu;                                        // 0x03C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHideLocation;                                    // 0x03C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMenuControl;                                     // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHideMainCommand;                                 // 0x03C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C6[0x2];                                      // 0x03C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       NextAnimation;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayingAnimation;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Location_Message_000_modern(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void WidgetNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void BPActionDelegate(class FName EventTag);
	void Construct();
	void SetLocationTitle(class FName InMapId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Location_Message_000_modern_C">();
	}
	static class UWBP_Hud_Location_Message_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Location_Message_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Location_Message_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Location_Message_000_modern_C");
static_assert(sizeof(UWBP_Hud_Location_Message_000_modern_C) == 0x0003D8, "Wrong size on UWBP_Hud_Location_Message_000_modern_C");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Location_Message_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, InitAnim) == 0x000378, "Member 'UWBP_Hud_Location_Message_000_modern_C::InitAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, HideAnim) == 0x000380, "Member 'UWBP_Hud_Location_Message_000_modern_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, ShowAnim) == 0x000388, "Member 'UWBP_Hud_Location_Message_000_modern_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, InvalidationBox_0) == 0x000390, "Member 'UWBP_Hud_Location_Message_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, Text_Shadow) == 0x000398, "Member 'UWBP_Hud_Location_Message_000_modern_C::Text_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, TextBlock_5544) == 0x0003A0, "Member 'UWBP_Hud_Location_Message_000_modern_C::TextBlock_5544' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, CaptionText) == 0x0003A8, "Member 'UWBP_Hud_Location_Message_000_modern_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, IsShow) == 0x0003C0, "Member 'UWBP_Hud_Location_Message_000_modern_C::IsShow' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, IsShowRequest) == 0x0003C1, "Member 'UWBP_Hud_Location_Message_000_modern_C::IsShowRequest' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, IsHideMenu) == 0x0003C2, "Member 'UWBP_Hud_Location_Message_000_modern_C::IsHideMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, IsHideLocation) == 0x0003C3, "Member 'UWBP_Hud_Location_Message_000_modern_C::IsHideLocation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, IsMenuControl) == 0x0003C4, "Member 'UWBP_Hud_Location_Message_000_modern_C::IsMenuControl' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, IsHideMainCommand) == 0x0003C5, "Member 'UWBP_Hud_Location_Message_000_modern_C::IsHideMainCommand' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, NextAnimation) == 0x0003C8, "Member 'UWBP_Hud_Location_Message_000_modern_C::NextAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Location_Message_000_modern_C, PlayingAnimation) == 0x0003D0, "Member 'UWBP_Hud_Location_Message_000_modern_C::PlayingAnimation' has a wrong offset!");

}

