#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_MapText_Z01_1F_01_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_MapText_Z01_1F_01_modern.WBP_Menu_MapText_Z01_1F_01_modern_C
// 0x00A8 (0x0458 - 0x03B0)
class UWBP_Menu_MapText_Z01_1F_01_modern_C final : public UJackUMGMainMapOverlayWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(Transient, DuplicateTransient)
	class UWBP_Map_Text_001_C*                    Destination_F08;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_F10_Z;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_F15;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_F19;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_M01_H;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_M07;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_M07_2;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_M07_3;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_M08;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Destination_S07;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LocationName_Panel;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RuraPoint_Panel;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_RuraPoint_001_C*     SelectedRuraPoint001;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_Text_001_C*                    Z01_1F_MapGimmick_001;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        RuraPointList;                                     // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWidget*>                        UseRuraPointList;                                  // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UJackUMGItemData*>               TempRuraData;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_MapText_Z01_1F_01_modern(int32 EntryPoint);
	void Construct();
	void SetRuraData(class UJackUMGAccessorSaveDataInRura* RuraData);
	void SetupRuraMode();
	void UpdateMapTextCondition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_MapText_Z01_1F_01_modern_C">();
	}
	static class UWBP_Menu_MapText_Z01_1F_01_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_MapText_Z01_1F_01_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_MapText_Z01_1F_01_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_MapText_Z01_1F_01_modern_C");
static_assert(sizeof(UWBP_Menu_MapText_Z01_1F_01_modern_C) == 0x000458, "Wrong size on UWBP_Menu_MapText_Z01_1F_01_modern_C");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, UberGraphFrame) == 0x0003B0, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_F08) == 0x0003B8, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_F08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_F10_Z) == 0x0003C0, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_F10_Z' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_F15) == 0x0003C8, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_F15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_F19) == 0x0003D0, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_F19' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_M01_H) == 0x0003D8, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_M01_H' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_M07) == 0x0003E0, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_M07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_M07_2) == 0x0003E8, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_M07_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_M07_3) == 0x0003F0, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_M07_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_M08) == 0x0003F8, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_M08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Destination_S07) == 0x000400, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Destination_S07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, LocationName_Panel) == 0x000408, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::LocationName_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, RuraPoint_Panel) == 0x000410, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::RuraPoint_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, SelectedRuraPoint001) == 0x000418, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::SelectedRuraPoint001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, Z01_1F_MapGimmick_001) == 0x000420, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::Z01_1F_MapGimmick_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, RuraPointList) == 0x000428, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::RuraPointList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, UseRuraPointList) == 0x000438, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::UseRuraPointList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_MapText_Z01_1F_01_modern_C, TempRuraData) == 0x000448, "Member 'UWBP_Menu_MapText_Z01_1F_01_modern_C::TempRuraData' has a wrong offset!");

}

