#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Value_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_Value_003_modern.WBP_Menu_Parts_Value_003_modern_C
// 0x0038 (0x0408 - 0x03D0)
class UWBP_Menu_Parts_Value_003_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel_2;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Slash;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CaptionPanel2Text;                                 // 0x03F0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_Value_003_modern(int32 EntryPoint);
	void SetValueSingle2(int32 InValue, int32 InFig);
	void SetValueSingle1(int32 InValue);
	void SetValuePresentMP(int32 InValue);
	void SetValueDataMaxHP(int32 MaxValue);
	void SetValueDataHP(int32 Value);
	void SetValueData(int32 Value, int32 MaxValue);
	void DrawUpdateContainerDelegate(const struct FJackUMGItemContainer& ItemContainer);
	void Construct();
	void IntToEmNumbers(int32 InVal, class FString* Str);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_Value_003_modern_C">();
	}
	static class UWBP_Menu_Parts_Value_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_Value_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_Value_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_Value_003_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_Value_003_modern_C) == 0x000408, "Wrong size on UWBP_Menu_Parts_Value_003_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_Value_003_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_Value_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Value_003_modern_C, CaptionPanel) == 0x0003D8, "Member 'UWBP_Menu_Parts_Value_003_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Value_003_modern_C, CaptionPanel_2) == 0x0003E0, "Member 'UWBP_Menu_Parts_Value_003_modern_C::CaptionPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Value_003_modern_C, Slash) == 0x0003E8, "Member 'UWBP_Menu_Parts_Value_003_modern_C::Slash' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_Value_003_modern_C, CaptionPanel2Text) == 0x0003F0, "Member 'UWBP_Menu_Parts_Value_003_modern_C::CaptionPanel2Text' has a wrong offset!");

}

