#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_013_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_013_modern.WBP_Menu_Parts_013_modern_C
// 0x0090 (0x04C0 - 0x0430)
class UWBP_Menu_Parts_013_modern_C final : public UJackUMGHorizontalParts
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ChoiceCursorPanel;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ChoiceText;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBig;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextSmall;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTitle;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_10;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_11;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_01;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_02;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_03;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_04;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_05;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_06;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_07;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_08;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_09;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_013_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_013_modern_C">();
	}
	static class UWBP_Menu_Parts_013_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_013_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_013_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_013_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_013_modern_C) == 0x0004C0, "Wrong size on UWBP_Menu_Parts_013_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Parts_013_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Arrow) == 0x000438, "Member 'UWBP_Menu_Parts_013_modern_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, ChoiceCursorPanel) == 0x000440, "Member 'UWBP_Menu_Parts_013_modern_C::ChoiceCursorPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, ChoiceText) == 0x000448, "Member 'UWBP_Menu_Parts_013_modern_C::ChoiceText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, TextBig) == 0x000450, "Member 'UWBP_Menu_Parts_013_modern_C::TextBig' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, TextSmall) == 0x000458, "Member 'UWBP_Menu_Parts_013_modern_C::TextSmall' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, TextTitle) == 0x000460, "Member 'UWBP_Menu_Parts_013_modern_C::TextTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_10) == 0x000468, "Member 'UWBP_Menu_Parts_013_modern_C::Value_10' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_11) == 0x000470, "Member 'UWBP_Menu_Parts_013_modern_C::Value_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_01) == 0x000478, "Member 'UWBP_Menu_Parts_013_modern_C::Value_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_02) == 0x000480, "Member 'UWBP_Menu_Parts_013_modern_C::Value_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_03) == 0x000488, "Member 'UWBP_Menu_Parts_013_modern_C::Value_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_04) == 0x000490, "Member 'UWBP_Menu_Parts_013_modern_C::Value_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_05) == 0x000498, "Member 'UWBP_Menu_Parts_013_modern_C::Value_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_06) == 0x0004A0, "Member 'UWBP_Menu_Parts_013_modern_C::Value_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_07) == 0x0004A8, "Member 'UWBP_Menu_Parts_013_modern_C::Value_07' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_08) == 0x0004B0, "Member 'UWBP_Menu_Parts_013_modern_C::Value_08' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_013_modern_C, Value_09) == 0x0004B8, "Member 'UWBP_Menu_Parts_013_modern_C::Value_09' has a wrong offset!");

}

