#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_000_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_List_000_modern.WBP_Menu_Sakusen_List_000_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern
// 0x03F8 (0x03F8 - 0x0000)
struct WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseBattleMessageWindow_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Position2;                            // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_Position;                             // 0x0048(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_BgScroll2;                            // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DisplayScale;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_BgScroll;                             // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_TokugiPanel_Item_C> K2Node_Event_CancelEventListener;                  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                K2Node_Event_CharacterType;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_TokugiPanel_Item_C> K2Node_Event_Listener;                             // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            K2Node_Event_Sender;                               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Arg2;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_Arg;                                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGTokugiPanelData*                K2Node_Event_PanelData;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       K2Node_Event_ItemData;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGTokugiPanelAnimData            K2Node_Event_AnimData;                             // 0x00B8(0x0040)()
	class FName                                   K2Node_Event_Message;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseBattleMessageWindow_ReturnValue2;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSakusenCommandList_ReturnValue;        // 0x0150(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_CloseBattleMessageWindow_ReturnValue3;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x01B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue12;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue2;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue;        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSScenario_SScenario;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAchievementSyinpaisyou_ReturnValue;     // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable7;                             // 0x02E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUIDisableCommandByFish_IsDisableCommandByFish; // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue13;              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMantan*                 CallFunc_GetAccessorMantan_ReturnValue;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecutableMantanCommand_ReturnValue;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExecutableMantanCommand_ReturnValue2;   // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue8;            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue9;            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue;            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackTokugiManager*                     CallFunc_GetTokugiManager_ReturnValue;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackGamePlayer*                        CallFunc_GetJackGamePlayer_ReturnValue;            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackFriendGameCharacter*>       CallFunc_GetPartyMembers_ReturnValue;              // 0x0350(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	class UJackFriendGameCharacter*               CallFunc_Array_Get_Item;                           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIncreaseTokugiPoint_ReturnValue;        // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackLDT_Achievement                   K2Node_MakeStruct_JackLDT_Achievement;             // 0x0390(0x0010)(NoDestructor)
	class UJackUMGItemBase*                       CallFunc_GetItemFromTextId_ReturnValue2;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool__________Variable;                       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecutableMantanCommand_ReturnValue3;   // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecutableMantanCommand_ReturnValue4;   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackAchievementManager*                CallFunc_GetAchievementManager_ReturnValue2;       // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x03E0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseBattleMessageWindow_ReturnValue4;    // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern");
static_assert(sizeof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern) == 0x0003F8, "Wrong size on WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000020, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_byte_Variable) == 0x000028, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_byte_Variable2) == 0x000030, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_bool_Variable) == 0x000031, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_CloseBattleMessageWindow_ReturnValue) == 0x000038, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_CloseBattleMessageWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Position2) == 0x000040, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Position2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Position) == 0x000048, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Position' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Scale) == 0x000050, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_BgScroll2) == 0x000054, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_BgScroll2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_DisplayScale) == 0x00005C, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_DisplayScale' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_BgScroll) == 0x000060, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_BgScroll' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_CancelEventListener) == 0x000068, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_CancelEventListener' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_CharacterType) == 0x000078, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_CharacterType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Listener) == 0x000080, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Listener' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Sender) == 0x000090, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Arg2) == 0x000098, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Arg2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Arg) == 0x0000A0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Arg' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_PanelData) == 0x0000A8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_PanelData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_ItemData) == 0x0000B0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_AnimData) == 0x0000B8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_AnimData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Event_Message) == 0x0000F8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_bool_True_if_break_was_hit_Variable) == 0x000100, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CustomEvent_EventTag) == 0x000108, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000110, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000111, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CustomEvent_EventName) == 0x000118, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CustomEvent_InItemBase) == 0x000120, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000128, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000129, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_CloseBattleMessageWindow_ReturnValue2) == 0x000130, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_CloseBattleMessageWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000138, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000140, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000148, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetSakusenCommandList_ReturnValue) == 0x000150, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetSakusenCommandList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_CloseBattleMessageWindow_ReturnValue3) == 0x000160, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_CloseBattleMessageWindow_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_bool_Variable2) == 0x000168, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000170, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable2) == 0x000178, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000188, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000190, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000198, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x0001A0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0001A8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_int_Loop_Counter_Variable) == 0x0001B0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable3) == 0x0001B8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0001C8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x0001D0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_OpenMenu_ReturnValue) == 0x0001D8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0001E0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x0001E8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable4) == 0x0001F0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x000200, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000208, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000210, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000218, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000220, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue10) == 0x000228, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000230, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable5) == 0x000238, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue11) == 0x000248, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x000250, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000258, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable6) == 0x000260, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CustomEvent_Sender) == 0x000270, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CustomEvent_CurrentTextID) == 0x000278, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x000280, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000288, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x000298, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0002A0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_StopBGM_ReturnValue) == 0x0002A8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue12) == 0x0002B0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x0002B8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetAccessorCommon_ReturnValue) == 0x0002C0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetAccessorCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetAccessorCommon_ReturnValue2) == 0x0002C8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetAccessorCommon_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetAchievementManager_ReturnValue) == 0x0002D0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetAchievementManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsSScenario_SScenario) == 0x0002D8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsSScenario_SScenario' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsAchievementSyinpaisyou_ReturnValue) == 0x0002D9, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsAchievementSyinpaisyou_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_struct_Variable7) == 0x0002E0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_name_Variable) == 0x0002F0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsUIDisableCommandByFish_IsDisableCommandByFish) == 0x0002F8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsUIDisableCommandByFish_IsDisableCommandByFish' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetUMGManager_ReturnValue13) == 0x000300, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetUMGManager_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_Not_PreBool_ReturnValue2) == 0x000308, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetAccessorMantan_ReturnValue) == 0x000310, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetAccessorMantan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsExecutableMantanCommand_ReturnValue) == 0x000318, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsExecutableMantanCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsExecutableMantanCommand_ReturnValue2) == 0x000319, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsExecutableMantanCommand_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue8) == 0x000320, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue9) == 0x000328, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetItemFromTextId_ReturnValue) == 0x000330, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetItemFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsValid_ReturnValue) == 0x000338, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Select_Default) == 0x000339, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetTokugiManager_ReturnValue) == 0x000340, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetTokugiManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetJackGamePlayer_ReturnValue) == 0x000348, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetJackGamePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetPartyMembers_ReturnValue) == 0x000350, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000360, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_Array_Get_Item) == 0x000370, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000378, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_Array_Length_ReturnValue) == 0x00037C, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsIncreaseTokugiPoint_ReturnValue) == 0x000380, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsIncreaseTokugiPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000381, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_BooleanOR_ReturnValue) == 0x000382, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_BooleanAND_ReturnValue) == 0x000383, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_name_Variable2) == 0x000388, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_MakeStruct_JackLDT_Achievement) == 0x000390, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_MakeStruct_JackLDT_Achievement' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_GetItemFromTextId_ReturnValue2) == 0x0003A0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_GetItemFromTextId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, Temp_bool__________Variable) == 0x0003A8, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::Temp_bool__________Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, CallFunc_IsValid_ReturnValue2) == 0x0003A9, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern, K2Node_Select2_Default) == 0x0003B0, "Member 'WBP_Menu_Sakusen_List_000_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_000_modern::K2Node_Select2_Default' has a wrong offset!");
