#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_009_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_009_modern
// 0x0310 (0x0310 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSuccessful_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Battle_List_010_modern_C*     K2Node_DynamicCast_AsWBP_Menu_Battle_List_010_Modern; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSibariPlayFlag_ReturnValue;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndexFromRegion_ReturnValue;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGSoubiData                      CallFunc_GetSoubiDataFromIndex_ReturnValue;        // 0x00B0(0x0070)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousai_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue2;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnAsyncFixupCharacterLooks_ReturnValue; // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnAsyncFixupCharacterLooks_ReturnValue2; // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultDeltaTime_ReturnValue;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetUMGSoubiRegionMessageTextId_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x01E8(0x0048)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetBagEquipmentItemList_ReturnValue;      // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	EJackEquipmentRegion                          Temp_byte_Variable3;                               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackEquipmentRegion                          K2Node_Select_Default;                             // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemListInfo                   CallFunc_Array_Get_Item;                           // 0x0290(0x0018)(NoDestructor)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndexFromRegion_ReturnValue2;      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6[0x2];                                      // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate5;             // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemListInfo                   CallFunc_Array_Get_Item2;                          // 0x02F0(0x0018)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern) == 0x000310, "Wrong size on WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_EventTag) == 0x000020, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_EventName) == 0x000030, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_InItemBase) == 0x000038, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_SwitchName2_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_IsSuccessful_ReturnValue) == 0x000041, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_IsSuccessful_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000048, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_DynamicCast_AsWBP_Menu_Battle_List_010_Modern) == 0x000050, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_DynamicCast_AsWBP_Menu_Battle_List_010_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_InEventTag) == 0x000060, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000068, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_InObject) == 0x000070, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_SwitchName3_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_InKeyType) == 0x000079, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_bIsPressed) == 0x00007A, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000080, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_IsSibariPlayFlag_ReturnValue) == 0x000089, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_IsSibariPlayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x00008A, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000090, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000098, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetItemIndexFromRegion_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetItemIndexFromRegion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetSoubiDataFromIndex_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetSoubiDataFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000120, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000128, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetItemSyousai_ReturnValue) == 0x000130, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetItemSyousai_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_struct_Variable) == 0x000138, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000148, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Array_Length_ReturnValue) == 0x00014C, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_BooleanAND_ReturnValue) == 0x000150, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000151, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000158, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000168, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetRealTimeSeconds_ReturnValue2) == 0x00016C, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetRealTimeSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000170, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000174, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Conv_FloatToString_ReturnValue) == 0x000178, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000188, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Concat_StrStr_ReturnValue) == 0x000190, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_byte_Variable) == 0x0001A0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_IsOnAsyncFixupCharacterLooks_ReturnValue) == 0x0001A1, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_IsOnAsyncFixupCharacterLooks_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_IsOnAsyncFixupCharacterLooks_ReturnValue2) == 0x0001A2, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_IsOnAsyncFixupCharacterLooks_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_byte_Variable2) == 0x0001A3, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0001A8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Concat_StrStr_ReturnValue2) == 0x0001B8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetSelectedItem_ReturnValue) == 0x0001C8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_bool_Variable) == 0x0001D0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetDefaultDeltaTime_ReturnValue) == 0x0001D4, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetDefaultDeltaTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0001D8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetUMGSoubiRegionMessageTextId_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetUMGSoubiRegionMessageTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x0001E8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000230, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_MakeArray_Array) == 0x000238, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000248, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000258, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetBagEquipmentItemList_ReturnValue) == 0x000260, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetBagEquipmentItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000270, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_byte_Variable3) == 0x000280, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, Temp_bool_Variable2) == 0x000281, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_Select_Default) == 0x000282, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CustomEvent_OutItemIndex) == 0x000284, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CustomEvent_OutItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000288, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Array_Get_Item) == 0x000290, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x0002A8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_DynamicCast_bSuccess2) == 0x0002B0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0002B4, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0002B8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002C0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x0002C8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GetItemIndexFromRegion_ReturnValue2) == 0x0002D0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GetItemIndexFromRegion_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x0002D4, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_Select2_Default) == 0x0002D5, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x0002D8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Array_Length_ReturnValue2) == 0x0002E8, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Array_Get_Item2) == 0x0002F0, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000308, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000309, "Member 'WBP_Menu_Battle_List_009_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_009_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.ItemindexNotification_Event_0
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0 final
{
public:
	int32                                         OutItemIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0) == 0x000004, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0) == 0x000004, "Wrong size on WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0, OutItemIndex) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_ItemindexNotification_Event_0::OutItemIndex' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Battle_List_009_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_009_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Battle_List_009_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.ItemListControlEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent) == 0x000010, "Wrong size on WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_009_modern_C_ItemListControlEvent::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.UpdateRegionList
// 0x0080 (0x0080 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_UpdateRegionList final
{
public:
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x0000(0x0050)()
	class UJackUMGSoubiList*                      K2Node_DynamicCast_AsJack_UMGSoubi_List;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_GetCharacterSoubi_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_UpdateRegionList");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList) == 0x000080, "Wrong size on WBP_Menu_Battle_List_009_modern_C_UpdateRegionList");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, CallFunc_GetItemContainer_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::CallFunc_GetItemContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, K2Node_DynamicCast_AsJack_UMGSoubi_List) == 0x000050, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::K2Node_DynamicCast_AsJack_UMGSoubi_List' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, CallFunc_GetAccessorMembers_ReturnValue) == 0x000060, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, CallFunc_GetAccessorBattle_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, CallFunc_GetCharacterSoubi_ReturnValue) == 0x000070, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::CallFunc_GetCharacterSoubi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_UpdateRegionList, CallFunc_GetCharacterType_ReturnValue) == 0x000078, "Member 'WBP_Menu_Battle_List_009_modern_C_UpdateRegionList::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.AddSoubiDataList
// 0x0100 (0x0100 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList final
{
public:
	struct FJackUMGSoubiData                      JackUMGSoubiData;                                  // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FJackUMGSoubiData                      NewLocalVar_0;                                     // 0x0070(0x0070)(Edit, BlueprintVisible)
	struct FJackUMGItemListInfo                   K2Node_MakeStruct_JackUMGItemListInfo;             // 0x00E0(0x0018)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList) == 0x000100, "Wrong size on WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList, JackUMGSoubiData) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList::JackUMGSoubiData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList, NewLocalVar_0) == 0x000070, "Member 'WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList, K2Node_MakeStruct_JackUMGItemListInfo) == 0x0000E0, "Member 'WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList::K2Node_MakeStruct_JackUMGItemListInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList, CallFunc_Array_Add_ReturnValue) == 0x0000FC, "Member 'WBP_Menu_Battle_List_009_modern_C_AddSoubiDataList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_009_modern.WBP_Menu_Battle_List_009_modern_C.OpenSetumeiWindow
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_003_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_003_Modern; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Status_000_modern_C*    K2Node_DynamicCast_AsWBP_Menu_Dougu_Status_000_Modern; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow");
static_assert(sizeof(WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow) == 0x000050, "Wrong size on WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_009_modern_C_OpenSetumeiWindow::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
