#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Photo_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Photo_000_modern.WBP_Hud_Photo_000_modern_C.ExecuteUbergraph_WBP_Hud_Photo_000_modern
// 0x0520 (0x0520 - 0x0000)
struct WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePlayerCondition_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeAnimationRunning_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue3;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue4;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue5;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue6;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue7;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSeaOrSkyMap_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackHUD*                               CallFunc_GetJackHUD_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue8;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFadeAnimationRunning_ReturnValue2;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSmallPhotoMode_ReturnValue;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue9;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackPhotoModeEvent                           K2Node_CustomEvent_EventType;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue10;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOpen;                        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InSelectedIndex;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_GetSerifuWindowController_ReturnValue2;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue11;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue12;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 CallFunc_GetPhotoModeCharacters_OutCharacters;     // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(bool bIsOpen, int32 InSelectedIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue13;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue14;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadLookAtEnable_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackPlayerController*                  CallFunc_GetJackPlayerController_ReturnValue2;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackHUD*                               CallFunc_GetJackHUD_ReturnValue2;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackPhotoModeEvent EventType)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class AJackGameMode*                          CallFunc_GetJackGameMode_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue15;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEndStabilizePose_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AJackCharacter*>                 CallFunc_GetPhotoModeFollowingCharacters_OutCharacters; // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RequestRelocation_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue16;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadLookAtEnable_ReturnValue2;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_Text_Icon_080_modern_C*> K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue17;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEmoteNum_ReturnValue;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue2;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue3;              // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAlignment_ReturnValue;             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                K2Node_CustomEvent_Character;                      // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue18;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJackCharacter*                         CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorCommon*                 CallFunc_GetAccessorCommon_ReturnValue;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AJackCharacter*>                 CallFunc_CheckSavePosition_OutReturnCharacter;     // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckSavePosition_ReturnValue;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackCharacter*                         CallFunc_Array_Get_Item2;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue2;            // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x02A4(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Menu_Parts_Text_Icon_080_modern_C*> K2Node_MakeArray_Array2;                           // 0x02E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UWBP_Menu_Parts_Text_Icon_080_modern_C* CallFunc_Array_Get_Item3;                          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSoundSet*                       CallFunc_GetSoundSet_ReturnValue;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue19;        // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSmallPhotoMode_ReturnValue2;            // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue20;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue21;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue22;        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrentMapTown_bTown;                // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCurrentMapRoom_RoomMap;              // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSmallPhotoMode_ReturnValue3;            // 0x036F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue23;        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A[0x2];                                      // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0388(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_Icon_080_modern_C* CallFunc_Array_Get_Item4;                          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue24;        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSaveAlbumState_ReturnValue;            // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackPhotoModeErrorCode                       CallFunc_GetSaveAlbumErrorCode_ReturnValue;        // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsResamplingEnd_ReturnValue;              // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x03CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveAlbumBuffer_ReturnValue;              // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue25;        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PreCapture_ReturnValue;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPreCaptureDelaySeconds_ReturnValue;    // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PostAnimation_ReturnValue;                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCaptureExecuted_ReturnValue;            // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsScreenPercentageChanged_ReturnValue;    // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PostPreviewCapture_ReturnValue;           // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PrePreviewCapture_ReturnValue;            // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AJackPhotoModeCapture*                  CallFunc_GetPhotoModeCapture_ReturnValue;          // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_PhotoMode_C>    K2Node_DynamicCast_AsBP_IF_Photo_Mode;             // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue26;        // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPostAnimationDelaySeconds_ReturnValue; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0420(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0430(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIPlatformType                           Temp_byte_Variable;                                // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue27;        // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PostCapture_ReturnValue;                  // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466[0x2];                                      // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue10;                 // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPostCaptureDelaySeconds_ReturnValue;   // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecCapturePreviousFrame_ReturnValue;     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetExecCaptureDelaySeconds_ReturnValue;   // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue28;        // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0488(0x0010)(ZeroConstructor, NoDestructor)
	EJackPhotoModeCommand                         CallFunc_JackKeysToPhotoModeCommand_ReturnValue;   // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x04A0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue29;        // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultDeltaTime_ReturnValue;          // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue30;        // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x04D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsPhotoModeNotAvailable_ReturnValue;      // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue31;        // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackPhotoModeManager*                  CallFunc_GetPhotoModeManager_ReturnValue32;        // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPhotoModeNotAvailable_ReturnValue2;     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPhotoModeNotAvailable_ReturnValue3;     // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReverseEnterCancelButton_ReturnValue;   // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB[0x5];                                      // 0x04FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIPlatformType                           CallFunc_GetUIPlatformType_ReturnValue;            // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select2_Default;                            // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select3_Default;                            // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern) == 0x000008, "Wrong alignment on WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern");
static_assert(sizeof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern) == 0x000520, "Wrong size on WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetSerifuWindowController_ReturnValue) == 0x000010, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetSerifuWindowController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000018, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue) == 0x000020, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000028, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsGamePlayerCondition_ReturnValue) == 0x000034, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsGamePlayerCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000038, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue2) == 0x000040, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsFadeAnimationRunning_ReturnValue) == 0x000048, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsFadeAnimationRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_BooleanOR_ReturnValue) == 0x000049, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue3) == 0x000050, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue4) == 0x000058, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue5) == 0x000060, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue6) == 0x000068, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000070, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue7) == 0x000078, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsSeaOrSkyMap_ReturnValue) == 0x000080, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsSeaOrSkyMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_BooleanOR_ReturnValue2) == 0x000081, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetJackPlayerController_ReturnValue) == 0x000088, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetJackPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetJackHUD_ReturnValue) == 0x000090, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetJackHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue8) == 0x000098, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsFadeAnimationRunning_ReturnValue2) == 0x0000A0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsFadeAnimationRunning_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsSmallPhotoMode_ReturnValue) == 0x0000A1, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsSmallPhotoMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Not_PreBool_ReturnValue) == 0x0000A2, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue9) == 0x0000A8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Not_PreBool_ReturnValue2) == 0x0000B0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_CustomEvent_EventType) == 0x0000B1, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0000B2, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue10) == 0x0000B8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_CustomEvent_bIsOpen) == 0x0000C0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_CustomEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_CustomEvent_InSelectedIndex) == 0x0000C4, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_CustomEvent_InSelectedIndex' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000C8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Not_PreBool_ReturnValue3) == 0x0000D0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetSerifuWindowController_ReturnValue2) == 0x0000D8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetSerifuWindowController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue11) == 0x0000E0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue12) == 0x0000E8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeCharacters_OutCharacters) == 0x0000F0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeCharacters_OutCharacters' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue13) == 0x000110, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue14) == 0x000118, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsHeadLookAtEnable_ReturnValue) == 0x000120, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsHeadLookAtEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000128, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000138, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetJackPlayerController_ReturnValue2) == 0x000140, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetJackPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetJackHUD_ReturnValue2) == 0x000148, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetJackHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000150, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetJackGameMode_ReturnValue) == 0x000160, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetJackGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, Temp_int_Array_Index_Variable2) == 0x000168, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue15) == 0x000170, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue15' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsEndStabilizePose_ReturnValue) == 0x000178, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsEndStabilizePose_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeFollowingCharacters_OutCharacters) == 0x000180, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeFollowingCharacters_OutCharacters' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_RequestRelocation_ReturnValue) == 0x000190, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_RequestRelocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_GetPhotoModeManager_ReturnValue16) == 0x000198, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_GetPhotoModeManager_ReturnValue16' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_IsHeadLookAtEnable_ReturnValue2) == 0x0001A0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_IsHeadLookAtEnable_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, K2Node_MakeArray_Array) == 0x0001A8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x0001BC, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x0001C0, "Member 'WBP_Hud_Photo_000_modern_C_ExecuteUbergraph_WBP_Hud_Photo_000_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
