#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Name_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Name_000_modern.WBP_Hud_Name_000_modern_C
// 0x0030 (0x03A0 - 0x0370)
class UWBP_Hud_Name_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_726;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Icon;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_001;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Buff_000_C*             WBP_Menu_Parts_Buff_000;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Name_000_modern(int32 EntryPoint);
	void ChangePhotoModeDelegate_Event_0(bool bIsPhotoMode);
	void Construct();
	void HideFukidasi();
	void SetData(class UJackUMG3DWidgetData* Data);
	void Update(class UJackUMG3DWidgetData* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Name_000_modern_C">();
	}
	static class UWBP_Hud_Name_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Name_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Name_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Name_000_modern_C");
static_assert(sizeof(UWBP_Hud_Name_000_modern_C) == 0x0003A0, "Wrong size on UWBP_Hud_Name_000_modern_C");
static_assert(offsetof(UWBP_Hud_Name_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Hud_Name_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Name_000_modern_C, CanvasPanel_726) == 0x000378, "Member 'UWBP_Hud_Name_000_modern_C::CanvasPanel_726' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Name_000_modern_C, Icon) == 0x000380, "Member 'UWBP_Hud_Name_000_modern_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Name_000_modern_C, RootPanel) == 0x000388, "Member 'UWBP_Hud_Name_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Name_000_modern_C, Text_001) == 0x000390, "Member 'UWBP_Hud_Name_000_modern_C::Text_001' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Name_000_modern_C, WBP_Menu_Parts_Buff_000) == 0x000398, "Member 'UWBP_Hud_Name_000_modern_C::WBP_Menu_Parts_Buff_000' has a wrong offset!");

}

