#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Camera_Setting_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern
// 0x0170 (0x0170 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           Temp_object_Variable2;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           Temp_object_Variable3;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           Temp_object_Variable4;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           Temp_object_Variable5;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManaTexture*                           Temp_object_Variable6;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Namae_Furigana_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Namae_Furigana_000_Modern; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue9;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue10;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue11;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue12;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern) == 0x000170, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000028, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_object_Variable) == 0x000030, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000038, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_object_Variable2) == 0x000040, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_object_Variable3) == 0x000048, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_object_Variable4) == 0x000050, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_object_Variable5) == 0x000058, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_object_Variable6) == 0x000060, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CustomEvent_EventTag) == 0x000068, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000070, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CustomEvent_EventName) == 0x000078, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CustomEvent_InItemBase) == 0x000080, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000089, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_SwitchName4_CmpSuccess) == 0x00008A, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000090, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000098, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CustomEvent_Sender) == 0x0000A0, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CustomEvent_CurrentTextID) == 0x0000A8, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x0000B0, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000C0, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, Temp_struct_Variable2) == 0x0000C8, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000D8, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000E8, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F8, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000108, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_IsOpenSerifuWindow_ReturnValue) == 0x000110, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_IsOpenSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000120, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000128, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_DynamicCast_AsWBP_Menu_Namae_Furigana_000_Modern) == 0x000130, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_DynamicCast_AsWBP_Menu_Namae_Furigana_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000139, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue) == 0x00013C, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue2) == 0x000140, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue3) == 0x000144, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue4) == 0x000148, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue5) == 0x00014C, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue6) == 0x000150, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue7) == 0x000154, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue8) == 0x000158, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue9) == 0x00015C, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue10) == 0x000160, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue11) == 0x000164, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern, CallFunc_Array_Add_ReturnValue12) == 0x000168, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern::CallFunc_Array_Add_ReturnValue12' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.SelectTextSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet) == 0x000008, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SelectTextSet::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.SaveAndBack
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack final
{
public:
	int32                                         CallFunc_GetValue_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue2;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_ReturnValue3;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack) == 0x000028, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_GetValue_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_GetValue_ReturnValue2) == 0x000004, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_GetValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_GetValue_ReturnValue3) == 0x000010, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_GetValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000021, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x000022, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveAndBack::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.GetAllValue
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable5;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInversHorizontalCamera_ReturnValue;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAutoFollowCamera_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInversVerticalCamera_ReturnValue;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select3_Default;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue) == 0x000050, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_bool_Variable) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_int_Variable2) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_bool_Variable2) == 0x00000C, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_int_Variable3) == 0x000010, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_int_Variable4) == 0x000014, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_bool_Variable3) == 0x000018, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_int_Variable5) == 0x00001C, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, Temp_int_Variable6) == 0x000020, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000030, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, CallFunc_IsInversHorizontalCamera_ReturnValue) == 0x000038, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::CallFunc_IsInversHorizontalCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, CallFunc_IsAutoFollowCamera_ReturnValue) == 0x000039, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::CallFunc_IsAutoFollowCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, K2Node_Select_Default) == 0x00003C, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, K2Node_Select2_Default) == 0x000040, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, CallFunc_IsInversVerticalCamera_ReturnValue) == 0x000044, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::CallFunc_IsInversVerticalCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue, K2Node_Select3_Default) == 0x000048, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GetAllValue::K2Node_Select3_Default' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.SetInfoText
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText final
{
public:
	class FName                                   TempTextID;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText) == 0x000010, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText, TempTextID) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText::TempTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.GotoTheNextMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu final
{
public:
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu) == 0x000028, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000010, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000020, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_GotoTheNextMenu::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.SetFadePanel
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel) == 0x000001, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SetFadePanel::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C.SaveSelectedItemId
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId final
{
public:
	class UJackUMGItemBase*                       CallFunc_GetSelectedItem_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId");
static_assert(sizeof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId) == 0x000008, "Wrong size on WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId");
static_assert(offsetof(WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId, CallFunc_GetSelectedItem_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Camera_Setting_000_modern_C_SaveSelectedItemId::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");

}

