#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Window_001_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Namae_Sibari_Setting_000_modern_C* K2Node_DynamicCast_AsWBP_Menu_Namae_Sibari_Setting_000_Modern; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveDataEmptyInCached_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSaveDataEmptyInCached_ReturnValue2;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSaveDataFullInCached_ReturnValue;       // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue7;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue3;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue4;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue8;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue2;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoukennosyoTrialRestertMsg_ReturnValue; // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSerifuWindow_ReturnValue3;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue5;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenWebBrowser_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0128(0x0018)()
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue9;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBrokenTrialSaveData_ReturnValue;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGSaveDataCheckResult                   K2Node_CustomEvent_Result3;                        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x01D0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_CustomEvent_Result2;                        // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_VerifyDataTableRowName_ReturnValue;       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayBGMFromBGMID_ReturnValue;             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable7;                             // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable8;                             // 0x0278(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item;                           // 0x02A4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate3;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckResult                   K2Node_CustomEvent_Result;                         // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern) == 0x0002E0, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000028, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000038, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_InKeyType) == 0x000040, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_bIsPressed) == 0x000041, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000058, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x000060, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_DynamicCast_AsWBP_Menu_Namae_Sibari_Setting_000_Modern) == 0x000068, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_DynamicCast_AsWBP_Menu_Namae_Sibari_Setting_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x000078, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000080, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue6) == 0x000088, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsSaveDataEmptyInCached_ReturnValue) == 0x000090, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsSaveDataEmptyInCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsSaveDataEmptyInCached_ReturnValue2) == 0x000091, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsSaveDataEmptyInCached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsSaveDataFullInCached_ReturnValue) == 0x000092, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsSaveDataFullInCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000098, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000A0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue7) == 0x0000A8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchName_CmpSuccess) == 0x0000B0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_CheckPoint4) == 0x0000B1, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_CheckPoint4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_Result) == 0x0000B2, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0000B3, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x0000B8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000C0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsTrial_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_CloseSerifuWindow_ReturnValue3) == 0x0000D8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_CloseSerifuWindow_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_CloseSerifuWindow_ReturnValue4) == 0x0000E0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_CloseSerifuWindow_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsOpenSerifuWindow_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsOpenSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue8) == 0x0000F0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsOpenSerifuWindow_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsOpenSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsBoukennosyoTrialRestertMsg_ReturnValue) == 0x0000F9, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsBoukennosyoTrialRestertMsg_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000100, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsOpenSerifuWindow_ReturnValue3) == 0x000108, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsOpenSerifuWindow_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_CloseSerifuWindow_ReturnValue5) == 0x000110, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_CloseSerifuWindow_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000118, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_OpenWebBrowser_ReturnValue) == 0x000120, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_OpenWebBrowser_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000128, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000140, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_GetAccessorSaveData_ReturnValue9) == 0x000148, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_GetAccessorSaveData_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_IsBrokenTrialSaveData_ReturnValue) == 0x000150, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_IsBrokenTrialSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000158, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_EventTag) == 0x000168, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable2) == 0x000170, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000180, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000188, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable3) == 0x000190, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_Result3) == 0x0001A0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_Result3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x0001A8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchEnum3_CmpSuccess) == 0x0001B0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x0001B8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0001C0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable4) == 0x0001D0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable5) == 0x0001E0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x0001F0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x0001F8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable6) == 0x000200, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000210, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5) == 0x000218, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_Result2) == 0x000220, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x000228, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchEnum4_CmpSuccess) == 0x000230, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_EventName) == 0x000238, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_InItemBase) == 0x000240, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_VerifyDataTableRowName_ReturnValue) == 0x000248, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_VerifyDataTableRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_PlayBGMFromBGMID_ReturnValue) == 0x000250, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_PlayBGMFromBGMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchName3_CmpSuccess) == 0x000251, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchName4_CmpSuccess) == 0x000252, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable7) == 0x000258, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6) == 0x000268, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_WaitMessageEndFromBP_Result3) == 0x000270, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_WaitMessageEndFromBP_Result3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, Temp_struct_Variable8) == 0x000278, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_CheckPoint3) == 0x000288, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_CheckPoint3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_Sender2) == 0x000290, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_CheckPoint2) == 0x0002A0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_CheckPoint2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_CheckRusult) == 0x0002A1, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_CheckRusult' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_Array_Get_Item) == 0x0002A4, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0002B0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, CallFunc_StopBGM_ReturnValue) == 0x0002C0, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_CustomEvent_Result) == 0x0002C1, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_Sender) == 0x0002C8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_Event_CheckPoint) == 0x0002D8, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_Event_CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern, K2Node_SwitchEnum5_CmpSuccess) == 0x0002D9, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Window_001_modern::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.ExecuteSaveDataCheck
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck) == 0x000018, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck, CheckPoint) == 0x000010, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.OnFinishSaveDataCheck_Erase
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase final
{
public:
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase) == 0x000001, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase, Result) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Erase::Result' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.ExecuteSaveDataCheckResult
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult final
{
public:
	TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           CheckRusult;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult) == 0x000018, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult, CheckPoint) == 0x000010, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult::CheckPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult, CheckRusult) == 0x000011, "Member 'WBP_Menu_Namae_Window_001_modern_C_ExecuteSaveDataCheckResult::CheckRusult' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.OnDisplayMessageFromSaveDataCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck) == 0x000001, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck, CheckPoint) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_OnDisplayMessageFromSaveDataCheck::CheckPoint' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Namae_Window_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.OnFinishSaveDataCheck_NewData
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData final
{
public:
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData) == 0x000001, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData, Result) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_NewData::Result' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.OnFinishSaveDataCheck_Load
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load final
{
public:
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load) == 0x000001, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load, Result) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck_Load::Result' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Namae_Window_001_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Namae_Window_001_modern.WBP_Menu_Namae_Window_001_modern_C.OnFinishSaveDataCheck
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck final
{
public:
	EJackUMGSaveDataCheckPoint                    CheckPoint;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Window_001_modern_C_OnFinishSaveDataCheck");
