#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_005_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C
// 0x01B8 (0x05E8 - 0x0430)
class UWBP_Menu_Battle_List_005_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanelWithIcon;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1465;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_002_modern_C*           WBP_Menu_Parts_002;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_76;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_77;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_78;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_034_modern_C*           WBP_Menu_Parts_034_C_79;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FJackMessageArgumentData               ItemNameArg;                                       // 0x0490(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               SelCharNameArg;                                    // 0x04D8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FJackMessageArgumentData               TagcharNameArg;                                    // 0x0520(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	EJackCharacter                                TargetCharType;                                    // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DataNumber;                                        // 0x056C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    ItemSyousaiRef;                                    // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   UIActionInfoRef;                                   // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRenkeiAction;                                   // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsJumonAction;                                    // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               ItemActionStatus;                                  // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoActionFlag;                                      // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAlive;                                           // 0x0591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsVisibleNumber;                                   // 0x0592(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_593[0x5];                                      // 0x0593(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemActionStatus*               ActionStatusRef;                                   // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisibleBuffIcon;                                 // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDisplayBuffIcon;                                 // 0x05A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RenkeiID;                                          // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   SetumeiWindow000Ref;                               // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  CommonSetumei000Ref;                               // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemActionStatus*               ActionStatus;                                      // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           RenkeiAliveCheckList;                              // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UJackFriendGameCharacter*               BattleTarget;                                      // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_003_modern_C*  CommonSetumei003Ref;                               // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_005_modern(int32 EntryPoint);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void CustomEvent_0(EJackKeys InKeyType, bool bIsPressed);
	void WidgetNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void GetDataNames();
	void UpdateMembarList(bool* IsOnItemList);
	void UpdateCommonSetumei();
	int32 CountItemRemain();
	void SetupItemActionList(bool* IsOnList);
	EJackUMGUIActionFlow GetUIFlow();
	void SetupJumonActionList();
	void CheckSingleActionFlow(class FName* OutTextId);
	void GetCharacterStatus(EJackCharacter InputPin, class UJackUMGItemActionStatus** AsJack_UMGItem_Action_Status);
	void CheckDamageTypeAction(EJackActionDamageType Selection, class UJackUMGItemActionStatus* Target, bool* DoAction);
	void CheckAllActionFlow(class FName* NewParam);
	void GetMsgTargetCharName(struct FJackMessageArgumentData* JackMessageArgumentData);
	void GetMsgActionName(struct FJackMessageArgumentData* JackMessageArgumentData);
	void SetVisibleParts034BuffIcon(bool InBuffVisibility, class FName InOddEffectId);
	void UpdateMemberListImpl(bool* IsOnItemList);
	void SetupRenkeiActionList(class FName InRenkeiId, const class FText& InRenkeiName);
	void CheckBuffIcon(bool* NewParam);
	void GetActionMemberList(class UJackUMGUIActionInfo* UIActionInfoRef_0);
	void OpenSetumeiWindow000(class UWBP_Menu_Jumon_Setumei_000_modern_C** Output_Get);
	void OpenSetumeiWindow001();
	void NewFunction_0(TArray<class UJackUMGItemData*>& Array, int32* NewLocalVar_11);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_005_modern_C">();
	}
	static class UWBP_Menu_Battle_List_005_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_005_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_005_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_005_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_005_modern_C) == 0x0005E8, "Wrong size on UWBP_Menu_Battle_List_005_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Battle_List_005_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_Battle_List_005_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, ItemListPanelWithIcon) == 0x000440, "Member 'UWBP_Menu_Battle_List_005_modern_C::ItemListPanelWithIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, RootPanel) == 0x000448, "Member 'UWBP_Menu_Battle_List_005_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WBP_Menu_Parts_000_C_1465) == 0x000450, "Member 'UWBP_Menu_Battle_List_005_modern_C::WBP_Menu_Parts_000_C_1465' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WBP_Menu_Parts_002) == 0x000458, "Member 'UWBP_Menu_Battle_List_005_modern_C::WBP_Menu_Parts_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WBP_Menu_Parts_034_C_76) == 0x000460, "Member 'UWBP_Menu_Battle_List_005_modern_C::WBP_Menu_Parts_034_C_76' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WBP_Menu_Parts_034_C_77) == 0x000468, "Member 'UWBP_Menu_Battle_List_005_modern_C::WBP_Menu_Parts_034_C_77' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WBP_Menu_Parts_034_C_78) == 0x000470, "Member 'UWBP_Menu_Battle_List_005_modern_C::WBP_Menu_Parts_034_C_78' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WBP_Menu_Parts_034_C_79) == 0x000478, "Member 'UWBP_Menu_Battle_List_005_modern_C::WBP_Menu_Parts_034_C_79' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, Window_Line) == 0x000480, "Member 'UWBP_Menu_Battle_List_005_modern_C::Window_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, WindowFrame) == 0x000488, "Member 'UWBP_Menu_Battle_List_005_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, ItemNameArg) == 0x000490, "Member 'UWBP_Menu_Battle_List_005_modern_C::ItemNameArg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, SelCharNameArg) == 0x0004D8, "Member 'UWBP_Menu_Battle_List_005_modern_C::SelCharNameArg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, TagcharNameArg) == 0x000520, "Member 'UWBP_Menu_Battle_List_005_modern_C::TagcharNameArg' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, TargetCharType) == 0x000568, "Member 'UWBP_Menu_Battle_List_005_modern_C::TargetCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, DataNumber) == 0x00056C, "Member 'UWBP_Menu_Battle_List_005_modern_C::DataNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, ItemSyousaiRef) == 0x000570, "Member 'UWBP_Menu_Battle_List_005_modern_C::ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, UIActionInfoRef) == 0x000578, "Member 'UWBP_Menu_Battle_List_005_modern_C::UIActionInfoRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, bIsRenkeiAction) == 0x000580, "Member 'UWBP_Menu_Battle_List_005_modern_C::bIsRenkeiAction' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, bIsJumonAction) == 0x000581, "Member 'UWBP_Menu_Battle_List_005_modern_C::bIsJumonAction' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, ItemActionStatus) == 0x000588, "Member 'UWBP_Menu_Battle_List_005_modern_C::ItemActionStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, DoActionFlag) == 0x000590, "Member 'UWBP_Menu_Battle_List_005_modern_C::DoActionFlag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, IsAlive) == 0x000591, "Member 'UWBP_Menu_Battle_List_005_modern_C::IsAlive' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, IsVisibleNumber) == 0x000592, "Member 'UWBP_Menu_Battle_List_005_modern_C::IsVisibleNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, ActionStatusRef) == 0x000598, "Member 'UWBP_Menu_Battle_List_005_modern_C::ActionStatusRef' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, IsVisibleBuffIcon) == 0x0005A0, "Member 'UWBP_Menu_Battle_List_005_modern_C::IsVisibleBuffIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, IsDisplayBuffIcon) == 0x0005A1, "Member 'UWBP_Menu_Battle_List_005_modern_C::IsDisplayBuffIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, RenkeiID) == 0x0005A8, "Member 'UWBP_Menu_Battle_List_005_modern_C::RenkeiID' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, SetumeiWindow000Ref) == 0x0005B0, "Member 'UWBP_Menu_Battle_List_005_modern_C::SetumeiWindow000Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, CommonSetumei000Ref) == 0x0005B8, "Member 'UWBP_Menu_Battle_List_005_modern_C::CommonSetumei000Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, ActionStatus) == 0x0005C0, "Member 'UWBP_Menu_Battle_List_005_modern_C::ActionStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, RenkeiAliveCheckList) == 0x0005C8, "Member 'UWBP_Menu_Battle_List_005_modern_C::RenkeiAliveCheckList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, BattleTarget) == 0x0005D8, "Member 'UWBP_Menu_Battle_List_005_modern_C::BattleTarget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_005_modern_C, CommonSetumei003Ref) == 0x0005E0, "Member 'UWBP_Menu_Battle_List_005_modern_C::CommonSetumei003Ref' has a wrong offset!");

}

