#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_003_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_List_003_modern.WBP_Menu_Sakusen_List_003_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern
// 0x0070 (0x0070 - 0x0000)
struct WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackGambit                                   CallFunc_SetInfoText_OutGambit;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackGambit                                   CallFunc_SetInfoText_OutGambit2;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetPrevPageWidget_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGBrowserBase*                    K2Node_DynamicCast_AsJack_UMGBrowser_Base;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern) == 0x000070, "Wrong size on WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_CustomEvent_EventName) == 0x000028, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_CustomEvent_InItemBase) == 0x000030, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_CustomEvent_EventTag) == 0x000038, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, CallFunc_SetInfoText_OutGambit) == 0x000041, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::CallFunc_SetInfoText_OutGambit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, CallFunc_SetInfoText_OutGambit2) == 0x000042, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::CallFunc_SetInfoText_OutGambit2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_SwitchName2_CmpSuccess) == 0x000043, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000048, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000050, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, CallFunc_GetPrevPageWidget_ReturnValue) == 0x000058, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::CallFunc_GetPrevPageWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_DynamicCast_AsJack_UMGBrowser_Base) == 0x000060, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_DynamicCast_AsJack_UMGBrowser_Base' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Menu_Sakusen_List_003_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_003_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_003_modern.WBP_Menu_Sakusen_List_003_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_003_modern.WBP_Menu_Sakusen_List_003_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_List_003_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_003_modern.WBP_Menu_Sakusen_List_003_modern_C.SetInfoText
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Sakusen_List_003_modern_C_SetInfoText final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackGambit                                   OutGambit;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackGambit                                   Gambit;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_003_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText) == 0x000038, "Wrong size on WBP_Menu_Sakusen_List_003_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, Selection) == 0x000000, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::Selection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, OutGambit) == 0x000008, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::OutGambit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, Gambit) == 0x000009, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::Gambit' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000020, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern) == 0x000028, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_003_modern_C_SetInfoText, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Sakusen_List_003_modern_C_SetInfoText::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

