#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Syuurenjou_004_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Syuurenjou_004_modern.WBP_Menu_Syuurenjou_004_modern_C
// 0x0028 (0x0398 - 0x0370)
class UWBP_Menu_Syuurenjou_004_modern_C final : public UJackUMGSyuurenjou004Base
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           RootPanel;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Syuurenjou_RewardInfo_modern_C* WBP_Menu_Syuurenjou_RewardInfo;                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnInFocus;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Syuurenjou_004_modern(int32 EntryPoint);
	void OnInFocus__DelegateSignature();
	void PlayCheckInAnim(int32 ItemIndex);
	void SetData(class UJackUMGSyuurenjouItemData* Data);
	void SetSyuurenjouData(const struct FJackDataTableSyuurenjou& Data);
	void ShowCheck(int32 ItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Syuurenjou_004_modern_C">();
	}
	static class UWBP_Menu_Syuurenjou_004_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Syuurenjou_004_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Syuurenjou_004_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Syuurenjou_004_modern_C");
static_assert(sizeof(UWBP_Menu_Syuurenjou_004_modern_C) == 0x000398, "Wrong size on UWBP_Menu_Syuurenjou_004_modern_C");
static_assert(offsetof(UWBP_Menu_Syuurenjou_004_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Syuurenjou_004_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_004_modern_C, RootPanel) == 0x000378, "Member 'UWBP_Menu_Syuurenjou_004_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_004_modern_C, WBP_Menu_Syuurenjou_RewardInfo) == 0x000380, "Member 'UWBP_Menu_Syuurenjou_004_modern_C::WBP_Menu_Syuurenjou_RewardInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Syuurenjou_004_modern_C, OnInFocus) == 0x000388, "Member 'UWBP_Menu_Syuurenjou_004_modern_C::OnInFocus' has a wrong offset!");

}

