#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_RuraPoint_002

#include "Basic.hpp"

#include "WBP_Menu_WorldMap_RuraPointBase_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WorldMap_RuraPoint_002.WBP_Menu_WorldMap_RuraPoint_002_C
// 0x0018 (0x01F0 - 0x01D8)
class UWBP_Menu_WorldMap_RuraPoint_002_C final : public UWBP_Menu_WorldMap_RuraPointBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Menu_WorldMap_RuraPoint_002_C;  // 0x01D8(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 RuraPoint_002;                                     // 0x01E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_RuraPoint_003_C*     RuraPoint_003;                                     // 0x01E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_WorldMap_RuraPoint_002(int32 EntryPoint);
	void SetFlag(bool bIsOn);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WorldMap_RuraPoint_002_C">();
	}
	static class UWBP_Menu_WorldMap_RuraPoint_002_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WorldMap_RuraPoint_002_C>();
	}
};
static_assert(alignof(UWBP_Menu_WorldMap_RuraPoint_002_C) == 0x000008, "Wrong alignment on UWBP_Menu_WorldMap_RuraPoint_002_C");
static_assert(sizeof(UWBP_Menu_WorldMap_RuraPoint_002_C) == 0x0001F0, "Wrong size on UWBP_Menu_WorldMap_RuraPoint_002_C");
static_assert(offsetof(UWBP_Menu_WorldMap_RuraPoint_002_C, UberGraphFrame_WBP_Menu_WorldMap_RuraPoint_002_C) == 0x0001D8, "Member 'UWBP_Menu_WorldMap_RuraPoint_002_C::UberGraphFrame_WBP_Menu_WorldMap_RuraPoint_002_C' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_RuraPoint_002_C, RuraPoint_002) == 0x0001E0, "Member 'UWBP_Menu_WorldMap_RuraPoint_002_C::RuraPoint_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_RuraPoint_002_C, RuraPoint_003) == 0x0001E8, "Member 'UWBP_Menu_WorldMap_RuraPoint_002_C::RuraPoint_003' has a wrong offset!");

}

