#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Save_data_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Save_data_000_modern.WBP_Menu_Namae_Save_data_000_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern
// 0x0910 (0x0910 - 0x0000)
struct WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender3;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID3;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex3;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender2;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID2;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex2;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSaveDataContainer*              CallFunc_GetSaveDataContainer_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0090(0x0048)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x00F8(0x0048)()
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x0140(0x0048)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData4;        // 0x01A8(0x0048)()
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue2;        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue3;        // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveDataEmptyInCached_ReturnValue;      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotNumberInCondition_ReturnValue;     // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetTrialSaveDataList_ReturnValue;         // 0x0228(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UJackUMGItemData*>               CallFunc_GetSaveDataListFromCached_ReturnValue;    // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue4;        // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue5;        // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B[0x1];                                      // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData5;        // 0x0260(0x0048)()
	bool                                          CallFunc_IsValidSavedata_Valid;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x02B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue7;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue8;         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue6;        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue7;        // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x02FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue9;         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SlotIndex;                      // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_CustomEvent_SaveLoadResult;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue10;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetSaveDataListFromCached_ReturnValue2;   // 0x0330(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue11;        // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue4;            // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData6;        // 0x0380(0x0048)()
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x03D0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue12;        // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue13;        // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue14;        // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReturnedArasuziFlag_ReturnValue;       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0410(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue15;        // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue3;           // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0440(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0450(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result3;             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result4;             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue4;           // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0490(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x04A0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue16;        // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint4;                          // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_Event_Result;                               // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BA[0x6];                                      // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x04C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6; // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_CustomEvent_Result3;                        // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGSaveDataCheckResult                   K2Node_CustomEvent_Result2;                        // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x04E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x04E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue17;        // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue8;        // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB[0x5];                                      // 0x04FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue18;        // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue19;        // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint3;                          // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522[0x6];                                      // 0x0522(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_DynamicCast_AsBP_IF_Save_Data_Check;        // 0x0530(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate4;             // 0x0548(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> CallFunc_ExecuteSaveDataCheck_Sender_CastInput;    // 0x0558(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGBoukennoSyoAction                     Temp_byte_Variable;                                // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue20;        // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue12;              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAutoSaveData3D_ReturnValue;             // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0590(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x05A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x05A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender2;                              // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint2;                          // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSaveLoadResult                           K2Node_Event_CheckRusult;                          // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BA[0x6];                                      // 0x05BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_Event_Sender;                               // 0x05C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGSaveDataCheckPoint                    K2Node_Event_CheckPoint;                           // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x05D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue7; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackLanguage                                 CallFunc_GetLanguageType_ReturnValue;              // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result5;             // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable6;                             // 0x0608(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue5;           // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item2;                          // 0x0620(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayableName_Displayable;            // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData7;        // 0x0630(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0678(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue8; // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A5[0x3];                                      // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue21;        // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue9; // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayableName_Displayable2;           // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result6;             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable7;                             // 0x06D0(0x0010)(ZeroConstructor, ReferenceParm)
	EJackUMGSaveDataCheckResult                   K2Node_CustomEvent_Result;                         // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x3];                                      // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item3;                          // 0x06E4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue2;                     // 0x06ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE[0x2];                                      // 0x06EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue13;              // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_DynamicCast_AsBP_IF_Save_Data_Check2;       // 0x06F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_IF_SaveDataCheck_C> CallFunc_ExecuteSaveDataCheck_Sender2_CastInput;   // 0x0710(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0720(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable8;                             // 0x0730(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue10; // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable9;                             // 0x0748(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result7;             // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue11; // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidArasuziData_Valid;                 // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result8;             // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue22;        // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSaveDataIndex_Valid;               // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable10;                            // 0x0798(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue12; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result9;             // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSaveDataIndex_Valid2;              // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C2[0x6];                                      // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue23;        // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue14;              // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable11;                            // 0x07D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue24;        // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue13; // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue9;        // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result10;            // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUIPlatformType                           CallFunc_GetUIPlatformType_ReturnValue;            // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80A[0x6];                                      // 0x080A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable12;                            // 0x0810(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_822[0x2];                                      // 0x0822(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item4;                          // 0x0824(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x082D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue3;                     // 0x082E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x082F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSaveDataIndex_Valid3;              // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SlotIndex, EJackSaveLoadResult SaveLoadResult)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0838(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable13;                            // 0x0848(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue14; // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result11;            // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue15;              // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue25;        // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGBoukennoSyoAction                     CallFunc_GetBoukennoSyoAction_ReturnValue10;       // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable14;                            // 0x0880(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue15; // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable15;                            // 0x08A0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result12;            // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue16; // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable16;                            // 0x08C0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue16;              // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue17; // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> K2Node_DynamicCast_AsBP_IF_Save_Data_Check3;       // 0x08E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result13;            // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_SaveDataCheck_C> CallFunc_ExecuteSaveDataCheck_Sender3_CastInput;   // 0x0900(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern");
static_assert(sizeof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern) == 0x000910, "Wrong size on WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000018, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CustomEvent_Sender3) == 0x000028, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CustomEvent_Sender3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CustomEvent_CurrentTextID3) == 0x000030, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CustomEvent_CurrentTextID3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CustomEvent_SelectDialogIndex3) == 0x000038, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CustomEvent_SelectDialogIndex3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x00003C, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetBoukennoSyoAction_ReturnValue) == 0x000058, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetBoukennoSyoAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000059, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00005A, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x00005B, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CustomEvent_Sender2) == 0x000060, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CustomEvent_Sender2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CustomEvent_CurrentTextID2) == 0x000068, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CustomEvent_CurrentTextID2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_CustomEvent_SelectDialogIndex2) == 0x000070, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_CustomEvent_SelectDialogIndex2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x000080, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetSaveDataContainer_ReturnValue) == 0x000088, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetSaveDataContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x000090, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_Conv_IntToString_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x0000F8, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_MakeStruct_JackMessageArgumentData3) == 0x000140, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_MakeStruct_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000188, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_Conv_IntToString_ReturnValue2) == 0x000190, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x0001A0, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_MakeStruct_JackMessageArgumentData4) == 0x0001A8, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_MakeStruct_JackMessageArgumentData4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetBoukennoSyoAction_ReturnValue2) == 0x0001F0, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetBoukennoSyoAction_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0001F1, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0001F8, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x000200, "Member 'WBP_Menu_Namae_Save_data_000_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Save_data_000_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
