#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tokugi_SkillInfo_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tokugi_SkillInfo_002_modern.WBP_Menu_Tokugi_SkillInfo_002_modern_C.ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0018(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     K2Node_CustomEvent_IconList;                       // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class USpacer*>                        K2Node_MakeArray_Array2;                           // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item2;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                CallFunc_Array_Get_Item3;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern) == 0x000090, "Wrong size on WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000018, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, K2Node_CustomEvent_IconList) == 0x000038, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::K2Node_CustomEvent_IconList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, K2Node_MakeArray_Array2) == 0x000068, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Array_Length_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x00007C, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Array_Get_Item2) == 0x000080, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern, CallFunc_Array_Get_Item3) == 0x000088, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_ExecuteUbergraph_WBP_Menu_Tokugi_SkillInfo_002_modern::CallFunc_Array_Get_Item3' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfo_002_modern.WBP_Menu_Tokugi_SkillInfo_002_modern_C.SetIconList
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList final
{
public:
	TArray<class UTexture2D*>                     IconList;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList) == 0x000010, "Wrong size on WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList, IconList) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_SetIconList::IconList' has a wrong offset!");

// Function WBP_Menu_Tokugi_SkillInfo_002_modern.WBP_Menu_Tokugi_SkillInfo_002_modern_C.InitFontColor
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor final
{
public:
	EJackUMGTextColorSet                          InColorType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor");
static_assert(sizeof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor) == 0x000001, "Wrong size on WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor");
static_assert(offsetof(WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor, InColorType) == 0x000000, "Member 'WBP_Menu_Tokugi_SkillInfo_002_modern_C_InitFontColor::InColorType' has a wrong offset!");

}

