#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Soubi_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern
// 0x0478 (0x0478 - 0x0000)
struct WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive2;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive3;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGEquipmentResultData            CallFunc_DoEquipmentAction_ResultData;             // 0x0038(0x0018)(NoDestructor)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_CustomEvent_IsEquippedConfirmation;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue4;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue;    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable4;                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array2;                           // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue5;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue2;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTokugiNitouryuu_NewParam;               // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   CallFunc_GetUMGEquippedItemFromRegion_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   Temp_name_Variable5;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select2_Default;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable6;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive2;       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array3;                           // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive3;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue6;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array4;                           // 0x0188(0x0010)(ZeroConstructor, ReferenceParm)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue3;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue2;   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGSouthpaw_IsSouthpaw;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUMGAliveSelectCharacter_bIsLive4;       // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x01B0(0x0048)()
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue3;   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData2;        // 0x0200(0x0048)()
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array5;                           // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsSibariPlayFlag_ReturnValue;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable7;                               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable8;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array6;                           // 0x0280(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array7;                           // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x02A0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable4;                               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select4_Default;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array8;                           // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array9;                           // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable9;                               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable10;                              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue7;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select5_Default;                            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData3;        // 0x0318(0x0048)()
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData4;        // 0x0360(0x0048)()
	EJackCharacter                                CallFunc_BagTypeToCharType_ReturnValue;            // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUMGAliveCharacterName_ReturnValue;     // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData5;        // 0x03C8(0x0048)()
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0418(0x0048)()
	int32                                         CallFunc_GetMenuMessageSelectIndex_ReturnValue4;   // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array10;                          // 0x0468(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern");
static_assert(sizeof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern) == 0x000478, "Wrong size on WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveCharacter_bIsAlive) == 0x000004, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveCharacter_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable) == 0x000008, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveCharacter_bIsAlive2) == 0x000011, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveCharacter_bIsAlive2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable2) == 0x000018, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveCharacter_bIsAlive3) == 0x000020, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveCharacter_bIsAlive3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_CustomEvent_EventTag) == 0x000028, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_DoEquipmentAction_ResultData) == 0x000038, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_DoEquipmentAction_ResultData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_CustomEvent_IsEquippedConfirmation) == 0x000060, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_CustomEvent_IsEquippedConfirmation' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000068, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000080, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x000089, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable3) == 0x000090, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue4) == 0x000098, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetBagSelectedChar_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetActionItemId_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetActionItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_bool_Variable) == 0x0000B0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_CanBeEquippedItemInChar_ReturnValue) == 0x0000B1, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_CanBeEquippedItemInChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveSelectCharacter_bIsLive) == 0x0000C0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveSelectCharacter_bIsLive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue) == 0x0000C4, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000C8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable4) == 0x0000D0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array2) == 0x0000D8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_struct_Variable) == 0x0000F0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000100, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000101, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue5) == 0x000108, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetBagSelectedChar_ReturnValue2) == 0x000110, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetBagSelectedChar_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x000111, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsTokugiNitouryuu_NewParam) == 0x000112, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsTokugiNitouryuu_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetUMGEquippedItemFromRegion_ReturnValue) == 0x000118, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetUMGEquippedItemFromRegion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_BooleanAND_ReturnValue) == 0x000120, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_struct_Variable2) == 0x000128, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable5) == 0x000138, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_bool_Variable2) == 0x000140, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_Select2_Default) == 0x000148, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000150, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable6) == 0x000158, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveSelectCharacter_bIsLive2) == 0x000160, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveSelectCharacter_bIsLive2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_bool_Variable3) == 0x000161, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array3) == 0x000168, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveSelectCharacter_bIsLive3) == 0x000178, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveSelectCharacter_bIsLive3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue6) == 0x000180, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array4) == 0x000188, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetBagSelectedChar_ReturnValue3) == 0x000198, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetBagSelectedChar_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue2) == 0x00019C, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGSouthpaw_IsSouthpaw) == 0x0001A0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGSouthpaw_IsSouthpaw' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x0001A1, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsUMGAliveSelectCharacter_bIsLive4) == 0x0001A2, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsUMGAliveSelectCharacter_bIsLive4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_Select3_Default) == 0x0001A8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x0001B0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue3) == 0x0001F8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeStruct_JackMessageArgumentData2) == 0x000200, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeStruct_JackMessageArgumentData2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchInteger3_CmpSuccess) == 0x000248, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000250, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array5) == 0x000258, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_IsSibariPlayFlag_ReturnValue) == 0x000268, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_IsSibariPlayFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable7) == 0x000270, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable8) == 0x000278, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array6) == 0x000280, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array7) == 0x000290, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_struct_Variable3) == 0x0002A0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_bool_Variable4) == 0x0002B0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_Select4_Default) == 0x0002B8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array8) == 0x0002C0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array9) == 0x0002D0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0002E0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable9) == 0x0002F0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_name_Variable10) == 0x0002F8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_name_Variable10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorItem_ReturnValue7) == 0x000300, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorItem_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, Temp_bool_Variable5) == 0x000308, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_Select5_Default) == 0x000310, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeStruct_JackMessageArgumentData3) == 0x000318, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeStruct_JackMessageArgumentData3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeStruct_JackMessageArgumentData4) == 0x000360, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeStruct_JackMessageArgumentData4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_BagTypeToCharType_ReturnValue) == 0x0003A8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_BagTypeToCharType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetUMGAliveCharacterName_ReturnValue) == 0x0003B0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetUMGAliveCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0003C0, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeStruct_JackMessageArgumentData5) == 0x0003C8, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeStruct_JackMessageArgumentData5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000410, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000418, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, CallFunc_GetMenuMessageSelectIndex_ReturnValue4) == 0x000460, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::CallFunc_GetMenuMessageSelectIndex_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_SwitchInteger4_CmpSuccess) == 0x000464, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern, K2Node_MakeArray_Array10) == 0x000468, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Soubi_000_modern::K2Node_MakeArray_Array10' has a wrong offset!");

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.DoEquipmentEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent final
{
public:
	bool                                          IsEquippedConfirmation_0;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent) == 0x000001, "Wrong alignment on WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent");
static_assert(sizeof(WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent) == 0x000001, "Wrong size on WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent, IsEquippedConfirmation_0) == 0x000000, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_DoEquipmentEvent::IsEquippedConfirmation_0' has a wrong offset!");

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.OpenQuantityWindow
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow final
{
public:
	class UWBP_Menu_Common_Quantity_001_modern_C* OutQuantityWindow;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagCountBySelected_ReturnValue;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Quantity_001_modern_C* K2Node_DynamicCast_AsWBP_Menu_Common_Quantity_001_Modern; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow");
static_assert(sizeof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow) == 0x000038, "Wrong size on WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, OutQuantityWindow) == 0x000000, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::OutQuantityWindow' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, CallFunc_GetBagCountBySelected_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::CallFunc_GetBagCountBySelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000020, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, K2Node_DynamicCast_AsWBP_Menu_Common_Quantity_001_Modern) == 0x000028, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::K2Node_DynamicCast_AsWBP_Menu_Common_Quantity_001_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_OpenQuantityWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.SetupSoubiData
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData final
{
public:
	class UJackUMGSoubiList*                      CallFunc_GetSoubi_AsJack_UMGSoubi_List;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   CallFunc_GetItemEquipmentInfo_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBagSelectedItemIndex_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData");
static_assert(sizeof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData) == 0x000020, "Wrong size on WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData, CallFunc_GetSoubi_AsJack_UMGSoubi_List) == 0x000000, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData::CallFunc_GetSoubi_AsJack_UMGSoubi_List' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData, CallFunc_GetItemEquipmentInfo_ReturnValue) == 0x000010, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData::CallFunc_GetItemEquipmentInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData, CallFunc_GetBagSelectedItemIndex_ReturnValue) == 0x000018, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData::CallFunc_GetBagSelectedItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData, CallFunc_GetBagSelectedType_ReturnValue) == 0x00001C, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData, CallFunc_GetBagSelectedChar_ReturnValue) == 0x00001D, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_SetupSoubiData::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.MakeMessageArgument
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument final
{
public:
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x0008(0x0048)()
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0058(0x0048)()
};
static_assert(alignof(WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument");
static_assert(sizeof(WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument) == 0x0000A0, "Wrong size on WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument, CallFunc_GetAccessorMembers_ReturnValue) == 0x000000, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument, K2Node_MakeStruct_JackMessageArgumentData) == 0x000008, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000058, "Member 'WBP_Menu_Dougu_Soubi_000_modern_C_MakeMessageArgument::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Dougu_Soubi_000_modern.WBP_Menu_Dougu_Soubi_000_modern_C.IsHandedWeapons
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Dougu_Soubi_000_modern_C_IsHandedWeapons final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHanded;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
