#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Tokugi_Flash_004

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Tokugi_Flash_004.WBP_Menu_Tokugi_Flash_004_C.EventEndAnim__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature final
{
public:
	class UWBP_Menu_Tokugi_Flash_004_C*           Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature");
static_assert(sizeof(WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature");
static_assert(offsetof(WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature, Sender) == 0x000000, "Member 'WBP_Menu_Tokugi_Flash_004_C_EventEndAnim__DelegateSignature::Sender' has a wrong offset!");

// Function WBP_Menu_Tokugi_Flash_004.WBP_Menu_Tokugi_Flash_004_C.ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDontAutoRemove;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004");
static_assert(sizeof(WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004) == 0x000010, "Wrong size on WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004");
static_assert(offsetof(WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004, EntryPoint) == 0x000000, "Member 'WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004, K2Node_CustomEvent_bDontAutoRemove) == 0x000004, "Member 'WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004::K2Node_CustomEvent_bDontAutoRemove' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004, K2Node_Event_Animation) == 0x000008, "Member 'WBP_Menu_Tokugi_Flash_004_C_ExecuteUbergraph_WBP_Menu_Tokugi_Flash_004::K2Node_Event_Animation' has a wrong offset!");

// Function WBP_Menu_Tokugi_Flash_004.WBP_Menu_Tokugi_Flash_004_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished");
static_assert(sizeof(WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished");
static_assert(offsetof(WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Menu_Tokugi_Flash_004_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Menu_Tokugi_Flash_004.WBP_Menu_Tokugi_Flash_004_C.PlayAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Tokugi_Flash_004_C_PlayAnim final
{
public:
	bool                                          bDontAutoRemove;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Tokugi_Flash_004_C_PlayAnim) == 0x000001, "Wrong alignment on WBP_Menu_Tokugi_Flash_004_C_PlayAnim");
static_assert(sizeof(WBP_Menu_Tokugi_Flash_004_C_PlayAnim) == 0x000001, "Wrong size on WBP_Menu_Tokugi_Flash_004_C_PlayAnim");
static_assert(offsetof(WBP_Menu_Tokugi_Flash_004_C_PlayAnim, bDontAutoRemove) == 0x000000, "Member 'WBP_Menu_Tokugi_Flash_004_C_PlayAnim::bDontAutoRemove' has a wrong offset!");

}

