#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Title_Push_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Title_Push_000_modern.WBP_Menu_Title_Push_000_modern_C
// 0x0058 (0x03C8 - 0x0370)
class UWBP_Menu_Title_Push_000_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BasePanel;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightPanel;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RainbowPanel;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightS;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           TitleMenuText_0;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           TitleMenuText_1;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleRoot;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Title_Push_000_modern(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void SelectTitleMode(int32 InMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Title_Push_000_modern_C">();
	}
	static class UWBP_Menu_Title_Push_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Title_Push_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Title_Push_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Title_Push_000_modern_C");
static_assert(sizeof(UWBP_Menu_Title_Push_000_modern_C) == 0x0003C8, "Wrong size on UWBP_Menu_Title_Push_000_modern_C");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Title_Push_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, Loop) == 0x000378, "Member 'UWBP_Menu_Title_Push_000_modern_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, BasePanel) == 0x000380, "Member 'UWBP_Menu_Title_Push_000_modern_C::BasePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, HighlightPanel) == 0x000388, "Member 'UWBP_Menu_Title_Push_000_modern_C::HighlightPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, ItemListPanel) == 0x000390, "Member 'UWBP_Menu_Title_Push_000_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, RainbowPanel) == 0x000398, "Member 'UWBP_Menu_Title_Push_000_modern_C::RainbowPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, RightS) == 0x0003A0, "Member 'UWBP_Menu_Title_Push_000_modern_C::RightS' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, RootPanel) == 0x0003A8, "Member 'UWBP_Menu_Title_Push_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, TitleMenuText_0) == 0x0003B0, "Member 'UWBP_Menu_Title_Push_000_modern_C::TitleMenuText_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, TitleMenuText_1) == 0x0003B8, "Member 'UWBP_Menu_Title_Push_000_modern_C::TitleMenuText_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Title_Push_000_modern_C, TitleRoot) == 0x0003C0, "Member 'UWBP_Menu_Title_Push_000_modern_C::TitleRoot' has a wrong offset!");

}

