#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_005_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.ExecuteUbergraph_WBP_Menu_Battle_List_005_modern
// 0x0260 (0x0260 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenuItem_ReturnValue;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue3;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemRemain_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetupItemActionList_IsOnList;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMemberListImpl_IsOnItemList;        // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName5_CmpSuccess;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue4;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue5;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleCassterMP_ReturnValue;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActionDescriptionString_OutDescriptiont; // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue6;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBattleCassterMP_ReturnValue2;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0118(0x0048)()
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUMGAliveCharacter_bIsAlive;             // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue7;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue8;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BattleCommandMenu_ReturnValue2;           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue2;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate4;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x01D0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue3;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue9;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue3;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainerFromSelected_ReturnValue; // 0x0200(0x0050)()
	class UJackUMGItemActionStatus*               K2Node_DynamicCast_AsJack_UMGItem_Action_Status;   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern) == 0x000260, "Wrong size on WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_InKeyType) == 0x000018, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_bIsPressed) == 0x000019, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_BattleCommandMenuItem_ReturnValue) == 0x000038, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_BattleCommandMenuItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_EventTag) == 0x000040, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_EventName) == 0x000048, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_InItemBase) == 0x000050, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchName_CmpSuccess) == 0x000058, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchName2_CmpSuccess) == 0x000059, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchName3_CmpSuccess) == 0x00005A, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchName4_CmpSuccess) == 0x00005B, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue3) == 0x000060, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_CountItemRemain_ReturnValue) == 0x000068, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_CountItemRemain_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchInteger_CmpSuccess) == 0x00006C, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_SetupItemActionList_IsOnList) == 0x00006D, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_SetupItemActionList_IsOnList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_UpdateMemberListImpl_IsOnItemList) == 0x00006E, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_UpdateMemberListImpl_IsOnItemList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_InEventTag) == 0x000070, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000078, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CustomEvent_InObject) == 0x000080, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchName5_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchName5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue4) == 0x000090, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000098, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_BattleCommandMenu_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_BattleCommandMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue5) == 0x0000B0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetBattleCassterMP_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetBattleCassterMP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetActionDescriptionString_OutDescriptiont) == 0x0000C0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetActionDescriptionString_OutDescriptiont' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue6) == 0x0000D8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetBattleCassterMP_ReturnValue2) == 0x0000E0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetBattleCassterMP_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000E8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000F8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000100, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, Temp_struct_Variable) == 0x000108, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000118, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_MakeArray_Array) == 0x000160, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000170, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000180, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000190, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_IsUMGAliveCharacter_bIsAlive) == 0x000191, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_IsUMGAliveCharacter_bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_Array_Contains_ReturnValue) == 0x000192, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue7) == 0x000198, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue8) == 0x0001A0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x0001A8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_BattleCommandMenu_ReturnValue2) == 0x0001B0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_BattleCommandMenu_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetJackCharacterFromType_ReturnValue2) == 0x0001B8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetJackCharacterFromType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x0001C0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, Temp_struct_Variable2) == 0x0001D0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0001E0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorMembers_ReturnValue3) == 0x0001E8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorMembers_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetAccessorBattle_ReturnValue9) == 0x0001F0, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetAccessorBattle_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetJackCharacterFromType_ReturnValue3) == 0x0001F8, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetJackCharacterFromType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, CallFunc_GetItemContainerFromSelected_ReturnValue) == 0x000200, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::CallFunc_GetItemContainerFromSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_DynamicCast_AsJack_UMGItem_Action_Status) == 0x000250, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_DynamicCast_AsJack_UMGItem_Action_Status' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'WBP_Menu_Battle_List_005_modern_C_ExecuteUbergraph_WBP_Menu_Battle_List_005_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Battle_List_005_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_CustomEvent_0 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_CustomEvent_0) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_CustomEvent_0) == 0x000002, "Wrong size on WBP_Menu_Battle_List_005_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CustomEvent_0, InKeyType) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_CustomEvent_0::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CustomEvent_0, bIsPressed) == 0x000001, "Member 'WBP_Menu_Battle_List_005_modern_C_CustomEvent_0::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.WidgetNotificationDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate) == 0x000018, "Wrong size on WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate, InEventTag) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate, InObject) == 0x000010, "Member 'WBP_Menu_Battle_List_005_modern_C_WidgetNotificationDelegate::InObject' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.GetDataNames
// 0x0108 (0x0108 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_GetDataNames final
{
public:
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagTargetChar_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetBagSelectedChar_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackFriendGameCharacter*               CallFunc_GetJackCharacterFromType_ReturnValue2;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue; // 0x0028(0x0048)()
	struct FJackMessageArgumentData               CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2; // 0x0070(0x0048)()
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x00C0(0x0048)()
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_GetDataNames) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_GetDataNames");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_GetDataNames) == 0x000108, "Wrong size on WBP_Menu_Battle_List_005_modern_C_GetDataNames");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetAccessorMembers_ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetBagTargetChar_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetBagTargetChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetBagSelectedChar_ReturnValue) == 0x000011, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetBagSelectedChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetJackCharacterFromType_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetJackCharacterFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetJackCharacterFromType_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetJackCharacterFromType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_MakeJackMessageArgumentDataAtGameCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, CallFunc_GetActionItemId_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::CallFunc_GetActionItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetDataNames, K2Node_MakeStruct_JackMessageArgumentData) == 0x0000C0, "Member 'WBP_Menu_Battle_List_005_modern_C_GetDataNames::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.UpdateMembarList
// 0x0005 (0x0005 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_UpdateMembarList final
{
public:
	bool                                          IsOnItemList;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMemberListImpl_IsOnItemList;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckBuffIcon_NewParam;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGUIActionFlow                          CallFunc_GetUIFlow_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_UpdateMembarList");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList) == 0x000005, "Wrong size on WBP_Menu_Battle_List_005_modern_C_UpdateMembarList");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList, IsOnItemList) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_UpdateMembarList::IsOnItemList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList, CallFunc_UpdateMemberListImpl_IsOnItemList) == 0x000001, "Member 'WBP_Menu_Battle_List_005_modern_C_UpdateMembarList::CallFunc_UpdateMemberListImpl_IsOnItemList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList, CallFunc_CheckBuffIcon_NewParam) == 0x000002, "Member 'WBP_Menu_Battle_List_005_modern_C_UpdateMembarList::CallFunc_CheckBuffIcon_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList, CallFunc_GetUIFlow_ReturnValue) == 0x000003, "Member 'WBP_Menu_Battle_List_005_modern_C_UpdateMembarList::CallFunc_GetUIFlow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_UpdateMembarList, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_Menu_Battle_List_005_modern_C_UpdateMembarList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.CountItemRemain
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_CountItemRemain final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackItem_Bag                                 CallFunc_GetBagSelectedType_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountItemInBag_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_CountItemRemain");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain) == 0x000028, "Wrong size on WBP_Menu_Battle_List_005_modern_C_CountItemRemain");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain, ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_CountItemRemain::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain, CallFunc_GetAccessorItem_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_CountItemRemain::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain, CallFunc_GetBagSelectedType_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_005_modern_C_CountItemRemain::CallFunc_GetBagSelectedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain, CallFunc_GetActionItemId_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_005_modern_C_CountItemRemain::CallFunc_GetActionItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CountItemRemain, CallFunc_CountItemInBag_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_005_modern_C_CountItemRemain::CallFunc_CountItemInBag_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.SetupItemActionList
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_SetupItemActionList final
{
public:
	bool                                          IsOnList;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActionItemId_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    CallFunc_GetItemSyousai_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMembarList_IsOnItemList;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_SetupItemActionList");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList) == 0x000030, "Wrong size on WBP_Menu_Battle_List_005_modern_C_SetupItemActionList");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, IsOnList) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::IsOnList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, CallFunc_GetAccessorBattle_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, CallFunc_GetAccessorItem_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, CallFunc_GetActionItemId_ReturnValue) == 0x000018, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::CallFunc_GetActionItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, CallFunc_GetItemSyousai_ReturnValue) == 0x000020, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::CallFunc_GetItemSyousai_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupItemActionList, CallFunc_UpdateMembarList_IsOnItemList) == 0x000029, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupItemActionList::CallFunc_UpdateMembarList_IsOnItemList' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.GetUIFlow
// 0x0005 (0x0005 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_GetUIFlow final
{
public:
	EJackUMGUIActionFlow                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGUIActionFlow                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGUIActionFlow                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow) == 0x000001, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_GetUIFlow");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow) == 0x000005, "Wrong size on WBP_Menu_Battle_List_005_modern_C_GetUIFlow");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow, ReturnValue) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_GetUIFlow::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow, Temp_bool_Variable) == 0x000001, "Member 'WBP_Menu_Battle_List_005_modern_C_GetUIFlow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow, Temp_byte_Variable) == 0x000002, "Member 'WBP_Menu_Battle_List_005_modern_C_GetUIFlow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000003, "Member 'WBP_Menu_Battle_List_005_modern_C_GetUIFlow::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_GetUIFlow, K2Node_Select_Default) == 0x000004, "Member 'WBP_Menu_Battle_List_005_modern_C_GetUIFlow::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.SetupJumonActionList
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList final
{
public:
	class UWBP_Menu_Jumon_Setumei_000_modern_C*   CallFunc_OpenSetumeiWindow000_Output_Get;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorBattle*                 CallFunc_GetAccessorBattle_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateMembarList_IsOnItemList;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList) == 0x000020, "Wrong size on WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList, CallFunc_OpenSetumeiWindow000_Output_Get) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList::CallFunc_OpenSetumeiWindow000_Output_Get' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList, CallFunc_GetAccessorBattle_ReturnValue) == 0x000010, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList::CallFunc_GetAccessorBattle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList, CallFunc_UpdateMembarList_IsOnItemList) == 0x000018, "Member 'WBP_Menu_Battle_List_005_modern_C_SetupJumonActionList::CallFunc_UpdateMembarList_IsOnItemList' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.CheckSingleActionFlow
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow final
{
public:
	class FName                                   OutTextId;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow) == 0x000008, "Wrong alignment on WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow");
static_assert(sizeof(WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow) == 0x000010, "Wrong size on WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow, OutTextId) == 0x000000, "Member 'WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow::OutTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow, CallFunc_Less_IntInt_ReturnValue2) == 0x000009, "Member 'WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_Menu_Battle_List_005_modern_C_CheckSingleActionFlow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Battle_List_005_modern.WBP_Menu_Battle_List_005_modern_C.GetCharacterStatus
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Menu_Battle_List_005_modern_C_GetCharacterStatus final
{
public:
	EJackCharacter                                InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
