#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Senreki_ItemList_Window_000_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Senreki_ItemList_Window_000_modern.WBP_Menu_Senreki_ItemList_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue2;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue3;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0088(0x0018)()
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue4;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue5;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern) == 0x0000E8, "Wrong size on WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000020, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000028, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000038, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000048, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_CustomEvent_EventTag) == 0x000050, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000058, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_CustomEvent_EventName) == 0x000060, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_CustomEvent_InItemBase) == 0x000068, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000070, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue3) == 0x000078, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000080, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_SwitchName3_CmpSuccess) == 0x000081, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_SwitchName4_CmpSuccess) == 0x000082, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000088, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0000A8, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x0000B0, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue4) == 0x0000B8, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0000C0, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C8, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_GetAccessorSenreki_ReturnValue5) == 0x0000D8, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_GetAccessorSenreki_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x0000E0, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Senreki_ItemList_Window_000_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_000_modern.WBP_Menu_Senreki_ItemList_Window_000_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_000_modern.WBP_Menu_Senreki_ItemList_Window_000_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_000_modern.WBP_Menu_Senreki_ItemList_Window_000_modern_C.SetItemsList
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList) == 0x000018, "Wrong size on WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetItemsList::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_000_modern.WBP_Menu_Senreki_ItemList_Window_000_modern_C.DispCategoryCount
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount) == 0x000020, "Wrong size on WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount, InName) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount::InName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000018, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_DispCategoryCount::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Senreki_ItemList_Window_000_modern.WBP_Menu_Senreki_ItemList_Window_000_modern_C.SetDisplayColor
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSenreki*                CallFunc_GetAccessorSenreki_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor) == 0x000008, "Wrong alignment on WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor");
static_assert(sizeof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor) == 0x000018, "Wrong size on WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor, CallFunc_GetAccessorSenreki_ReturnValue) == 0x000008, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor::CallFunc_GetAccessorSenreki_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor, CallFunc_Greater_IntInt_ReturnValue2) == 0x000011, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor, CallFunc_Greater_IntInt_ReturnValue3) == 0x000012, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor, CallFunc_Greater_IntInt_ReturnValue4) == 0x000013, "Member 'WBP_Menu_Senreki_ItemList_Window_000_modern_C_SetDisplayColor::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");

}

