#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Name_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Status_Name_modern.WBP_Hud_Status_Name_modern_C
// 0x0018 (0x04E0 - 0x04C8)
class UWBP_Hud_Status_Name_modern_C final : public UJackUMGHudStatusBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             Name_0;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Status_Name_modern(int32 EntryPoint);
	void SetTestTextJustification(ETextJustify InJustification);
	void SetStatusValue(EJackUMGHudStatusMode InType, const int32 Value0, const int32 Value1);
	void SetNameText(const class FString& InName);
	void CustomEvent_1(int32 Index_0, int32 ColorNum);
	void CustomEvent_0(const class FString& Name_0);
	void Construct();
	void SetColor(int32 HP, int32 MaxHP);
	void SetCaptionJustification(ETextJustify InJustification);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Status_Name_modern_C">();
	}
	static class UWBP_Hud_Status_Name_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Status_Name_modern_C>();
	}
};
static_assert(alignof(UWBP_Hud_Status_Name_modern_C) == 0x000008, "Wrong alignment on UWBP_Hud_Status_Name_modern_C");
static_assert(sizeof(UWBP_Hud_Status_Name_modern_C) == 0x0004E0, "Wrong size on UWBP_Hud_Status_Name_modern_C");
static_assert(offsetof(UWBP_Hud_Status_Name_modern_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Hud_Status_Name_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Name_modern_C, Name_0) == 0x0004D0, "Member 'UWBP_Hud_Status_Name_modern_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Status_Name_modern_C, RootPanel) == 0x0004D8, "Member 'UWBP_Hud_Status_Name_modern_C::RootPanel' has a wrong offset!");

}

