#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_UMG_Root_Widget_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Title_UMG_Root_Widget_modern.WBP_Title_UMG_Root_Widget_modern_C.ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGMenuId                                K2Node_CustomEvent_InMenuId;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InArgName;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InArgValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetAsyncLoadedWidget_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_PlayGoBase_modern_C*          K2Node_DynamicCast_AsWBP_Menu_Play_Go_Base_Modern; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackPlayGoMenuType                           CallFunc_GetPlayGoMenuType_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IF_Arasuzi_C>      K2Node_DynamicCast_AsBP_IF_Arasuzi;                // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue8;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue9;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_CS_Skip_000_modern_C*          K2Node_DynamicCast_AsWBP_Hud_CS_Skip_000_Modern;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetAsyncLoadedWidget_ReturnValue2;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_PlayGoBase_modern_C*          K2Node_DynamicCast_AsWBP_Menu_Play_Go_Base_Modern2; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue10;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue11;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue12;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue13;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EJackUMGMenuId InMenuId, class FName InArgName, int32 InArgValue)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue8;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue14;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue9;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue15;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern) == 0x000008, "Wrong alignment on WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern");
static_assert(sizeof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern) == 0x0001A8, "Wrong size on WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, EntryPoint) == 0x000000, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_InMenuId) == 0x000018, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_InMenuId' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_InArgName) == 0x000020, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_InArgName' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_InArgValue) == 0x000028, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_InArgValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_Conv_IntToByte_ReturnValue) == 0x00002D, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetValidValue_ReturnValue) == 0x00002E, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00002F, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000030, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetAsyncLoadedWidget_ReturnValue) == 0x000040, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetAsyncLoadedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_AsWBP_Menu_Play_Go_Base_Modern) == 0x000050, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_AsWBP_Menu_Play_Go_Base_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000060, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000068, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000070, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000078, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x000080, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x000088, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetPlayGoMenuType_ReturnValue) == 0x000090, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetPlayGoMenuType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000098, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_AsBP_IF_Arasuzi) == 0x0000A0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_AsBP_IF_Arasuzi' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_bSuccess2) == 0x0000B0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_SwitchEnum2_CmpSuccess) == 0x0000B1, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x0000B8, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_InEventTag) == 0x0000C0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x0000C8, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_InObject) == 0x0000D0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_SwitchName_CmpSuccess) == 0x0000D8, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue8) == 0x0000E0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x0000E8, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue9) == 0x0000F0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_AsWBP_Hud_CS_Skip_000_Modern) == 0x0000F8, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_AsWBP_Hud_CS_Skip_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_bSuccess3) == 0x000100, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetAsyncLoadedWidget_ReturnValue2) == 0x000108, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetAsyncLoadedWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_AsWBP_Menu_Play_Go_Base_Modern2) == 0x000110, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_AsWBP_Menu_Play_Go_Base_Modern2' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_DynamicCast_bSuccess4) == 0x000118, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue10) == 0x000120, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CustomEvent_EventTag) == 0x000128, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_SwitchName2_CmpSuccess) == 0x000130, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000138, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue11) == 0x000140, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x000148, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue12) == 0x000150, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue12' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x000158, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue13) == 0x000160, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue13' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000168, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue8) == 0x000178, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue14) == 0x000180, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue14' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000188, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_AddUMGMenuWidget_ReturnValue9) == 0x000198, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_AddUMGMenuWidget_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern, CallFunc_GetUMGManager_ReturnValue15) == 0x0001A0, "Member 'WBP_Title_UMG_Root_Widget_modern_C_ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern::CallFunc_GetUMGManager_ReturnValue15' has a wrong offset!");

// Function WBP_Title_UMG_Root_Widget_modern.WBP_Title_UMG_Root_Widget_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0 final
{
public:
	EJackUMGMenuId                                InMenuId;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InArgName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InArgValue;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0, InMenuId) == 0x000000, "Member 'WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0::InMenuId' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0, InArgName) == 0x000008, "Member 'WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0::InArgName' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0, InArgValue) == 0x000010, "Member 'WBP_Title_UMG_Root_Widget_modern_C_CustomEvent_0::InArgValue' has a wrong offset!");

// Function WBP_Title_UMG_Root_Widget_modern.WBP_Title_UMG_Root_Widget_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Title_UMG_Root_Widget_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Title_UMG_Root_Widget_modern.WBP_Title_UMG_Root_Widget_modern_C.CloseMenu
// 0x0004 (0x0004 - 0x0000)
struct WBP_Title_UMG_Root_Widget_modern_C_CloseMenu final
{
public:
	int32                                         InArg;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_UMG_Root_Widget_modern_C_CloseMenu) == 0x000004, "Wrong alignment on WBP_Title_UMG_Root_Widget_modern_C_CloseMenu");
static_assert(sizeof(WBP_Title_UMG_Root_Widget_modern_C_CloseMenu) == 0x000004, "Wrong size on WBP_Title_UMG_Root_Widget_modern_C_CloseMenu");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_CloseMenu, InArg) == 0x000000, "Member 'WBP_Title_UMG_Root_Widget_modern_C_CloseMenu::InArg' has a wrong offset!");

// Function WBP_Title_UMG_Root_Widget_modern.WBP_Title_UMG_Root_Widget_modern_C.WidgetNotificationDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate) == 0x000008, "Wrong alignment on WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate");
static_assert(sizeof(WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate) == 0x000018, "Wrong size on WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate, InEventTag) == 0x000000, "Member 'WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate, InCallWidgetBase) == 0x000008, "Member 'WBP_Title_UMG_Root_Widget_modern_C_WidgetNotificationDelegate::InCallWidgetBase' has a wrong offset!");
