#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_046_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_046_modern.WBP_Menu_Parts_046_modern_C.ExecuteUbergraph_WBP_Menu_Parts_046_modern
// 0x0140 (0x0140 - 0x0000)
struct WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable3;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable4;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable5;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable6;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0020(0x0050)()
	class UJackUMGTokugiPanelSkillLineData*       K2Node_DynamicCast_AsJack_UMGTokugi_Panel_Skill_Line_Data; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllMastered_ReturnValue;                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	EJackUMGTextColorSet                          K2Node_Select2_Default;                            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x00B0(0x0018)()
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x00D8(0x0018)()
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue2;             // 0x0100(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue3;             // 0x0118(0x0018)()
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern");
static_assert(sizeof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern) == 0x000140, "Wrong size on WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_bool_Variable) == 0x000006, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable3) == 0x000018, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable4) == 0x000019, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_bool_Variable2) == 0x00001A, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable5) == 0x00001B, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable6) == 0x00001C, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_bool_Variable3) == 0x00001D, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable7) == 0x00001E, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_byte_Variable8) == 0x00001F, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_CustomEvent_ItemContainer) == 0x000020, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_DynamicCast_AsJack_UMGTokugi_Panel_Skill_Line_Data) == 0x000070, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_DynamicCast_AsJack_UMGTokugi_Panel_Skill_Line_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_SwitchName_CmpSuccess) == 0x000079, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_IsAllMastered_ReturnValue) == 0x00007A, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_IsAllMastered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_Select_Default) == 0x00007B, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_Select2_Default) == 0x000098, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_Select3_Default) == 0x00009A, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_GetText_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x0000B0, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, Temp_bool_Variable4) == 0x0000D0, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_Select4_Default) == 0x0000F0, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_GetAsciiDecText_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_GetAsciiDecText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, CallFunc_GetAsciiDecText_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::CallFunc_GetAsciiDecText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_Menu_Parts_046_modern_C_ExecuteUbergraph_WBP_Menu_Parts_046_modern::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Menu_Parts_046_modern.WBP_Menu_Parts_046_modern_C.DrawUpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_046_modern_C_DrawUpdateContainerDelegate::ItemContainer' has a wrong offset!");

}

