#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_002_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Sakusen_List_002_modern.WBP_Menu_Sakusen_List_002_modern_C
// 0x00B0 (0x04E0 - 0x0430)
class UWBP_Menu_Sakusen_List_002_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           DecisionPanel;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_0;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_170;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_209;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_2;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_4;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_6;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_9;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_15;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_21;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_27;                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_018_modern_C*           WBP_Menu_Parts_018_C_34;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_1;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line_2;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsVisibleNumber;                                   // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EJackUMGSnapType                              SnapType;                                          // 0x04C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Sakusen_Renkei_Settei_000_modern_C* WBP_Menu_Renkei_Settei;                            // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RenkeiSerifuID;                                    // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Sakusen_List_002_modern(int32 EntryPoint);
	void CustomEvent_0_Copy(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void CustomEvent_0(EJackKeys InKeyType, bool bIsPressed);
	void Construct();
	void WidgetBPActionDelegate(class FName EventTag);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void AdjustPanel();
	void SetVisibilityImage();
	void SnapRenkeiModeWidget();
	void SetVisibilitySakusenWindow(ESlateVisibility InVisibility);
	void IsOpenedMainMenu(bool* OpenedMainMenu);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Sakusen_List_002_modern_C">();
	}
	static class UWBP_Menu_Sakusen_List_002_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Sakusen_List_002_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Sakusen_List_002_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Sakusen_List_002_modern_C");
static_assert(sizeof(UWBP_Menu_Sakusen_List_002_modern_C) == 0x0004E0, "Wrong size on UWBP_Menu_Sakusen_List_002_modern_C");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, DecisionPanel) == 0x000438, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::DecisionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, InvalidationBox_0) == 0x000440, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, ItemList) == 0x000448, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, RootPanel) == 0x000450, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_000_0) == 0x000458, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_000_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_000_C_170) == 0x000460, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_000_C_170' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_000_C_209) == 0x000468, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_000_C_209' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_2) == 0x000470, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_4) == 0x000478, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_6) == 0x000480, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_9) == 0x000488, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_9' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_15) == 0x000490, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_21) == 0x000498, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_21' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_27) == 0x0004A0, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_27' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Parts_018_C_34) == 0x0004A8, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Parts_018_C_34' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, Window_Line_1) == 0x0004B0, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::Window_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, Window_Line_2) == 0x0004B8, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::Window_Line_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WindowFrame) == 0x0004C0, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, IsVisibleNumber) == 0x0004C8, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::IsVisibleNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, SnapType) == 0x0004C9, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::SnapType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, WBP_Menu_Renkei_Settei) == 0x0004D0, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::WBP_Menu_Renkei_Settei' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Sakusen_List_002_modern_C, RenkeiSerifuID) == 0x0004D8, "Member 'UWBP_Menu_Sakusen_List_002_modern_C::RenkeiSerifuID' has a wrong offset!");

}

