#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Text_000

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetValueAscii
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetValueAscii final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFig;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetValueAscii) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetValueAscii");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetValueAscii) == 0x000028, "Wrong size on WBP_Menu_Parts_Text_000_C_SetValueAscii");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueAscii, InValue) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetValueAscii::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueAscii, InFig) == 0x000004, "Member 'WBP_Menu_Parts_Text_000_C_SetValueAscii::InFig' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueAscii, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_Text_000_C_SetValueAscii::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueAscii, CallFunc_GetDecMenuText_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetValueAscii::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetTextId
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetTextId final
{
public:
	class FName                                   InTextId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetTextId) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetTextId");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetTextId) == 0x000028, "Wrong size on WBP_Menu_Parts_Text_000_C_SetTextId");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetTextId, InTextId) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetTextId::InTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetTextId, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_Text_000_C_SetTextId::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetTextId, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetTextId::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetString
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetString final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetString) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetString");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetString) == 0x000028, "Wrong size on WBP_Menu_Parts_Text_000_C_SetString");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetString, InString) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetString::InString' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetString, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetTxet
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetTxet final
{
public:
	class FText                                   SetText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetTxet) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetTxet");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetTxet) == 0x000018, "Wrong size on WBP_Menu_Parts_Text_000_C_SetTxet");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetTxet, SetText) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetTxet::SetText' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetValue2Byte
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetValue2Byte final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFig;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Get2ByteDecText_ReturnValue;              // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetValue2Byte) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetValue2Byte");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetValue2Byte) == 0x000028, "Wrong size on WBP_Menu_Parts_Text_000_C_SetValue2Byte");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue2Byte, InValue) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetValue2Byte::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue2Byte, InFig) == 0x000004, "Member 'WBP_Menu_Parts_Text_000_C_SetValue2Byte::InFig' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue2Byte, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Parts_Text_000_C_SetValue2Byte::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue2Byte, CallFunc_Get2ByteDecText_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetValue2Byte::CallFunc_Get2ByteDecText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetValue
// 0x0048 (0x0048 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFig;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is2Byte;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSign;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Get2ByteDecText_ReturnValue;              // 0x0018(0x0018)()
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0030(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetValue) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetValue");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetValue) == 0x000048, "Wrong size on WBP_Menu_Parts_Text_000_C_SetValue");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, InValue) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, InFig) == 0x000004, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::InFig' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, Is2Byte) == 0x000008, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::Is2Byte' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, IsSign) == 0x000009, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::IsSign' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, CallFunc_Get2ByteDecText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::CallFunc_Get2ByteDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValue, CallFunc_GetAsciiDecText_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_Text_000_C_SetValue::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetValueFloat
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetValueFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSign;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InUnitTextId;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetRealText_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetValueFloat) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetValueFloat");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetValueFloat) == 0x000030, "Wrong size on WBP_Menu_Parts_Text_000_C_SetValueFloat");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueFloat, InValue) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetValueFloat::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueFloat, IsSign) == 0x000004, "Member 'WBP_Menu_Parts_Text_000_C_SetValueFloat::IsSign' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueFloat, InUnitTextId) == 0x000008, "Member 'WBP_Menu_Parts_Text_000_C_SetValueFloat::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueFloat, CallFunc_GetUMGManager_ReturnValue) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetValueFloat::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueFloat, CallFunc_GetRealText_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_Text_000_C_SetValueFloat::CallFunc_GetRealText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Parts_Text_000.WBP_Menu_Parts_Text_000_C.SetValueWithUnit
// 0x0038 (0x0038 - 0x0000)
struct WBP_Menu_Parts_Text_000_C_SetValueWithUnit final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFig;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSign;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InUnitTextId;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_000_C_SetValueWithUnit");
static_assert(sizeof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit) == 0x000038, "Wrong size on WBP_Menu_Parts_Text_000_C_SetValueWithUnit");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit, InValue) == 0x000000, "Member 'WBP_Menu_Parts_Text_000_C_SetValueWithUnit::InValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit, InFig) == 0x000004, "Member 'WBP_Menu_Parts_Text_000_C_SetValueWithUnit::InFig' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit, IsSign) == 0x000008, "Member 'WBP_Menu_Parts_Text_000_C_SetValueWithUnit::IsSign' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit, InUnitTextId) == 0x000010, "Member 'WBP_Menu_Parts_Text_000_C_SetValueWithUnit::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_Text_000_C_SetValueWithUnit::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_000_C_SetValueWithUnit, CallFunc_GetDecMenuText_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_Text_000_C_SetValueWithUnit::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");

}

