#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Keyconfig_Settei_001_Steam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Keyconfig_Settei_001_Steam.WBP_Menu_Keyconfig_Settei_001_Steam_C
// 0x0090 (0x0490 - 0x0400)
class UWBP_Menu_Keyconfig_Settei_001_Steam_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePanel_Keyboard_Layout;                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Arrow_Image;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Obi;                                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_037_modern_C*           Parts037_TitleText;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Arrow_Image;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           SelectDummyParts;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPanel_Layout;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Keyconfig_Settei_002_Steam_C* KeyConfigSettei002;                                // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     TextureKeyboard;                                   // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           KeyboardLocale;                                    // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           ChangeKeyboard;                                    // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWBP_Menu_Keyconfig_Settei_000_Steam_C* KeyConfigSettei000;                                // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Keyconfig_Settei_001_Steam(int32 EntryPoint);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void ChangeKeyboardYN(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void ResetCaptureCameraPosition();
	void HideDebugInfo();
	void ShowDebugInfo();
	void KeyEventDelegate(EJackKeys InKeyType, bool bIsPressed);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void SetDebugTargetSize(bool bVisible, const struct FVector2D& SlideTargetOrigin, const struct FVector2D& MaxSlideTargetSize, const struct FVector2D& MinSlideTargetSize);
	void HideDebugTargetSize();
	void ShowDebugTargetSize();
	void SetKeyboardTexture(EJackKeyboardType InKeyboardType);
	void SetFocus000();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Keyconfig_Settei_001_Steam_C">();
	}
	static class UWBP_Menu_Keyconfig_Settei_001_Steam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Keyconfig_Settei_001_Steam_C>();
	}
};
static_assert(alignof(UWBP_Menu_Keyconfig_Settei_001_Steam_C) == 0x000008, "Wrong alignment on UWBP_Menu_Keyconfig_Settei_001_Steam_C");
static_assert(sizeof(UWBP_Menu_Keyconfig_Settei_001_Steam_C) == 0x000490, "Wrong size on UWBP_Menu_Keyconfig_Settei_001_Steam_C");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, BG) == 0x000408, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, ImagePanel_Keyboard_Layout) == 0x000410, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::ImagePanel_Keyboard_Layout' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, ItemList) == 0x000418, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, L_Arrow_Image) == 0x000420, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::L_Arrow_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, Obi) == 0x000428, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::Obi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, Parts037_TitleText) == 0x000430, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::Parts037_TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, R_Arrow_Image) == 0x000438, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::R_Arrow_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, SelectDummyParts) == 0x000440, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::SelectDummyParts' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, TextPanel_Layout) == 0x000448, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::TextPanel_Layout' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, KeyConfigSettei002) == 0x000450, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::KeyConfigSettei002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, TextureKeyboard) == 0x000458, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::TextureKeyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, KeyboardLocale) == 0x000468, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::KeyboardLocale' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, ChangeKeyboard) == 0x000478, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::ChangeKeyboard' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Keyconfig_Settei_001_Steam_C, KeyConfigSettei000) == 0x000488, "Member 'UWBP_Menu_Keyconfig_Settei_001_Steam_C::KeyConfigSettei000' has a wrong offset!");

}

