#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_014_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_014_modern.WBP_Menu_Parts_014_modern_C
// 0x00A0 (0x0470 - 0x03D0)
class UWBP_Menu_Parts_014_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Twod_Icon;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EmptyPanel;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_Colon;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_DataNumber;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_Empty;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_EmptyColon;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_EmptyNumber;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_Level;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_PlayerName;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           Parts_000_PlayTime;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Sibari_Play_Parts;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_Icon;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      Text_080_Location;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      Text_080_PlayTimeText;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      Text_080_RecordDay;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      Text_080_RecordTime;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      Text_080_RecordTimeText;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      Text_080_SibariPlay;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_014_modern(int32 EntryPoint);
	void CustomEvent_0(const struct FJackUMGItemContainer& ItemContainer);
	void SetData(class UJackUMGSaveDataContainer* Data);
	void Construct();
	void CheckSaveData(class UJackUMGSaveDataContainer* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_014_modern_C">();
	}
	static class UWBP_Menu_Parts_014_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_014_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_014_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_014_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_014_modern_C) == 0x000470, "Wrong size on UWBP_Menu_Parts_014_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_014_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Twod_Icon) == 0x0003D8, "Member 'UWBP_Menu_Parts_014_modern_C::Twod_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, EmptyPanel) == 0x0003E0, "Member 'UWBP_Menu_Parts_014_modern_C::EmptyPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_Colon) == 0x0003E8, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_Colon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_DataNumber) == 0x0003F0, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_DataNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_Empty) == 0x0003F8, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_EmptyColon) == 0x000400, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_EmptyColon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_EmptyNumber) == 0x000408, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_EmptyNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_Level) == 0x000410, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_Level' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_PlayerName) == 0x000418, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Parts_000_PlayTime) == 0x000420, "Member 'UWBP_Menu_Parts_014_modern_C::Parts_000_PlayTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, RootPanel) == 0x000428, "Member 'UWBP_Menu_Parts_014_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Sibari_Play_Parts) == 0x000430, "Member 'UWBP_Menu_Parts_014_modern_C::Sibari_Play_Parts' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Star_Icon) == 0x000438, "Member 'UWBP_Menu_Parts_014_modern_C::Star_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Text_080_Location) == 0x000440, "Member 'UWBP_Menu_Parts_014_modern_C::Text_080_Location' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Text_080_PlayTimeText) == 0x000448, "Member 'UWBP_Menu_Parts_014_modern_C::Text_080_PlayTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Text_080_RecordDay) == 0x000450, "Member 'UWBP_Menu_Parts_014_modern_C::Text_080_RecordDay' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Text_080_RecordTime) == 0x000458, "Member 'UWBP_Menu_Parts_014_modern_C::Text_080_RecordTime' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Text_080_RecordTimeText) == 0x000460, "Member 'UWBP_Menu_Parts_014_modern_C::Text_080_RecordTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_014_modern_C, Text_080_SibariPlay) == 0x000468, "Member 'UWBP_Menu_Parts_014_modern_C::Text_080_SibariPlay' has a wrong offset!");

}

