#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Syousai_106_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Dougu_Syousai_106_modern.WBP_Menu_Dougu_Syousai_106_modern_C.ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern
// 0x0268 (0x0268 - 0x0000)
struct WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_CustomEvent_ItemSyousaiRef;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetSpecialEffectsMessage_ReturnValue;     // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_033_modern_C*           CallFunc_Array_Get_Item2;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_Parts_033_modern_C*           CallFunc_Array_Get_Item3;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue2;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeEquippedItemInChar_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue3;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHandedness_NewParam;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGDispEquipmentState*             CallFunc_GetCharEquipmentState_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackEquipmentRegion                          CallFunc_CheckAccessoryFreeRegion_ReturnValue;     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGEquipmentParam                 CallFunc_Array_Get_Item4;                          // 0x0148(0x0038)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item5;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item6;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item7;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item8;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDecMenuText_ReturnValue;               // 0x01C8(0x0018)()
	class UTextBlock*                             CallFunc_Array_Get_Item9;                          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_033_modern_C*           CallFunc_Array_Get_Item10;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     CallFunc_MakeTextBlockArray_InTextBlockArray;      // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTextBlock*>                     CallFunc_MakeTextBlockArray_InTextBlockArray2;     // 0x0220(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTextBlock*>                     CallFunc_MakeTextBlockArray_InTextBlockArray3;     // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UTextBlock*>                     CallFunc_MakeTextBlockArray_InTextBlockArray4;     // 0x0240(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UWBP_Menu_Parts_033_modern_C*>   K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern) == 0x000268, "Wrong size on WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_int_Variable) == 0x000004, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_CustomEvent_InEventTag) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000018, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_CustomEvent_InObject) == 0x000020, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_CustomEvent_ItemSyousaiRef) == 0x000028, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_CustomEvent_ItemSyousaiRef' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000030, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x000040, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_SwitchName_CmpSuccess) == 0x000049, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000050, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetSpecialEffectsMessage_ReturnValue) == 0x000060, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetSpecialEffectsMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Length_ReturnValue2) == 0x000074, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000098, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_int_Loop_Counter_Variable2) == 0x0000A0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x0000A8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000D0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item2) == 0x0000E0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Length_ReturnValue3) == 0x0000E8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x0000EC, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_SwitchEnum_CmpSuccess) == 0x0000ED, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_int_Array_Index_Variable2) == 0x0000F0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item3) == 0x0000F8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000100, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetAccessorItem_ReturnValue2) == 0x000108, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetAccessorItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_CanBeEquippedItemInChar_ReturnValue) == 0x000110, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_CanBeEquippedItemInChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000111, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000112, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_BooleanAND_ReturnValue) == 0x000113, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetAccessorItem_ReturnValue3) == 0x000118, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetAccessorItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_name_Variable) == 0x000120, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_IsHandedness_NewParam) == 0x000128, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_IsHandedness_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetCharEquipmentState_ReturnValue) == 0x000130, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetCharEquipmentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_name_Variable2) == 0x000138, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_bool_Variable) == 0x000140, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000141, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_CheckAccessoryFreeRegion_ReturnValue) == 0x000142, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_CheckAccessoryFreeRegion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000143, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x000144, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item4) == 0x000148, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_BooleanOR_ReturnValue) == 0x000180, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_BooleanOR_ReturnValue2) == 0x000181, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_Select_Default) == 0x000188, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_BooleanAND_ReturnValue2) == 0x000190, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Length_ReturnValue4) == 0x000194, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Less_IntInt_ReturnValue3) == 0x000198, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000199, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_BooleanOR_ReturnValue3) == 0x00019A, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item5) == 0x0001A0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item6) == 0x0001A8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item7) == 0x0001B0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item8) == 0x0001B8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0001C0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_GetDecMenuText_ReturnValue) == 0x0001C8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_GetDecMenuText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item9) == 0x0001E0, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_CreateDelegate_OutputDelegate) == 0x0001E8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, Temp_int_Variable2) == 0x0001F8, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Add_IntInt_ReturnValue4) == 0x0001FC, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Array_Get_Item10) == 0x000200, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Array_Get_Item10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_Less_IntInt_ReturnValue4) == 0x000208, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_MakeTextBlockArray_InTextBlockArray) == 0x000210, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_MakeTextBlockArray_InTextBlockArray' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_MakeTextBlockArray_InTextBlockArray2) == 0x000220, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_MakeTextBlockArray_InTextBlockArray2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_MakeTextBlockArray_InTextBlockArray3) == 0x000230, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_MakeTextBlockArray_InTextBlockArray3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_MakeTextBlockArray_InTextBlockArray4) == 0x000240, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_MakeTextBlockArray_InTextBlockArray4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, K2Node_MakeArray_Array) == 0x000250, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern, CallFunc_BooleanAND_ReturnValue3) == 0x000260, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_ExecuteUbergraph_WBP_Menu_Dougu_Syousai_106_modern::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_106_modern.WBP_Menu_Dougu_Syousai_106_modern_C.DispItemFromSyousaiRef
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef final
{
public:
	class UJackUMGItemSyousai*                    ItemSyousaiRef_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef) == 0x000008, "Wrong size on WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef, ItemSyousaiRef_0) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_DispItemFromSyousaiRef::ItemSyousaiRef_0' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_106_modern.WBP_Menu_Dougu_Syousai_106_modern_C.JackOnWidgetNotificationDelegate_Event_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0 final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0, InEventTag) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0, InObject) == 0x000010, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_JackOnWidgetNotificationDelegate_Event_0::InObject' has a wrong offset!");

// Function WBP_Menu_Dougu_Syousai_106_modern.WBP_Menu_Dougu_Syousai_106_modern_C.DrawParameterCorrection
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection final
{
public:
	class UWBP_Menu_Parts_000_modern_C*           InParts000;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValue;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection) == 0x000008, "Wrong alignment on WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection");
static_assert(sizeof(WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection) == 0x000018, "Wrong size on WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection, InParts000) == 0x000000, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection::InParts000' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection, InValue) == 0x000008, "Member 'WBP_Menu_Dougu_Syousai_106_modern_C_DrawParameterCorrection::InValue' has a wrong offset!");
