#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_069_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.ExecuteUbergraph_WBP_Menu_Parts_069_modern
// 0x0058 (0x0058 - 0x0000)
struct WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                K2Node_CustomEvent_Character;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_BattleIndex;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MemberIndex;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOnCursor;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackCharacter                                K2Node_CustomEvent_CharacterType;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCharacterFaceIconFromType_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bExchange;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select4_Default;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern) == 0x000058, "Wrong size on WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_bool_Variable) == 0x000005, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_byte_Variable2) == 0x000006, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_byte_Variable3) == 0x000007, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_bool_Variable2) == 0x000008, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_byte_Variable4) == 0x000009, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_byte_Variable5) == 0x00000A, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_bool_Variable3) == 0x00000B, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_CustomEvent_Character) == 0x00000C, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_CustomEvent_BattleIndex) == 0x000010, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_CustomEvent_BattleIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_CustomEvent_MemberIndex) == 0x000014, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_CustomEvent_MemberIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_byte_Variable6) == 0x000024, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_CustomEvent_bIsOnCursor) == 0x000025, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_CustomEvent_bIsOnCursor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, Temp_bool_Variable4) == 0x000026, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_CustomEvent_CharacterType) == 0x000027, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_CustomEvent_CharacterType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_Select_Default) == 0x00002A, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_Select2_Default) == 0x00002B, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_GetCharacterFaceIconFromType_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_GetCharacterFaceIconFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_Event_bSelected) == 0x000038, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_Select3_Default) == 0x000039, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_CustomEvent_bExchange) == 0x00003A, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_CustomEvent_bExchange' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, K2Node_Select4_Default) == 0x000048, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000050, "Member 'WBP_Menu_Parts_069_modern_C_ExecuteUbergraph_WBP_Menu_Parts_069_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.PlayAnimOfSetCharacter
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter final
{
public:
	bool                                          bExchange;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter) == 0x000001, "Wrong alignment on WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter) == 0x000001, "Wrong size on WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter, bExchange) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_PlayAnimOfSetCharacter::bExchange' has a wrong offset!");

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.SetSelectedFlag
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_069_modern_C_SetSelectedFlag final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_SetSelectedFlag) == 0x000001, "Wrong alignment on WBP_Menu_Parts_069_modern_C_SetSelectedFlag");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_SetSelectedFlag) == 0x000001, "Wrong size on WBP_Menu_Parts_069_modern_C_SetSelectedFlag");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetSelectedFlag, bSelected) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_SetSelectedFlag::bSelected' has a wrong offset!");

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.SetCharacterType
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_069_modern_C_SetCharacterType final
{
public:
	EJackCharacter                                CharacterType_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_SetCharacterType) == 0x000001, "Wrong alignment on WBP_Menu_Parts_069_modern_C_SetCharacterType");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_SetCharacterType) == 0x000001, "Wrong size on WBP_Menu_Parts_069_modern_C_SetCharacterType");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetCharacterType, CharacterType_0) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_SetCharacterType::CharacterType_0' has a wrong offset!");

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.SetOnCursorFlag
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_069_modern_C_SetOnCursorFlag final
{
public:
	bool                                          bIsOnCursor;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_SetOnCursorFlag) == 0x000001, "Wrong alignment on WBP_Menu_Parts_069_modern_C_SetOnCursorFlag");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_SetOnCursorFlag) == 0x000001, "Wrong size on WBP_Menu_Parts_069_modern_C_SetOnCursorFlag");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetOnCursorFlag, bIsOnCursor) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_SetOnCursorFlag::bIsOnCursor' has a wrong offset!");

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.SetData
// 0x000C (0x000C - 0x0000)
struct WBP_Menu_Parts_069_modern_C_SetData final
{
public:
	EJackCharacter                                Character;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BattleIndex_0;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MemberIndex_0;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_SetData) == 0x000004, "Wrong alignment on WBP_Menu_Parts_069_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_SetData) == 0x00000C, "Wrong size on WBP_Menu_Parts_069_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetData, Character) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_SetData::Character' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetData, BattleIndex_0) == 0x000004, "Member 'WBP_Menu_Parts_069_modern_C_SetData::BattleIndex_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetData, MemberIndex_0) == 0x000008, "Member 'WBP_Menu_Parts_069_modern_C_SetData::MemberIndex_0' has a wrong offset!");

// Function WBP_Menu_Parts_069_modern.WBP_Menu_Parts_069_modern_C.SetButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_069_modern_C_SetButton final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_069_modern_C_SetButton) == 0x000001, "Wrong alignment on WBP_Menu_Parts_069_modern_C_SetButton");
static_assert(sizeof(WBP_Menu_Parts_069_modern_C_SetButton) == 0x000001, "Wrong size on WBP_Menu_Parts_069_modern_C_SetButton");
static_assert(offsetof(WBP_Menu_Parts_069_modern_C_SetButton, InKeyType) == 0x000000, "Member 'WBP_Menu_Parts_069_modern_C_SetButton::InKeyType' has a wrong offset!");

}

