#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_ActionCursor_Arrow_001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_ActionCursor_Arrow_001.WBP_Hud_ActionCursor_Arrow_001_C
// 0x0058 (0x0228 - 0x01D0)
class UWBP_Hud_ActionCursor_Arrow_001_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       ActionCursor_Loop;                                 // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActionCursor_In;                                   // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ActionIconImagePanel;                              // 0x01E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     ActionCursorIcons;                                 // 0x01F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UTexture2D*>                     NPCCursorIcons;                                    // 0x0200(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class UTexture2D*                             SetIconTextureRef;                                 // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconImageSize;                                     // 0x0218(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetAnimPlayer*               AnimationPlayer;                                   // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_ActionCursor_Arrow_001(int32 EntryPoint);
	void Construct();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void UpdateData(class UJackUMG3DWidgetData* Data);
	void UpdateIconData(class UJackUMG3DWidgetData* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_ActionCursor_Arrow_001_C">();
	}
	static class UWBP_Hud_ActionCursor_Arrow_001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_ActionCursor_Arrow_001_C>();
	}
};
static_assert(alignof(UWBP_Hud_ActionCursor_Arrow_001_C) == 0x000008, "Wrong alignment on UWBP_Hud_ActionCursor_Arrow_001_C");
static_assert(sizeof(UWBP_Hud_ActionCursor_Arrow_001_C) == 0x000228, "Wrong size on UWBP_Hud_ActionCursor_Arrow_001_C");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, ActionCursor_Loop) == 0x0001D8, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::ActionCursor_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, ActionCursor_In) == 0x0001E0, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::ActionCursor_In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, ActionIconImagePanel) == 0x0001E8, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::ActionIconImagePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, ActionCursorIcons) == 0x0001F0, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::ActionCursorIcons' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, NPCCursorIcons) == 0x000200, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::NPCCursorIcons' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, SetIconTextureRef) == 0x000210, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::SetIconTextureRef' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, IconImageSize) == 0x000218, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::IconImageSize' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_ActionCursor_Arrow_001_C, AnimationPlayer) == 0x000220, "Member 'UWBP_Hud_ActionCursor_Arrow_001_C::AnimationPlayer' has a wrong offset!");

}

