#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Camera_Setting_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Namae_Camera_Setting_000_modern.WBP_Menu_Namae_Camera_Setting_000_modern_C
// 0x0118 (0x0598 - 0x0480)
class UWBP_Menu_Namae_Camera_Setting_000_modern_C final : public UJackUMGCameraModeSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow_Down;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Left;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Right;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Up;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_R_Down;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_R_Left;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_R_Nomal;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_R_Right;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_R_Up;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ButtonSet;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CameraSettingPanel;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FadePanel;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineTate;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieTexture0;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieTexture1;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieTexture2;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieTexture3;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieTexture4;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MovieTexture5;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern;                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern_0;                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_modern_1;                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_011_modern_C*           WBP_Menu_Parts_011_modern_1;                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_011_modern_C*           WBP_Menu_Parts_011_modern_2;                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_011_modern_C*           WBP_Menu_Parts_011_modern_3;                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         InversH;                                           // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InversV;                                           // 0x057C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       SelectedItemBase;                                  // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AutoMove;                                          // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectItemSaved;                                   // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Namae_Camera_Setting_000_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate_Copy(class FName EventTag);
	void SelectTextSet();
	void SaveAndBack();
	void SetAllValue();
	void GetAllValue();
	void SetInfoText();
	void GotoTheNextMenu();
	void SetFadePanel();
	void SaveSelectedItemId();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Namae_Camera_Setting_000_modern_C">();
	}
	static class UWBP_Menu_Namae_Camera_Setting_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Namae_Camera_Setting_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Namae_Camera_Setting_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Namae_Camera_Setting_000_modern_C");
static_assert(sizeof(UWBP_Menu_Namae_Camera_Setting_000_modern_C) == 0x000598, "Wrong size on UWBP_Menu_Namae_Camera_Setting_000_modern_C");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Arrow_Down) == 0x000488, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Arrow_Down' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Arrow_Left) == 0x000490, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Arrow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Arrow_Right) == 0x000498, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Arrow_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Arrow_Up) == 0x0004A0, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Arrow_Up' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Button_R_Down) == 0x0004A8, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Button_R_Down' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Button_R_Left) == 0x0004B0, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Button_R_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Button_R_Nomal) == 0x0004B8, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Button_R_Nomal' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Button_R_Right) == 0x0004C0, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Button_R_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Button_R_Up) == 0x0004C8, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Button_R_Up' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, ButtonSet) == 0x0004D0, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::ButtonSet' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, CameraSettingPanel) == 0x0004D8, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::CameraSettingPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, CaptionPanel) == 0x0004E0, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, FadePanel) == 0x0004E8, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::FadePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, ItemList) == 0x0004F0, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Line_1) == 0x0004F8, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Line_2) == 0x000500, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, LineTate) == 0x000508, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::LineTate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, MovieTexture0) == 0x000510, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::MovieTexture0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, MovieTexture1) == 0x000518, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::MovieTexture1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, MovieTexture2) == 0x000520, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::MovieTexture2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, MovieTexture3) == 0x000528, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::MovieTexture3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, MovieTexture4) == 0x000530, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::MovieTexture4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, MovieTexture5) == 0x000538, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::MovieTexture5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, WBP_Menu_Parts_000_modern) == 0x000540, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::WBP_Menu_Parts_000_modern' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, WBP_Menu_Parts_000_modern_0) == 0x000548, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::WBP_Menu_Parts_000_modern_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, WBP_Menu_Parts_000_modern_1) == 0x000550, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::WBP_Menu_Parts_000_modern_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, WBP_Menu_Parts_011_modern_1) == 0x000558, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::WBP_Menu_Parts_011_modern_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, WBP_Menu_Parts_011_modern_2) == 0x000560, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::WBP_Menu_Parts_011_modern_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, WBP_Menu_Parts_011_modern_3) == 0x000568, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::WBP_Menu_Parts_011_modern_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, Window) == 0x000570, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::Window' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, InversH) == 0x000578, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::InversH' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, InversV) == 0x00057C, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::InversV' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, SelectedItemBase) == 0x000580, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::SelectedItemBase' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, AutoMove) == 0x000588, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::AutoMove' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Camera_Setting_000_modern_C, SelectItemSaved) == 0x000590, "Member 'UWBP_Menu_Namae_Camera_Setting_000_modern_C::SelectItemSaved' has a wrong offset!");

}

