#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_004_modern

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern
// 0x0148 (0x0148 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutItemIndex)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetKiraUMGItemDataList_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGItemListInfo                   K2Node_MakeStruct_JackUMGItemListInfo;             // 0x0080(0x0018)(NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_GetAsyncLoadedWidget_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_OutItemIndex;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemsPerPage_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_PoppedWidget;                     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_PopMenu_CurrentActiveWidget;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern) == 0x000148, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetKiraUMGItemDataList_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetKiraUMGItemDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CustomEvent_EventTag) == 0x000058, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CustomEvent_InKeyType) == 0x000060, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CustomEvent_bIsPressed) == 0x000061, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_SwitchName_CmpSuccess) == 0x000062, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000063, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Array_Length_ReturnValue2) == 0x000064, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Array_Length_ReturnValue3) == 0x000078, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_MakeStruct_JackUMGItemListInfo) == 0x000080, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_MakeStruct_JackUMGItemListInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_NotEqual_NameName_ReturnValue) == 0x000098, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Array_Add_ReturnValue) == 0x00009C, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000A0, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetAsyncLoadedWidget_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetAsyncLoadedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000B0, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern) == 0x0000B8, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_DynamicCast_AsWBP_Menu_Dougu_Syousai_100_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CustomEvent_OutItemIndex) == 0x0000C4, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CustomEvent_OutItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetItemsPerPage_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetItemsPerPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x0000D8, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Percent_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0000F0, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetZOrder_ReturnValue) == 0x000100, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000108, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Add_IntInt_ReturnValue2) == 0x000118, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x000120, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, Temp_int_Loop_Counter_Variable) == 0x000128, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_PopMenu_PoppedWidget) == 0x000130, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_PopMenu_PoppedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_PopMenu_CurrentActiveWidget) == 0x000138, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_PopMenu_CurrentActiveWidget' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Less_IntInt_ReturnValue2) == 0x000140, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern, CallFunc_Add_IntInt_ReturnValue3) == 0x000144, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.CustomEvent_3
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3 final
{
public:
	int32                                         OutItemIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3) == 0x000004, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3, OutItemIndex) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_3::OutItemIndex' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.CustomEvent_1
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1) == 0x000002, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1, InKeyType) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1, bIsPressed) == 0x000001, "Member 'WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_1::bIsPressed' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0 final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0) == 0x000008, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0, EventTag) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_CustomEvent_0::EventTag' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.Open
// 0x0098 (0x0098 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_Open final
{
public:
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0000(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue;             // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue2;            // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue2;                // 0x003C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0048(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X4;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y4;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0058(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_WorldMap_Setumei_003_modern_C* K2Node_DynamicCast_AsWBP_Menu_World_Map_Setumei_003_Modern; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Button_000_modern_C*   K2Node_DynamicCast_AsWBP_Menu_Common_Button_000_Modern; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_Open) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_Open");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_Open) == 0x000098, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_Open");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_GetPanelSize_ReturnValue) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_GetPanelPosition_ReturnValue) == 0x000008, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_GetPanelPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_X2) == 0x000018, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_Y2) == 0x00001C, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_GetPanelPosition_ReturnValue2) == 0x000024, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_GetPanelPosition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_MakeVector2D_ReturnValue) == 0x00002C, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_X3) == 0x000034, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_Y3) == 0x000038, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_Y3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_GetPanelSize_ReturnValue2) == 0x00003C, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_GetPanelSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_X4) == 0x000050, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_X4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_BreakVector2D_Y4) == 0x000054, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_BreakVector2D_Y4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_MakeVector2D_ReturnValue2) == 0x000058, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_GetUMGManager_ReturnValue) == 0x000060, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000068, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, K2Node_DynamicCast_AsWBP_Menu_World_Map_Setumei_003_Modern) == 0x000070, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::K2Node_DynamicCast_AsWBP_Menu_World_Map_Setumei_003_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, CallFunc_AddUMGMenuWithSnap_ReturnValue2) == 0x000080, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::CallFunc_AddUMGMenuWithSnap_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, K2Node_DynamicCast_AsWBP_Menu_Common_Button_000_Modern) == 0x000088, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::K2Node_DynamicCast_AsWBP_Menu_Common_Button_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_Open, K2Node_DynamicCast_bSuccess2) == 0x000090, "Member 'WBP_Menu_WorldMap_List_004_modern_C_Open::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.ForEachExecAllKiraSymbol
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol final
{
public:
	float                                         Opacity;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrawsPopCondition;                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJackMapSymbol>                        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGMapSymbolInfoBase*>      CallFunc_FindAllMapSymbolInfo_ReturnValue;         // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMapSymbolInfoBase*              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMapKiraSymbolInfo*              K2Node_DynamicCast_AsJack_UMGMap_Kira_Symbol_Info; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol) == 0x000068, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, Opacity) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::Opacity' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, bDrawsPopCondition) == 0x000004, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::bDrawsPopCondition' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, CallFunc_GetUMGManager_ReturnValue) == 0x000028, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, CallFunc_FindAllMapSymbolInfo_ReturnValue) == 0x000030, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::CallFunc_FindAllMapSymbolInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, K2Node_DynamicCast_AsJack_UMGMap_Kira_Symbol_Info) == 0x000058, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::K2Node_DynamicCast_AsJack_UMGMap_Kira_Symbol_Info' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_Menu_WorldMap_List_004_modern_C_ForEachExecAllKiraSymbol::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.FindKiraAccessor
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor final
{
public:
	TArray<class UJackMapKiraAccessorBase*>       KiraAccessorList;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         UniqueNo;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackMapKiraAccessorBase*               KiraAccessor;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackMapKiraAccessorBase*               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor");
static_assert(sizeof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor) == 0x000050, "Wrong size on WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, KiraAccessorList) == 0x000000, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::KiraAccessorList' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, UniqueNo) == 0x000010, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::UniqueNo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, Found) == 0x000014, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::Found' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, KiraAccessor) == 0x000018, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::KiraAccessor' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000039, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'WBP_Menu_WorldMap_List_004_modern_C_FindKiraAccessor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C.ListEventHandler
// 0x0188 (0x0188 - 0x0000)
struct WBP_Menu_WorldMap_List_004_modern_C_ListEventHandler final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       ItemBase;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetItemId_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataIndex_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x005C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x007C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackMapKiraAccessorBase*>       CallFunc_GetKiraAccessorList_ReturnValue;          // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	struct FJackUMGItemContainer                  CallFunc_GetItemContainer_ReturnValue;             // 0x00A8(0x0050)()
	class UJackMapKiraAccessorBase*               CallFunc_Array_Get_Item2;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGKiraItemSyousai*                K2Node_DynamicCast_AsJack_UMGKira_Item_Syousai;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGMapSymbolInfoBase*              CallFunc_FindMapSymbolInfo_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item3;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item4;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGMapSymbolInfoBase*              CallFunc_FindMapSymbolInfo_ReturnValue2;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindKiraAccessor_Found;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
