#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_Settei_001_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern
// 0x0228 (0x0228 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackBGMDiscVersion                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	EJackVoice                                    Temp_byte_Variable2;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_ChangeBGM_OutBGM;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackVoice                                    CallFunc_GetVoiceType_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUseDQ8BGM_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackBGMDiscVersion                           CallFunc_GetBGMDiscVersion_ReturnValue;            // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayBGMFromBGMID_ReturnValue;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayBGMFromBGMID_ReturnValue2;            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue3;                     // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x019C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayBGMFromBGMID_ReturnValue3;            // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x01A8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeVoice_IsChange;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable5;                                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger6_CmpSuccess;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName5_CmpSuccess;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable6;                                // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select3_Default;                            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern) == 0x000228, "Wrong size on WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_int_Variable) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_int_Variable2) == 0x00000C, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_struct_Variable) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_byte_Variable2) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_ChangeBGM_OutBGM) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_ChangeBGM_OutBGM' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CustomEvent_Sender) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CustomEvent_CurrentTextID) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_IsTrial_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetVoiceType_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetVoiceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_IsUseDQ8BGM_ReturnValue) == 0x0000C1, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_IsUseDQ8BGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetBGMDiscVersion_ReturnValue) == 0x0000C2, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetBGMDiscVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_Select_Default) == 0x0000C4, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetGameFlagBool_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CustomEvent_EventName) == 0x0000D0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CustomEvent_InItemBase) == 0x0000D8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchName_CmpSuccess) == 0x0000E0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000E1, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchName3_CmpSuccess) == 0x0000E2, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchName4_CmpSuccess) == 0x0000E3, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x0000E8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x0000F0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x0000F8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchInteger2_CmpSuccess) == 0x0000F9, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchInteger3_CmpSuccess) == 0x0000FA, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchInteger4_CmpSuccess) == 0x0000FB, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchInteger5_CmpSuccess) == 0x0000FC, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000100, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_struct_Variable2) == 0x000108, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x000118, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_StopBGM_ReturnValue) == 0x000128, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_PlayBGMFromBGMID_ReturnValue) == 0x000129, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_PlayBGMFromBGMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_struct_Variable3) == 0x000130, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000140, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_struct_Variable4) == 0x000148, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000158, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x000160, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000168, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_struct_Variable5) == 0x000170, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4) == 0x000180, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate6) == 0x000188, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_StopBGM_ReturnValue2) == 0x000198, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_StopBGM_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_PlayBGMFromBGMID_ReturnValue2) == 0x000199, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_PlayBGMFromBGMID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_StopBGM_ReturnValue3) == 0x00019A, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_StopBGM_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_MakeVector2D_ReturnValue) == 0x00019C, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_PlayBGMFromBGMID_ReturnValue3) == 0x0001A4, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_PlayBGMFromBGMID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_struct_Variable6) == 0x0001A8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5) == 0x0001B8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_int_Variable3) == 0x0001C0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_int_Variable4) == 0x0001C4, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_ChangeVoice_IsChange) == 0x0001C8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_ChangeVoice_IsChange' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_bool_Variable) == 0x0001C9, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_int_Variable5) == 0x0001CC, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_Select2_Default) == 0x0001D0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x0001D8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchInteger6_CmpSuccess) == 0x0001E0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchInteger6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x0001E8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6) == 0x0001F0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x0001F8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CreateDelegate_OutputDelegate7) == 0x000200, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_CustomEvent_EventTag) == 0x000210, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_SwitchName5_CmpSuccess) == 0x000218, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_SwitchName5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, Temp_int_Variable6) == 0x00021C, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern, K2Node_Select3_Default) == 0x000220, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_Settei_001_modern::K2Node_Select3_Default' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C.UpdateMenuList
// 0x00BC (0x00BC - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList final
{
public:
	struct FVector2D                              SubValue;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue;             // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0010(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue2;            // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue2;   // 0x0020(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue3;            // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue3;   // 0x0030(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue4;            // 0x0038(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue4;   // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue5;            // 0x0048(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue5;   // 0x0050(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue6;            // 0x0058(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue6;   // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue7;            // 0x0068(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue7;   // 0x0070(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue;                 // 0x0078(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue8;   // 0x0080(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue8;            // 0x0088(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue9;   // 0x0090(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue9;            // 0x0098(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue10;  // 0x00A0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelSize_ReturnValue2;                // 0x00A8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue11;  // 0x00B0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameFlagBool_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList");
static_assert(sizeof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList) == 0x0000BC, "Wrong size on WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, SubValue) == 0x000000, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::SubValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue2) == 0x000018, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue2) == 0x000020, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue3) == 0x000028, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue3) == 0x000030, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue4) == 0x000038, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue4) == 0x000040, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue5) == 0x000048, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue5) == 0x000050, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue6) == 0x000058, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue6) == 0x000060, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue7) == 0x000068, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue7) == 0x000070, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelSize_ReturnValue) == 0x000078, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue8) == 0x000080, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue8) == 0x000088, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue9) == 0x000090, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelPosition_ReturnValue9) == 0x000098, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelPosition_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue10) == 0x0000A0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetPanelSize_ReturnValue2) == 0x0000A8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetPanelSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_Subtract_Vector2DVector2D_ReturnValue11) == 0x0000B0, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_Subtract_Vector2DVector2D_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList, CallFunc_GetGameFlagBool_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Sakusen_Settei_001_modern_C_UpdateMenuList::CallFunc_GetGameFlagBool_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_Settei_001_modern.WBP_Menu_Sakusen_Settei_001_modern_C.GetSoundSaveData
// 0x0220 (0x0220 - 0x0000)
struct WBP_Menu_Sakusen_Settei_001_modern_C_GetSoundSaveData final
{
public:
	bool                                          bGetDefaultSetting;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FJackUMGDefaultSoundSetting            DefaultSoundSetting;                               // 0x0001(0x0008)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable9;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackAudioVolume                              Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable11;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable13;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable14;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable15;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable16;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
