#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Main_Command_000_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Main_Command_000_modern.WBP_Menu_Main_Command_000_modern_C
// 0x01A8 (0x05A8 - 0x0400)
class UWBP_Menu_Main_Command_000_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemList;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_0;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_2;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_7;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_11;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_36;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1971;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOpendMiniMap;                                    // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasOpenHusStatus;                                  // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackMessageArgumentData               MsgMenuCharName;                                   // 0x0460(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UJackUMGItemData*>               SeiriRemoveItemList;                               // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         SeiriSortCount;                                    // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SeiriCount;                                        // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   DouguSeiriResultEvent;                             // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EJackUMGDouguSeiriResult                      SeiriResult;                                       // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                SoubiCharType;                                     // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EquipmentAcionDelegate;                            // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EJackEquipmentRegion                          EquipmentRegion;                                   // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGUIActionInfo*                   EquippedAccessory1Ref;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGUIActionInfo*                   EquippedAccessory2Ref;                             // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActionEquipment;                                 // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJackUMGEquipmentResultData            ResultData;                                        // 0x0508(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TSoftClassPtr<class UClass>                   Menu_Sakusen_List_000_Asset;                       // 0x0520(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsDouguInBag;                                      // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSoubiInBag;                                      // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsNakamaCommand;                                   // 0x053A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53B[0x5];                                      // 0x053B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Menu_Dougu_List_000_Asset;                         // 0x0540(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Soubi_Window_000_Asset;                       // 0x0558(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Tuyosa_List_002_Asset;                        // 0x0570(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Jumon_List_000_Asset;                         // 0x0588(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsOKPartyTalk;                                     // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnableJumon;                                     // 0x05A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void DouguSeiriResultEvent__DelegateSignature(EJackUMGDouguSeiriResult NewParam, int32 InResult);
	void EquipmentAcionDelegate__DelegateSignature();
	void ExecuteUbergraph_WBP_Menu_Main_Command_000_modern(int32 EntryPoint);
	void OnMantanCommandEnd();
	void OnKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void DoDouguSeiriFlowEvent(bool NewParam);
	void WidgetNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void WidgetBPActionDelegate(class FName EventTag);
	void Construct();
	void EnableMainCommand();
	void EnableNakamaCommand();
	void OpenGoldWindow(bool InOpen);
	void OpenHudStatua(bool IsOpen);
	void ShowSmallLocationTitle(bool IsOpenMainCommand);
	void GetDouguSeiriResult(EJackUMGDouguSeiriResult* SeiriResult_0, int32* NewParam);
	void GetEquipmentActionResult(bool* NewParam);
	void GetEquipmentResultData(struct FJackUMGEquipmentResultData* ResultData_0);
	void NewFunction_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Main_Command_000_modern_C">();
	}
	static class UWBP_Menu_Main_Command_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Main_Command_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Main_Command_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Main_Command_000_modern_C");
static_assert(sizeof(UWBP_Menu_Main_Command_000_modern_C) == 0x0005A8, "Wrong size on UWBP_Menu_Main_Command_000_modern_C");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Main_Command_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Main_Command_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, ItemList) == 0x000410, "Member 'UWBP_Menu_Main_Command_000_modern_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, RootPanel) == 0x000418, "Member 'UWBP_Menu_Main_Command_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_0) == 0x000420, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_1) == 0x000428, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_2) == 0x000430, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_7) == 0x000438, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_7' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_11) == 0x000440, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_36) == 0x000448, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_36' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, WBP_Menu_Parts_000_C_1971) == 0x000450, "Member 'UWBP_Menu_Main_Command_000_modern_C::WBP_Menu_Parts_000_C_1971' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsOpendMiniMap) == 0x000458, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsOpendMiniMap' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, HasOpenHusStatus) == 0x000459, "Member 'UWBP_Menu_Main_Command_000_modern_C::HasOpenHusStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, MsgMenuCharName) == 0x000460, "Member 'UWBP_Menu_Main_Command_000_modern_C::MsgMenuCharName' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, SeiriRemoveItemList) == 0x0004A8, "Member 'UWBP_Menu_Main_Command_000_modern_C::SeiriRemoveItemList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, SeiriSortCount) == 0x0004B8, "Member 'UWBP_Menu_Main_Command_000_modern_C::SeiriSortCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, SeiriCount) == 0x0004BC, "Member 'UWBP_Menu_Main_Command_000_modern_C::SeiriCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, DouguSeiriResultEvent) == 0x0004C0, "Member 'UWBP_Menu_Main_Command_000_modern_C::DouguSeiriResultEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, SeiriResult) == 0x0004D0, "Member 'UWBP_Menu_Main_Command_000_modern_C::SeiriResult' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, SoubiCharType) == 0x0004D1, "Member 'UWBP_Menu_Main_Command_000_modern_C::SoubiCharType' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, EquipmentAcionDelegate) == 0x0004D8, "Member 'UWBP_Menu_Main_Command_000_modern_C::EquipmentAcionDelegate' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, EquipmentRegion) == 0x0004E8, "Member 'UWBP_Menu_Main_Command_000_modern_C::EquipmentRegion' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, EquippedAccessory1Ref) == 0x0004F0, "Member 'UWBP_Menu_Main_Command_000_modern_C::EquippedAccessory1Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, EquippedAccessory2Ref) == 0x0004F8, "Member 'UWBP_Menu_Main_Command_000_modern_C::EquippedAccessory2Ref' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsActionEquipment) == 0x000500, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsActionEquipment' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, ResultData) == 0x000508, "Member 'UWBP_Menu_Main_Command_000_modern_C::ResultData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, Menu_Sakusen_List_000_Asset) == 0x000520, "Member 'UWBP_Menu_Main_Command_000_modern_C::Menu_Sakusen_List_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsDouguInBag) == 0x000538, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsDouguInBag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsSoubiInBag) == 0x000539, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsSoubiInBag' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsNakamaCommand) == 0x00053A, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsNakamaCommand' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, Menu_Dougu_List_000_Asset) == 0x000540, "Member 'UWBP_Menu_Main_Command_000_modern_C::Menu_Dougu_List_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, Menu_Soubi_Window_000_Asset) == 0x000558, "Member 'UWBP_Menu_Main_Command_000_modern_C::Menu_Soubi_Window_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, Menu_Tuyosa_List_002_Asset) == 0x000570, "Member 'UWBP_Menu_Main_Command_000_modern_C::Menu_Tuyosa_List_002_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, Menu_Jumon_List_000_Asset) == 0x000588, "Member 'UWBP_Menu_Main_Command_000_modern_C::Menu_Jumon_List_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsOKPartyTalk) == 0x0005A0, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsOKPartyTalk' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Main_Command_000_modern_C, IsEnableJumon) == 0x0005A1, "Member 'UWBP_Menu_Main_Command_000_modern_C::IsEnableJumon' has a wrong offset!");

}

