#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Sibari_Setting_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Namae_Sibari_Setting_000_modern.WBP_Menu_Namae_Sibari_Setting_000_modern_C
// 0x00B0 (0x04B0 - 0x0400)
class UWBP_Menu_Namae_Sibari_Setting_000_modern_C final : public UJackUMGSibariPlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           AutoSaveFrame;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           AutoSavePanel;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemPanel;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_468;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_2421;                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_Armour;                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_Battle;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_Enemy;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_Ex0;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_modern;                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_modern_0;                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_Shop;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_062_modern_C*           WBP_Menu_Parts_062_Shy;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_080_modern_C*      WBP_Menu_Parts_Text_080;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Frame;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line2;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_005_modern_C*  SnapWidget;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackSibari                                   Sibari;                                            // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSibari;                                          // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Namae_Sibari_Setting_000_modern(int32 EntryPoint);
	void WidgetBPActionDelegate(class FName EventTag);
	void ExecuteSaveDataCheck(TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender, EJackUMGSaveDataCheckPoint CheckPoint);
	void CustomEvent_4(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void ExecuteSaveDataCheckResult(TScriptInterface<class IBP_IF_SaveDataCheck_C> Sender, EJackUMGSaveDataCheckPoint CheckPoint, EJackSaveLoadResult CheckRusult);
	void OnDisplayMessageFromSaveDataCheck(EJackUMGSaveDataCheckPoint CheckPoint);
	void Construct();
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void OnFinishSaveDataCheck(EJackUMGSaveDataCheckPoint CheckPoint, EJackUMGSaveDataCheckResult Result);
	void FinishSaveAsync(int32 SlotIndex, EJackSaveLoadResult SaveLoadResult);
	void CustomEvent_0(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void CustomEvent_1(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void CustomEvent_2(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex);
	void SetSnapText(class UWBP_Menu_Common_Setumei_005_modern_C* InWidget);
	void SibariBoukenNoSyo(class FName InTextId, bool* IsKettei);
	void SibariField(class FName InTextId, bool* SibariOn);
	void ResetSibariActive();
	void IsNotTitle(bool* NotTitle);
	void AddSnapWindow();
	void IsBoukenSibariKakunin(bool* Kakunin);
	void ResetSibariKey();
	void ResetSibariTassei();
	void OffCheckMark();
	void ResetSibariFlag();
	void IsSibariChecked(bool* Checked);
	void ClearSibariFlag();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Namae_Sibari_Setting_000_modern_C">();
	}
	static class UWBP_Menu_Namae_Sibari_Setting_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Namae_Sibari_Setting_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Namae_Sibari_Setting_000_modern_C");
static_assert(sizeof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C) == 0x0004B0, "Wrong size on UWBP_Menu_Namae_Sibari_Setting_000_modern_C");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, AutoSaveFrame) == 0x000408, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::AutoSaveFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, AutoSavePanel) == 0x000410, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::AutoSavePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, InvalidationBox_0) == 0x000418, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, ItemPanel) == 0x000420, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::ItemPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, RootPanel) == 0x000428, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_000_C_468) == 0x000430, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_000_C_468' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_000_C_2421) == 0x000438, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_000_C_2421' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_Armour) == 0x000440, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_Armour' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_Battle) == 0x000448, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_Battle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_Enemy) == 0x000450, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_Enemy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_Ex0) == 0x000458, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_Ex0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_modern) == 0x000460, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_modern' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_modern_0) == 0x000468, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_modern_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_Shop) == 0x000470, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_Shop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_062_Shy) == 0x000478, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_062_Shy' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, WBP_Menu_Parts_Text_080) == 0x000480, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::WBP_Menu_Parts_Text_080' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, Window_Frame) == 0x000488, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::Window_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, Window_Line) == 0x000490, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::Window_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, Window_Line2) == 0x000498, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::Window_Line2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, SnapWidget) == 0x0004A0, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::SnapWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, Sibari) == 0x0004A8, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::Sibari' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_Sibari_Setting_000_modern_C, IsSibari) == 0x0004A9, "Member 'UWBP_Menu_Namae_Sibari_Setting_000_modern_C::IsSibari' has a wrong offset!");

}

