#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_070_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_070_modern.WBP_Menu_Parts_070_modern_C.ExecuteUbergraph_WBP_Menu_Parts_070_modern
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackGameCharacter*                     K2Node_CustomEvent_GameCharacter;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackCharacter                                CallFunc_GetCharacterType_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          K2Node_CustomEvent_bIsOnCursor;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern");
static_assert(sizeof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern) == 0x000050, "Wrong size on WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, K2Node_Event_bSelected) == 0x000004, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, Temp_bool_Variable) == 0x000005, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, Temp_byte_Variable) == 0x000006, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, Temp_byte_Variable2) == 0x000007, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, K2Node_Select_Default) == 0x000008, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, K2Node_CustomEvent_GameCharacter) == 0x000010, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::K2Node_CustomEvent_GameCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, CallFunc_GetCharacterType_ReturnValue) == 0x000018, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::CallFunc_GetCharacterType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern, K2Node_CustomEvent_bIsOnCursor) == 0x000048, "Member 'WBP_Menu_Parts_070_modern_C_ExecuteUbergraph_WBP_Menu_Parts_070_modern::K2Node_CustomEvent_bIsOnCursor' has a wrong offset!");

// Function WBP_Menu_Parts_070_modern.WBP_Menu_Parts_070_modern_C.SetSelectedFlag
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_070_modern_C_SetSelectedFlag final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_070_modern_C_SetSelectedFlag) == 0x000001, "Wrong alignment on WBP_Menu_Parts_070_modern_C_SetSelectedFlag");
static_assert(sizeof(WBP_Menu_Parts_070_modern_C_SetSelectedFlag) == 0x000001, "Wrong size on WBP_Menu_Parts_070_modern_C_SetSelectedFlag");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_SetSelectedFlag, bSelected) == 0x000000, "Member 'WBP_Menu_Parts_070_modern_C_SetSelectedFlag::bSelected' has a wrong offset!");

// Function WBP_Menu_Parts_070_modern.WBP_Menu_Parts_070_modern_C.SetOnCursorFlag
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_070_modern_C_SetOnCursorFlag final
{
public:
	bool                                          bIsOnCursor;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Parts_070_modern_C_SetOnCursorFlag) == 0x000001, "Wrong alignment on WBP_Menu_Parts_070_modern_C_SetOnCursorFlag");
static_assert(sizeof(WBP_Menu_Parts_070_modern_C_SetOnCursorFlag) == 0x000001, "Wrong size on WBP_Menu_Parts_070_modern_C_SetOnCursorFlag");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_SetOnCursorFlag, bIsOnCursor) == 0x000000, "Member 'WBP_Menu_Parts_070_modern_C_SetOnCursorFlag::bIsOnCursor' has a wrong offset!");

// Function WBP_Menu_Parts_070_modern.WBP_Menu_Parts_070_modern_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Parts_070_modern_C_SetData final
{
public:
	class UJackGameCharacter*                     GameCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_070_modern_C_SetData) == 0x000008, "Wrong alignment on WBP_Menu_Parts_070_modern_C_SetData");
static_assert(sizeof(WBP_Menu_Parts_070_modern_C_SetData) == 0x000008, "Wrong size on WBP_Menu_Parts_070_modern_C_SetData");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_SetData, GameCharacter) == 0x000000, "Member 'WBP_Menu_Parts_070_modern_C_SetData::GameCharacter' has a wrong offset!");

// Function WBP_Menu_Parts_070_modern.WBP_Menu_Parts_070_modern_C.SetButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_070_modern_C_SetButton final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_070_modern_C_SetButton) == 0x000001, "Wrong alignment on WBP_Menu_Parts_070_modern_C_SetButton");
static_assert(sizeof(WBP_Menu_Parts_070_modern_C_SetButton) == 0x000001, "Wrong size on WBP_Menu_Parts_070_modern_C_SetButton");
static_assert(offsetof(WBP_Menu_Parts_070_modern_C_SetButton, InKeyType) == 0x000000, "Member 'WBP_Menu_Parts_070_modern_C_SetButton::InKeyType' has a wrong offset!");

}

