#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_Input_002_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "STRUCT_TitleBGMFadeTime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EJackKeys InKeyType, bool bIsPressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FSTRUCT_TitleBGMFadeTime>       Temp_struct_Variable3;                             // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNGWord_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputNameEmpty_ReturnValue;             // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable4;                             // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable5;                             // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayableNameFlag_ReturnValue;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable6;                             // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	EJackKeys                                     K2Node_CustomEvent_InKeyType;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPressed;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue2;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackSibariManager*                     CallFunc_GetSibariManager_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackLocalizationManager*               CallFunc_GetLocalizationManager_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackLanguage                                 CallFunc_GetLanguageType_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ReplaceToAlternativeCharacter_ReturnValue; // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0174(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FJackMessageArgumentData               K2Node_MakeStruct_JackMessageArgumentData;         // 0x01C8(0x0048)()
	ESlateVisibility                              CallFunc_GetCaptionVisibility_Visibility;          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJackMessageArgumentData>       K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPanelPosition_ReturnValue;             // 0x0230(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0238(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x024C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue3;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue4;         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TitleBGMFadeTime               CallFunc_Array_Get_Item;                           // 0x0270(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_StopBGM_ReturnValue;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate5;             // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_OpenMenu_ReturnValue;                     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue5;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorSaveData*               CallFunc_GetAccessorSaveData_ReturnValue6;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisplayableNameFlag_ReturnValue2;       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDisplayableNameFlag_ReturnValue3;       // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern) == 0x0002C8, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_struct_Variable2) == 0x000018, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000028, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000038, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x000040, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_bool_Variable) == 0x000048, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_struct_Variable3) == 0x000060, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_EventTag) == 0x000070, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_SwitchName_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_CheckNGWord_ReturnValue) == 0x000079, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_CheckNGWord_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_Sender) == 0x000080, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_CurrentTextID) == 0x000088, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x000090, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_EventName) == 0x000098, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_InItemBase) == 0x0000A0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0000A8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_SwitchName2_CmpSuccess) == 0x0000A9, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_IsInputNameEmpty_ReturnValue) == 0x0000AA, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_IsInputNameEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_struct_Variable4) == 0x0000B0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetUMGManager_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_struct_Variable5) == 0x0000C8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetAccessorSaveData_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetAccessorSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_IsDisplayableNameFlag_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_IsDisplayableNameFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, Temp_struct_Variable6) == 0x0000E8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0000F8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000108, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000110, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_InKeyType) == 0x000120, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CustomEvent_bIsPressed) == 0x000121, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CustomEvent_bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_SwitchEnum_CmpSuccess) == 0x000122, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000128, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x000130, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000138, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetAccessorSaveData_ReturnValue2) == 0x000140, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetAccessorSaveData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetSibariManager_ReturnValue) == 0x000148, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetSibariManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetLocalizationManager_ReturnValue) == 0x000150, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetLocalizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetLanguageType_ReturnValue) == 0x000158, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetLanguageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_ReplaceToAlternativeCharacter_ReturnValue) == 0x000160, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_ReplaceToAlternativeCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000170, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_Event_MyGeometry) == 0x000174, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_Event_InDeltaTime) == 0x0001B0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_Select_Default) == 0x0001B8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_MakeStruct_JackMessageArgumentData) == 0x0001C8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_MakeStruct_JackMessageArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetCaptionVisibility_Visibility) == 0x000210, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetCaptionVisibility_Visibility' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_MakeArray_Array) == 0x000218, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x000228, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetPanelPosition_ReturnValue) == 0x000230, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetPanelPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000238, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_BreakVector2D_X) == 0x000240, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_BreakVector2D_Y) == 0x000244, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x000248, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_MakeVector2D_ReturnValue) == 0x00024C, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetAccessorSaveData_ReturnValue3) == 0x000258, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetAccessorSaveData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetAccessorSaveData_ReturnValue4) == 0x000260, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetAccessorSaveData_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000268, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_Array_Get_Item) == 0x000270, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CreateDelegate_OutputDelegate4) == 0x000278, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_StopBGM_ReturnValue) == 0x000288, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_StopBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, K2Node_CreateDelegate_OutputDelegate5) == 0x000290, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x0002A0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_OpenMenu_ReturnValue) == 0x0002A8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetAccessorSaveData_ReturnValue5) == 0x0002B0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetAccessorSaveData_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_GetAccessorSaveData_ReturnValue6) == 0x0002B8, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_GetAccessorSaveData_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_IsDisplayableNameFlag_ReturnValue2) == 0x0002C0, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_IsDisplayableNameFlag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern, CallFunc_IsDisplayableNameFlag_ReturnValue3) == 0x0002C1, "Member 'WBP_Menu_Namae_Input_002_modern_C_ExecuteUbergraph_WBP_Menu_Namae_Input_002_modern::CallFunc_IsDisplayableNameFlag_ReturnValue3' has a wrong offset!");

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Namae_Input_002_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Namae_Input_002_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.WidgetKeyEvent
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent) == 0x000001, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent) == 0x000002, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent, InKeyType) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent, bIsPressed) == 0x000001, "Member 'WBP_Menu_Namae_Input_002_modern_C_WidgetKeyEvent::bIsPressed' has a wrong offset!");

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0 final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0, Sender) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Namae_Input_002_modern_C_CustomEvent_0::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.GotoModeSelect
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect final
{
public:
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect) == 0x000018, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000010, "Member 'WBP_Menu_Namae_Input_002_modern_C_GotoModeSelect::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Namae_Input_002_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Namae_Input_002_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Namae_Input_002_modern.WBP_Menu_Namae_Input_002_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Namae_Input_002_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

}

