#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Battle_List_016_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Battle_List_016_modern.WBP_Menu_Battle_List_016_modern_C
// 0x0200 (0x0668 - 0x0468)
class UWBP_Menu_Battle_List_016_modern_C final : public UJackUMGJoutaiMiru
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel1;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel2;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8034;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8035;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8036;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8037;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Member_3;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MemberList_3;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_3_1;                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_3_2;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_3_3;                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_044_C*                  WBP_Menu_Parts_044_C_191;                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_59;                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_60;                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_61;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_62;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_63;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_64;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_65;                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_66;                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_67;                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_68;                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_69;                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_70;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_71;                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_72;                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_74;                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_75;                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_76;                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_77;                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_78;                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_79;                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_80;                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_81;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_82;                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_83;                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_84;                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_85;                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_86;                           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_87;                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_89;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_90;                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_91;                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_92;                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_93;                           // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_94;                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_95;                           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_96;                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_97;                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_98;                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_99;                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_100;                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_101;                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_063_modern_C*           WBP_Menu_Parts_063_C_102;                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumData;                                           // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPageItem;                                       // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BarPanel;                                          // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceIcon_0;                                        // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceIcon_1;                                        // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FaceIcon_2;                                        // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextPanels;                                        // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Battle_List_016_modern(int32 EntryPoint);
	void CustomEvent_1(int32 InListOffset);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void CustomEvent_0(class FName EventTag);
	void Construct();
	void ResetWindow();
	void SetFaceAndName(int32 InIndex, class UWBP_Menu_Parts_000_modern_C* Parts000, class UTexture2D** FaceTexture, EJackCharacter* CharacterType, bool* Valid);
	void SetOddEffectIcon(TArray<class UJackUMGItemBase*>& ItemBase);
	void SetDiscription(class FName InName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Battle_List_016_modern_C">();
	}
	static class UWBP_Menu_Battle_List_016_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Battle_List_016_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Battle_List_016_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Battle_List_016_modern_C");
static_assert(sizeof(UWBP_Menu_Battle_List_016_modern_C) == 0x000668, "Wrong size on UWBP_Menu_Battle_List_016_modern_C");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, UberGraphFrame) == 0x000468, "Member 'UWBP_Menu_Battle_List_016_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, CaptionPanel1) == 0x000470, "Member 'UWBP_Menu_Battle_List_016_modern_C::CaptionPanel1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, CaptionPanel2) == 0x000478, "Member 'UWBP_Menu_Battle_List_016_modern_C::CaptionPanel2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, Image_8034) == 0x000480, "Member 'UWBP_Menu_Battle_List_016_modern_C::Image_8034' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, Image_8035) == 0x000488, "Member 'UWBP_Menu_Battle_List_016_modern_C::Image_8035' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, Image_8036) == 0x000490, "Member 'UWBP_Menu_Battle_List_016_modern_C::Image_8036' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, Image_8037) == 0x000498, "Member 'UWBP_Menu_Battle_List_016_modern_C::Image_8037' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, InvalidationBox_0) == 0x0004A0, "Member 'UWBP_Menu_Battle_List_016_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, Member_3) == 0x0004A8, "Member 'UWBP_Menu_Battle_List_016_modern_C::Member_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, MemberList_3) == 0x0004B0, "Member 'UWBP_Menu_Battle_List_016_modern_C::MemberList_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_000) == 0x0004B8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_000_3_1) == 0x0004C0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_000_3_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_000_3_2) == 0x0004C8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_000_3_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_000_3_3) == 0x0004D0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_000_3_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_044_C_191) == 0x0004D8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_044_C_191' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_59) == 0x0004E0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_59' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_60) == 0x0004E8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_60' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_61) == 0x0004F0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_61' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_62) == 0x0004F8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_62' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_63) == 0x000500, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_63' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_64) == 0x000508, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_64' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_65) == 0x000510, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_65' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_66) == 0x000518, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_66' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_67) == 0x000520, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_67' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_68) == 0x000528, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_68' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_69) == 0x000530, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_69' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_70) == 0x000538, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_70' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_71) == 0x000540, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_71' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_72) == 0x000548, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_72' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_74) == 0x000550, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_74' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_75) == 0x000558, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_75' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_76) == 0x000560, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_76' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_77) == 0x000568, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_77' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_78) == 0x000570, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_78' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_79) == 0x000578, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_79' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_80) == 0x000580, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_80' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_81) == 0x000588, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_81' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_82) == 0x000590, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_82' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_83) == 0x000598, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_83' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_84) == 0x0005A0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_84' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_85) == 0x0005A8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_85' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_86) == 0x0005B0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_86' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_87) == 0x0005B8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_87' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_89) == 0x0005C0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_89' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_90) == 0x0005C8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_90' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_91) == 0x0005D0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_91' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_92) == 0x0005D8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_92' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_93) == 0x0005E0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_93' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_94) == 0x0005E8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_94' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_95) == 0x0005F0, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_95' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_96) == 0x0005F8, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_96' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_97) == 0x000600, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_97' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_98) == 0x000608, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_98' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_99) == 0x000610, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_99' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_100) == 0x000618, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_100' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_101) == 0x000620, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_101' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, WBP_Menu_Parts_063_C_102) == 0x000628, "Member 'UWBP_Menu_Battle_List_016_modern_C::WBP_Menu_Parts_063_C_102' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, NumData) == 0x000630, "Member 'UWBP_Menu_Battle_List_016_modern_C::NumData' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, NumPageItem) == 0x000634, "Member 'UWBP_Menu_Battle_List_016_modern_C::NumPageItem' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, BarPanel) == 0x000638, "Member 'UWBP_Menu_Battle_List_016_modern_C::BarPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, FaceIcon_0) == 0x000640, "Member 'UWBP_Menu_Battle_List_016_modern_C::FaceIcon_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, FaceIcon_1) == 0x000648, "Member 'UWBP_Menu_Battle_List_016_modern_C::FaceIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, FaceIcon_2) == 0x000650, "Member 'UWBP_Menu_Battle_List_016_modern_C::FaceIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Battle_List_016_modern_C, TextPanels) == 0x000658, "Member 'UWBP_Menu_Battle_List_016_modern_C::TextPanels' has a wrong offset!");

}

