#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_List_004_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_WorldMap_List_004_modern.WBP_Menu_WorldMap_List_004_modern_C
// 0x0108 (0x0538 - 0x0430)
class UWBP_Menu_WorldMap_List_004_modern_C final : public UJackUMGBrowserBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemListPanel;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           List004_Panel;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           NoKiraText;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_001;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_002;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_003;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_004;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_005;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_006;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_007;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_008;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_009;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_010;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_011;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_075_modern_C*           WBP_ListItem_012;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_1175;                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_002_modern_C*           WBP_PageController;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window_Line;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Dougu_Syousai_100_modern_C*   ItemDetailWBP;                                     // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               UMGItemDataList;                                   // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackUMGItemListInfo>           ItemSyousaiList;                                   // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWBP_Menu_WorldMap_Setumei_003_modern_C* PopConditionWBP;                                   // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Button_000_modern_C*   ShowDetailWBP;                                     // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDetailWBP_UpOffsetted;                         // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedListItemIndex;                             // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHatenaListItem;                                 // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShowDetailWBPOffsetWork;                           // 0x0524(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ShowDetailWBPOffset;                               // 0x052C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_WorldMap_List_004_modern(int32 EntryPoint);
	void CustomEvent_3(int32 OutItemIndex);
	void CustomEvent_1(EJackKeys InKeyType, bool bIsPressed);
	void CustomEvent_0(class FName EventTag);
	void Construct();
	void Open();
	void ForEachExecAllKiraSymbol(float Opacity, bool bDrawsPopCondition);
	void FindKiraAccessor(TArray<class UJackMapKiraAccessorBase*>& KiraAccessorList, int32 UniqueNo, bool* Found, class UJackMapKiraAccessorBase** KiraAccessor);
	void ListEventHandler(class FName EventName, class UJackUMGItemBase* ItemBase);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_WorldMap_List_004_modern_C">();
	}
	static class UWBP_Menu_WorldMap_List_004_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_WorldMap_List_004_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_WorldMap_List_004_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_WorldMap_List_004_modern_C");
static_assert(sizeof(UWBP_Menu_WorldMap_List_004_modern_C) == 0x000538, "Wrong size on UWBP_Menu_WorldMap_List_004_modern_C");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, InvalidationBox_0) == 0x000438, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ItemListPanel) == 0x000440, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ItemListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, List004_Panel) == 0x000448, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::List004_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, NoKiraText) == 0x000450, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::NoKiraText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, RootPanel) == 0x000458, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_001) == 0x000460, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_001' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_002) == 0x000468, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_002' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_003) == 0x000470, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_003' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_004) == 0x000478, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_004' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_005) == 0x000480, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_005' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_006) == 0x000488, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_007) == 0x000490, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_008) == 0x000498, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_008' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_009) == 0x0004A0, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_009' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_010) == 0x0004A8, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_010' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_011) == 0x0004B0, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_011' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_ListItem_012) == 0x0004B8, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_ListItem_012' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_Menu_Parts_000_C_1175) == 0x0004C0, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_Menu_Parts_000_C_1175' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WBP_PageController) == 0x0004C8, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WBP_PageController' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, Window_Line) == 0x0004D0, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::Window_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, WindowFrame) == 0x0004D8, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ItemDetailWBP) == 0x0004E0, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ItemDetailWBP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, UMGItemDataList) == 0x0004E8, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::UMGItemDataList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ItemSyousaiList) == 0x0004F8, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ItemSyousaiList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, PopConditionWBP) == 0x000508, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::PopConditionWBP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ShowDetailWBP) == 0x000510, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ShowDetailWBP' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ShowDetailWBP_UpOffsetted) == 0x000518, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ShowDetailWBP_UpOffsetted' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, SelectedListItemIndex) == 0x00051C, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::SelectedListItemIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, bIsHatenaListItem) == 0x000520, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::bIsHatenaListItem' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ShowDetailWBPOffsetWork) == 0x000524, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ShowDetailWBPOffsetWork' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_WorldMap_List_004_modern_C, ShowDetailWBPOffset) == 0x00052C, "Member 'UWBP_Menu_WorldMap_List_004_modern_C::ShowDetailWBPOffset' has a wrong offset!");

}

