#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Button_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.ExecuteUbergraph_WBP_Menu_Common_Button_000_modern
// 0x00CC (0x00CC - 0x0000)
struct WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue2;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable4;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue3;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue4;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue4;                // 0x0064(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue4;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue2;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x007C(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern) == 0x000004, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern) == 0x0000CC, "Wrong size on WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, Temp_float_Variable) == 0x000004, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, Temp_float_Variable2) == 0x000008, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Ease_ReturnValue) == 0x000010, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Ease_ReturnValue2) == 0x000024, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Ease_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_MakeVector2D_ReturnValue2) == 0x000028, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000030, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Less_FloatFloat_ReturnValue) == 0x000034, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_FClamp_ReturnValue2) == 0x000038, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Percent_FloatFloat_ReturnValue) == 0x00003C, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, Temp_float_Variable3) == 0x000040, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, Temp_float_Variable4) == 0x000044, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Ease_ReturnValue3) == 0x00004C, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Ease_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_MakeVector2D_ReturnValue3) == 0x000054, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_FClamp_ReturnValue3) == 0x00005C, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_FClamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Ease_ReturnValue4) == 0x000060, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Ease_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_MakeVector2D_ReturnValue4) == 0x000064, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_MakeVector2D_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x00006C, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000070, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_FClamp_ReturnValue4) == 0x000074, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_FClamp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Percent_FloatFloat_ReturnValue2) == 0x000078, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Percent_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, K2Node_Event_MyGeometry) == 0x00007C, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, K2Node_Event_InDeltaTime) == 0x0000B8, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000BC, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x0000C4, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0000C8, "Member 'WBP_Menu_Common_Button_000_modern_C_ExecuteUbergraph_WBP_Menu_Common_Button_000_modern::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Common_Button_000_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Common_Button_000_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Common_Button_000_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetButtonAndCaption1
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1 final
{
public:
	EJackKeys                                     InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTransparentBG;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1) == 0x000008, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1) == 0x000020, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1, InKeyType) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1::InKeyType' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1, InTxetId) == 0x000008, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1::InTxetId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1, IsTransparentBG) == 0x000010, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1::IsTransparentBG' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1, CallFunc_Array_Get_Item) == 0x000014, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption1::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetButtonAndCaption2
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2 final
{
public:
	EJackKeys                                     InKeyType1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId1;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     InKeyType2;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId2;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTransparentBG;                                   // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item2;                          // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2) == 0x000008, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2) == 0x000038, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, InKeyType1) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::InKeyType1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, InTxetId1) == 0x000008, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::InTxetId1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, InKeyType2) == 0x000010, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::InKeyType2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, InTxetId2) == 0x000018, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::InTxetId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, IsTransparentBG) == 0x000020, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::IsTransparentBG' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, CallFunc_NotEqual_NameName_ReturnValue) == 0x000021, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000022, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2, CallFunc_Array_Get_Item2) == 0x00002C, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption2::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetButtonAndCaption3
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3 final
{
public:
	EJackKeys                                     InKeyType1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId1;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     InKeyType2;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId2;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTransparentBG;                                   // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item2;                          // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3) == 0x000008, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3) == 0x000038, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, InKeyType1) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::InKeyType1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, InTxetId1) == 0x000008, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::InTxetId1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, InKeyType2) == 0x000010, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::InKeyType2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, InTxetId2) == 0x000018, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::InTxetId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, IsTransparentBG) == 0x000020, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::IsTransparentBG' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, CallFunc_Array_Get_Item) == 0x000024, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3, CallFunc_Array_Get_Item2) == 0x00002C, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption3::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetButtonAndCaption5
// 0x0060 (0x0060 - 0x0000)
struct WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5 final
{
public:
	EJackKeys                                     InKeyType1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId1;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackKeys                                     InKeyType2;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InTxetId2;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InTxetId3;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTransparentBG;                                   // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item2;                          // 0x0034(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0048(0x0018)()
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5) == 0x000008, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5) == 0x000060, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, InKeyType1) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::InKeyType1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, InTxetId1) == 0x000008, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::InTxetId1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, InKeyType2) == 0x000010, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::InKeyType2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, InTxetId2) == 0x000018, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::InTxetId2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, InTxetId3) == 0x000020, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::InTxetId3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, IsTransparentBG) == 0x000028, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::IsTransparentBG' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, CallFunc_Array_Get_Item2) == 0x000034, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, CallFunc_GetUMGManager_ReturnValue) == 0x000040, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000048, "Member 'WBP_Menu_Common_Button_000_modern_C_SetButtonAndCaption5::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetTextFontColorCaption1
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1 final
{
public:
	EJackUMGTextColorSet                          InColorType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1) == 0x000001, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1) == 0x000001, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1, InColorType) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetTextFontColorCaption1::InColorType' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetVisibleCaption3
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3 final
{
public:
	bool                                          bIsVisibleLeft;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsVisibleRight;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3) == 0x000001, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3) == 0x000002, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3, bIsVisibleLeft) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3::bIsVisibleLeft' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3, bIsVisibleRight) == 0x000001, "Member 'WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption3::bIsVisibleRight' has a wrong offset!");

// Function WBP_Menu_Common_Button_000_modern.WBP_Menu_Common_Button_000_modern_C.SetVisibleCaption5
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5 final
{
public:
	ESlateVisibility                              Visibillity;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5) == 0x000001, "Wrong alignment on WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5");
static_assert(sizeof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5) == 0x000001, "Wrong size on WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5");
static_assert(offsetof(WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5, Visibillity) == 0x000000, "Member 'WBP_Menu_Common_Button_000_modern_C_SetVisibleCaption5::Visibillity' has a wrong offset!");

}

