#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Jumon_Setumei_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Jumon_Setumei_001_modern.WBP_Menu_Jumon_Setumei_001_modern_C
// 0x0080 (0x03F0 - 0x0370)
class UWBP_Menu_Jumon_Setumei_001_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           DescriptionPanel;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Bank;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Bougu;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Buki;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Casino;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Church;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Dougu;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Inn;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Kazi;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Umarace;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           IconListPanel;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_006_modern_C*           WBP_Menu_Parts_006;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_007_modern_C*           WBP_Menu_Parts_007;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         IconArray;                                         // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_Jumon_Setumei_001_modern(int32 EntryPoint);
	void Construct();
	void SetupWorldMapRuraMode();
	void SetShopIconVisibility(bool Visibility_0, class UWidget* Target);
	void SetSetumei(class UJackUMGAccessorSaveDataInRura* RuraData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Jumon_Setumei_001_modern_C">();
	}
	static class UWBP_Menu_Jumon_Setumei_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Jumon_Setumei_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Jumon_Setumei_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Jumon_Setumei_001_modern_C");
static_assert(sizeof(UWBP_Menu_Jumon_Setumei_001_modern_C) == 0x0003F0, "Wrong size on UWBP_Menu_Jumon_Setumei_001_modern_C");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, DescriptionPanel) == 0x000378, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::DescriptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Bank) == 0x000380, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Bank' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Bougu) == 0x000388, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Bougu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Buki) == 0x000390, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Buki' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Casino) == 0x000398, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Casino' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Church) == 0x0003A0, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Church' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Dougu) == 0x0003A8, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Dougu' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Inn) == 0x0003B0, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Inn' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Kazi) == 0x0003B8, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Kazi' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, Icon_Umarace) == 0x0003C0, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::Icon_Umarace' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, IconListPanel) == 0x0003C8, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::IconListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, WBP_Menu_Parts_006) == 0x0003D0, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::WBP_Menu_Parts_006' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, WBP_Menu_Parts_007) == 0x0003D8, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::WBP_Menu_Parts_007' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Jumon_Setumei_001_modern_C, IconArray) == 0x0003E0, "Member 'UWBP_Menu_Jumon_Setumei_001_modern_C::IconArray' has a wrong offset!");

}

