#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_WorldMap_Cursor_000

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_WorldMap_Cursor_000.WBP_Menu_WorldMap_Cursor_000_C.ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000) == 0x000008, "Wrong alignment on WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000");
static_assert(sizeof(WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000) == 0x000018, "Wrong size on WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000");
static_assert(offsetof(WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000, EntryPoint) == 0x000000, "Member 'WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_WorldMap_Cursor_000_C_ExecuteUbergraph_WBP_Menu_WorldMap_Cursor_000::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Menu_WorldMap_Cursor_000.WBP_Menu_WorldMap_Cursor_000_C.Show
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_WorldMap_Cursor_000_C_Show final
{
public:
	int32                                         TargetNo_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_WorldMap_Cursor_000_C_Show) == 0x000004, "Wrong alignment on WBP_Menu_WorldMap_Cursor_000_C_Show");
static_assert(sizeof(WBP_Menu_WorldMap_Cursor_000_C_Show) == 0x000004, "Wrong size on WBP_Menu_WorldMap_Cursor_000_C_Show");
static_assert(offsetof(WBP_Menu_WorldMap_Cursor_000_C_Show, TargetNo_0) == 0x000000, "Member 'WBP_Menu_WorldMap_Cursor_000_C_Show::TargetNo_0' has a wrong offset!");

// Function WBP_Menu_WorldMap_Cursor_000.WBP_Menu_WorldMap_Cursor_000_C.IsEmpty
// 0x0002 (0x0002 - 0x0000)
struct WBP_Menu_WorldMap_Cursor_000_C_IsEmpty final
{
public:
	bool                                          bEmpty;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_WorldMap_Cursor_000_C_IsEmpty) == 0x000001, "Wrong alignment on WBP_Menu_WorldMap_Cursor_000_C_IsEmpty");
static_assert(sizeof(WBP_Menu_WorldMap_Cursor_000_C_IsEmpty) == 0x000002, "Wrong size on WBP_Menu_WorldMap_Cursor_000_C_IsEmpty");
static_assert(offsetof(WBP_Menu_WorldMap_Cursor_000_C_IsEmpty, bEmpty) == 0x000000, "Member 'WBP_Menu_WorldMap_Cursor_000_C_IsEmpty::bEmpty' has a wrong offset!");
static_assert(offsetof(WBP_Menu_WorldMap_Cursor_000_C_IsEmpty, CallFunc_Less_IntInt_ReturnValue) == 0x000001, "Member 'WBP_Menu_WorldMap_Cursor_000_C_IsEmpty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

