#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_082_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_082_modern.WBP_Menu_Parts_082_modern_C
// 0x0080 (0x0450 - 0x03D0)
class UWBP_Menu_Parts_082_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FaceIconPanel;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OrderNumPanel;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Buff_000_C*             WBP_Menu_Parts_Buff_000;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NumberText;                                        // 0x0410(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsNumberVisivility;                                // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       ItemDataBase;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     NumberTexList;                                     // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UTexture2D*                             FaceTextureRef;                                    // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_082_modern(int32 EntryPoint);
	void SetFaceIcon(EJackCharacter InCharType);
	void NotificationItemBase(const class FName& NotifyTag, class UJackUMGItemData* InItemData, class UObject* Object, int32 Value);
	void DrawItemBase(class UJackUMGItemData* InItemData);
	void Construct();
	void SetNumber(int32 InNumber);
	void SetNumberAndCaption(const class FText& CaptionText_0, int32 InValue, ESlateVisibility NumberVisibility);
	void SetVisibilityParts(bool InBuffVisibility, bool InNumberVisibility);
	void SetStatusDeadColor(EJackCharacter InCharType);
	void SetOddEffectType(class FName InOddEffectId);
	void SetStatusRateColor(float HPRate);
	void SetOddEffectId(class FName InOddEffectId);
	void SetNumber2(int32 InNumber, ESlateVisibility InVisivility);
	void SetPanelOffset(bool IsOnePlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_082_modern_C">();
	}
	static class UWBP_Menu_Parts_082_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_082_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_082_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_082_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_082_modern_C) == 0x000450, "Wrong size on UWBP_Menu_Parts_082_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_082_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, BG) == 0x0003D8, "Member 'UWBP_Menu_Parts_082_modern_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, CaptionPanel) == 0x0003E0, "Member 'UWBP_Menu_Parts_082_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, FaceIconPanel) == 0x0003E8, "Member 'UWBP_Menu_Parts_082_modern_C::FaceIconPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, HorizontalBox_0) == 0x0003F0, "Member 'UWBP_Menu_Parts_082_modern_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, OrderNumPanel) == 0x0003F8, "Member 'UWBP_Menu_Parts_082_modern_C::OrderNumPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, RootPanel) == 0x000400, "Member 'UWBP_Menu_Parts_082_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, WBP_Menu_Parts_Buff_000) == 0x000408, "Member 'UWBP_Menu_Parts_082_modern_C::WBP_Menu_Parts_Buff_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, NumberText) == 0x000410, "Member 'UWBP_Menu_Parts_082_modern_C::NumberText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, IsNumberVisivility) == 0x000428, "Member 'UWBP_Menu_Parts_082_modern_C::IsNumberVisivility' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, ItemDataBase) == 0x000430, "Member 'UWBP_Menu_Parts_082_modern_C::ItemDataBase' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, NumberTexList) == 0x000438, "Member 'UWBP_Menu_Parts_082_modern_C::NumberTexList' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_082_modern_C, FaceTextureRef) == 0x000448, "Member 'UWBP_Menu_Parts_082_modern_C::FaceTextureRef' has a wrong offset!");

}

