#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Dougu_Status_000_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Dougu_Status_000_modern.WBP_Menu_Dougu_Status_000_modern_C
// 0x0030 (0x0430 - 0x0400)
class UWBP_Menu_Dougu_Status_000_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000_C_78;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_033_modern_C*           WBP_Menu_Parts_033;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowModernFrame;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Dougu_Status_000_modern(int32 EntryPoint);
	void OnItemListControl(class FName EventName, class UJackUMGItemBase* InItemBase);
	void Construct();
	void ShowStatus(EJackCharacter InCharType, class FName InItemId, bool IsEquipment, EJackEquipmentRegion InEquippedRegion);
	void ShowStatusModern(EJackCharacter InCharType, class FName InItemId, bool IsEquipment, EJackEquipmentRegion InEquippedRegion);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Dougu_Status_000_modern_C">();
	}
	static class UWBP_Menu_Dougu_Status_000_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Dougu_Status_000_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Dougu_Status_000_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Dougu_Status_000_modern_C");
static_assert(sizeof(UWBP_Menu_Dougu_Status_000_modern_C) == 0x000430, "Wrong size on UWBP_Menu_Dougu_Status_000_modern_C");
static_assert(offsetof(UWBP_Menu_Dougu_Status_000_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Dougu_Status_000_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Status_000_modern_C, WBP_Menu_Parts_000) == 0x000408, "Member 'UWBP_Menu_Dougu_Status_000_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Status_000_modern_C, WBP_Menu_Parts_000_C_78) == 0x000410, "Member 'UWBP_Menu_Dougu_Status_000_modern_C::WBP_Menu_Parts_000_C_78' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Status_000_modern_C, WBP_Menu_Parts_033) == 0x000418, "Member 'UWBP_Menu_Dougu_Status_000_modern_C::WBP_Menu_Parts_033' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Status_000_modern_C, WindowFrame) == 0x000420, "Member 'UWBP_Menu_Dougu_Status_000_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Dougu_Status_000_modern_C, WindowModernFrame) == 0x000428, "Member 'UWBP_Menu_Dougu_Status_000_modern_C::WindowModernFrame' has a wrong offset!");

}

