#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Shop_Item_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InResultCode, class UObject* InLoaddedObject, class UJackUMGAsyncLoad* InLoadInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          Temp_byte_Variable3;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemData*                       K2Node_Event_InItemData;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGDataContainer*                  CallFunc_GetDataContainerObject_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGItemSyousai*                    K2Node_DynamicCast_AsJack_UMGItem_Syousai;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EJackUMGTextColorSet                          K2Node_Select2_Default;                            // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InResultCode;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InLoaddedObject;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      K2Node_CustomEvent_InLoadInfo;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AsyncLoadTexture_ReturnValue;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLoaddedTextureFromId_ReturnValue;      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UJackUMGAccessorItem*                   CallFunc_GetAccessorItem_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetItemOsyareIconTexture_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern) == 0x0000A8, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_bool_Variable) == 0x000018, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_byte_Variable3) == 0x000019, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00001B, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_Event_InItemData) == 0x000020, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_Event_InItemData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_GetDataContainerObject_ReturnValue) == 0x000028, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_GetDataContainerObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_CustomEvent_EventTag) == 0x000030, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000038, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_DynamicCast_AsJack_UMGItem_Syousai) == 0x000040, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_DynamicCast_AsJack_UMGItem_Syousai' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000049, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_bool_Variable2) == 0x00004A, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_Select2_Default) == 0x00004B, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_byte_Variable4) == 0x000060, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000068, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_CustomEvent_InResultCode) == 0x000070, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_CustomEvent_InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_CustomEvent_InLoaddedObject) == 0x000078, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_CustomEvent_InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_CustomEvent_InLoadInfo) == 0x000080, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_CustomEvent_InLoadInfo' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_AsyncLoadTexture_ReturnValue) == 0x000088, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_AsyncLoadTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_byte_Variable5) == 0x00008C, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_SetLoaddedTextureFromId_ReturnValue) == 0x00008D, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_SetLoaddedTextureFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_SwitchEnum_CmpSuccess) == 0x00008E, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, Temp_bool_Variable3) == 0x00008F, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_GetAccessorItem_ReturnValue) == 0x000090, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_GetAccessorItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, CallFunc_GetItemOsyareIconTexture_ReturnValue) == 0x000098, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::CallFunc_GetItemOsyareIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern, K2Node_Select3_Default) == 0x0000A0, "Member 'WBP_Menu_Shop_Item_000_modern_C_ExecuteUbergraph_WBP_Menu_Shop_Item_000_modern::K2Node_Select3_Default' has a wrong offset!");

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0 final
{
public:
	int32                                         InResultCode;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InLoaddedObject;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAsyncLoad*                      InLoadInfo;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0) == 0x000018, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0, InResultCode) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0::InResultCode' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0, InLoaddedObject) == 0x000008, "Member 'WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0::InLoaddedObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0, InLoadInfo) == 0x000010, "Member 'WBP_Menu_Shop_Item_000_modern_C_CustomEvent_0::InLoadInfo' has a wrong offset!");

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.DrawItemBase
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_Item_000_modern_C_DrawItemBase final
{
public:
	class UJackUMGItemData*                       InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_DrawItemBase) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_DrawItemBase");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_DrawItemBase) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_DrawItemBase");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_DrawItemBase, InItemData) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_DrawItemBase::InItemData' has a wrong offset!");

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.SetUnitTextId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId final
{
public:
	class FName                                   InUnitTextId;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId) == 0x000010, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId, InUnitTextId) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId::InUnitTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'WBP_Menu_Shop_Item_000_modern_C_SetUnitTextId::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.CancelLoadTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture) == 0x000008, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture) == 0x000008, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_CancelLoadTexture::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Shop_Item_000_modern.WBP_Menu_Shop_Item_000_modern_C.SetPossessionAmount
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount final
{
public:
	int32                                         InPossessionAmount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount) == 0x000004, "Wrong alignment on WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount");
static_assert(sizeof(WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount) == 0x000004, "Wrong size on WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount");
static_assert(offsetof(WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount, InPossessionAmount) == 0x000000, "Member 'WBP_Menu_Shop_Item_000_modern_C_SetPossessionAmount::InPossessionAmount' has a wrong offset!");

}

