#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_028_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_028_modern.WBP_Menu_Parts_028_modern_C
// 0x0048 (0x0418 - 0x03D0)
class UWBP_Menu_Parts_028_modern_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             CaptionPanel;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NumberPanel;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Buff_000_C*             WBP_Menu_Parts_Buff_000;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NumberText;                                        // 0x03F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsNumberVisivility;                                // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_028_modern(int32 EntryPoint);
	void DrawUpdateContainerDelegate(const struct FJackUMGItemContainer& ItemContainer);
	void Construct();
	void SetNumber(int32 InNumber, ESlateVisibility InVisivility);
	void SetNumberAndCaption(const class FText& CaptionText_0, int32 InValue, ESlateVisibility NumberVisibility);
	void SetVisibilityParts(bool InBuffVisibility, bool InNumberVisibility);
	void SetStatusDeadColor(EJackCharacter InCharType);
	void SetOddEffectType(class FName InOddEffectId);
	void SetStatusRateColor(float HPRate);
	void SetOddEffectId(class FName InOddEffectId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_028_modern_C">();
	}
	static class UWBP_Menu_Parts_028_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_028_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_028_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_028_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_028_modern_C) == 0x000418, "Wrong size on UWBP_Menu_Parts_028_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_028_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, CaptionPanel) == 0x0003D8, "Member 'UWBP_Menu_Parts_028_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, HorizontalBox_0) == 0x0003E0, "Member 'UWBP_Menu_Parts_028_modern_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, NumberPanel) == 0x0003E8, "Member 'UWBP_Menu_Parts_028_modern_C::NumberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, WBP_Menu_Parts_Buff_000) == 0x0003F0, "Member 'UWBP_Menu_Parts_028_modern_C::WBP_Menu_Parts_Buff_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, NumberText) == 0x0003F8, "Member 'UWBP_Menu_Parts_028_modern_C::NumberText' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_028_modern_C, IsNumberVisivility) == 0x000410, "Member 'UWBP_Menu_Parts_028_modern_C::IsNumberVisivility' has a wrong offset!");

}

