#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_Text_090_modern

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Parts_Text_090_modern.WBP_Menu_Parts_Text_090_modern_C.ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern
// 0x0090 (0x0090 - 0x0000)
struct WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FJackUMGItemContainer                  K2Node_CustomEvent_ItemContainer;                  // 0x0018(0x0050)()
	TDelegate<void(struct FJackUMGItemContainer& ItemContainer)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  K2Node_Event_InJustification;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern");
static_assert(sizeof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern) == 0x000090, "Wrong size on WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_CustomEvent_ItemContainer) == 0x000018, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_CustomEvent_ItemContainer' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_SwitchName_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_CustomEvent_EventTag) == 0x000080, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_SwitchName2_CmpSuccess) == 0x000088, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern, K2Node_Event_InJustification) == 0x000089, "Member 'WBP_Menu_Parts_Text_090_modern_C_ExecuteUbergraph_WBP_Menu_Parts_Text_090_modern::K2Node_Event_InJustification' has a wrong offset!");

// Function WBP_Menu_Parts_Text_090_modern.WBP_Menu_Parts_Text_090_modern_C.SetTextJustification
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_Text_090_modern_C_SetTextJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Text_090_modern_C_SetTextJustification) == 0x000001, "Wrong alignment on WBP_Menu_Parts_Text_090_modern_C_SetTextJustification");
static_assert(sizeof(WBP_Menu_Parts_Text_090_modern_C_SetTextJustification) == 0x000001, "Wrong size on WBP_Menu_Parts_Text_090_modern_C_SetTextJustification");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_SetTextJustification, InJustification) == 0x000000, "Member 'WBP_Menu_Parts_Text_090_modern_C_SetTextJustification::InJustification' has a wrong offset!");

// Function WBP_Menu_Parts_Text_090_modern.WBP_Menu_Parts_Text_090_modern_C.WidgetBPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate");
static_assert(sizeof(WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Parts_Text_090_modern_C_WidgetBPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Parts_Text_090_modern.WBP_Menu_Parts_Text_090_modern_C.DrawUpdateContainerDelegate
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate final
{
public:
	struct FJackUMGItemContainer                  ItemContainer;                                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate");
static_assert(sizeof(WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate) == 0x000050, "Wrong size on WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate, ItemContainer) == 0x000000, "Member 'WBP_Menu_Parts_Text_090_modern_C_DrawUpdateContainerDelegate::ItemContainer' has a wrong offset!");

// Function WBP_Menu_Parts_Text_090_modern.WBP_Menu_Parts_Text_090_modern_C.SetCaptionJustification
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification) == 0x000001, "Wrong alignment on WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification");
static_assert(sizeof(WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification) == 0x000001, "Wrong size on WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification, InJustification) == 0x000000, "Member 'WBP_Menu_Parts_Text_090_modern_C_SetCaptionJustification::InJustification' has a wrong offset!");

// Function WBP_Menu_Parts_Text_090_modern.WBP_Menu_Parts_Text_090_modern_C.SetCharacterSpacing
// 0x0004 (0x0004 - 0x0000)
struct WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing final
{
public:
	float                                         InCharacterSpacing;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing) == 0x000004, "Wrong alignment on WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing");
static_assert(sizeof(WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing) == 0x000004, "Wrong size on WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing");
static_assert(offsetof(WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing, InCharacterSpacing) == 0x000000, "Member 'WBP_Menu_Parts_Text_090_modern_C_SetCharacterSpacing::InCharacterSpacing' has a wrong offset!");

}

