#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Namae_PrivacyPolicy_001_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Namae_PrivacyPolicy_001_modern.WBP_Menu_Namae_PrivacyPolicy_001_modern_C
// 0x0058 (0x0490 - 0x0438)
class UWBP_Menu_Namae_PrivacyPolicy_001_modern_C final : public UJackUMGWebBrowser
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Button_Icon;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CaptionPanel;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GameStart;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_Icon_080_modern_C* WBP_Menu_Parts_Text_Icon_080;                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowFrame;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TopNumber;                                         // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LineCount;                                         // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScrollMove;                                        // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndNumber;                                         // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScrollMoveLine;                                    // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PixelPerLine;                                      // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Namae_PrivacyPolicy_001_modern(int32 EntryPoint);
	void Construct();
	void WidgetKeyEvent(EJackKeys InKeyType, bool bIsPressed);
	void WidgetBPActionDelegate(class FName EventTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Namae_PrivacyPolicy_001_modern_C">();
	}
	static class UWBP_Menu_Namae_PrivacyPolicy_001_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Namae_PrivacyPolicy_001_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Namae_PrivacyPolicy_001_modern_C");
static_assert(sizeof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C) == 0x000490, "Wrong size on UWBP_Menu_Namae_PrivacyPolicy_001_modern_C");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, UberGraphFrame) == 0x000438, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, Button_Icon) == 0x000440, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::Button_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, CaptionPanel) == 0x000448, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::CaptionPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, Panel) == 0x000450, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, RootPanel) == 0x000458, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, Text_GameStart) == 0x000460, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::Text_GameStart' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, WBP_Menu_Parts_Text_Icon_080) == 0x000468, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::WBP_Menu_Parts_Text_Icon_080' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, WindowFrame) == 0x000470, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::WindowFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, TopNumber) == 0x000478, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::TopNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, LineCount) == 0x00047C, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::LineCount' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, ScrollMove) == 0x000480, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::ScrollMove' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, EndNumber) == 0x000484, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::EndNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, ScrollMoveLine) == 0x000488, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::ScrollMoveLine' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Namae_PrivacyPolicy_001_modern_C, PixelPerLine) == 0x00048C, "Member 'UWBP_Menu_Namae_PrivacyPolicy_001_modern_C::PixelPerLine' has a wrong offset!");

}

