#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Sakusen_List_001_modern

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern
// 0x0268 (0x0268 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UJackUMGSerifuWindowController* Sender, class FName CurrentTextID, int32 SelectDialogIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable2;                             // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       K2Node_CustomEvent_InItemBase;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue2;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue3;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UJackUMGItemData*>               CallFunc_GetSystemCommandListNE_ReturnValue;       // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FJackMessageArgumentData>       Temp_struct_Variable3;                             // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowLatentMessageEndResult* CallFunc_WaitMessageEndFromBP_Result2;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTrial_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemData*                       CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultDeltaTime_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F8(0x003C)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackItemPresentManager*                CallFunc_GetItemPresentManager_ReturnValue2;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCheckDlcDataUpdateEnd_ReturnValue;      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue4;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackMusicManager*                      CallFunc_GetMusicManager_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStopFadeoutBGM_ReturnValue;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCaravan_ReturnValue;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue5;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue4;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue2;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUIPlatformType                           CallFunc_GetUIPlatformType_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJackUMGItemData*>               CallFunc_GetSystemCommandListNE_ReturnValue2;      // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue5;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, class UJackUMGItemBase* InItemBase)> K2Node_CreateDelegate_OutputDelegate2;             // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue2;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue6;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue7;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         K2Node_CustomEvent_Sender;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CurrentTextID;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectDialogIndex;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue6;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGSerifuWindowController*         CallFunc_CloseSerifuWindow_ReturnValue2;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate3;             // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue8;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue7;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue9;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue10;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWidget_ReturnValue11;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCaravan_ReturnValue2;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTrial_ReturnValue2;                     // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern) == 0x000268, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, Temp_struct_Variable) == 0x000008, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue) == 0x000028, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_WaitMessageEndFromBP_Result) == 0x000030, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_WaitMessageEndFromBP_Result' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue) == 0x000038, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, Temp_struct_Variable2) == 0x000040, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CustomEvent_EventTag) == 0x000050, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CustomEvent_EventName) == 0x000068, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CustomEvent_InItemBase) == 0x000070, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CustomEvent_InItemBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_SwitchName2_CmpSuccess) == 0x000078, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_SwitchName3_CmpSuccess) == 0x000079, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_SwitchName3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue2) == 0x000080, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue3) == 0x000088, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000090, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x000098, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetSystemCommandListNE_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetSystemCommandListNE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue2) == 0x0000B0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, Temp_struct_Variable3) == 0x0000B8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x0000C8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3) == 0x0000D0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_DisplaySerifuWindowAtTextID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_WaitMessageEndFromBP_Result2) == 0x0000D8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_WaitMessageEndFromBP_Result2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_IsTrial_ReturnValue) == 0x0000E0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_IsTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, Temp_int_Array_Index_Variable) == 0x0000E4, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_SwitchName4_CmpSuccess) == 0x0000F0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_SwitchName4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetDefaultDeltaTime_ReturnValue) == 0x0000F4, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetDefaultDeltaTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_Event_MyGeometry) == 0x0000F8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_Event_InDeltaTime) == 0x000134, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetItemPresentManager_ReturnValue) == 0x000138, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetItemPresentManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetItemPresentManager_ReturnValue2) == 0x000140, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetItemPresentManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000148, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_IsCheckDlcDataUpdateEnd_ReturnValue) == 0x000149, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_IsCheckDlcDataUpdateEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_BooleanAND_ReturnValue) == 0x00014A, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue4) == 0x000150, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue3) == 0x000158, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetMusicManager_ReturnValue) == 0x000160, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetMusicManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_IsStopFadeoutBGM_ReturnValue) == 0x000168, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_IsStopFadeoutBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_IsCaravan_ReturnValue) == 0x000169, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_IsCaravan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue5) == 0x000170, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue4) == 0x000178, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetAccessorMembers_ReturnValue2) == 0x000180, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetAccessorMembers_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUIPlatformType_ReturnValue) == 0x000188, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUIPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetSystemCommandListNE_ReturnValue2) == 0x000190, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetSystemCommandListNE_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001A0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue5) == 0x0001A8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x0001B0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWithSnap_ReturnValue2) == 0x0001C0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWithSnap_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue6) == 0x0001C8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue7) == 0x0001D0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CustomEvent_Sender) == 0x0001D8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CustomEvent_CurrentTextID) == 0x0001E0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CustomEvent_CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CustomEvent_SelectDialogIndex) == 0x0001E8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CustomEvent_SelectDialogIndex' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue6) == 0x0001F0, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_SwitchInteger_CmpSuccess) == 0x0001F8, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_CloseSerifuWindow_ReturnValue) == 0x000200, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_CloseSerifuWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_CloseSerifuWindow_ReturnValue2) == 0x000208, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_CloseSerifuWindow_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, K2Node_CreateDelegate_OutputDelegate3) == 0x000210, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue8) == 0x000220, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_GetUMGManager_ReturnValue7) == 0x000228, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_GetUMGManager_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue9) == 0x000230, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue10) == 0x000238, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_AddUMGMenuWidget_ReturnValue11) == 0x000240, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_AddUMGMenuWidget_ReturnValue11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_IsCaravan_ReturnValue2) == 0x000248, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_IsCaravan_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_IsTrial_ReturnValue2) == 0x000249, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_IsTrial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_MakeLiteralName_ReturnValue) == 0x000250, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_BooleanOR_ReturnValue) == 0x000258, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, Temp_int_Loop_Counter_Variable) == 0x00025C, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000260, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000264, "Member 'WBP_Menu_Sakusen_List_001_modern_C_ExecuteUbergraph_WBP_Menu_Sakusen_List_001_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.KetteiSettei
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei final
{
public:
	class UJackUMGSerifuWindowController*         Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTextID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectDialogIndex;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei) == 0x000018, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei, Sender) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei, CurrentTextID) == 0x000008, "Member 'WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei::CurrentTextID' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei, SelectDialogIndex) == 0x000010, "Member 'WBP_Menu_Sakusen_List_001_modern_C_KetteiSettei::SelectDialogIndex' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_Tick) == 0x000004, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_Tick");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_Tick) == 0x000040, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_Tick");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_Tick, InDeltaTime) == 0x00003C, "Member 'WBP_Menu_Sakusen_List_001_modern_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.OnItemListControl
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGItemBase*                       InItemBase;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl) == 0x000010, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl, EventName) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl::EventName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl, InItemBase) == 0x000008, "Member 'WBP_Menu_Sakusen_List_001_modern_C_OnItemListControl::InItemBase' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.WidgetBPActionDelegate_Copy
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy) == 0x000008, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy, EventTag) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_WidgetBPActionDelegate_Copy::EventTag' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.SetInfoText
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_SetInfoText final
{
public:
	class FName                                   Selection;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGWidgetBase*                     CallFunc_GetUMGWidgetFromName_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Common_Setumei_000_modern_C*  K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_SetInfoText");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText) == 0x000030, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_SetInfoText");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText, Selection) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_SetInfoText::Selection' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_List_001_modern_C_SetInfoText::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'WBP_Menu_Sakusen_List_001_modern_C_SetInfoText::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText, CallFunc_GetUMGWidgetFromName_ReturnValue) == 0x000018, "Member 'WBP_Menu_Sakusen_List_001_modern_C_SetInfoText::CallFunc_GetUMGWidgetFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText, K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern) == 0x000020, "Member 'WBP_Menu_Sakusen_List_001_modern_C_SetInfoText::K2Node_DynamicCast_AsWBP_Menu_Common_Setumei_000_Modern' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_SetInfoText, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Menu_Sakusen_List_001_modern_C_SetInfoText::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.AddSnap
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_AddSnap final
{
public:
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     CallFunc_AddUMGMenuWithSnap_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_AddSnap) == 0x000008, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_AddSnap");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_AddSnap) == 0x000018, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_AddSnap");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_AddSnap, CallFunc_GetUMGManager_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_AddSnap::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_AddSnap, CallFunc_AddUMGMenuWithSnap_ReturnValue) == 0x000008, "Member 'WBP_Menu_Sakusen_List_001_modern_C_AddSnap::CallFunc_AddUMGMenuWithSnap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_AddSnap, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_Menu_Sakusen_List_001_modern_C_AddSnap::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Sakusen_List_001_modern.WBP_Menu_Sakusen_List_001_modern_C.RemoveSnap
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap final
{
public:
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap) == 0x000001, "Wrong alignment on WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap");
static_assert(sizeof(WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap) == 0x000001, "Wrong size on WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap");
static_assert(offsetof(WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'WBP_Menu_Sakusen_List_001_modern_C_RemoveSnap::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

