#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_UMG_Root_Widget_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title_UMG_Root_Widget_modern.WBP_Title_UMG_Root_Widget_modern_C
// 0x0168 (0x04D8 - 0x0370)
class UWBP_Title_UMG_Root_Widget_modern_C final : public UJackUMGWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FontRenderingPanel;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FJackUMGAnimSet>                PresetAnimSets;                                    // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FText                                   FontRendering;                                     // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   Menu_Title_000_Asset;                              // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Namae_Window_001_Asset;                       // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Hud_CS_Skip_000_Asset;                             // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Omoide_List_000_Asset;                        // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Omoide_Window_000;                            // 0x0418(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   WBP_Menu_Camp_List_000_Asset;                      // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Tutrial_Window_000_Asset;                     // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_Arasuzi_All_000;                              // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   WBPJukeboxWindowAsset;                             // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Menu_MeosiDataRobo_000_Asset;                      // 0x0490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   WBPMenuCredit000Asset;                             // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MenuNerusenPicture000Asset;                        // 0x04C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Title_UMG_Root_Widget_modern(int32 EntryPoint);
	void Construct();
	void CustomEvent_0(EJackUMGMenuId InMenuId, class FName InArgName, int32 InArgValue);
	void BPActionDelegate(class FName EventTag);
	void CloseMenu(int32 InArg);
	void WidgetNotificationDelegate(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_UMG_Root_Widget_modern_C">();
	}
	static class UWBP_Title_UMG_Root_Widget_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_UMG_Root_Widget_modern_C>();
	}
};
static_assert(alignof(UWBP_Title_UMG_Root_Widget_modern_C) == 0x000008, "Wrong alignment on UWBP_Title_UMG_Root_Widget_modern_C");
static_assert(sizeof(UWBP_Title_UMG_Root_Widget_modern_C) == 0x0004D8, "Wrong size on UWBP_Title_UMG_Root_Widget_modern_C");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, UberGraphFrame) == 0x000370, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, CanvasPanel) == 0x000378, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, FontRenderingPanel) == 0x000380, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::FontRenderingPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, RootPanel) == 0x000388, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, PresetAnimSets) == 0x000390, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::PresetAnimSets' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, FontRendering) == 0x0003A0, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::FontRendering' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_Title_000_Asset) == 0x0003B8, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_Title_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_Namae_Window_001_Asset) == 0x0003D0, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_Namae_Window_001_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Hud_CS_Skip_000_Asset) == 0x0003E8, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Hud_CS_Skip_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_Omoide_List_000_Asset) == 0x000400, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_Omoide_List_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_Omoide_Window_000) == 0x000418, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_Omoide_Window_000' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, WBP_Menu_Camp_List_000_Asset) == 0x000430, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::WBP_Menu_Camp_List_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_Tutrial_Window_000_Asset) == 0x000448, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_Tutrial_Window_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_Arasuzi_All_000) == 0x000460, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_Arasuzi_All_000' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, WBPJukeboxWindowAsset) == 0x000478, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::WBPJukeboxWindowAsset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, Menu_MeosiDataRobo_000_Asset) == 0x000490, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::Menu_MeosiDataRobo_000_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, WBPMenuCredit000Asset) == 0x0004A8, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::WBPMenuCredit000Asset' has a wrong offset!");
static_assert(offsetof(UWBP_Title_UMG_Root_Widget_modern_C, MenuNerusenPicture000Asset) == 0x0004C0, "Member 'UWBP_Title_UMG_Root_Widget_modern_C::MenuNerusenPicture000Asset' has a wrong offset!");

}

