#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Status_Level3_modern

#include "Basic.hpp"

#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Status_Level3_modern.WBP_Hud_Status_Level3_modern_C.ExecuteUbergraph_WBP_Hud_Status_Level3_modern
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetUMGMenuStringFromTextId_ReturnValue;   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Name)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, int32 ColorNum)>  K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Name;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ColorNum;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	int32                                         K2Node_CustomEvent_Level;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          K2Node_CustomEvent_ColorType;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAsciiDecText_ReturnValue;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x00E0(0x0018)()
};
static_assert(alignof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern) == 0x000008, "Wrong alignment on WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern");
static_assert(sizeof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern) == 0x0000F8, "Wrong size on WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, EntryPoint) == 0x000000, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000008, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_GetUMGMenuStringFromTextId_ReturnValue) == 0x000010, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_GetUMGMenuStringFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, Temp_bool_Variable) == 0x000040, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, Temp_string_Variable) == 0x000048, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, Temp_string_Variable2) == 0x000058, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CustomEvent_Name) == 0x000068, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CustomEvent_Index) == 0x000078, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CustomEvent_ColorNum) == 0x00007C, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CustomEvent_ColorNum' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CustomEvent_Level) == 0x000098, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_CustomEvent_ColorType) == 0x00009C, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_CustomEvent_ColorType' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00009D, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_GetAsciiDecText_ReturnValue) == 0x0000A0, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000D0, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern, CallFunc_Conv_StringToText_ReturnValue2) == 0x0000E0, "Member 'WBP_Hud_Status_Level3_modern_C_ExecuteUbergraph_WBP_Hud_Status_Level3_modern::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");

// Function WBP_Hud_Status_Level3_modern.WBP_Hud_Status_Level3_modern_C.InitData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Status_Level3_modern_C_InitData final
{
public:
	int32                                         Level_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          ColorType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Level3_modern_C_InitData) == 0x000004, "Wrong alignment on WBP_Hud_Status_Level3_modern_C_InitData");
static_assert(sizeof(WBP_Hud_Status_Level3_modern_C_InitData) == 0x000008, "Wrong size on WBP_Hud_Status_Level3_modern_C_InitData");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_InitData, Level_0) == 0x000000, "Member 'WBP_Hud_Status_Level3_modern_C_InitData::Level_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_InitData, ColorType) == 0x000004, "Member 'WBP_Hud_Status_Level3_modern_C_InitData::ColorType' has a wrong offset!");

// Function WBP_Hud_Status_Level3_modern.WBP_Hud_Status_Level3_modern_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_Status_Level3_modern_C_CustomEvent_1 final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColorNum;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Level3_modern_C_CustomEvent_1) == 0x000004, "Wrong alignment on WBP_Hud_Status_Level3_modern_C_CustomEvent_1");
static_assert(sizeof(WBP_Hud_Status_Level3_modern_C_CustomEvent_1) == 0x000008, "Wrong size on WBP_Hud_Status_Level3_modern_C_CustomEvent_1");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_CustomEvent_1, Index_0) == 0x000000, "Member 'WBP_Hud_Status_Level3_modern_C_CustomEvent_1::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_CustomEvent_1, ColorNum) == 0x000004, "Member 'WBP_Hud_Status_Level3_modern_C_CustomEvent_1::ColorNum' has a wrong offset!");

// Function WBP_Hud_Status_Level3_modern.WBP_Hud_Status_Level3_modern_C.CustomEvent_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_Status_Level3_modern_C_CustomEvent_0 final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Level3_modern_C_CustomEvent_0) == 0x000008, "Wrong alignment on WBP_Hud_Status_Level3_modern_C_CustomEvent_0");
static_assert(sizeof(WBP_Hud_Status_Level3_modern_C_CustomEvent_0) == 0x000010, "Wrong size on WBP_Hud_Status_Level3_modern_C_CustomEvent_0");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_CustomEvent_0, Name_0) == 0x000000, "Member 'WBP_Hud_Status_Level3_modern_C_CustomEvent_0::Name_0' has a wrong offset!");

// Function WBP_Hud_Status_Level3_modern.WBP_Hud_Status_Level3_modern_C.SetColor
// 0x000C (0x000C - 0x0000)
struct WBP_Hud_Status_Level3_modern_C_SetColor final
{
public:
	int32                                         HP;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxHP;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJackUMGTextColorSet                          CallFunc_GetTextColorTypeHP_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Status_Level3_modern_C_SetColor) == 0x000004, "Wrong alignment on WBP_Hud_Status_Level3_modern_C_SetColor");
static_assert(sizeof(WBP_Hud_Status_Level3_modern_C_SetColor) == 0x00000C, "Wrong size on WBP_Hud_Status_Level3_modern_C_SetColor");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_SetColor, HP) == 0x000000, "Member 'WBP_Hud_Status_Level3_modern_C_SetColor::HP' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_SetColor, MaxHP) == 0x000004, "Member 'WBP_Hud_Status_Level3_modern_C_SetColor::MaxHP' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Status_Level3_modern_C_SetColor, CallFunc_GetTextColorTypeHP_ReturnValue) == 0x000008, "Member 'WBP_Hud_Status_Level3_modern_C_SetColor::CallFunc_GetTextColorTypeHP_ReturnValue' has a wrong offset!");

}

