#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_003_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_003_modern.WBP_Menu_Parts_003_modern_C
// 0x0070 (0x0588 - 0x0518)
class UWBP_Menu_Parts_003_modern_C final : public UJackUMGValueController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow_Down_Disable;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Down_Enable;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_UP_Disable;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_UP_Enable;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_00;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_01;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_02;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_03;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_04;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_05;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_06;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ValueCursorPanel;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ValueText;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_Parts_003_modern(int32 EntryPoint);
	void Construct();
	void BPActionDelegate(class FName EventTag);
	void ShowArrow(EJackUMGCheckValueInput InCheck, bool InVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_003_modern_C">();
	}
	static class UWBP_Menu_Parts_003_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_003_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_003_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_003_modern_C");
static_assert(sizeof(UWBP_Menu_Parts_003_modern_C) == 0x000588, "Wrong size on UWBP_Menu_Parts_003_modern_C");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, UberGraphFrame) == 0x000518, "Member 'UWBP_Menu_Parts_003_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Arrow_Down_Disable) == 0x000520, "Member 'UWBP_Menu_Parts_003_modern_C::Arrow_Down_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Arrow_Down_Enable) == 0x000528, "Member 'UWBP_Menu_Parts_003_modern_C::Arrow_Down_Enable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Arrow_UP_Disable) == 0x000530, "Member 'UWBP_Menu_Parts_003_modern_C::Arrow_UP_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Arrow_UP_Enable) == 0x000538, "Member 'UWBP_Menu_Parts_003_modern_C::Arrow_UP_Enable' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_00) == 0x000540, "Member 'UWBP_Menu_Parts_003_modern_C::Value_00' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_01) == 0x000548, "Member 'UWBP_Menu_Parts_003_modern_C::Value_01' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_02) == 0x000550, "Member 'UWBP_Menu_Parts_003_modern_C::Value_02' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_03) == 0x000558, "Member 'UWBP_Menu_Parts_003_modern_C::Value_03' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_04) == 0x000560, "Member 'UWBP_Menu_Parts_003_modern_C::Value_04' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_05) == 0x000568, "Member 'UWBP_Menu_Parts_003_modern_C::Value_05' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, Value_06) == 0x000570, "Member 'UWBP_Menu_Parts_003_modern_C::Value_06' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, ValueCursorPanel) == 0x000578, "Member 'UWBP_Menu_Parts_003_modern_C::ValueCursorPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_003_modern_C, ValueText) == 0x000580, "Member 'UWBP_Menu_Parts_003_modern_C::ValueText' has a wrong offset!");

}

