#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Result_Window_000_modern

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "JackGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Result_Window_000_modern.WBP_Menu_Result_Window_000_modern_C.ExecuteUbergraph_WBP_Menu_Result_Window_000_modern
// 0x0120 (0x0120 - 0x0000)
struct WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGBattleResultData*               K2Node_DynamicCast_AsJack_UMGBattle_Result_Data;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJackUMGAnimSet                        CallFunc_GetUMGPresetAnimSet_ReturnValue;          // 0x0040(0x0038)(NoDestructor)
	class UWBP_Menu_Parts_Text_090_modern_C*      CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAnimSet_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item2;                          // 0x0088(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGAccessorMembers*                CallFunc_GetAccessorMembers_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharNameFromType_ReturnValue;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_Parts_Text_090_modern_C*> K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern");
static_assert(sizeof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern) == 0x000120, "Wrong size on WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, Temp_byte_Variable2) == 0x000005, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_CustomEvent_InEventTag) == 0x000010, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000018, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_CustomEvent_InObject) == 0x000020, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_DynamicCast_AsJack_UMGBattle_Result_Data) == 0x000028, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_DynamicCast_AsJack_UMGBattle_Result_Data' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000031, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_GetUMGManager_ReturnValue) == 0x000038, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_GetUMGPresetAnimSet_ReturnValue) == 0x000040, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_GetUMGPresetAnimSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_SetAnimSet_ReturnValue) == 0x000080, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_SetAnimSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Array_Get_Item2) == 0x000088, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Array_Length_ReturnValue2) == 0x0000A4, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_GetAccessorMembers_ReturnValue) == 0x0000B0, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_GetAccessorMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_GetCharNameFromType_ReturnValue) == 0x0000B8, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_GetCharNameFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, Temp_bool_Variable) == 0x0000C8, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern, CallFunc_Add_IntInt_ReturnValue) == 0x000118, "Member 'WBP_Menu_Result_Window_000_modern_C_ExecuteUbergraph_WBP_Menu_Result_Window_000_modern::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Menu_Result_Window_000_modern.WBP_Menu_Result_Window_000_modern_C.WidgetNotificationDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate");
static_assert(sizeof(WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate) == 0x000018, "Wrong size on WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate, InEventTag) == 0x000000, "Member 'WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate, InObject) == 0x000010, "Member 'WBP_Menu_Result_Window_000_modern_C_WidgetNotificationDelegate::InObject' has a wrong offset!");

// Function WBP_Menu_Result_Window_000_modern.WBP_Menu_Result_Window_000_modern_C.SetParamData
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_Result_Window_000_modern_C_SetParamData final
{
public:
	class UWBP_Menu_Parts_Text_090_modern_C*      WBP_Menu_Parts_Text_090_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_Text_090_modern_C*      WBP_Menu_Parts_Text_090_Num;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_Parts_033_modern_C*           WBP_Menu_Parts_033_0;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InCaption;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InBaseup;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCurrent;                                         // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InChanged;                                         // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Baseup;                                            // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetAsciiDecText_ReturnValue;              // 0x0038(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Result_Window_000_modern_C_SetParamData) == 0x000008, "Wrong alignment on WBP_Menu_Result_Window_000_modern_C_SetParamData");
static_assert(sizeof(WBP_Menu_Result_Window_000_modern_C_SetParamData) == 0x000068, "Wrong size on WBP_Menu_Result_Window_000_modern_C_SetParamData");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, WBP_Menu_Parts_Text_090_0) == 0x000000, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::WBP_Menu_Parts_Text_090_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, WBP_Menu_Parts_Text_090_Num) == 0x000008, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::WBP_Menu_Parts_Text_090_Num' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, WBP_Menu_Parts_033_0) == 0x000010, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::WBP_Menu_Parts_033_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, InCaption) == 0x000018, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::InCaption' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, InBaseup) == 0x000020, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::InBaseup' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, InCurrent) == 0x000024, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::InCurrent' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, InChanged) == 0x000028, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::InChanged' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, Baseup) == 0x00002C, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::Baseup' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, CallFunc_GetUMGManager_ReturnValue) == 0x000030, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, CallFunc_GetAsciiDecText_ReturnValue) == 0x000038, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::CallFunc_GetAsciiDecText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Result_Window_000_modern_C_SetParamData, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'WBP_Menu_Result_Window_000_modern_C_SetParamData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

