#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Casino_Quantity_000_modern

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C.OnGinkouEnter__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature final
{
public:
	class UJackUMGWidgetBase*                     Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature");
static_assert(sizeof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature, Sender) == 0x000000, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature::Sender' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature, Value) == 0x000008, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouEnter__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C.OnGinkouCancel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature final
{
public:
	class UJackUMGWidgetBase*                     Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature");
static_assert(sizeof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature, Sender) == 0x000000, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_OnGinkouCancel__DelegateSignature::Sender' has a wrong offset!");

// Function WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C.ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern
// 0x0058 (0x0058 - 0x0000)
struct WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName InEventTag, class UJackUMGWidgetBase* InCallWidgetBase, class UObject* InObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventTag)>         K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_InEventTag;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     K2Node_CustomEvent_InCallWidgetBase;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_InObject;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventTag;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern) == 0x000008, "Wrong alignment on WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern");
static_assert(sizeof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern) == 0x000058, "Wrong size on WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, EntryPoint) == 0x000000, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_CustomEvent_InEventTag) == 0x000028, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_CustomEvent_InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_CustomEvent_InCallWidgetBase) == 0x000030, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_CustomEvent_InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_CustomEvent_InObject) == 0x000038, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_CustomEvent_InObject' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_SwitchName_CmpSuccess) == 0x000040, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_CustomEvent_EventTag) == 0x000048, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern, K2Node_SwitchName2_CmpSuccess) == 0x000050, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_ExecuteUbergraph_WBP_Menu_Casino_Quantity_000_modern::K2Node_SwitchName2_CmpSuccess' has a wrong offset!");

// Function WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C.BPActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate");
static_assert(sizeof(WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate) == 0x000008, "Wrong size on WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate, EventTag) == 0x000000, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_BPActionDelegate::EventTag' has a wrong offset!");

// Function WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C.DefaultNotificationDelegate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate final
{
public:
	class FName                                   InEventTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGWidgetBase*                     InCallWidgetBase;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InObject;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate) == 0x000008, "Wrong alignment on WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate");
static_assert(sizeof(WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate) == 0x000018, "Wrong size on WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate, InEventTag) == 0x000000, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate::InEventTag' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate, InCallWidgetBase) == 0x000008, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate::InCallWidgetBase' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate, InObject) == 0x000010, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_DefaultNotificationDelegate::InObject' has a wrong offset!");

// Function WBP_Menu_Casino_Quantity_000_modern.WBP_Menu_Casino_Quantity_000_modern_C.SetupQuantity
// 0x0088 (0x0088 - 0x0000)
struct WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity final
{
public:
	class FName                                   CaptionTextId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UnitTextId1;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TotalTextId;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue;     // 0x0028(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue3;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue2;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJackUMGManager*                        CallFunc_GetUMGManager_ReturnValue3;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue2;    // 0x0058(0x0018)()
	class FText                                   CallFunc_GetUMGMenuTextFromTextId_ReturnValue3;    // 0x0070(0x0018)()
};
static_assert(alignof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity) == 0x000008, "Wrong alignment on WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity");
static_assert(sizeof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity) == 0x000088, "Wrong size on WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CaptionTextId) == 0x000000, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CaptionTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, UnitTextId1) == 0x000008, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::UnitTextId1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, TotalTextId) == 0x000010, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::TotalTextId' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_GetUMGManager_ReturnValue) == 0x000018, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_GetUMGManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_NotEqual_NameName_ReturnValue) == 0x000020, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_GetUMGMenuTextFromTextId_ReturnValue) == 0x000028, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_GetUMGMenuTextFromTextId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000040, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_NotEqual_NameName_ReturnValue3) == 0x000041, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_NotEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_GetUMGManager_ReturnValue2) == 0x000048, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_GetUMGManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_GetUMGManager_ReturnValue3) == 0x000050, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_GetUMGManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_GetUMGMenuTextFromTextId_ReturnValue2) == 0x000058, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_GetUMGMenuTextFromTextId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity, CallFunc_GetUMGMenuTextFromTextId_ReturnValue3) == 0x000070, "Member 'WBP_Menu_Casino_Quantity_000_modern_C_SetupQuantity::CallFunc_GetUMGMenuTextFromTextId_ReturnValue3' has a wrong offset!");

}

