#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Parts_053

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Parts_053.WBP_Menu_Parts_053_C
// 0x0018 (0x03E8 - 0x03D0)
class UWBP_Menu_Parts_053_C final : public UJackUMGItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Slide_Loop;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slide_Arrow;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Parts_053(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Parts_053_C">();
	}
	static class UWBP_Menu_Parts_053_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Parts_053_C>();
	}
};
static_assert(alignof(UWBP_Menu_Parts_053_C) == 0x000008, "Wrong alignment on UWBP_Menu_Parts_053_C");
static_assert(sizeof(UWBP_Menu_Parts_053_C) == 0x0003E8, "Wrong size on UWBP_Menu_Parts_053_C");
static_assert(offsetof(UWBP_Menu_Parts_053_C, UberGraphFrame) == 0x0003D0, "Member 'UWBP_Menu_Parts_053_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_053_C, Slide_Loop) == 0x0003D8, "Member 'UWBP_Menu_Parts_053_C::Slide_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Parts_053_C, Slide_Arrow) == 0x0003E0, "Member 'UWBP_Menu_Parts_053_C::Slide_Arrow' has a wrong offset!");

}

