#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Common_Setumei_006_modern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "JackGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_Common_Setumei_006_modern.WBP_Menu_Common_Setumei_006_modern_C
// 0x0020 (0x0420 - 0x0400)
class UWBP_Menu_Common_Setumei_006_modern_C final : public UJackUMGWindowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_000_modern_C*           WBP_Menu_Parts_000;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Parts_024_modern_C*           WBP_Menu_Parts_024;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Menu_Common_Setumei_006_modern(int32 EntryPoint);
	void SetValue(int32 InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_Common_Setumei_006_modern_C">();
	}
	static class UWBP_Menu_Common_Setumei_006_modern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_Common_Setumei_006_modern_C>();
	}
};
static_assert(alignof(UWBP_Menu_Common_Setumei_006_modern_C) == 0x000008, "Wrong alignment on UWBP_Menu_Common_Setumei_006_modern_C");
static_assert(sizeof(UWBP_Menu_Common_Setumei_006_modern_C) == 0x000420, "Wrong size on UWBP_Menu_Common_Setumei_006_modern_C");
static_assert(offsetof(UWBP_Menu_Common_Setumei_006_modern_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Menu_Common_Setumei_006_modern_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Setumei_006_modern_C, InvalidationBox_0) == 0x000408, "Member 'UWBP_Menu_Common_Setumei_006_modern_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Setumei_006_modern_C, WBP_Menu_Parts_000) == 0x000410, "Member 'UWBP_Menu_Common_Setumei_006_modern_C::WBP_Menu_Parts_000' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_Common_Setumei_006_modern_C, WBP_Menu_Parts_024) == 0x000418, "Member 'UWBP_Menu_Common_Setumei_006_modern_C::WBP_Menu_Parts_024' has a wrong offset!");

}

