#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Kakutoku_All_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "JackGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Kakutoku_All_000.WBP_Hud_Kakutoku_All_000_C
// 0x00D8 (0x02A8 - 0x01D0)
class UWBP_Hud_Kakutoku_All_000_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Kakutoku_Utinaosi;                                 // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kakutoku_Item_Out;                                 // 0x01E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kakutoku_Item_In;                                  // 0x01E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kakutoku_Casino;                                   // 0x01F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kakutoku_Gold;                                     // 0x01F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kakutoku_Medal;                                    // 0x0200(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kakutoku_Item;                                     // 0x0208(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Back_Side;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Back_Side_Casino;                                  // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Casino;                                            // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light1_0;                                   // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light1_1;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light1_2;                                   // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light1_3;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light1_4;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light1_5;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_Light2;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gold;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Medal;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Side_Side;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Side_Side_Casino;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Utinaosi;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayAnim;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrevPlayAnim;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ItemIconTexture;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Hud_Kakutoku_All_000(int32 EntryPoint);
	void ChangePhotoModeDelegate(bool bIsPhotoMode);
	void Destruct();
	void OnLoadedItemPopIcon(class FName ItemID, class UObject* LoadedObject);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void Construct();
	void SetData(EJackItemGetIcon IconType, class FName ItemID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Kakutoku_All_000_C">();
	}
	static class UWBP_Hud_Kakutoku_All_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Kakutoku_All_000_C>();
	}
};
static_assert(alignof(UWBP_Hud_Kakutoku_All_000_C) == 0x000008, "Wrong alignment on UWBP_Hud_Kakutoku_All_000_C");
static_assert(sizeof(UWBP_Hud_Kakutoku_All_000_C) == 0x0002A8, "Wrong size on UWBP_Hud_Kakutoku_All_000_C");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, UberGraphFrame) == 0x0001D0, "Member 'UWBP_Hud_Kakutoku_All_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Utinaosi) == 0x0001D8, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Utinaosi' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Item_Out) == 0x0001E0, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Item_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Item_In) == 0x0001E8, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Item_In' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Casino) == 0x0001F0, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Casino' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Gold) == 0x0001F8, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Gold' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Medal) == 0x000200, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Medal' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Kakutoku_Item) == 0x000208, "Member 'UWBP_Hud_Kakutoku_All_000_C::Kakutoku_Item' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Back_Side) == 0x000210, "Member 'UWBP_Hud_Kakutoku_All_000_C::Back_Side' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Back_Side_Casino) == 0x000218, "Member 'UWBP_Hud_Kakutoku_All_000_C::Back_Side_Casino' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Casino) == 0x000220, "Member 'UWBP_Hud_Kakutoku_All_000_C::Casino' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light1_0) == 0x000228, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light1_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light1_1) == 0x000230, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light1_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light1_2) == 0x000238, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light1_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light1_3) == 0x000240, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light1_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light1_4) == 0x000248, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light1_4' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light1_5) == 0x000250, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light1_5' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Effect_Light2) == 0x000258, "Member 'UWBP_Hud_Kakutoku_All_000_C::Effect_Light2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Gold) == 0x000260, "Member 'UWBP_Hud_Kakutoku_All_000_C::Gold' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, ItemIcon) == 0x000268, "Member 'UWBP_Hud_Kakutoku_All_000_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Medal) == 0x000270, "Member 'UWBP_Hud_Kakutoku_All_000_C::Medal' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Side_Side) == 0x000278, "Member 'UWBP_Hud_Kakutoku_All_000_C::Side_Side' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Side_Side_Casino) == 0x000280, "Member 'UWBP_Hud_Kakutoku_All_000_C::Side_Side_Casino' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, Utinaosi) == 0x000288, "Member 'UWBP_Hud_Kakutoku_All_000_C::Utinaosi' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, PlayAnim) == 0x000290, "Member 'UWBP_Hud_Kakutoku_All_000_C::PlayAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, PrevPlayAnim) == 0x000298, "Member 'UWBP_Hud_Kakutoku_All_000_C::PrevPlayAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Kakutoku_All_000_C, ItemIconTexture) == 0x0002A0, "Member 'UWBP_Hud_Kakutoku_All_000_C::ItemIconTexture' has a wrong offset!");

}

