#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WmfMediaFactory

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WmfMediaFactory.WmfMediaSettings
// 0x0008 (0x0040 - 0x0038)
class UWmfMediaSettings final : public UObject
{
public:
	bool                                          AllowNonStandardCodecs;                            // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LowLatency;                                        // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NativeAudioOut;                                    // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WmfMediaSettings">();
	}
	static class UWmfMediaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWmfMediaSettings>();
	}
};
static_assert(alignof(UWmfMediaSettings) == 0x000008, "Wrong alignment on UWmfMediaSettings");
static_assert(sizeof(UWmfMediaSettings) == 0x000040, "Wrong size on UWmfMediaSettings");
static_assert(offsetof(UWmfMediaSettings, AllowNonStandardCodecs) == 0x000038, "Member 'UWmfMediaSettings::AllowNonStandardCodecs' has a wrong offset!");
static_assert(offsetof(UWmfMediaSettings, LowLatency) == 0x000039, "Member 'UWmfMediaSettings::LowLatency' has a wrong offset!");
static_assert(offsetof(UWmfMediaSettings, NativeAudioOut) == 0x00003A, "Member 'UWmfMediaSettings::NativeAudioOut' has a wrong offset!");

}

